{"Walkins":[{"date":"13, 14, 15, 16, 17 - Oct - 2020","skills":"HR Generalist Activities, Human Resource Management, Employee Engagement, HR Operations","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Starmark Fitness Studios Pvt. Limited, 85 PRINCE ANWAR SHAH ROAD, FIRST FLOOR, CITY HIGH BUILDING, near Navina Cinema Hall, Kolkata, West Bengal - 700 033","phone":"6291031933","profile":"HR Executive (Female Only) \nStarmark Fitness Studios Pvt. Limited","description":"Applicant must be well versed with all the gamuts of HR. Must have a good & pleasing personality. Must have good communication skills Without good communication, skill please don't apply Required Candidate profile- Recruitment, Hiring, Selection. It is 10 am to 7 pm job profile for HR Executive. Must be good looking and experienced with fluent English communication. Must be below 35 years of age Female only. It's a walk-in Interview please call at 6291031933 for more details. Date/ Time: 13th October - 17th October , 11.00 AM - 5.30 PM VENUE- Starmark Fitness Studios Pvt. Limited 85 PRINCE ANWAR SHAH ROAD, FIRST FLOOR, CITY HIGH BUILDING, near Navina Cinema Hall, Kolkata, West Bengal - 700 033 Contact - Dipti Mehrotra ( 6291031933 )","location":"Kolkata","experience":"1 - 5 Years"},{"date":"16, 17 - Oct - 2020","skills":"JAVA, Python, Node JS, C++ ,C#, .Net","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Soft Suave Technologies Private Limited, Gayatri Tech Park 4th floor Plot No 183, EPIP, Near iGate, KIADB Industrial Area, Road, 1B, EPIP Zone Whitefield Rd, Kundalahalli, Whitefield, Bengaluru, Karnataka - 560 066","phone":"Not Provided","profile":"Full Stack Developer (Java/ .Net) \nSoft Suave Technologies Private Limited","description":"Candidate should have good knowledge in JAVA, Python, Node JS, C++ ,C#, .Net with Logical and analytical thinking towards the programming Eligibility Criteria: BE/ B.Tech/ ME/ M.Tech/ MCA 2018, 2019 passed outs only. Immediate Joiners. Job Responsibility: Execute full software development life cycle (SDLC) Code, test and troubleshoot programs utilizing the appropriate framework, database, and programming technology. Write quality and clean code using prescribed specifications. Analyze performance of programs and take action to correct deficiencies . Levels of Interview: Level 1: Online test (the moment you apply for this job, you receive online link your mail with in 2-3 days) Level 2 & 3: Online Programming Test Level 4: Technical Interview Walk-in Date/ Time: 16th October - 17th October , 10.30 AM - 3.30 PM Venue Details- Soft Suave Technologies Private Limited Gayatri Tech Park 4th floor Plot No 183, EPIP, Near iGate, KIADB Industrial Area, Road, 1B, EPIP Zone Whitefield Rd, Kundalahalli, Whitefield, Bengaluru, Karnataka - 560 066","location":"Bangalore","experience":"0 - 2 Years"},{"date":"13, 14, 15 - Oct - 2020","skills":"Banking Process, Non Voice/ Chat Process, Customer Handling","qualification":"Diploma, B.A., B.Com, B.B.A, B.Sc","address":"Teleperformance Global Services Pvt. Limited, NSL Centrum Mall, Brand factory Building, Lift Lobby 2, 2nd Floor, Plot No-1062 & 1063, Phase 5, KPHB Colony, Opp Road to Forum Mall Lane, Hyderabad \u0096 500 072","phone":"Not Provided","profile":"Chat/ Banking Process Associate \nTeleperformance Global Services Pvt. Limited","description":"Candidate should be minimum 12th/ Any Graduate with excellent English Communication Skills Must have good communication skills with English, Hindi. Fresher / Experienced can apply. Should have good Customer handling skills. Rotational shifts, Rotational week off. 6 days a week. Open Positions - 30 Package : Freshers/ Experienced : 17,000 CTC (Fixed) Mode of Work :- Work From Office Typing :- 25 Words Per Minute. Interested candidates can walk-in for interview from 12th October - 15th October , 9.30 AM - 1.30 PM to the below mentioned address- Teleperformance Global Services Pvt. Limited NSL Centrum Mall, Brand factory Building, Lift Lobby 2, 2nd Floor, Plot No-1062 & 1063, Phase 5, KPHB Colony, Opp Road to Forum Mall Lane, Hyderabad \u0096 500 072","location":"Hyderabad","experience":"0 - 3 Years"},{"date":"13, 14 - Oct - 2020","skills":"Customer Service, Customer Support, Back Office, Customer Care","qualification":"Diploma, B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Aegis Customer Support Services Private Limited, 4th Floor, Essar House, Opp. Gujarat College, Ellisbridge, Ahmedabad - 380 006","phone":"Not Provided","profile":"Customer Care Executive \nAegis Customer Support Services Pvt. Limited","description":"Aegis Ahmedabad is required Customer Care Executive for one of the leading banking process Qualification: HSC/ Under Graduate/ Any Graduate Work Experience: 0 - 1 Years Fresher's can also apply Day shift only Fix Sunday off Must be good in Gujarati language Walk-in Date/ Time: 13th October - 14th October , 10.00 AM - 6.00 PM Venue Details- Aegis Customer Support Services Private Limited 4th Floor, Essar House, Opp. Gujarat College, Ellisbridge, Ahmedabad - 380 006","location":"Ahmedabad","experience":"0 - 1 Years"},{"date":"13 - Oct - 2020","skills":"Semi Voice/ Voice Process, International Voice Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Avanze Technologies India Pvt. Limited, # 403, 3rd & 4th Floor, Above Reliance Digital, Kammanahalli Main Road, HRBR Layout 3rd Block, Kalyan Nagar, Bengaluru","phone":"080-4670000","profile":"Semi Voice Process Executive - US \nAvanze Technologies India Private Limited","description":"Avanze Technologies India Pvt. Limited is looking for BPO Professionals with experience in Voice/ Semi Voice Process IMMEDIATE JOINERS PREFERED Please call 9535770036 for interviews. Walk-in Date/ Time: 13th October 2020, 9.30 AM - 5.30 PM Venue Details- Avanze Technologies India Pvt. Limited # 403, 3rd & 4th Floor, Above Reliance Digital, Kammanahalli Main Road, HRBR Layout 3rd Block, Kalyan Nagar, Bengaluru Landmark: Jalvayu Vihar/ Cafe Coffee Day Contact - HR (080-46700000)","location":"Bangalore","experience":"2 - 7 Years"},{"date":"12, 13, 14, 15, 16, 17, 18 - Oct - 2020","skills":"Customer Relationship Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Jana Small Finance Bank Limited, Cosmo Bazar, Bagnan Station Road, Bagnan, Howrah, Kolkata - 7113 03.","phone":"Not Provided","profile":"Customer Relationship Executive \nJana Small Finance Bank Limited","description":"Candidate should be Any Graduate with 3 to 6 years of experience in Customer Relationship Management Must have excellent communication skills Job Responsibilities : Sourcing new customers, enhancing existing relationships, analyzing needs, cross sell of products & services. Handling walk in customers, providing service quality, Daily coordination with head offices, Complaint resolution within TAT, Daily CIBIL Logins on step by step complaints and queries of new customer/ existing customers. Movement of CASA Forms, Service Enquiry to the existing and related products & services of customers, adherence to process. Handling the Cashier responsibility in absence of Cashier. Walk-in Date/ Time: 12th October - 18th October , 9.30 AM - 5.30 PM Venue Details- Jana Small Finance Bank Limited, Cosmo Bazar, Bagnan Station Road, Bagnan, Howrah, Kolkata - 7113 03. Contact Person- Tuhin Kumar Ghosh","location":"Kolkata","experience":"3 - 6 Years"},{"date":"13, 14, 15 - Oct - 2020","skills":"Core Java, Advanced Java/ J2Ee, Hibernate, Spring","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Stemetric IT Solutions Private Limited, 101/A, 1st Floor, Plot #2, Above Karnataka Bank, Opposite to, Image Gardens Road, HITEC City, Hyderabad, Telangana - 500 081.","phone":"Not Provided","profile":"JAVA Developers \nStemetric IT Solutions Private Limited","description":"Stemetric IT Solutions Private Limited, is having Opportunity For Trained or Experienced Candidates for the position of JAVA Developer Prerequisite: Candidate should be Trained/ Experienced on Java Technologies Core Java, Advanced Java/ J2Ee, Hibernate, Spring Work Experience: 0 to 5 Years 2019-2020 Passed outs are not allowed. Job Location: Hyderabad Walk-in Date/ Time: 13th October - 15th October , 10.30 AM - 1.00 PM Venue Details- Stemetric IT Solutions Private Limited 101/A, 1st Floor, Plot #2, Above Karnataka Bank, Opposite to, Image Gardens Road, HITEC City, Hyderabad, Telangana - 500 081. Contact Person- SAI SIRISHA If your interested please share your Updated Resume to recruiter@stemetricitsolutions.com","location":"Hyderabad","experience":"0 - 5 Years"},{"date":"13 - Oct - 2020","skills":"Tellecalling, Voice Process, Inbound/ Outbound Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"TEAMLEASE DIGITAL PRIVATE LIMITED, 3RD FLOOR, CROMPTON HOUSE, KODAMBAKKAM HIGH ROAD, NUNGAMABAKKAM, CHENNAI","phone":"8838139874","profile":"Telecalling Executive \nSBI TeamLease Services Limited","description":"Candidate should be Any Graduate with 6 months to 1 year of experience in Any BPO Sector. Must have excellent communication skills. Initiating sales with potential customers over the phone. Asking questions to engage customers and keep the conversation going. Listening to the customers' needs to generate repeat sales. Gathering and documenting customer information, payment methods, purchases, and reactions to products. Keeping up to date on all products and informing customers of new products. Answering customers' questions on the products. Meeting sales quotas. WALK_IN DATE/ TIME- 13th October 2020, 1 PM onwards TEAMLEASE DIGITAL PRIVATE LIMITED, 3RD FLOOR, CROMPTON HOUSE, KODAMBAKKAM HIGH ROAD, NUNGAMABAKKAM, CHENNAI LANDMARK- NEAR BY PALMGROVE HOTEL. SOUNDARYA HR / 8838139874","location":"Chennai","experience":"0 - 4 Years"},{"date":"13 - Oct - 2020","skills":"Portfolio Management, Customer Retention, Business Development","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Kotak Mahindra Bank Limited, Sector-16, Faridabad","phone":"Not Provided","profile":"Relationship Officer \nKotak Mahindra Bank Limited","description":"We have Urgent openings for Relationship Officer (Business Development) for the entire Delhi- NCR location. Job Requirement : Should have direct sales experience & orientation. Portfolio Management, Customer retention. Cost efficiency through the process. Immense interest in developing a relationship with the customers. Minimum work exp.- 2 year Maximum Age - 30 yrs Eligibility: Must be a Graduate with Fair English communication skills Must have a minimum of 2 years of experience in Sales Must have Field Sales Exposure and willing to hunt in the open market Designation: Relationship Officer - Business Development Grade: M2 - Deputy Manager CTC Offered- Upto 4.50 lac Job Profile Developing new and expanding existing High Net worth Customer(HNI) relationships for liabilities by sourcing customers. Sources new bank customers through external individual efforts and acquisition channel. Cross-sells bank products to the existing set of Branch customers which are mapped. Informs customers of new products or product enhancements to further expand the banking relationship. Maintains complete relationship record for assigned customer accounts. Responsible for NTB acquisition of customers. Responsible for successfully contacting 20 customers per day. Responsible for meeting 4 customers/ prospects per day. Responsible for 2 product sales (CASA, TD, SIP, MF, Insurance, Gold, Demat, Asset, Gift Card etc.) per day. Interview Date: 13th October 2020 Timing: 2:00 PM to 4:00 pm Interview Venue: Kotak Mahindra Bank Limited, Sector-16, Faridabad","location":"Faridabad","experience":"3 - 8 Years"},{"date":"13, 14, 15, 16, 17 - Oct - 2020","skills":"Back Office, MIS Preparation, MS Office/ Computer Operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Sterling Hospitals, Near Maharaja Agresan School, Gurukul Road, Memnagar, Ahmedabad- 380 052","phone":"079-40011954","profile":"Back Office Executive \nSterling Addlife India Private Limited","description":"Hiring candidates for Back office Executive/ Computer Operator at communication & correspondence with Units to handle back office responsibilities,. Computer work in MS Office, MIS Preparation, Communication & correspondence with Units Client companies, Taking feedback &. Reports etc. Graduation in Any stream is must. Freshers can also apply. Should be comfortable with rotation duties. We are looking preferably for male candidates. Walk-in Date/ Time: 13th October - 17th October , 10.00 AM - 4.00 PM Venue Details- Sterling Addlife India Private Limited Sterling Hospitals, Near Maharaja Agresan School, Gurukul Road, Memnagar, Ahmedabad- 380 052 Contact - Kinjal Rathod (07940011954)","location":"Ahmedabad","experience":"0 - 1 Years"},{"date":"13 - Oct - 2020","skills":"Portfolio Management, Client Relationship Management, Wealth Management, Lead Generation","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Kotak Mahindra Bank Limited, Preet Vihar, East Delhi","phone":"Not Provided","profile":"Branch Relationship Manager \nKotak Mahindra Bank Limited","description":"We have Urgent openings for Branch Relationship Manager - Business Development for the entire Delhi- NCR location. Designation: Branch Relationship Manager (BRM) Grade: Deputy Manager/ Manager (M3) CTC Offered- Upto 6.50 LPA Maximum Age Limit - 32 Years Minimum work Experience- 4 Years Preferred candidates From Banking, Insurance, Stockbroking Only Job Profile Developing new and expanding existing High Net worth Customer(HNI) relationships for liabilities by sourcing customers. Sources new bank customers through external individual efforts and acquisition channel. Cross-sells bank products to the existing set of Branch customers which are mapped. Informs customers of new products or product enhancements to further expand the banking relationship. Maintains complete relationship record for assigned customer accounts. Responsible for NTB acquisition of customers. Originate/Develop new and expands existing HNI relationships for liabilities, specifically and across the range of KMBL product offering. Develop a database for lead generation, identifies market segments, strategies with acquisition channel. Plan and Conduct special sales initiatives and events for prospective and existing clients. Track customer complaints/queries and turnaround times to ensure a high level of customer satisfaction and provide information for product and service enhancements. Coordinate with other group companies to provide bank customers with seamless access to other group products. Job Requirement : Should have direct sales experience & orientation. Portfolio Management. Customer retention. Cost efficiency through the process. Immense interest in developing a relationship with the customers. Interview Date: 13th October 2020 Timing: 11:00 AM to 2:00 PM Interview Venue: Kotak Mahindra Bank Limited, Preet Vihar, East Delhi Note: Candidates coming after 1:00 pm won't be entertain","location":"Delhi","experience":"4 - 9 Years"},{"date":"14 - Oct - 2020","skills":"Core Java (v1.5 and above), J2EE/ JEE with Spring and or Struts","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Please share your profile on above given email and get yourself shortlisted for the interview this Wednesday.","phone":"Virtual Walk in","profile":"Java/ J2EE Developers \nInterra InfoTech India Private Limited","description":"We are conducting a recruitment drive on Wednesday, October 14, 2020, for the position of Java/ J2EE Developers. Required Experience/ Skills- Core Java (v1.5 and above), J2EE/ JEE with Spring and or Struts Working knowledge with Databases SQL, JDBC Frontend - JSP, HTML, CSS, JavaScript Experience with Application Servers (WebSphere/ Weblogic/ JBoss) Knowledge about and experienced with MQ Series is a plus Excellent English both verbal and written communication skills. If you are someone with the skills suited for the job position, please share your profile with us now on Email Id: Careers@InterraIT.COM and get yourself shortlisted for the interview this Wednesday.","location":"Noida, Kolkata","experience":"2 - 7 Years"},{"date":"12, 13, 14, 15, 16, 17, 19, 20, 21, 22 - Oct - 2020","skills":"Email Support, Customer Service, Customer Calling, Backend Support","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"CorpAid Services Private Limited, 101 102, First Floor, Gulmohar Apartment, East Street, Camp Pune - 411001","phone":"9112211104","profile":"Customer Support Executive \nCorpAid Services Private Limited","description":"Candidate should be Any Graduate with Good English Communication Skills Must have Basic Knowledge of Computer Operations The only Candidate apply whose age between 20 to 30 Salary Offer: As per Industry Standard Walk-in Date/ Time: 12th October - 22nd October , 10 AM onwards Venue Details- CorpAid Services Private Limited 101 102, First Floor, Gulmohar Apartment, East Street, Camp Pune - 411 001. Contact Person- Sulakshana HR Contact No.: 8669998509/ 9112211104","location":"Pune","experience":"0 - 2 Years"},{"date":"12, 13, 14, 15, 16, 17, 19, 20, 21 - Oct - 2020","skills":"Desktop Support, LAN, Laptop Support, Networking","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Chamunda Tech-Net Services Pvt. Limited 401 L wing, Tex Center, Near Narayan Plaza, Chandivali Andher (East), Mumbai","phone":"Not Provided","profile":"Technical Support Engineer \nChamunda Tech-Net Services Pvt. Limited","description":"Candidate should be Any Graduate with Windows and Desktop Installation and Administration skills Must have excellent communication skills Job Responsibility- Office applications - Install, Configure and Support OS Drivers and Patch installation Desktop/ Laptop hardware and OS Installation Patch Installation Desktop support LAN Troubleshooting Walk-in Date/ Time: 12th October - 21st October , 9.30 AM - 5.30 PM Venue Details- Chamunda Tech-Net Services Pvt. Limited 401 L wing, Tex Center, Near Narayan Plaza, Chandivali Andher (East), Mumbai Contact Person- Rupesh Patil Phone No. 9821381118","location":"Mumbai","experience":"0 - 1 Years"},{"date":"12, 13, 14, 15, 16, 17, 19, 20, 21 - Oct - 2020","skills":"Customer Service, Inbound Process, Customer Support","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"1Point1 Solutions Limited, Plot No. 17, Sector-18 Near Sarhaul Mod Gurgaon, Haryana","phone":"9999535416","profile":"Customer Support - Inbound Process \nOne Point One Solutions Limited","description":"First point of contact for customers calling for Support Engineer is expected to interact with customers to identify the issue, create case with correct documentation and guide the case to correct department for further troubleshooting. Candidates working with any kind of Voice based customer support/ Semi- Technical Support/ Product Support are the preferred ones. Must possess Best-in-class Communication skills to provide premium level support to our valued Customers. Core Skills- Excellent Soft skills to build customer rapport for an effectively controlled interaction Direct Customer Handling Experience Excellent written & verbal communication skills in English Good typing speed and ability to take notes while talking to the customer Eligibility Criteria- Fresher - Male/ Female both can apply for this job. Candidate must be 12th Pass [Under graduate and graduate can apply] Candidate must speak fluent English & Hindi Must know basic computer. Job Responsibility- 1) Attending customer queries over the phone and providing solutions. 2) Following quality parameters while talking or dealing with customers and clients. 3) Resolving matters in the best interest of both the customer and the company 4) Participating in all organizational activities like RNR | Fun Activities and Sports activities. 5) Coordination with Team Supervisor and colleagues in case of any doubts and problems Other Details- Shift For Female Employee : 9am to 6pm and 9:30am to 6:30pm. For Male- Rotational Shifts. Six days working and 1 week off. Salary : 11314k CTC to 18000K CTC basis of Final Interview Interested candidates may walk-in on given venue/ Or can call/ Whats app on given below no :- 12th October - 21st October , 9.30 AM - 5.30 PM 1Point1 Solutions Limited Plot No. 17, Sector-18 Near Sarhaul Mod Gurgaon, Haryana Sunny Kaushik- 9999535416","location":"Gurgaon","experience":"0 - 1 Years"},{"date":"12, 13, 14, 15, 16, 17, 18 - Oct - 2020","skills":"Customer Relationship Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Jana Small Finance Bank Limited, Cosmo Bazar, Bagnan Station Road, Bagnan, Howrah, PIN - 711303.","phone":"Not Provided","profile":"Customer Relationship Executive \nJana Small Finance Bank Limited","description":"Jana Small Finance Bank Limited, is looking for Customer Relationship Executive (CRE) Key Responsibilities : Sourcing new customers, enhancing existing relationships, analyzing needs, cross sell of products & services. Handling walk in customers, providing service quality, Daily coordination with head offices, Complaint resolution within TAT, Daily CIBIL Logins on step by step complaints and queries of new customer/ existing customers. Movement of CASA Forms, Service Enquiry to the existing and related products & services of customers, adherence to process. Handling the Cashier responsibility in absence of Cashier. Walk-in Dare- 12th October - 18th October , 9.30 AM - 5.30 PM Venue Details- Jana Small Finance Bank Limited, Cosmo Bazar, Bagnan Station Road, Bagnan, Howrah, PIN - 711303. Contact Person- Tuhin Kumar Ghosh Interested candidates kindly share the resumes on swarnendu.roy@janabank.com","location":"Kolkata","experience":"0 - 1 Years"},{"date":"10 - Oct - 2020","skills":"Tender Registration, Bidding, e Tendering","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Alankit House, 4E/2 Jhandewalan Extension New Delhi -110 055. Landmark:- Near post office","phone":"7290012325","profile":"Tender Executive - Preferably Male \nAlankit Limited","description":"Person should be Any Graduate with minimum 6 month experience in Tender. Follow up Tender Registration & Payments in various Govt. Department. Should be responsible to handle tenders published on GEM Portal. Prepare documents for e-Tendering, Studying tender documents, qualification criteria, scope of work, Floating RFQ to various vendors/ contractors, collecting quotations, preparing comparative statements, meeting deadlines for the tenders received from public sector undertaking Govt. and other organizations. Prepare Bills of All Departments Follow ups from client regarding order. Convert inquiries into order. Preparing MIS weekly/ Monthly Reports. Date & Timing: 10th October 2020 @ 10:00 AM to 1:00 PM Venue Details:- Alankit House, 4E/2 Jhandewalan Extension New Delhi -110 055 Landmark:- Near post office Nearest Metro Station:- Jhandewalan Metro Station Gate No. 2 Contact Person:- Ms. Usha Phone:- 7290012325 Note:- Interested candidate can share their resume on ushar@alankit.com OR call on 7290012325.","location":"Delhi","experience":"0 - 1 Years"},{"date":"10 - Oct - 2020","skills":"Customer Support, Voice Process, Voice Support","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Equiniti India Private Limited, Zed Tech Park 1st Floor, Electronic City Phase 1, Bangalore, Karnataka.","phone":"Not Provided","profile":"Customer Support Executive \nEquiniti India Private Limited","description":"In the role of Customer Experience Executive/Sr CEE/SME/TL you would need to assist shareholders in buying & selling shares, in accordance with predetermined procedures & service standards under appropriate guidance and direction. Eligible Criteria: Any Graduates/ Post Graduates. Years of Experience in International Voice Process from 1 to 7 years. Candidate should be comfortable to work in US Shift (Night Shift). The successful candidate will be responsible for: Answer inbound calls, emails from Shareholders and assist them with their queries within the agreed service standards, Contribute to the completion of the teams workload, Undertake duties at a similar level as required, Always to undertake the duties of this role in accordance with the requirements of the company's Regulators, Ensure that all work is undertaken within the quality system, Ensure that work and ethics comply with all security arrangements both physical and information. To be the successful candidate one would need to possess the below: Strong command on English language speaking & call handling Understanding of Customer Experience /BPO Prior experience of international voice process Satisfactory resolution of queries. Walk-in Date/ Time: 10th October 2020, 10.00 AM - 1.30 PM Venue Details- Equiniti India Private Limited, Zed Tech Park 1st Floor, Electronic City Phase 1, Bangalore, Karnataka. Contact Person - Chandra","location":"Bangalore","experience":"1 - 7 Years"},{"date":"10 - Oct - 2020","skills":"MIS Reporting, Stakeholder Management, MIS, Bidata Analyst","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Flipkart Grocery, PMR Warehousing, Next to Commando Dogs training, Devarayamjal Village road, Medchal, Hyderabad.","phone":"Not Provided","profile":"Backend Executive - MIS Reporting \nFlipkart Internet Private Limited","description":"Walk-in for MIS Operations only for Female Hiring-Executive operations for (MIS Reporting) Grocery FC-Hyderabad. Qualification: Any Graduates/ Post Graduates Can apply Work Experience: 1- 4Years in MIS Reporting CTC : Upto 4 LPA including variable. Notice Period : Not more than 20 days/ Immediate Joiners Preferred Must Haves: 1. Strong in problem-solving and analytical skills. 2. Technical capabilities: SQL and Excel.. 3. Experience in analyzing very large, complex, multi-dimensional data sets. 4.MIS reporting (Vlookup, Hlookup, Sumif, Pivot etc) : 5.Should have hands on team handling. 6. Should be good at communication Analytical and problem solving skills. Strong technical skills. The ability to work well under pressure. Attention to detail with Teamworking skills. Organisation and time management. Interpersonal and communication skills. Management and leadership skills. Job location : Grocery Warehouse Medchal Hyderabad. Walk-in Interview Date & Time: 9th & 10th October : Between 10AM to 4:00PM Address for Walk-in: Flipkart Grocery, PMR Warehousing, Next to Commando Dogs training, Devarayamjal Village road, Medchal, Hyderabad. SPOC: Ramesh Gantha / Chandrashekar Note: This position is open only for Female applicants ,other will not be allowed for the interview.","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"10 - Oct - 2020","skills":"Handling Customer Queries, Customer Service, Customer Support","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Rosmerta Safety Systems (P) Limited, 137, Udyog Vihar, Phase - I, Gurugram, Haryana - 122 016","phone":"Not Provided","profile":"Customer Care Executive \nRosmerta Technologies Limited","description":"Candidate should be Any Graduate with good communication skills Must be well versed in remote support to customer queries Must have exposure of call center specially helpline Can join us immediately Roles & Responsibilities- Handling & managing of customer queries over call Dealing with OEMs, Dealers or directly with the customers & providing solution to their queries related to HSRP order Maintaining relationship with the customer to increase HSRP orders Proactive resolutions of query raised Sharing daily, weekly, monthly, quarterly & annual reports Complaint resolutions percentage under detailed timeline & control process Walk-in Date/ Time: 10th October 2020, 10.00 AM - 5.00 PM Venue Details- Rosmerta Safety Systems (P) Limited 137, Udyog Vihar, Phase - I, Gurugram, Haryana - 122 016 Contact Person - Rahul Tiwari","location":"Gurgaon","experience":"1 - 6 Years"},{"date":"7 - Oct - 2020","skills":"Export Import, Clearing and Forwarding, Purchase, Export Logistics","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Agrotext Commodities Private Limited, NO:153, 1st Floor, 1st Stage 3rd A Cross, K H B Colony Basaveshwar Nagar Bangalore - 560079","phone":"080-40921202","profile":"Back Office Executive/ Manager \nAgrotext Commodities Private Limited","description":"We are looking for Export Import - Purchase, Secretary/ Executive/ Manager at Bangalore, location You are required to possess the following qualifications MALE/ FEMALE (around 25- 40 years of age) Excellent communication skills in English , Hindi, kannada Excellent computer skills: Word, Excel, PowerPoint, Internet, email , and daily reporting . Knowledge of export, import, logistics , shipping , duty drawback and company statutory requirement is must . Minimum 2 years experience in trading , import export, logistics, shipping Candidates with experience in Textile Industry preferred Degree in Foreign trade/ Marketing preferred Stability and commitment to job is must Minimizing cost for company Have presence of mind to handle situation intelligently & think quickly Intelligent handling of trade transaction READY TO LEARN NEW THINGS AND MULTI TASKING Salary: Best Interested candidates should submit letter of interest along with the CV in English, and one recent photograph by email agrotext@gmail.com or can walk in interview with prior confirmation by tel at the following address- Agrotext Commodities Private Limited NO:153, 1st Floor, 1st Stage 3rd A Cross, K H B Colony Basaveshwar Nagar Bangalore - 560079 Tell no:080-40921202 Mob. No: 8277605022 E-mail: agrotext@gmail.com","location":"Bangalore","experience":"2 - 7 Years"},{"date":"7, 8, 9, 10 - Oct - 2020","skills":"Desktop Support, Desktop Administration, Hardware Support, System Administration","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"MIOT Hospitals Private Limited, No: 4/112, Mount Poonamallee Road, Manapakkam, Chennai - 89","phone":"044-22492288","profile":"Desktop Support Engineer \nMIOT Hospitals Private Limited","description":"Candidate should be Any Graduate with good communication skills. Added skills - Certification course - A+, N+ and MCP Must be willing to work in Rotational Shift Only Male candidates need to apply Job Responsibility- Resolve issues by carrying out problem analysis to implement temporary or permanent solutions. Maintain all the application installed in the clients Record, update and document request using IT service desk system Upgrade all client systems Walk-in Date/ Time: 7th - 10th October , 10.00 AM - 12.00 PM Venue Details- MIOT Hospitals Private Limited No: 4/112, Mount Poonamallee Road, Manapakkam, Chennai - 89 Land Mark: (Near to Chennai Trade Centre) Contact - DIVYA (7708068401) Phone: 044-22492288, Extn: 4004","location":"Chennai","experience":"1 - 5 Years"},{"date":"7, 8, 9 - Oct - 2020","skills":"Pivot Table, Monthly Reports, Excel, Countif, MIS, VLOOKUP","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"3i Infotech Limited, C-57 Sector 57, Noida","phone":"Not Provided","profile":"MIS Executive \n3i Infotech Limited","description":"Roles and Responsibilities: To prepare the daily, weekly & monthly reports. Adhoc Reports. Client co-ordination. Average communication skills. Desired Candidate Profile: Good Excel knowledge 12th pass or graduate. Fresher & experienced both can apply. Walk-in Date/ Time: 7th - 9th October , 11.30 AM - 3.00 PM Venue Details- 3i Infotech Limited C-57 Sector 57, Noida Contact - Ankita Srivastava","location":"Noida","experience":"3 - 6 Years"},{"date":"7, 8 - Oct - 2020","skills":"Customer Service, Customer Care, MIS Preparation","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"ERD Technologies Private Limited, C-3 Sector-59, Noida","phone":"Not Provided","profile":"Female Executive (Fresher) - Sales/ Ordering \nERD Technologies Private Limited","description":"Wanted Female Executive (Fresher) - Marketing Sitting Job. Local candidate or staying in the surrounding area approx 15-20 Km and also she does not have conveyance problems will be preferred. 1. MBA 2. Knowledge about MIS Reporting. 3. Excellent communication skills. 4. Customer service skills. 5. Day to day general accounting 5. Knowledge about World & Excel Walk-in Date/ Time: 7th - 8th October 2020, 2.00 PM - 6.00 PM Venue Details- ERD Technologies Private Limited C-3 Sector-59, Noida","location":"Noida","experience":"0 - 1 Years"},{"date":"7 - Oct - 2020","skills":"HR/ Recruitment, Shortlisting Cv's - Scheduling interviews","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"ORRA Fine Jewellers Private Limited, 1st & 2nd Floor, A-Wing, Gate No. 4, Plot No. 11, Ashok Chakravarty Road, Kandivali (East), Mumbai \u0096 400 101. Maharashtra.","phone":"8080050250","profile":"HR Executive/ Intern \nORRA Fine Jewellers Private Limited","description":"Job Responsibility- Shortlisting Cv's - Scheduling interviews Conducting initial round of interview Helping the team in HR Activities Assisting HR team Maintaining data on Excel Creating offer letters Walk-in Date/ Time: 7th October , 11 AM onwards Venue Details- ORRA Fine Jewellers Private Limited 1st & 2nd Floor, A-Wing, Gate No. 4, Plot No. 11, Ashok Chakravarty Road, Kandivali (East), Mumbai \u0096 400 101. Maharashtra. Contact Person- 8080050250","location":"Mumbai","experience":"0 - 1 Years"},{"date":"7 - Oct - 2020","skills":"Retail Sales, Counter Sales, Showroom Sales, Sales Consulting","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Ample Technologies Private Limited 612, 1, 80 Feet Road, Koramangala 4th Block, Koramangala, Bengaluru, Karnataka - 560090","phone":"8056279641","profile":"Retail Sales Executive \nAmple Technologies Private Limited","description":"Greetings from Ample Technologies. We have openings for Retail Sales Executives for Apple stores in Bangalore. Job Description :- Greeting customer's & find out the needs. To be a sales consultant to the customer. Describing a product's features & demonstrate use and operation of the product. Handling customer queries regarding the store and the merchandise. Providing information about warranties, manufacturing specifications, care and maintenance of merchandise and delivery options. Maintain sales reports to keep a track of the progress. Walk-in Date/ Time: 7th October 2020, 11.00 AM - 4.30 PM Venue Details- Ample Technologies Private Limited 612, 1, 80 Feet Road, Koramangala 4th Block, Koramangala, Bengaluru, Karnataka - 560090 Contact Person- Archana (8056279641) Interested candidates can also send in their resume to archana.melchoir@ample.co.in","location":"Bangalore","experience":"0 - 3 Years"},{"date":"7 - Oct - 2020","skills":"Back Office Operations, International Semi-Voice Process into Sales","qualification":"Diploma, B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Zealous Technology Services, No.5-2-26, CMR Complex, 4th Floor, NH-65, Behind BIG BAZZER, Near Kukatpally Metro Station, Kukatpally, Hyderabad - 500072","phone":"8712913585","profile":"Backend Executive/ Semi-Voice Process \nZealous Technology Services","description":"Eligibility: Any Graduate/ Post Graduate/ Diploma (Age criteria: 18 - 26 years) 2017 ,18, 2019, 2020 Passed Outs/ Maximum of 3 Backlogs (with proper documents) Key Skills: Good Communication & Interpersonal Skills Shift Timings: US Fixed Shift/ Night Shift (6:30 Pm to 4:30 Am) Working Days: (Monday - Friday) 5 Working Days, Saturday & Sunday Fixed Week off Location : Kukatpally, Hyderabad. Salary: 8500 /- Per month (Work from Office) Candidates who are in Hyderabad can apply and Need To Work from Office Rounds of Interview: 1. Group Discussion/JAM 2. Face 2 Face/ HR Round Interview Timings: 11 : 00 Am - 2:00 Pm (Monday - Friday) Venue- Zealous Technology Services, No.5-2-26, CMR Complex, 4th Floor, NH-65, Behind BIG BAZZER, Near Kukatpally Metro Station, Kukatpally, Hyderabad - 500 072 Documents: At the time of attending Interview candidates are advised to bring: 1. Updated Resume - Soft copy 2. All the Relevant Educational Certificates/ Testimonials - Soft copy 3. Aadhar & Pan Documents - Soft copy Do mention 'SUBHASH -HR' on the right top of your resume while coming for the walk in. Also bring your Resume & all education card xerox copy. Contact Person - SUBHASH-HR. Contact Number - 8712913585 (If its Not Connected, Please Direct Walk in to above mentioned Address)","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"7 - Oct - 2020","skills":"Word, Excel, PowerPoint, Internet, email , and daily reporting . TALLY","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Agrotext Commodities Private Limited, NO:153, 1st Floor, 1st Stage, 3rd A Cross, K H B Colony, Basaveshwar Nagar Bangalore - 560 079","phone":"080-40921202","profile":"Accounts Cum Admin Executive \nAgrotext Commodities Private Limited","description":"We are private limited company having registered office in Bangalore, India. Our main business is Export of Textiles (Yarns, Fibers, Raw cotton, Cotton waste etc ). For our Factory AT KACHOHALLI VILLAGE , BANAGLORE we are looking for ACCOUNTS CUM ADMIN EXECUTIVE /INCHARGE Location : Bangalore, INDIA You are required to possess the following qualifications- KNOWLEDGE OF ALL ASPECT OF ACCOUNTING AND BOOK KEEPING MALE /FEMALE (around 25- 40 years of age) Excellent communication skills in English, Hindi, Kannada Excellent computer skills: Word, Excel, PowerPoint, Internet, email , and daily reporting. TALLY KNOWLEDGE Maintenance of business records with supporting , book keeping Preparation of financial statements , balance sheet, profit and loss Prepare supporting schedule , Knowledge on making payments online /digital knowledge Handling compliance with banks /company secretary function Collections of GST bill from all relevant parties and prepare for GST refund Review accounts payable , purchase orders , cash receipts , business licenses , payroll , utility billings and other accounting records and transactions and ensure money is posted to correct accounts. Minimizing cost for company Have presence of mind to handle situation intelligently & think quickly READY TO LEARN NEW THINGS AND MULTITASKING Interested candidates should submit letter of interest along with the CV in English, and one recent photograph by email agrotext@gmail.com or directly to address. Candidates who are confident that they are fulfill above requirements , can walk in interview with prior confirmation by tel at the following address- Agrotext Commodities Private Limited NO:153, 1st Floor, 1st Stage, 3rd A Cross, K H B Colony, Basaveshwar Nagar Bangalore - 560 079 Tell No: 080-40921202 Mob. No: 8277605022","location":"Bangalore","experience":"3 - 8 Years"},{"date":"7, 8, 9 - Oct - 2020","skills":"Customer Relationship, Store Operation, Customer Handling, Auto sales","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Cars24 Services Private Limited, Adajan, Surat, Shop No-123, First Floor, La Victoria Complex, Galaxy Cir, Opposite Suryam Villa, Adajan Gam, Pal Gam, Surat, Gujarat - 394 510","phone":"9870390425","profile":"Retail Manager \nCars24 Services Private Limited","description":"Job Responsibilities : Retail store handling/ Retail Management Develop and implement the sales & service plan for the center to meet business objectives. Assist in planning & execution of micro marketing activities at ground level Plan and implement Operations procedures in the store to deliver the desired level of consumer satisfaction. Impart training to store staff and equip them with the skills to understand and fulfill consumer needs. Maintains store staff job results by coaching, counselling, and disciplining employees; planning, monitoring, and appraising job results. Measure and report sales metrics; monitor actuals-to-plan. Responsible for hiring, training, and monitoring team member performance. He/she is responsible for the resolution of customer complaints and to assist in closings when necessary. Perks and Benefits - Perks and Benefits Lucrative Incentives 6 Days Working Walk-in Date/ Time: 7th, 8th, 9th October 10 AM onwards Venue Details: Cars24 Services Private Limited Adajan, Surat, Shop No-123, First Floor, La Victoria Complex, Galaxy Cir, Opposite Suryam Villa, Adajan Gam, Pal Gam, Surat, Gujarat - 394 510 Concern Person-Nimish Contact No- 9870390425 Please share CV lavi.saxena@cars24.com","location":"Surat","experience":"1 - 6 Years"},{"date":"15 - Oct - 2020","skills":"Phone and in-Person, Admission Process, Telephonic Counselling","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"GATE Indian Institute of Tutorials Academy, 3RD Floor, Raghvendra Plaza, 17th Main Road, J P Nagar 2nd Phase, Half KM Behind Central Mall, Bangalore - 78.","phone":"8310248457","profile":"Sr. Academic Coordinator \nGATE Indian Institute of Tutorials Academy","description":"Career Counselling for prospective applicants and their parents, both over the phone and in-Person, during the admission process Entitled for Telephonic Counselling Managing complete admission process Regular follow up with leads Required Candidate profile Converting students to admissions Regular activities to convert negative leads into positive leads. Dedicated to work and targets. Candidate will be responsible for calling and handling of students Walk-in Date/ Time: 15th October 2020, 11 AM onwards Venue Details- GATE Indian Institute of Tutorials Academy, 3RD Floor, Raghvendra Plaza, 17th Main Road, J P Nagar 2nd Phase, Half KM Behind Central Mall, Bangalore - 78. Contact - Recruiter (8310248457)","location":"Bangalore","experience":"2 - 7 Years"},{"date":"5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15 - Oct - 2020","skills":"Human Resource Management, Business Development","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"PaSay Webscript Technologies Pvt. Limited 101, First Floor, Shakti Nagar Shopping Complex, Above Narmada / Vyanjan Sweets, Sector 1 Shakti Nagar, Habib Ganj, Bhopal - 462 024.","phone":"9893222186","profile":"HR Executive & Sales Executive \nPaSay Webscript Technologies Pvt. Limited","description":"Consistently following-up to re-generate walk-ins for registration. Supporting through emailing/ calling/ Messaging services. Generating walk-ins from fresh leads. Immediately Joiner only apply Performance Base Salary. Walk-in Date/ Time: 5th - 15th October 2020, 10 AM onwards Venue Details- PaSay Webscript Technologies Pvt. Limited 101, First Floor, Shakti Nagar Shopping Complex, Above Narmada / Vyanjan Sweets, Sector 1 Shakti Nagar, Habib Ganj, Bhopal - 462 024. Contact Person- Mr. Yogesh Pase (9893222186)","location":"Bhopal","experience":"0 - 1 Years"},{"date":"5, 6, 7, 8, 9, 10, 12, 13, 14 - Oct - 2020","skills":"Customer Service, Inbound Process, Customer Support, Outbound Process, International BPO","qualification":"Diploma, B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Saarthi Management Consultants, G-10, Ground Floor, TDI Fun Republic Mall, Moti Nagar, New Delhi - 110 015.","phone":"7838557749","profile":"Customer Support Executive \nSaarthi Management Consultants","description":"Undergraduate/ Graduate with good communication (Hindi or English) Candidate must have good communication skills. Freshers can also apply Job Responsibilities- Attending Customer queries/ Sales over phone and providing solutions through calls. Resolving matters in the best interest of both the customer and the company. Experience in customer service will be an added advantage. Walk-in Date/ Time: 5th October - 14th October , 9.30 AM - 5.30 PM Venue Details- Saarthi Management Consultants G-10, Ground Floor, TDI Fun Republic Mall, Moti Nagar, New Delhi - 110 015. Whats App or Call, Raghav Gulati (7838557749)","location":"Delhi","experience":"0 - 3 Years"},{"date":"5, 6, 7, 8, 9, 10, 11, 12 - Oct - 2020","skills":"Customer Service, Customer Relationship","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Matrimony.com Limited, Arihant e-Park, Lattice Bridge Road, 2nd Floor, Baktavatsalam Nagar, Adyar, Chennai - 600 020. Landmark \u0096 Near Adyar Signal","phone":"7299591001","profile":"Relationship Executive - Day Shift \nMatrimony.com Limited","description":"Matrimony.com is looking for Relationship Executives who can speak any of these languages fluently - Tamil, Telugu, Kannada, Malayalam, Hindi, Gujarati, Bengali, Oriya The Relationship Executive will contact Mandap/Venue Partners (Owners/Managers) etc. They will interact with Partners to have their respective venues listed on our Matrimony Mandap site. The Relationship Executive would, at any point, display highest values of Matrimony Mandaps & should be able to communicate clearly to convince the partners to get listed. Touch base with the venue partners via calls, as per list provided Inform the venue partner about Matrimony Mandaps Values Inform the benefits of Free Listing Probe the partner in getting details - exact name of the mandap, complete postal address, location/landmark/map, contact number, capacity, parking facility, dining - veg/non veg etc Evaluate if the venue aligns with the Matrimony Mandaps definition & if yes, then collect all required/mandatory details Get digital consent of the partner via SMS / WhatsApp Explain the process of on-boarding Inform about App usage and details Check availability of the Owner/Decision Making Authority & arrange a call/meeting via CRM Strictly adhere to the mandated guidelines Desired Candidate Profile Any Graduate with 1 - 2 years experience, preferably in a similar field Very good English communication skills & command over language + a vernacular language Customer centricity Good probing & persuasive skills Walk-in Date/ Time: 5th to 12th October , 10.00 AM - 4.00 PM Venue Details- Matrimony.com Limited Arihant e-Park, Lattice Bridge Road, 2nd Floor, Baktavatsalam Nagar, Adyar, Chennai - 600 020 Landmark \u0096 Near Adyar Signal HR Contact - Payal Jain ( 7299591001 )","location":"Chennai","experience":"1 - 2 Years"},{"date":"5, 6, 7, 8, 9, 10, 11, 12, 13 - Oct - 2020","skills":"Back Office, Domestic BPO Outbound, Customer Support, Customer Care","qualification":"Diploma, B.A., B.Com, B.B.A, B.Sc","address":"CorpAid Services Private Limited, 101 & 102, First Floor, Gulmohar Apartment, East Street, Camp Pune - 411 001","phone":"9112211104","profile":"Customer Care Executive \nCorpAid Services Private Limited","description":"We have vacancies for our organization for the position of CSE Inbound process and Outbound Processes. Candidate having experience into outbound and inbound. Required Candidate profile Candidates with KYC, Sales, the customer service experience HSC/ Graduate Fresher/ Experience Skill: Good Communication Skill in English, Hindi & Marathi Another language will add advantage Walk-in Date/ Time: 5th - 13th October 2020, 10.30 AM - 4.30 PM Venue Details- CorpAid Services Private Limited 101 & 102, First Floor, Gulmohar Apartment, East Street, Camp Pune - 411 001 Email: hr@corpaidcs.com Contact - HR Sulakshana (9112211104) Note: Opening is with us. We are not a placement Consultancy & don't charge Fees/ Registration.","location":"Pune","experience":"0 - 2 Years"},{"date":"5, 6, 7, 8, 9, 10, 11, 12 - Oct - 2020","skills":"LETTER WRITTING, Busy/ Tally Billing, INTERNET AND COMPUTER EXPERT","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"G-43, PALIKA PALACE, PUNCHKUIAN ROAD. OPPOSITE METRO PILLAR NO. 13, NEAR GOLE MARKET, NEW DELHI - 110001","phone":"9811308515","profile":"Back Office Assistant/ Computer Operator \nASHIRWAD FURNISHERS","description":"LOOKING FOR A FEMALE OFFICE ASSISTANT & COMPUTER OPERATOR WITH GOOD ENGLISH COMMAND, TYPING SPEED, BUSY/ TALLY BILLING ALONG WITH MAKING ESTIMATES, QUOTATION , BILLINGS, E-MAILS, TENDERING, CALLS ATTENDING AND RESPONDING, LEDGER ENTERIES ETC WITH OTHER OFFICE WORKS ONLY FEMALE NEED TO APPLY! WALK-IN DATE/ TIME- 5th - 12th October 2020, 1.00 PM - 3.00 PM VENUE- G-43, PALIKA PALACE, PUNCHKUIAN ROAD. OPPOSITE METRO PILLAR NO. 13, NEAR GOLE MARKET, NEW DELHI - 110001 Contact - SANJAY BHALLA (9811308515)","location":"Delhi","experience":"0 - 5 Years"},{"date":"5, 6, 7, 8, 9, 12, 13, 14, 15 - Oct - 2020","skills":"Android App development, UI, API Integration, Android SDK","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Avaskm Technology, G-20, Sector-63, Noida","phone":"0120-4246608","profile":"Android Developers \nAvaskm Technology","description":"Candidate should have 1 to 3 years experience in Android App development, UI, API Integration, Knowledge of Third party API like SMS Api, Google map, payment gateway, working on camera features. Should have experience of debugging android applications & Android SDK Key Responsibilities- 1. Develop App UI 2. Link JSON api 3. Complete project 4. SDK knowledge 5. Must have sound android coding experience Walk-in Date/ Time: 5th - 15th October, 2020 between 11 am - 5 pm Monday To Saturday (2 & 4 Saturday Closed) Venue Details- Avaskm Technology G-20, Sector-63, Noida Call at 0120-4246608 to schedule interview or direct walk-in Contact Person- Ms. Jyoti","location":"Noida","experience":"1 - 3 Years"},{"date":"5, 6, 7, 8, 9 - Oct - 2020","skills":"Java technologies/ Fresher","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"KRSM Crown Technology, SBN Arcade 4th floor Opp: Marigold Hotel, Lot Mobile Shop Building, Metro Pillar No. 1423, Hyderabad, Telangana - 500 016","phone":"9052707969","profile":"Java Developer/ Freshers \nKRSM Crown Technology","description":"We are looking for a Java Developer to join our engineering team and help us develop and maintain various software products. Java Developers responsibilities include writing and testing code, debugging programs, and integrating applications with third-party web services. Desired candidate profile Any Graduate B.Tech/ M.Tech/ MCA Candidates are eligible Students have to perform daily tasks provided by the team lead Duration will be 45-60 days Walk-in Date/ Time: 5th October - 9th October , 10.00 AM - 3.00 PM Venue Details- KRSM Crown Technology SBN Arcade 4th floor Opp: Marigold Hotel, Lot Mobile Shop Building, Metro Pillar No. 1423, Hyderabad, Telangana - 500 016 Contact Person- Raju Sir (9052707969)","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"5, 6, 7, 8, 9, 10, 12, 13, 14 - Oct - 2020","skills":"Core Java, J2EE and PL/ SQL","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"CamsUnit, Dheeram Innovations Private Limited, #9, 1st floor, Kanagaraja Street, Rajakilpakkam, Chennai - 600 073.","phone":"9840981006","profile":"Software Engineer (Java Fresher) \nCamsUnit (Dheeram Innovations Pvt. Limited)","description":"We are looking for IT fresher/ Software Engineers having ability to do coding for our product development. Required Skills- Should have coding skills in any of the Object Oriented Programing Languages Good knowledge in Core Java, J2EE and PL/ SQL are added advantage Should be a technology lover Must have I-Can-Do attitude Ready to face challenges always Ready to learn new technologies always Walk-in Date/ Time: 5th - 14th October , 10.30 AM - 4.00 PM Venue Details- CamsUnit, Dheeram Innovations Private Limited, #9, 1st floor, Kanagaraja Street, Rajakilpakkam, Chennai - 600 073. Contact Person- 9840981006 The short listed candidate will work with our product development immediately. For any queries, contact hr@camsunit.com","location":"Chennai","experience":"0 - 1 Years"},{"date":"1 - Oct - 2020","skills":"Recruitment, Selection, Interviewing, Advertising, Head Hunting, Recruitment Consulting","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Firstsource Solutions Limited, 3rd Floor, 5th Block, Pritech, Ecospace, Bellundur, Bengaluru","phone":"Not Provided","profile":"Recruitment Executive \nFirstsource Solutions Limited","description":"EDUCATIONAL/ PROFESSIONAL QUALIFICATIONS (ESSESNTIAL/ DESIRED) Graduate in any specialization from an institute of reasonable repute 1 to 3 years of experience, out of which at least 6 months should be in Recruitment. Should be okay to do volume hiring HR Process understanding KEY ACCOUNTABILITIES/ RESPONSIBILITIES: Responsible for carrying out recruitment and screening of candidates for all junior levels. Improve and modify the recruitment process to meet internal customer requirements Drive the recruitment consultant to deliver quality candidates. Help in designing and positioning the advertisement in leading newspapers. Organize and conduct advertisement walk-in at site and outstation. Manage the interview process with various recruitment agencies. Extend offers to selected candidates. Lead the campus drive for various Graduate campuses. Ensure maintenance of up-to-date information on the recruitment status/recruitment MIS at any given point in time. Should ensure that the identification, contracting and management of vendors that supplement functional and segment recruitment needs is effective and fulfills client/function head requirements. KNOWLEDGE AND SKILLS (ESSENTIAL) Knowledge of the product and process Should be familiar with all channels of viz job portals, print media, building reference, head hunting, campus interviews etc Excellent spoken & written communication skills Good presentation skills Strong interpersonal, effectiveness & teamwork skills to empower, influence Good interviewing and analyzing skills Ability to work under pressure Ability to deliver on time and as per specifications Date of walk-in Interview: 1st October 2020 Time: 11.30 AM - 5.30 PM Venue Details- Firstsource Solutions Limited 3rd Floor, 5th Block, Pritech, Ecospace, Bellundur, Bengaluru IT RECRUITER PLEASE IGNORE THIS MAIL","location":"Bangalore","experience":"1 - 4 Years"},{"date":"1 - Oct - 2020","skills":"Customer Care, Outbound calls, Customer Support","qualification":"Diploma, B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Matrimony.com Limited, Besides Rasulpoora Metro Station, Above Citibank, 5th floor, Begumpet, Hyderabad","phone":"8309591299","profile":"Service Executive/ Service officer \nMatrimony.com Limited","description":"The Telesales & Service Associate of Bharat Matrimony sells paid memberships over phone to clients who are looking for matrimony alliances. The job is to reach out to various customers over phone, explain them the product & features and deliver value to the customers. Key Responsibilities Responsible for making outbound calls and regular follow up on leads assigned. Build a strong relationship / trust with customers by understanding the customer requirements and suggesting the right product to the Customers. Selling Membership over the phone and achieve the targeted sales numbers & value, set quality parameters Explaining the product features in detail and how to use the packages. Understand the Customer requirements, encourage them to upgrade / renew the matrimony packages. Address all the issues / grievances of customers and provide the right customer experience. Capture the insights from customer interactions and share it with the internal team. Strictly adhere to the process requirements Skill and Competencies required: Functional Skills Business Knowledge Process Knowledge Product Knowledge Customer Orientation Language skills English/ Regional lanugage Telemarketing / Selling Skills Basic computer skills MS Excel, Word Education and Experience: Graduate in any stream/ 2019 Passed outs Awaiting final year result/ Graduate with arrears can also apply Walk-in Date/Time: 1st October , 9.30 AM - 5.30 PM Venue Details- Matrimony.com Limited Besides Rasulpoora Metro Station, Above Citibank, 5th floor, Begumpet, Hyderabad Contact Person- Sravanthi ( 8309591299 )","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"1 - Oct - 2020","skills":"Retail Sales, Sales Consulting","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Ample Technologies Private Limited, 701, Road Number 36, Aditya Enclave, Venkatagiri, Jubilee Hills, Hyderabad, Telangana - 500 034","phone":"8056279641","profile":"Retail Sales/ Inventory Executive \nAmple Technologies Private Limited","description":"Greetings from Ample Technologies Private Limited, We have opening for various positions for Retail Sales for UNDER ARMOUR (WHICH IS OPENING SOON AT HYDERABAD AT INORBIT MALL, Madhapur) 1. Retail Sales Executive 2. Senior Sales Executive 3. Cashier 4. Inventory Job Responsibility:- Greeting customer's & find out the needs. To be a sales consultant to the customer. Describing a product's features & demonstrate use and operation of the product. Handling customer queries regarding the store and the merchandise. Providing information about warranties, manufacturing specifications, care and maintenance of merchandise and delivery options. Maintain sales reports to keep a track of the progress. Walk-in Date/ Time: 1st October 2020, 11.30 AM - 5.00 PM Interview location- Ample Technologies Private Limited 701, Road Number 36, Aditya Enclave, Venkatagiri, Jubilee Hills, Hyderabad, Telangana - 500 034 Interested candidates can send in their resume to archana.melchoir@ample.co.in","location":"Hyderabad","experience":"0 - 5 Years"},{"date":"1 - Oct - 2020","skills":"Client operations, Presentation, PPT Details, Database Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Cryoviva Biotech Private Limited, Plot No.129 , Pace City \u0096 1, Sector \u0096 37 Gurgaon \u0096 122 001, Haryana","phone":"Not Provided","profile":"Client Operations Executive (Female) \nCryoviva Biotech Private Limited","description":"Desired Qualification : Any Graduate (Female) Years Of Experience : 0 to 2 Years Preferred Function : Outbound calling Preferred Industry: Medical/ Healthcare/ Pharma/ Insurance/ BPO/ Banking/ Call Center Job Responsibility- Call the provided leads and Fix Home Presentation Sharing the PPT Details with the respective Sales person Database Management Achieve the targets Competencies- Excellent Communication Skills Possess high energy level and good convincing skill Possess good analytical skills Consultative problem solver Committed to Continuous learning Walk-in Date/ Time: 1st October 2020, 11.00 AM - 5.00 PM Venue Details- Cryoviva Biotech Private Limited Plot No.129 , Pace City \u0096 1, Sector \u0096 37 Gurgaon \u0096 122 001, Haryana Near Hero Honda Chowk, Behind Big Boy Toys Car Showroom Contact Person- Ms. Prerna","location":"Gurgaon","experience":"0 - 2 Years"},{"date":"1 - Oct - 2020","skills":"Payroll, HR/ Recruitment","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Busybees Logistics Solutions Pvt. Limited, B1 Cerebrum IT park, 1st floot Near D Mart, Kalyani Nagar, Pune - 411 014.","phone":"Not Provided","profile":"Payroll Executive/ Fresher \nBusybees Logistics Solutions Pvt. Limited","description":"Educational Qualification: MBA-HR/ Fresher Candidate must have Excel knowledge Opening for freshers only Roles and Responsibilities- Co-ordinating for processing monthly payroll Vendor Management, Invoice Verification & following up for Vendor payments with Finance Dept Preparing Reports on Excel Provides payroll information by answering questions and requests Statutory Compliance & Documentation Walk-in Date/ Time: 1st October 2020, 11.00 AM - 3.00 PM Venue Details- Busybees Logistics Solutions Pvt. Limited, B1 Cerebrum IT park, 1st floot Near D Mart, Kalyani Nagar, Pune - 411 014. Contact Person- Omprakash Sutar","location":"Pune","experience":"0 - 1 Years"},{"date":"30 - Sept - 2020","skills":"Technical Support, Computer Hardware Troubleshooting, Customer Handling","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Imagine Store, #612/1, 80 Feet Road, 4th Block, Koramangala, Bengaluru - 560 095","phone":"9686685466","profile":"Technical Support Consultant \nAmple Technologies Private Limited","description":"We at Ample Technologies Private Limited have walk-in drive for freshers/ experienced candidates for Technical Support Consultant Job Description: Customer service / Front-end customer handling. Handling customer queries / issues in the store related to (Mobile, Laptop & Desktop). Troubleshooting of technical related issues and ensure to resolve the issues / queries. Escalate problems when unable to resolve customer issues. Knowledge on computer hardware & software is added advantage. Excellent language fluency, excellent verbal & written communication skill. Should be able to handle customer queries and should aim at customer delight. Self driven & goal oriented and willing to work on Weekends Should be technically sound. Duration: Contract Basis Your consultation period is 1 year and and this period may be extended or pre-closed as per the business needs. If you are interested please attend the walk-in happening on 30th September 2020. Venue - Imagine Store #612/1, 80 Feet Road, 4th Block, Koramangala, Bengaluru - 560 095 Time - 10:30 am to 4:30 pm Contact Person - Jiddu Manohar Email- jiddu.manoharan@ample.co.in","location":"Bangalore","experience":"0 - 2 Years"},{"date":"3 - Oct - 2020","skills":"ASP .Net, C#, HTML, CSS, Javascript, MySQL, Oracle, Sql Server","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Amity Software Systems Limited, B 16, B Block, Sector 63, Noida, Uttar Pradesh - 201 307","phone":"Not Provided","profile":"Software Developer (ASP .Net) \nAmity Software Systems Limited","description":"We are looking for a few passionate freshers who want to start their career in ASP .NET/.Net Core/.NET Web Forms/ Android/ iOS and have an extreme desire to work closely with industry professionals and passionate team of developers. Qualification: BCA / MCA / B Tech / B Sc. (IT) / M Sc. (IT) Experience: Fresher or max 6 to 8 month working Experience in .NET domain. Basic knowledge of ASP .Net, C#, HTML, CSS, Javascript, etc. Databases: MySQL, Oracle, Sql Server (Any one of them) Satisfactory communication skills required in English and Hindi languages. Candidates living in Noida and nearby are preffered. Good Communication Skills Excellent Mathematical/ Logical/ Reasoning Skills A passionate learner of OOPS methodology and devotee of C++ / C# /MS SQL Skills Required: Candidate must have good knowledge of OOPS, DBMS, Data structures, Deep programming language & SDLC. Candidates must have good communication skills & be ready to accept challenges A passionate and keen learner & has the desire to work in a fast-paced environment Minimum 03 month training certificate required from reputed Institution in .NET Technologies Interview Process: There will be a written test (Quantitative / Logical / English/ Programming), candidates who appear in written test will be eligible for final discussion. Terms & Conditions as below: Candidate must have to fill a bond of bank guarantee upto 1.5 lacs for 2 years and 06 months. There will be a training period of 06 months, candidates will be entitled for the stipend of Rs. 15000/- per month in this training period. After confirmation his/her salary for first year will be 3 LPA and for second year 3.6 - 4.2 LPA. Perks and Benefits PF, ESI, Health Insurance, Free OPD in reputed hospitals Walk-in Date/ Time: 3rd October 2020, 10.00 AM - 2.30 PM Venue Details- Amity Software Systems Limited B 16, B Block, Sector 63, Noida, Uttar Pradesh - 201 307 Contact Person - Sudhanshu","location":"Noida","experience":"0 - 1 Years"},{"date":"10, 11 - Oct - 2020","skills":"ASP .NET framework, SQL Server and Design/ Architectural Patterns","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Vagaro Technologies Private Limited, Block - D , 3rd Floor, West gate Near YMCA Club, S G Highway, Ahmedabad, Gujarat - 380 051","phone":"Not Provided","profile":".Net Professionals \nVagaro Technologies Private Limited","description":"Applicant must have Familiarity with the ASP .NET framework, SQL Server and Design/ Architectural Patterns (e.g. Model-View-Controller (MVC). Very good development experience using C# .NET, Familiarity with architecture styles/ APIs (REST, RPC) Understanding of Agile Methodologies Excellent troubleshooting and communication skills Able to work well in a team setting Knowledge of at-least one JavaScript framework i.e. jQuery Work Experience: Freshers to 10 Years Added Advantages- i. Knowledge of Microsoft Azure ii. Knowledge of .net Core ii. Knowledge of Node.js Walk-in Date: 10th & 11th October'20 (Saturday - Sunday) Timings : 9:00 am to 4:00 pm Venue Details- Vagaro Technologies Private Limited Block - D , 3rd Floor, West gate Near YMCA Club, S G Highway, Ahmedabad, Gujarat - 380 051 Interested candidates please mail CV at hrindia@vagaro.com","location":"Ahmedabad","experience":"0 - 5 Years"},{"date":"1, 2, 3, 5, 6, 7, 8, 9, 10, 12 - Oct - 2020","skills":"Voice/ Non Voice Process, Customer Support, Outbound Calling","qualification":"Diploma, B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"CorpAid Consultancy Services Private Limited, 101 & 102, First Floor, Gulmohar Apartment, East Street, Above SBI Bank, Camp Pune - 411 001","phone":"9112211104","profile":"Customer Support Executive \nCorpAid Services Private Limited","description":"CorpAid Services Private Limited is currently hiring Customer Support Executives for Inbound and Outbound Process (Immediate Joining | Day shift) Required Candidate profile Educational Qualification: HSC or Graduate Skills: Good Communication Skill in English, Hindi & Marathi Basic Computer Knowledge and Good hands-on Computer Perks and benefits- Incentive. Mediclaim Policy Walk-in Date/ Time: 1st to 12th October 2020, 9 AM onwards Venue Details- CorpAid Consultancy Services Private Limited, 101 & 102, First Floor, Gulmohar Apartment, East Street, Above SBI Bank, Camp Pune - 411 001 Email: hr@corpaidcs.com Contact No: 9112211104 Contact - HR Manager ( 8669998509 )","location":"Pune","experience":"0 - 1 Years"},{"date":"1, 2, 3, 5, 6, 7 - Oct - 2020","skills":"Inbound Process, Customer Service, Technical Support","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"One Point One Solutions Limited, Plot No. 17, Sector-18 Near Sarhaul Mod Gurgaon, Haryana","phone":"9999535416","profile":"Customer Support (Inbound Process) \nOne Point One Solutions Limited","description":"Candidates working with any kind of Voice based customer support/ Semi- Technical Support/ Product Support are the preferred ones. Must possess Best-in-class Communication skills to provide premium level support to our valued Customers. Eligibility Criteria : Fresher - Male / Female both can apply for this job. Candidate must be 12th Pass [ Under graduate and graduate can apply] Candidate must speak fluent English & Hindi Must know basic computer. JOB RESPONSIBILITY : 1) Attending customer queries over the phone and providing solutions. 2) Following quality parameters while talking or dealing with customers and clients. 3) Resolving matters in the best interest of both the customer and the company 4) Participating in all organizational activities like RNR | Fun Activities and Sports activities. 5) Coordination with Team Supervisor and colleagues in case of any doubts and problems Other Details Shift For Female Employee : 9am to 6pm and 9:30am to 6:30pm. For Male- Rotational Shifts. Six days working and 1 week off. Salary : 11314k CTC to 18000K CTC basis of Final Interview Interested candidates may walk-in on given venue/ Or can call/ Whats app on given below no :- One Point One Solutions Limited Plot No. 17, Sector-18 Near Sarhaul Mod Gurgaon, Haryana 28 September - 7th October , 9.30 AM - 5.30 PM Sunny Kaushik- 9999535416 Sahil Kajal -9991361100","location":"Gurgaon","experience":"0 - 1 Years"}]}