{"Walkins":[{"date":"11 - Sept - 2019","skills":"Java, Core Java, Spring, Hibernate and UI","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Maxima IT Consulting India Pvt. Limited, G2/3 Sigma House Senapati Bapat Road, Pune, Maharashtra - 411 016","phone":"020-41463471","profile":"Java Developers \nMaxima IT Consulting India Pvt. Limited","description":"Candidate should have good experience on Java, Core Java, Spring, Hibernate and UI Must have excellent communication skills Immediate Joiner preferred. Walk-in Date/ Time: 11th September 2019, 1 PM onwards Interview Venue- Maxima IT Consulting India Pvt. Limited G2/3 Sigma House Senapati Bapat Road, Pune, Maharashtra - 411 016 Tel: 020-41463471 (Office) 8208806551 (MO) Interested candidates has to call an take an Interview email before coming. Please send your resume on gborase@maximaconsulting.com","location":"Pune","experience":"1 - 2 Years"},{"date":"13, 14 - Sept - 2019","skills":"Java, HTML5, CSS, JavaScript, Web Sockets, AJAX, JSON and XML","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Trident Hotel, Bhubaneswar, CB-1 - Jayadebvihar Nayapalli - 751 013","phone":"674 230 1010","profile":"Java Developers \nBroadridge Financial Solutions (India) Pvt. Limited","description":"Broadridge Financial Solutions (India) is hiring for Java Developers at Bhubaneshwar Job Location: Bangalore Required Skills/ Knowledge/ Experience: Candidate must have 3 to 10 years of strong Java programming experience Strong HTML5, CSS, JavaScript, Web Sockets, AJAX, JSON and XML skills. Hands On - J2EE, Struts 1.x, 2.x, Spring IOC, JDBC. Hands On - PL/SQL Oracle Knowledge of Jersey, Jetty, ORM, Groovy would be an advantage Experience using NodeJS would be an advantage Experience using JavaScript modules and frameworks such as JQuery, ExtJS would be an advantage Exposure to backend programming and understanding of interaction with databases (NoSql and SQL) and socket communication would be an advantage Working knowledge of various tools (Git, Maven/Gradle, Grunt, Jenkins, Docker) Other - C/ C++ Strong verbal and written communication skills. Ability to work in a rapidly changing environment and work under pressure Domain experience in capital markets either in trading or clearing preferred Some basic understanding of securities and how trading and settlement works Walk-in Dates : 13th and 14th September, 2019 Time : 10:00 AM to 5:00 PM Walk-In Venue: Trident Hotel, Bhubaneswar CB-1 - Jayadebvihar Nayapalli - 751 013 Tel. +91 674 230 1010 POC @ the Venue : Manish Jagirdar - HR Kindly Note: Please Mention Source as 'Direct Sourcing' on top of your Resume Please carry updated profile, PP Pic and any address ID proof at the venue","location":"Bhubaneshwar","experience":"3 - 10 Years"},{"date":"10, 11, 12, 13, 14 - Sept - 2019","skills":"C# .Net and Java/ Android Programming","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Elico Limited, B-90, C-56, A.P.I.E, Gate No. 6, Sanathnagar, Hyderabad - 18","phone":"040-44451244","profile":"Software Engineer (C# .Net and Java) \nXL Dynamics India Private Limited","description":"Role: Software Engineer/ Developer. Qualification: B.Tech (ECE or C.Sc) / MCA or Equivalent. Work Experience: 2 to 5 Years Roles and Responsibilities: Software Coding. Involve in Application Architecture Designing, Documenting the Project Implementation. Adhere to Specified s/w Development practices. External Client Project and Communications. Maintain the project delivery schedules. Required Skills: C# .Net and Java/ Android Programming. Must have a strong experience in at least one set of the above mentioned fields. Experience in Communication programming (Serial, Network Programming) Development of image processing Algorithms. Knowledge in Web Application Development. Knowledge in Cloud Computing is an advantage. Knowledge in AI and ML is an advantage. Strong analytical, communication and problem solving skills. Should be able to work independently. Should be proactive & possess good interpersonal skills. Ability to work in fast paced environment and be self-driven with strong commitment to work. Note: Candidate should have at least 2 years of work experience in real time projects. At least 6 months of experience in the real time project with an external client. Should have knowledge about Project Management and Version control Software. And Good Communication Skills. Interested candidates, Please walk-in directly with your resume at below mentioned address (Excluding Sunday) or send your Updated resume to prasannam@elicohcs.com Elico Limited B-90, C-56, A.P.I.E, Gate No. 6, Sanathnagar, Hyderabad - 18 Land Mark: Near Bharathanagar MMTS & Metro Rlwy Stations Contact Person: Prasanna. Contact Number: 040-44451244/ 8978447766","location":"Hyderabad","experience":"2 - 5 Years"},{"date":"14 - Sept - 2019","skills":"Java, J2Ee, Postrgre, Spring Boot","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Hinduja Tech Limited, SKCL Triton Squaer Unit C3 to C7, TVK industrial Estate, Guindy, Chennai - 600 032","phone":"Not Provided","profile":"Java Developer \nHinduja Tech Limited","description":"Primary Skill Group (used for reporting purpose): JAVA/ J2EE Primary Skill1 : J2EE Other Skill1 : Primary Skill2 : Others Other Skill2 : Springboot Primary Skill3 : Others Other Skill3 : PostrgreSQL Secondary Skills : Angular 4 Work Experience: 4 to 6 Years Walk-in Date/ Time: 14th September from 9 AM onwards Interview Venue: Hinduja Tech Limited SKCL Triton Squaer Unit C3 to C7, TVK industrial Estate, Guindy, Chennai - 600 032","location":"Chennai","experience":"4 - 6 Years"},{"date":"14 - Sept - 2019","skills":"Java Spring JSP, Spring Core, MVC, Hibernate, JQuery, SQL, PLSQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Nucleus Software Exports Limited, A-39, Sector-62, Noida (Opposite Noida Electronic City Metro Station)","phone":"0120-2403970","profile":"Core Java Developer \nNucleus Software Exports Limited","description":"We are inviting applicants for our product development team in Java Spring Hibernate Hands on experience in Core Java [Threading, Collections, Exception handling JSP, Spring Core, MVC, Hibernate, JQuery Basic knowledge of SQL, PLSQL Writing and maintaining unit test cases Technical architecture Log Analysis, L1/ L2 Custom layer development Role/ Responsbility- Developing Custom layer code based on solution designed following standard coding practice Needs to adhere to committed delivery timelines Sharing status update to supervisors on time Needs to interact with customer for issue analysis & resolution related to Product & Interfaces developed Issue/log analysis and fixing- Innovate and create re-usable component Walk-in Date 14th September 2019 - Saturday Timings - 9.30 am to 2 pm Venue Details- Nucleus Software Exports Limited A-39, Sector-62, Noida (Opposite Noida Electronic City Metro Station) Interested candidates may send their applications to karan.setia@nucleussoftware.com with below details to check the fitment at glance Total Experience- Current CTC- Expected CTC- Notice Period- Note: Please carry a hard copy of your updated resume.","location":"Noida","experience":"3 - 6 Years"},{"date":"12 - Sept - 2019","skills":"Core Java, J2EE, Any framework, HTML, JavaScript, and Jquery","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Eastern Software Systems Pvt. Limited, B-65 Sector 63 Noida - 201 307","phone":"7303555266","profile":"JAVA Developer \nEastern Software Systems Pvt. Limited","description":"Candidate should have 6 months to 2 years of strong hands-on experience with Core Java, J2EE. Experience in any framework, HTML, JavaScript, and Jquery. Working knowledge of MVC, Object Oriented Analysis /Object Oriented Design methodologies. Excellent Debugging / Troubleshooting skills Strong Aptitude and logic is a must. Good Communication Skills. Design, code and debug web applications, create robust high-volume production applications, and develop prototypes quickly. Walk-in Date/ Time: 12th September , 9 AM onwards Interview Venue: Eastern Software Systems Pvt. Limited B-65 Sector 63 Noida - 201 307","location":"Noida","experience":"0 - 2 Years"},{"date":"10, 11, 12, 13, 14, 16, 17 - Sept - 2019","skills":"Java and J2EE frameworks, Spring boot, Data Structure","qualification":"B.E./B.Tech, MCA/PGDCA","address":"E2 Software India Private Limited, 22/1, Madeeha Square, 2nd Floor, Coles Road, Frazer Town, Bengaluru, Karnataka - 560 005.","phone":"Not Provided","profile":"Java Developers \nE2 Software India Private Limited","description":"Person must have strong fundamentals in Java and J2EE frameworks. Spring Framework overall with Spring boot strong experience. Strong problem solving and data structure skills. Strong database knowledge Experience in REST and Micro Service development Experience in Web services and hibernate. Good written and oral communication skills. Walk-in Date/ Time: 10th - 17th September , 11 AM onwards Interview Venue: E2 Software India Private Limited 22/1, Madeeha Square, 2nd Floor, Coles Road, Frazer Town, Bengaluru, Karnataka - 560 005.","location":"Bangalore","experience":"3 - 5 Years"},{"date":"11, 12 - Sept - 2019","skills":"Core Java, Spring, Java/ J2EE and related technologies","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Johnson Controls India Private Limited, C 601, 6th Floor, RMZ Centennial, Kundalahalli Main Road, Whitefield Bangalore, Karnataka - 560 048","phone":"080-40527009","profile":"Software Engineer (Java) \nJohnson Controls India Private Limited","description":"Candidate should have 2 to 3 years of industry and relevant experience Excellent knowledge of Core Java and Spring Candidate should have working knowledge on web services Should be efficient with Java J2EE and related technologies. Should have worked in distributed agile model and continuous integration Should have knowledge on designing and implementation of REST Web services Strong experience with REST API and web services Strong RESTFUL web service experience Strong SQL (preferably Oracle), JQuery, HTML/CSS, Oracle Restful, SOAP web services Walk-in Date/ Time: 11th - 12th September , 10 AM onwards Interview Venue: Johnson Controls India Private Limited C 601, 6th Floor, RMZ Centennial, Kundalahalli Main Road, Whitefield Bangalore, Karnataka - 560 048 PoC - Abhijit","location":"Bangalore","experience":"2 - 3 Years"},{"date":"10, 11, 12, 13 - Sept - 2019","skills":"Java, J2EE, Struts/ Spring","qualification":"B.E./B.Tech, MCA/PGDCA","address":"CNSI, 709, 7th Floor, Phase II SPENCER PLAZA, Anna Salai Channai","phone":"044-43937500","profile":"Software Engineer -Java \nCNSI","description":"Looking for Software Engineer -Java ( Immediate joining preferable) No. of Openings: 20 Experience in Java, J2EE, Struts/ Spring Hands on in writing code Excellent oral & written communication skills, Good problem-solving & analytical skills Must be an excellent team player. Walk-in Date : 10th to 13th Sep 2019 Time : 10 AM to 5 PM Interview Venue: CNSI 709, 7th Floor, Phase II SPENCER PLAZA, Anna Salai Channai","location":"Chennai","experience":"2 - 3 Years"},{"date":"14 - Sept - 2019","skills":"Java/ J2EE (Core java, Struts, Hibernate & Spring Framework)","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"TOMIA (Formerly Starhome Mach) #49, Ground Floor, Shilpa Vidya, 1st Main Road, Sarakki Industrial Layout, 3rd Phase, JP Nagar, Bengaluru, Karnataka - 560 078","phone":"080-66909490","profile":"Senior JAVA Developer \nTOMIA (Formerly Starhome Mach)","description":"Candidate should have Any Engineering degree (BE/ B.Tech/ ME/ M.Tech), preferably in Computer Science Or Computer Application degree (MCA) with 5+ years of experience in Java/ J2EE development, creating application in Telecom OSS/BSS domains. Technical Skills: Java/ J2EE (Core Java, Struts, Hibernate & Spring Framework) Advanced level Angular Intermediary level Oracle, others RDBMS Concepts Intermediary level UNIX Intermediary level Performance Tuning Intermediary level Agile Methodologies Intermediary level Worked on Telecommunication OSS/ BSS platforms Prior experience in Roaming domain would be preferred Subversion, CVS Intermediary level. Walk-in Date/ Time: 14th September 2019, 10 AM onwards Interview Venue: TOMIA (Formerly Starhome Mach) #49, Ground Floor, Shilpa Vidya, 1st Main Road, Sarakki Industrial Layout, 3rd Phase, JP Nagar, Bengaluru, Karnataka - 560 078","location":"Hyderabad","experience":"5 - 9 Years"},{"date":"14 - Sept - 2019","skills":"Java, Node, Go, Python, MySQL, Oracle, PostgreSQL, SQL Server, NoSQL, etc","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Ideas2IT Technologies Private Limited, Plat no 33A, RR Towers-V, 8th floor, Lazer St, Thiru Vi Ka Industrial Estate, Guindy, Chennai, Tamil Nadu - 600 032","phone":"Not Provided","profile":"Java Professionals \nIdeas2IT Technologies Private Limited","description":"Candidate should have 3 to 8 years of strong backend development experience in one of the server-side languages: Java, Node, Go, Python. Familiarity with few databases, like MySQL, Oracle, PostgreSQL, SQL Server, NoSQL, etc. Ability to write high-quality code with test automation A technical mindset with great attention to detail Senior developers (4+ years) are expected to be the Architect for relatively smaller enterprise level projects and for larger projects, you will be closely working with the fellow architects to come up with the architecture and take it further. Walk-in Date: 14th September 2019 Time 11 AM to 3 PM Interview Venue: Ideas2IT Technologies Private Limited Plat no 33A, RR Towers-V, 8th floor, Lazer St, Thiru Vi Ka Industrial Estate, Guindy, Chennai, Tamil Nadu - 600 032 If interested, please share your profile to karthick@ideas2it.com to proceed further","location":"Chennai","experience":"3 - 8 Years"},{"date":"10, 11, 12, 13 - Sept - 2019","skills":"Java, Spring boot, Hibernate, MySQL, PostgreSQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Enstrapp IT Solutions Private Limited, #1556/57, 2nd Floor, Sector 1, HSR Layout, Bangalore - 560 102","phone":"Not Provided","profile":"Java Full Stack Developer \nEnstrapp IT Solutions Private Limited","description":"Person must have 2+ years of experince in Java, Spring boot, Hibernate, MySQL, PostgreSQL HTML5, Boostrap, CSS, JavaScript, Angular JS (1.x) and Gulp Job Location : Bangalore (HSR Layout) Interested candidates can walk-in to our office from 10th - 13th September '2019 at the below mentioned Venue between 10.00 Am - 4.30 Pm Enstrapp IT Solutions Private Limited #1556/57, 2nd Floor, Sector 1, HSR Layout, Bangalore - 560 102 Landmark: Opposite to Indian Oil Petrol Bunk or Next to Hotel Nandas Contact Person : Smithy.M","location":"Bangalore","experience":"2 - 4 Years"},{"date":"9, 10, 11, 12, 13, 14 - Sept - 2019","skills":"General Administration, Housekeeping, Front Office","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Nittany Creative Services LLP, 141, Prakash Towers, 2nd Floor, OMR IT highway, Near IGP Bus stop, Chennai - 600 041.","phone":"9003238160","profile":"Admin Executive \nNittany Creative Services LLP","description":"Candidates with Decent communication can apply. Willing to Work in Rotational Night Shits Only Male Candidate EDUCATION QUALIFICATION: Any Degree (with arrear or Without arrear) SHIFTS: Rotational Shifts (Day/ Night), there will not be any static shifts. Shifts will be decided by the Team leads/ Managers Walk-in Date/ Time: 9th - 14th September , 10 AM onwards Interview Address: Nittany Creative Services LLP 141, Prakash Towers, 2nd Floor, OMR IT highway, Near IGP Bus stop, Chennai - 600 041. Contact Person: Vaidheeswaran HR Contact No: 9003238160 / 9176332863","location":"Chennai","experience":"0 - 1 Years"},{"date":"9, 10, 11, 12, 13, 14 - Sept - 2019","skills":"ASP .Net, MVC, CSS, Web API, Web / WCF Services","qualification":"B.E./B.Tech, MCA/PGDCA","address":"iMarque Solutions Private Limited, No. 9-10, 1st Floor, Theyagaraya Road, T. Nagar, Chennai, Tamilnadu - 600 017","phone":"9087884463","profile":"Software Developer (.Net) \niMarque Solutions Private Limited","description":"Candidate must have 1 to 4 years of experience as .Net Developer with SQL Server Maintaining Internal application & solving Bugs during testing. Must have exposure in Software Development with System Integrity. Should be flexible with strong knowledge in programming languages. Job Responsbility- Planning, developing, testing and implementing the Software. Handling and maintaining the current software and improvising. Working on par with information security managements in software development field. Immediate Joiners Preferred. Walk-in Date/ Time: 9th - 14th September , 10 AM onwards Interview Venue: iMarque Solutions Private Limited, No. 9-10, 1st floor, Theyagaraya Road, T. Nagar, Chennai - 17. (Opposite to Globus, Above Idea Showroom) Contact YAMUNA -9087884463","location":"Chennai","experience":"1 - 4 Years"},{"date":"9, 10, 11 - Sept - 2019","skills":"ASP .Net, C# .Net, SQL Server, OOPS Concepts and Data Structures","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Binary Semantics Limited, 15, Sector 18, Electronics City Gurgaon, Haryana","phone":"9911205666","profile":".Net Developer/ Trainee \nBinary Semantics Limited (BSL)","description":"Candidate must have done some project or training or internship on dot net skills. Education: MCA/ B.Tech (CS/ IT) Technical Skills: ASP .Net, C# .Net, SQL Server Good with OOPS Concepts and Data Structures Excellent Communication Skills Good Analytical Skills Bond of Service Agreement of 2 yrs No of Position: 3 (Dot Net Trainee) Shift Timing: General Shift Job Location: Gurgaon Walk-in Date/ Time: 9th - 11th September , 10 AM onwards Interview Venue: Binary Semantics Limited, 15, Sector 18, Electronics City Gurgaon, Haryana Please go through the above job details and reply back with your updated resume at nirav.soni@binarysemantics.com","location":"Gurgaon","experience":"0 - 1 Years"},{"date":"9, 10, 11 - Sept - 2019","skills":"ASP .Net, MVC, Ajax, Javascript, Jquery, Web Application, Stored Procedures","qualification":"B.E./B.Tech, MCA/PGDCA","address":"SITEL India Private Limited, 5th Floor, B wing Boomerang Building, Chandivali, Andheri (East) Mumbai - 400072","phone":"8451957388","profile":".Net Developers \nSITEL India Private Limited","description":"Person should have good hands on experience with web application development utilizing ASP .Net, JavaScript, Ajax, XML, jQuery, etc. Design and develop complex systems with a high level of reliability and execution speed. Database development using Microsoft SQL Server and/or MySQL including table schemas, stored procedures, triggers, database jobs, etc. Mandatory Skills- Required 1 years of experience with the following: C#, SQL Server. Ability to perform programming, debugging, data analysis, system analysis, and quality assurance preferred Good understanding of the entire software development life cycle. Good communication Skills (Mandatory) Freshers can apply Walk-in Date: 11th September 2019 Interview timings 4 pm - 5 pm Venue Details- SITEL India Private Limited 5th Floor, B wing Boomerang Building, Chandivali, Andheri (East) Mumbai - 400072 Call or drop a text on 8451957388 for further queries Contact person - Jyoti","location":"Mumbai","experience":"1 - 2 Years"},{"date":"9, 10, 11, 12 - Sept - 2019","skills":"General Administration, Housekeeping, Office Management, Amcs Petty Cash","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Brain4ce Education Solutions (P) Limited, 3rd Floor, No. 38/4, Adjacent to Dell EMC2, Outer Ring Rd, Doddanekundi, Bengaluru, Karnataka - 560 048","phone":"9902826205","profile":"Administration Executive \nBrain4ce Education Solutions (P) Limited","description":"Candidate should be Any Graduate with 0 to 3 years of experience in General Administration, Housekeeping, Office Management, Amcs, Petty Cash, Travel Booking, Vendor Management and Facilities Management. Job Responsibilities: Managing entire admin & facilities at Edureka Maintaining budgets & petty cash Team & Vendor Management Creating internal processes and checklists for internal operations Managing housekeeping, security and office boys Ensure AMCs are managed as per SOP Responsible for managing IT infrastructure through vendor management Strategic initiatives as when required for facilities Ensure general upkeep & maintenance of the facility Liaison with different internal & external stakeholders Involved in travel booking as when required Any other ad hoc duties as when assigned by the superiors Walk-in Date/ Time: 9th - 12th September, 10 AM onwards Interview Venue: Brain4ce Education Solutions (P) Limited 3rd Floor, No. 38/4, Adjacent to Dell EMC2, Outer Ring Rd, Doddanekundi, Bengaluru, Karnataka - 560 048","location":"Bangalore","experience":"0 - 3 Years"},{"date":"9, 10, 11, 12, 13, 14 - Sept - 2019","skills":"Front Office/ Front Desk Activities, Hospitality and Guest Relations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Jehangir Hospital, 32, Sasoon Road, Pune - 411001","phone":"020-66819921","profile":"Front Office Executive \nJehangir Hospital","description":"Candidate should be Any Garduate with 0 to 3 years of experience in Front Office/ Front Desk Activities, Hospitality and Guest Relations. Must have excellent communication skills Key Responsibilities- 1) Attending phone calls & giving appointments. 2) Preparing summaries & typing out reports. 3) Handling patient queries. 4) Accompanying the patient to various dept. for the tests. 5) Settling checks received by health check. 6) Maintaining important records & documentation as per departmental rules. Walk-in Date/ Time: 9th - 14th September , 10 AM onwards Interview Venue: Jehangir Hospital 32, Sasoon Road, Pune - 411001 Note: Kindly get your updated CV/Bio-data along with a passport size photograph","location":"Pune","experience":"0 - 3 Years"},{"date":"9, 10 - Sept - 2019","skills":"front office, guest relations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Ample Technologies Private Limited, NCC Windsor Jakkur Next to Renault Showroom","phone":"Not Provided","profile":"Guest Relation Officer (Female) \nAmple Technologies Private Limited","description":"Job Responsbility:- Greet and welcome guests as soon as they arrive at the centre. Answer queries, resolve complaints and provide basic and accurate information for the challenges faced by the customers. Work basis the feedback mechanism Work with Team Members to ensure coordination and 100%CSAT. Deliver consistent Customer service experience. Empathise with the customers and get the problems solved. Key Requisites:- Strong customer service skills Ability to manage sensitive and critical client information. Excellent verbal and written communication skills. Problem solving skills. Relationship building skills. Should have an inclination towards technology Walk-in Date/ Time: 9th - 10th September , 10 AM onwards Interview Venue: Ample Technologies Private Limited NCC Windsor Jakkur Next to Renault Showroom Interested candidates may refer to the below JD & send in your resume to ashwini.prasad@ample.co.in","location":"Bangalore","experience":"1 - 3 Years"},{"date":"9 - Sept - 2019","skills":"C#, VB .NET, ASP .NET with Framework 4.0","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Tai Infotech Private Limited, Building No. 149 4th floor Sector 44 Gurgaon. Next to Luminous Building Near Punjab and Sindh bank, HUDA Metro","phone":"9599555476","profile":"Backend Process Executive \nHCL Technologies Limited","description":"Educational Requirement: BBA, BA, B Com, B.SC Graduates (Only 2015/2016/2017/2018 Pass-outs are eligible for this opening). CS can also apply for the same. Note: Technical graduates / Regular MBA's are not eligible for this opening. Shifts : 24*7 (Rotational) Salary: Upto 2.50 LPA Job Location: Gurgaon Work Experience: Freshers / Maximum 6 months experience Roles and Responsibilities:- *Manage and update Insurance Member and Plan data on multiple systems. *Enter new member data into excel and enrolment forms. *Processes customer requests in a timely and accurate manner. *Communicates with customers through written correspondence. *Using PC application and functions such as Excel and Word to update and load data sets. *To answer queries coming from end user customers in a polite and professional manner. Skill Set Required:- *Good typing speed (25 wpm with 80% Accuracy). *Strong commitment to customer service and quality *Excellent Keyboard Skills *Demonstrates a strong customer service orientation. *Takes responsibility to follow up with customers to ensure their needs and expectations are satisfied. Please come down for a face to face Interview Please write HR Yogendra 9599555476 on the top of your resume for entry Interview Date: 9th September 2019 (Monday) Timings - 11 AM to 4 PM Venue:- Tai Infotech Private Limited Building No. 149 4th floor Sector 44 Gurgaon Next to Luminous Building Near Punjab and Sindh bank Near to HUDA Metro Please Be in Formals For the interview. Need to Carry: Updated CV, All education certificates (Original & Xerox copy) & Govt address / ID proof.","location":"Gurgaon","experience":"0 - 1 Years"},{"date":"9, 10, 11, 12, 13 - Sept - 2019","skills":"C# .Net, ASP .Net, MVC 5.0, Web forms, Entity Framework, Java script, ADO .Net","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Selectsys India Private Limited, Plot-4, Road No. 45/A, Masthan Nagar, Jubilee Hills, Hyderabad - 500 033.","phone":"9849360114","profile":".Net Trained/ Developers \nSelectsys India Private Limited","description":"We are inviting Freshers/Experienced who are Certified /Trained in Dot Net Environment. Any Graduate/ B.Tech/ PG/ M.Tech/ MCA is eligible. Relevant Experience: Fresher to 2 years Skills :- C# .Net, ASP .Net, MVC 5.0, Web forms, Entity Framework, Java script, ADO .Net, JQuery, Web API, MS SQL Server. Job Requirements: Good in Verbal and Written Communication. Excellent Analytical, Presentation and Interpersonal skills. Walk-In Drive between Mon-Fri (11 am-4 pm) hours Interview Venue: Selectsys India Private Limited Plot-4, Road No. 45/A, Masthan Nagar, Jubilee Hills, Hyderabad - 500 033. LandMark: Near to Dr Ambedkar University / Hanuman Temple Point of Contact: - Pawan/ Bhargavi. Mobile:- 9849360114/ 7331149671. Email id:- hrsupport@selectsysamerica.com","location":"Hyderabad","experience":"0 - 2 Years"},{"date":"9, 10, 11, 12, 13 - Sept - 2019","skills":"Software Testing, Quality Assurance, Test Case Design, Test Execution and Defect Management","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Analec Infotech Private Limited, 6th Floor, Tower B, Park Centra NH-8 Sector 30, Gurgaon, Haryana","phone":"Not Provided","profile":"Software Testing Engineer \nANALEC Infotech Private Limited","description":"Candidate should have 0-2 years of experience in Software Testing and Quality Assurance with hands on experience in Agile methodology. Should be very strong in Manual Testing. Expertise in Test Case Design, Test Execution and Defect Management. Perform manual testing, the scope of which will encompass all functionality of services to as a prequel to Automation Ability to track and manage numerous parallel test activities Understanding of QA methodologies, life cycle and processes Leadership and initiative skills Good in Data Analysis, Data Validation, Data Cleansing, Data Verification Design and build the automated test suites/ cases for use in development and testing cycles (Desirable) Having financial domain (Investment Banking/ Capital Market) knowledge (Desirable) Walk-in Date/ Time: 9th - 13th September , 10 AM onwards Interview Venue: Analec Infotech Private Limited 6th Floor, Tower B, Park Centra NH-8 Sector 30, Gurgaon, Haryana","location":"Gurgaon","experience":"0 - 2 Years"},{"date":"9, 10, 11, 12, 13, 14, 16, 17, 18, 19, 20 - Sept - 2019","skills":"Back Office Operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Hexaware Technologies Limited, Q1, 1st floor, M/S Loma IT Park Developer Pvt Ltd, Opposite to MC Donalds, Ghansoli, Navi Mumbai - 400 701","phone":"Not Provided","profile":"Back Office Executive \nHexaware Technologies Limited","description":"Hiring Candidates from Science Streams: Education : H.S.C/ Graduates from Science only (No Bsc IT) Basic Requirement : Candidate should be willing to work in rotational shifts Excellent Communication Good Comprehensive skills Comfortable with UK-US shifts Technical Competencies: Typing speed 25 to 30 wpm with 90% accuracy Ability to multitask and effectively prioritize work Salary: - Good in the industry Benefits:- Working for Brand Name Pickup and Drop Facilities Available Subsidized Canteen Food Walk-in Date/ Time: 9th September - 20th September , 3 PM onwards Interview Venue: Hexaware Technologies Limited Q1, 1st floor, M/S Loma IT Park Developer Pvt Ltd, Opposite to MC Donalds, Ghansoli, Navi Mumbai - 400 701 Contact Person : HR Wasim M","location":"Mumbai","experience":"1 - 4 Years"},{"date":"9, 10, 11, 12, 13, 14, 16, 17, 18, 19, 20, 21 - Sept - 2019","skills":"C#, SQL, .NET ASP .NET","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Chamunda Tech Net Services Private Limited, 401 L-Wing Tex Center, Near Naryan Plaza. Chandivali, Andheri (East) Mumbai","phone":"Not Specified","profile":"Software Developer (.Net) \nChamunda Tech Net Services Pvt. Limited","description":"Need fresher software developers for IT company Applicant should have good knolwdge of C#, SQL, .NET ASP.NET Job Location: Mumbai Salary: INR 80,000 - 3,00,000 PA. Capable candidates will be offered good salary package. Walk-in Date/ Time: 9th - 21st September , 9 AM onwards Interview Venue: Chamunda Tech Net Services Private Limited 401 L-Wing Tex Center, Near Naryan Plaza. Chandivali, Andheri (East) Mumbai","location":"Mumbai","experience":"0 - 2 Years"},{"date":"10, 11 - Sept - 2019","skills":"ASP .NET, VB .NET, C#.Net, ADO .NET, Web Applications, Web Services, Javascript","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"MWebWare Software Services Pvt. Limited, H.No. 1-98/7/42, Jai Hind Enclave, Madhapur, Hyderabad, Telangana - 500 081. Landmark: Opposite to Season Swimming Pool","phone":"040-29705578","profile":".Net Developer/ Fresher \nMWebWare Software Services Pvt. Limited","description":"Candidate should be B. Tech (CSE, IT and ECE/ only) & MCA/ M.Tech (2017, 2018 and 2019 Passed outs) Scored 60% throughout their academics. Must have trained on DotNet (Minimum of two months). Knowledge of ASP .NET, VB .NET, C#.Net, ADO .NET, Web Applications, Web Services, Javascript, Ajax, XML & Understanding on OOP's Concepts. Should possess good communication skills. Knowledge of SQL Server programming is a must. Query, WCF, WPF, MVC, knowledge would be Add-on. Candidates matching above criteria can walk-in from 10th to 11th September 2019. Timings:11 AM to 4 PM. Interview Venue: MWebWare Software Services Pvt. Limited H.No. 1-98/7/42, Jai Hind Enclave, Madhapur, Hyderabad, Telangana - 500 081 Landmark: Opposite to Season Swimming Pool Note: Candidates who attended the interview are not eligible up to 3 months from date of interview.","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"23, 24, 25 - Sept - 2019","skills":"C++, C#, ASP .Net, OOPS, Javascript, Networking, CSS, HTML, Databases","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Enzigma Software Private Limited, 111/10/3, Opposite D-Mart, Baner Road, Baner, Pune","phone":"Not Provided","profile":".Net Trainee Engineer \nEnzigma Software Private Limited","description":"Technical Skills: C++, C#, ASP .Net, OOPS, Javascript, Networking, CSS, HTML, Databases, Web Services. Candidates have to be flexible in terms of technology as we are on the cloud platform and in the near future, if the projects require, they will have to switch to the cloud along with Dot Net. Excellent communication skills- Written and Verbal. Must be ready to work in any shift and sign a bond of 2.5 years. Walk-in Date/ Time: 23rd - 25th September , 9 AM onwards Interview Venue: Enzigma Software Private Limited 111/10/3, Opposite D-Mart, Baner Road, Baner, Pune Candidates who have applied in the past 3 months for any position in Enzigma will not be eligible to apply.","location":"Pune","experience":"0 - 2 Years"},{"date":"11, 12 - Sept - 2019","skills":"Core Java, Spring, Web Services, J2EE and related technologies.","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Johnson Controls India Private Limited, C 601, 6th Floor, RMZ Centennial, Kundalahalli Main Road, Whitefield Bangalore, Karnataka - 560 048","phone":"080-40527009","profile":"Software Engineer (Java) \nJohnson Controls India Private Limited","description":"Candidate should have 2 to 3 years of industry and relevant experience with excellent knowledge of Core Java and Spring. Should have working knowledge on web services. Efficient with Java J2EE and related technologies. Should have worked in distributed agile model and continuous integration Knowledge on designing and implementation of REST Web Services Strong experience with REST API and web services Strong RESTFUL web service experience Strong SQL (preferably Oracle), JQuery, HTML/CSS, Oracle Restful, SOAP web services Walk-in Date/ Time: 11th - 12th September , 10 AM onwards Interview Venue: Johnson Controls India Private Limited C 601, 6th Floor, RMZ Centennial, Kundalahalli Main Road, Whitefield Bangalore, Karnataka - 560 048 Contact Person- Abhijit","location":"Bangalore","experience":"2 - 3 Years"},{"date":"12, 13 - Sept - 2019","skills":"Manual Testing, Database Testing, SQL Server, QA, Web Technologies","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Sagarsoft (India) Limited, Plot No-111, 1st floor, Road No-10 Jubilee Hills, Hyderabad","phone":"9100814445","profile":"QA (Manual) Testing Engineer \nSagarsoft (India) Limited","description":"Candidate should have good experience on manual testing of Trading applications. Experience in Automation and Web API will be added advantage Capital Market/ Trading domain Experience is mandatory. Good on SQL Server and Database Testing. Strong communication skills. Knowledge on Linux basics is plus. Location: Hyderabad Notice Period: Immediate to 15 Days (Max 30 Days) Shift Timing: 3 PM to 12 AM Walk-in Date/ Time: 12th - 13th September , 2 PM onwards Interview Venue: Sagarsoft (India) Limited Plot No-111, 1st floor, Road No-10 Jubilee Hills, Hyderabad Note: Please carry a copy (In Mobile or Print-Out) of this posting for security clearance at the venue.","location":"Hyderabad","experience":"4 - 8 Years"},{"date":"10 - Sept - 2019","skills":"test engineering, Manual Testing, Selenium, Technology Solutions Testing","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"NOVAC Technology Solutions, Office No. 275 R. K. Mutt Road, Statesmen One Mylapore, Chennai - 600 004. (Landmark: Near to Bata Showroom/ Mylapore Railway Station)","phone":"Not Provided","profile":"Testing Trainee (Freshers) \nShriram Value Services Private Limited","description":"Novac Technology Solutions(Shriram Value Services) is currently hiring for Software Test Engineer Trainee. Candidate with 65% above in 10th, 12th, UG, PG are only eligible BE/ B Tech (CSE/ IT/ ECE/ EEE), MCA, MSc (CS) from 2018 & 2019 batch only BSc (CS), B.com & BCA from 2018 & 2019 batch only Work Experience: Fresher Good knowledge in Testing is preferred Age criteria Not more than 25 Years Selection Process : Aptitude Test Technical Round Walk-in Date: 10th September 2019 Timing:9.30 am to 3 pm Interview Venue: NOVAC Technology Solutions Office No. 275 R. K. Mutt Road, Statesmen One Mylapore, Chennai - 600 004. (Landmark: Near to Bata Showroom/ Mylapore Railway Station) Documents To Be Carried : Resume Passport Size Photo ID Proof If you have attended this interview process in last 6 months you won't be eligible.","location":"Chennai","experience":"0 - 1 Years"},{"date":"10, 11, 12, 13 - Sept - 2019","skills":"Test Scenarios, Software Testing, Manual Testing, Test Cases, Automation Testing","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"AQM Technologies Private Limited, 4th Floor, A-Wing, Raheja Plaza, LBS Road, Ghatkopar (West) Mumbai - 400 086","phone":"022-40508299","profile":"Software Tester - Freshers \nAQM Technologies Private Limited","description":"Candidate should have good understanding of Software Testing Should prepare Test scenarios and derive test cases Strong Programming skills in common languages like C++ or Core Java Should have basic SQL Database query knowledge Completion of Software Testing course is Mandatory. Should have good verbal & written communication skills. Should have the willingness to travel & work at various locations Walk-in Date/ Time: 10th to 13th September 2019, 10 AM onwards Interview Venue: AQM Technologies Private Limited 4th Floor, A-Wing, Raheja Plaza, LBS Road, Ghatkopar (West) Mumbai - 400 086","location":"Mumbai","experience":"0 - 1 Years"},{"date":"14 - Sept - 2019","skills":"Automation framework, Java, Web Servicess, White box Testing, Automation Testing, Agile SQL Server","qualification":"B.E./B.Tech","address":"BOLD Technology Systems Pvt. Limited, Aykon Tower, 4th Floor, Plot No. 4 Sector-135, Noida","phone":"Not Provided","profile":"Software Testing Engineer \nBold Technology Systems Private Limited","description":"Candidate should have good experience in White Box testing & Web Services Experience with one or more database technology- Relational (like SQL Server) and NoSQL Good working experience in security and performance testing & tools. Hands on coding in Java is a must Prior experience in platform based teams is preferable. Automation, API, web services, Java Job Responsibilities: Independently utilize innovative test methodologies to develop test plans/strategies for owned features. Create and enhance backend automation tests and test tools Ability to extend API automation framework Work efficiently in a multi-project agile environment Add to performance, security and scalability testing efforts Write specialized testing tools for use in testing our software platform Participate in design and code reviews Excellent debugging skills, measures and analyses code for quality. Walk-in Interview on 14th September from 9 AM onwards Interview Venue: BOLD Technology Systems Pvt. Limited Aykon Tower, 4th Floor, Plot No. 4 Sector-135, Noida","location":"Noida","experience":"1 - 5 Years"},{"date":"10 - Sept - 2019","skills":"Manual Testing/ Database Testing, SQL Query write ups","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Wipro Limited, Olympia Tech Park -3rd Floor Altius Block, Guindy, Chennai - 600 032","phone":"044-43905000","profile":"Manual/ Database Testing Engineer \nWipro Limited","description":"Candidate should be B.Tech or MCA with 18 to 36 months work experience in Manual Testing/ Database Testing, SQL Query write ups. Should have experience in creating test plans, identifying test cases and perform test execution. Experience in benefits administration preferably in Health or Insurance sector. Must have excellent Communication Skills Shift Timings- 11.30 am to 9 pm Need immediate joiners or less than 15 days-30 days Interview Rounds- Logical evaluation + Tech manager round Walk in dates- 10th September 2019 Timing- 9 am Onwards Interview Venue- Wipro Limited, Olympia Tech Park -3rd Floor Altius Block, Guindy, Chennai - 600 032","location":"Chennai","experience":"1 - 3 Years"},{"date":"9, 10, 11, 12, 13 - Sept - 2019","skills":"Java, .Net, IOT","qualification":"B.E./B.Tech, MCA/PGDCA","address":"VDart Software Services Pvt. Limited, No. 37, Raja Colony, 1st Main Road, Collector Office Road, Trichy 1.","phone":"8870110485","profile":"Software Developer (Java/ .Net) \nVdart Software Services Private Limited","description":"Candidate should have good experience in any coding Language Experience in Java, .Net, IOT will be added advantage. Work Experience: 0 to 2 Years Job Location : Trichy Walk-in Interview from 9th - 13th September , 10 AM onwards Interview Venue: VDart Software Services Pvt. Limited, No. 37, Raja Colony, 1st Main Road, Collector Office Road, Trichy 1. Contact Person: Siva/ 8870110485 Interested candidates reach me @ 8870110485 / siva@vdartinc.com","location":"Trichy","experience":"0 - 2 Years"},{"date":"9 - Sept - 2019","skills":"Software Testing, Manual Testing, Quality Assurance","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Amazon Development Center, 5th Floor, A Block, Global Infocity MGR Salai, Perungudi, Kandanchavady Chennai - 600 096","phone":"Not Mentioned","profile":"Software Testing Engineer \nAmazon Development Centre (India) Pvt. Limited","description":"Amazon is hiring Device Associate / Associate-Quality Services for Chennai location, this is a Full Time Role related to Software device testing. Please find the below Job Description for the same and criteria to apply for this role. You may appear for the interview if you find yourself matching the below criteria. Eligibility Criteria: BE/ B Tech or BCA/ MCA/ BSC/ MSC are only eligible to appear for the interviews Candidate pursuing Graduation or awaiting results will not be eligible to apply Freshers / candidates with less than one year of experience into Testing Candidates who have appeared for the same role in the last 6 months will not be eligible to reapply Immediate Joiners preferred Interview Date : 9th September 2019 Walk-in : 11:00 AM to 2:00 PM Interview Venue: Amazon Development Center 5th Floor, A Block, Global Infocity MGR Salai, Perungudi, Kandanchavady Chennai - 600 096 Next to RMZ Millennia and Behind Apollo Hospital Documents to Carry: 2 copies of Resume (Mandatory) 10th Standard Mark sheet (Mandatory) Photo Copies Pan Card (Mandatory) Photo Copies Provisional Certificate and/or Degree Certificate (Mandatory) Photo Copies 2019 Passouts Please carry all semester mark sheets along with the internet copy of your final semester results (Mandatory) Photo Copies","location":"Chennai","experience":"0 - 1 Years"},{"date":"9, 10, 11, 12, 13, 14, 16, 17, 18, 19, 20 - Sept - 2019","skills":"Front End, HTML5, UI, Bootstrap, Angularjs, Javascript, Jquery","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Bitstreet Technologies Private Limited, 501, 5th Floor, Crystal Plaza,158-CST Road, Vidya Nagari, Kalina, Santacruz (East), Mumbai - 400 098","phone":"9096257094","profile":"UI Developer \nBitstreet Technologies Private Limited","description":"Candidate should have Proficiency with Java Script, Jquery, Bootstrap, CSS3, HTML5, RESTful APIs, Asset Management tools (Grunt/ Gulp). Deep knowledge of Frameworks practices(AngularJS, react JS etc.) and commonly used modules based on extensive work experience. Experience in working with angular bootstrap,materialize and data visualisation libraries (e.g.Chart.js). Experience with all levels of operation available to the front-end, such as from creating XHRs in vanilla JS to using a custom wrapper around resource. Good to Have:- Building the infrastructure for serving the front-end app and assets Walk-in Date:- 9th to 20 September 2019 Interview Time:- 10.00 Am to 4.00 PM Venue:- Bitstreet Technologies Private Limited 501, 5th Floor, Crystal Plaza,158-CST Road, Vidya Nagari, Kalina, Santacruz (East), Mumbai - 400 098 Contact Person:- Ashfaque Shaikh Walkin along with your updated resume.","location":"Mumbai","experience":"3 - 8 Years"},{"date":"16 - Sept - 2019","skills":"Integrations, Data Analytics, Product Support, Machine learning, Big Data","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Interested candidates can send their resume to ssheriel@bizdata360.com or skbhardwaj@bizdata360.com along with their availability for 13th September.","phone":"+91-9715716758","profile":"Product Consultant/ Freshers \nBizdata Advanced Software Private Limited","description":"Peron must be expert in one or more DB Engines like Oracle, Mysql or PostgreSQL Strong understanding on APIs like REST, SOAP API and JSON dataset. Good understanding of distributed computing environments. Strong base understanding of Data Interpretation, Data Management with Charts and Graphs Knowledge of PHP, SQL, HTML5, CSS, Angular, JavaScript anyone would be added advantage Responsible for handling existing customers on Bizintel360 an eZintegrations products Excellent Analytical and Logical Skills are mandatory. Flexible to handle all technical query within the organization Have good interpersonal and communication skills Identify growth opportunities to support projects in an online environment with regular discussions with all stakeholders. Excellent oral and written communication skills Excellent troubleshooting skills with customer service experience / strong customer focus Self-starter who is excited about learning new technologies on a regular basis Job Responsibilities: Working with existing Bizdata customer using Bizintel360 and eZintegrations and understand the business process in order to ensure smooth day to day operations. Streamline and automate processes and reports, including improvements to current business process of the customer. Help Customer with Training on the Products for daily activities. Help Translate the customer business process into product requirement and communicate the same with the Bizdata Product Development and Consulting Team.","location":"Bangalore","experience":"0 - 3 Years"},{"date":"9, 10, 11, 12, 13 - Sept - 2019","skills":"Java, QA Automation, Selenium, Manual Testing","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Grazitti Interactive, Plot No. 198 Phase 2 Industrial Area, Panchkula","phone":"+91-9914693366","profile":"Software Testing Engineer \nGrazitti Interactive","description":"|| QA Automation Engineer || Expert in Automation with Selenium WebDriver with Java Test Automation Frameworks Expert Experience with building and maintaining test automation technologies (Selenium, Cucumber, AutoIT, Sikuli, REST Assured, TestNG, Maven Dependency, POM, Cucumber Reporting etc.) || QA Manual Engineer || Attributes and Skills required 1. Review requirements specification & Technical design document to provide timely meaningful feedback. 2. Create clear, concise test cases & test plans, identify & track bugs. 3. Perform regression testing when bugs are resolved 4. Testing and Quality Assurance of mobile and web apps, including cross-browser testing and cross-device 5. testing 6. Experience in Performance testing and automation is a plus Skills & Knowledge: Software Testing, Test Plans, Cross-Browser Compatibility, Test Cases Eventum, Bugzilla or Mantis (Defect Reporting tools) Microsoft Word and excel Walk-in Date/ Time: 9th - 13th September from 11 AM onwards Interview Venue: Grazitti Interactive Plot No. 198 Phase 2 Industrial Area, Panchkula","location":"Chandigarh","experience":"1 - 5 Years"},{"date":"14 - Sept - 2019","skills":"Visual Studio , .NET Core, C#, and Web API/ Rest API","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"CBRE | Digital & Technology, 6th Floor, Novus Tower, 18 Ananth Road, Maruti Udyog, Sector-18 Gurugram -122 008.","phone":"Not Mentioned","profile":".Net Professionals \nCBRE South Asia Private Limited","description":"We are conducting Mega Walk-In Drive at CBRE- Digital & Technology Centre (Gurugram) on Saturday 14th September at 9:00 am- 3:30 PM. Dot Net/ Dot Net Core with React/ Redux Developer (3 to 11 Years) Must have Skills- Dot Net with React/ Redux. Required Knowledge & Skills: 3- 11 Years for IT experience with development experience in React, Redux, HTML 5 , CSS, JavaScript/Typescript, Angular. Experience in Visual Studio , Dotnet, Dot NET Core, C#, and Web API/ Rest API Knowledge-Continuous Integration and Continuous Deployment, CI,CD, Desirable- Experience of Azure/Aws development No. of Opening: 5 (Candidates with 30-45 days Notice period or immediate joiner will be preferred) If you meet the above criteria. Request you to Directly attend walk-in interview on Saturday Saturday 14th September at 9:00 am- 3:30 PM. Do Carry your updated resume. Interview Venue : CBRE | Digital & Technology, 6th Floor, Novus Tower, 18 Ananth Road, Maruti Udyog, Sector-18 Gurugram -122 008. (Landmark- Opposite Passport Office) Contact Person: Surender Singh","location":"Gurgaon","experience":"3 - 11 Years"},{"date":"9, 10, 11 - Sept - 2019","skills":"OS Installation, IT Support, Installation,Troubleshooting, Desktop Configuration","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Directi Internet Solutions Private Limited, Directiplex, Opp Andheri Subway, Old Nagardas Road, Andheri (East), Mumbai, Maharashtra - 400 069","phone":"Not Provided","profile":"IT Support Executive \nDirecti Internet Solutions Private Limited","description":"Graduation in IT is highly preferable. Candidate should have good knowledge of IT products. Should have 1+ years of relevant experience Possess strong problem solving skills with ability to organize and analyze data Confident, creative, proactive in taking initiatives and achieving them Must be goal-oriented individual with a strong attention to detail Should have basic knowledge of Mac, Linux and Network Installation, configuration and Managing of Windows 7 up to Windows 10 machines. Should have excellent Windows Desktops OS troubleshooting skills including hardware troubleshooting skills. Installation, configuration & management of Servers, WiFi Router and Network devices. Installation and management of mail applications like MS Outlook and Thunderbird. Walk-in Date: 9th - 11th September 2019 Time: 10 AM - 3 PM Interview Venue: Directi Internet Solutions Private Limited Directiplex, Opp Andheri Subway, Old Nagardas Road, Andheri (East), Mumbai, Maharashtra - 400 069 Interview Process: HR Round + Online Test POC : Nupur Please carry your updated resume with you.","location":"Mumbai","experience":"1 - 3 Years"},{"date":"9, 10, 11, 12, 13, 14 - Sept - 2019","skills":"PHP based Websites, HTML5, CSS3 and JS, Education: Graduate / B-Tech / MCA","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Syscom Softech Private Limited, Hafed Complex, A-Block first floor, Near Wazirpur Depot, Opposite to Netaji Subhash Place, Delhi","phone":"8459013293","profile":"PHP & Android Developer \nSyscom Softech Private Limited","description":"1) PHP Developer Develop & Maintain PHP based Websites. Should have Knowledge of HTML5, CSS3 and JS. Knowledge of any one framework like cakePHP, codeigniter etc Working experience of any CMS / e-Commerce like Magneto, Open Cart, Wordpress, Joomla etc Knowledge of Ajax, jQuery, Mysql, JSON. 2) Android Developer Knowledge of Android SDK developer tools Knowledge of Web Services JSON, SOAP etc Experience in independently integrating the Android framework Database Skills like Sqlite Integration of API like Google, Yahoo, you tube will be a added advantage Educational Qualification: Graduate / B-Tech / MCA Experience: 0-2 year (Freshers can also apply) Salary: Negotiable Interview Date: Call @ (8459013293) to fix the time Concerned Person: Ms. Surbhi Bharti Interview Venue: Syscom Softech Private Limited Hafed Complex, A-Block first floor, Near Wazirpur Depot, Opposite to Netaji Subhash Place, Delhi If you are interested to apply, send us your updated resume with the following details on jobs@syscomindia.com 1. Date & Time of the interview (Between 10 AM to 5 PM): 2. Your Current CTC (If Any): 3. Your Expected CTC: 4. Notice Period (If Any): 5. Current Roles and responsibility (If Any):","location":"Delhi","experience":"0 - 2 Years"},{"date":"10 - Sept - 2019","skills":"Customer Care, Voice Process, Customer Support","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Artech Infosystems Private Limited, #01-02, 1st Floor, Phase-1A, Cyber Tower, Hitech City, Madhapur, Hyderabad - 500 081","phone":"Not Provided","profile":"Customer Support Executive \nArtech Infosystems Private Limited","description":"Applicable Qualification: UG: Any Graduate B.E, B.Tech, BSc, BCA, B.Com, BBM, BA PG: MBA, Mcom, MCA Year of Passed Out: 2016, 2017, 2018 and 2019 Only Any Percentage (No Backlogs) Required Experience: 0 to 2 Years Position: Immediate Joining Other benefits: Cab Facility Required Skills: Voice Process, Well Spoken English and Communication Skill Is Mandatory** Should be able to interact with customers, Ready to accept Inbound and out bound process Interview Process: # Group Discussion # Face to Face round with Client-Dell Interview Date: 10th Sept 2019 (Tuesday) Time: 9.30 AM to 12 PM Interview Venue: Artech Infosystems Private Limited #01-02, 1st Floor, Phase-1A, Cyber Tower, Hitech City, Madhapur, Hyderabad - 500 081 Contact Person - Keerthi","location":"Hyderabad","experience":"0 - 2 Years"},{"date":"6 - Sept - 2019","skills":"Java/J2EE (Core java, Struts, Hibernate & Spring Framework)","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"TOMIA (Formerly Starhome Mach) #49, Ground Floor, Shilpa Vidya, 1st Main Road, Sarakki Industrial Layout, 3rd Phase, JP Nagar, Bengaluru, Karnataka - 560 078","phone":"080-66909490","profile":"Java Developer \nTOMIA","description":"Requirements: Any Engineering degree (BE/ B.Tech/ ME/ M.Tech), preferably in Computer Science Or Computer Application degree (MCA) with 5+ years of experience in Java/ J2EE development, creating application in Telecom OSS/BSS domains. Technical Skills: Java/ J2EE (Core java, Struts, Hibernate & Spring Framework) Advanced level Angular Intermediary level Oracle, others RDBMS Concepts Intermediary level UNIX Intermediary level Performance Tuning Intermediary level Agile Methodologies Intermediary level Worked on Telecommunication OSS/BSS platforms and prior experience in Roaming domain would be preferred Subversion, CVS Intermediary level. Walk-in Date/ Time: 6th September 2019, 10 AM onwards Interview Venue: TOMIA (Formerly Starhome Mach) #49, Ground Floor, Shilpa Vidya, 1st Main Road, Sarakki Industrial Layout, 3rd Phase, JP Nagar, Bengaluru, Karnataka - 560 078","location":"Bangalore","experience":"5 - 9 Years"},{"date":"5, 6 - Sept - 2019","skills":"Non Voice Process, Data Entry Operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"3i Infotech Limited, ICICI Towers, Plot No. 12, Tower III, South Wing, 5th Floor, Nanakramguda, Financial District, Gachibowli, Hyderabad","phone":"Not Provided","profile":"Back Office/ Data Entry Executive \n3i Infotech Limited","description":"Qualification: Any Graduation (Mandatory) Preferably Males. Must have good communication skills in English & Telugu. Should have minimum 25 WPM Typing Speed. Shifts: Rotational (Includes Night Shift) Should be flexible for all 3 Shifts. General Shift: 9:30 Am to 6:30 Pm Afternoon Shift: 12 Noon to 9 Pm Night Shift: 9 Pm to 6 Am Walk-in Date/ Time: 5th - 6th September , 10 AM onwards Interveiw Venue: 3i Infotech Limited ICICI Towers, Plot No. 12, Tower III, South Wing, 5th Floor, Nanakramguda, Financial District, Gachibowli, Hyderabad Original Certificates Required: 1. Academic Certificates( SSC , HSC/ PUC/ Diploma/ ITI, Degree) 2. Aadhar Card 3. Pan Card / Pan Card Acknowledgment copy 4. Current Address proof 5. Passport Size Photo( with White Background) Should be in formals while attending interview.","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"5, 6 - Sept - 2019","skills":"Back End Operations, Data Entry, Day-to-day operations","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"HCL Technologies Limited, 1st floor, WSS Towers or Navins Building, 106 & 107, Langs Garden Road, Mount Road, Pudupet, Landmark : Near Casino Theatre , Chennai - 600 002","phone":"Not Provided","profile":"Backend Process Associate \nHCL Technologies Limited","description":"HCL bserv is the short term for HCL business service. HCL started its business in outsourcing from 2001 and named all its bpo activities into HCL bserv . It's the part of its parental company HCL technologies. Eligibility Criteria: Any Graduates can apply (No Backlogs) Should have good written and oral communication Job Role/ Responsbility: Handling and resolving issues related to Healthcare business. This position is responsible for day-to-day operations. Other Benefits: Job timings- (4 AM-2 PM ) Doorstep cab pick and drop - Free Transportation for women up to 20kms from work location. Internal opportunity within HCL BPO after 18 months. Excellent opportunity for Freshers to start their career. UG Consolidated & Provisional certificate is mandatory at the time of joining Walk in Date & Timings: 5th to 6th Sept, 11 am to 12 pm Interview Venue : HCL Technologies Limited, 1st floor, WSS Towers or Navins Building, 106 & 107, Langs Garden Road, Mount Road, Pudupet, Landmark : Near Casino Theatre , Chennai - 600 002 Contact HR : Sharmi Sai If Interested, you may walk-in with your updated Resume. Please mention Sharmi Sai on top of your resume without fail","location":"Chennai","experience":"0 - 3 Years"},{"date":"5, 6, 7, 9, 10, 11, 12, 13, 14, 16, 17 - Sept - 2019","skills":"MIS, Customer Service, Underwriting, Back Office, Renewals/ Retention","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Kotak Mahindra Life Insurance Co. Limited, No. 9, Cenatoph Road, Neeladri Building 2nd floor, Teynampet, Chennai - 600 018","phone":"Not Provided","profile":"Asst Manager - MIS/ Operations \nKotak Mahindra Life Insurance Co. Limited","description":"Candidate should be Any Graduate with 0 to 2 years experience in MIS, Customer Service, Underwriting, Back Office, Renewals/ Retention. Must have excellent communication skills. Roles & Responsibilities: MIS Management and Coordination Backend Processing Servicing Walk in Clients at the Branch Renewal Premium Followups Walk-in Date/ Time: 5th - 17th September , 10 AM onwards Interview Venue: Kotak Mahindra Life Insurance Co. Limited No. 9, Cenatoph Road, Neeladri Building 2nd floor, Teynampet, Chennai - 600 018","location":"Chennai","experience":"0 - 2 Years"},{"date":"5, 6, 7, 9, 10, 11, 12, 13, 14 - Sept - 2019","skills":"Software Testing, QTP, Selenium, Manual Testing, Automation Testing","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Enel X Services India Private Limited, Unit Number A-G01, Marathon Chambers, A Wing, Mafatlal Mill's Compound N M Joshi Marg, Lower Parel (East), Mumbai - 400 013","phone":"Not Provided","profile":"Back Office Analysts (Night Shift) \nEnel X Services (India) Private Limited","description":"We are looking for smart and dynamic candidates (may be fresher or having less than 2 years of experience) for our India Operations (Energy Utility Bill Processing) team. Required Credentials: Graduation Degree with no educational gaps (No BA, B.E, MMS and B.Tech candidates) Fresher/ Experienced (0-2) years Electronic spreadsheet knowledge Excellent written and verbal skills Good logical and analytical skills Immediate joiner Local candidate Required Candidate profile accounting fresher, backoffice, KPO,BPO, backofice operation, bill processing, data management, accounts payable, verification process, backend, admin Mumbai Office Location: Lower Parel East (Marathon Chambers) Night Shift - 11:00 pm to 7:30 am Sunday to Thursday (Friday and Saturday night off) Working days: 5 days Walk-in Date/ Time: 4th - 30th September , 11 AM onwards Interview Venue: Enel X Services India Private Limited Unit Number A-G01, Marathon Chambers, A Wing, Mafatlal Mill's Compound N M Joshi Marg, Lower Parel (East), Mumbai - 400 013 Landmark: Besides Lower Parel Station","location":"Mumbai","experience":"0 - 2 Years"},{"date":"5, 6 - Sept - 2019","skills":"HR Administration, Human Resource Management, Administrative Assistance","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Metis Eduventures Private Limited, 1007, 10th Floor, Tower C, Unitech Cyber Park, Durga Colony, Jharsa, Sector 39, Gurugram, Haryana - 122 022.","phone":"Not Provided","profile":"HR Administrator \nMetis Eduventures Private Limited","description":"Candidate should be Any Graduate/ MBA (HR) with 0 to 1 year experience in HR Administration, Human Resource Management, Administrative Assistance. Must have excellent communication skills, Job Responsibilities- - Organizing and maintaining personnel records. - Liaise with external partners, like insurance vendors, and ensure legal compliance. - Answer employees queries about HR-related issues. - Participate in HR projects (e.g. help organize events) Walk-in Date/ Time: 4th - 7th September , 1 PM onwards Interview Venue: Metis Eduventures Private Limited 1007, 10th Floor, Tower C, Unitech Cyber Park, Durga Colony, Jharsa, Sector 39, Gurugram, Haryana - 122 022, Nearest Metro Station: Huda City Metro Station","location":"Gurgaon","experience":"0 - 1 Years"},{"date":"5, 6 - Sept - 2019","skills":"Core Java, JSP / Servlet, J2EE, Spring, Hibernate, Angular2/4/5 , Micro services","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Xpanxion International Private Limited, 4th Floor, Server Space, A. G Technology Park, Off ITI Road, Near Sarja Hotel, Aundh, Pune - 411 007.","phone":"020-40190500","profile":"Java Fullstack Developer \nXpanxion International Private Limited","description":"Technical Skills - Mandatory Strong understanding of Object Oriented Programming Strong skills in Core Java, JSP / Servlet, J2EE Must have experience in Spring, Hibernate, Angular2/4/5 , Micro services Strong in Jenkins, Maven/ any build tools. Strong Oracle/ MS SQL Server and database designing skills Experience Required: 3 - 8 Years Walk-in Date: 5th & 6th Septmeber '19 Timings: 10 am - 4 pm Interview Venue: Xpanxion International Private Limited 4th Floor, Server Space, A. G Technology Park, Off ITI Road, Near Sarja Hotel, Aundh, Pune - 411 007. Contact Person: Shweta Patil","location":"Chennai","experience":"3 - 8 Years"},{"date":"14 - Sept - 2019","skills":"Java / J2EE, Spring, Webservices, L3/L2 Support, Monitoring tools","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"GSPANN Technologies, 2rd floor, N Heights, Plot No. 38, Hitech City Phase II, Hyderabad, Telangana 500081","phone":"Not Provided","profile":"Java Production Engineer \nGSPANN Technologies Inc.","description":"Person should have 3+ years of working experience on Java/ J2EE development preferable on Java 1.8 with Good knowledge on Spring boot and MySQL. Experience with NoSQL databases is plus. Must have hands experience in developing/ supporting Microservices/ REST APIs Ready to work on enhancements and bug fixes on agile process Experience in any of the monitoring tools like Splunk, Apigee, Akamai, ND is preferred Walk-in Date/ Time: 14th September from 9 AM onwards Interview Venue: GSPANN Technologies, 2rd floor, N Heights, Plot No. 38, Hitech City Phase II, Hyderabad, Telangana 500081","location":"Hyderabad","experience":"3 - 8 Years"},{"date":"7 - Sept - 2019","skills":"Core Java Hibernate CSS Advanced Java JSP Servlets JDBC J2Ee","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Adjecti Solutions Private Limited, 123, Level-II, Tower-A The Corenthum Building A-41, Sector 62 Noida - 201301","phone":"0120-4089940","profile":"Software Trainees - Java/ J2ee \nAdjecti Solutions Private Limited","description":"Adjecti Solutions, an ISO & CMMI-III certified, fast paced growing IT company is looking for Java/ J2Ee Trainees in Advance Java Stream (Core Java, JSP Servlets, JDBC, Spring & Hibernate) which would be an exciting opportunity for B.E/ B.Tech/ MCA freshers who are pass outs of 2015, 2016, 2017 & 2018 batches to join as Software Trainees and grow as Programmers/ Architects. Candidates would have innumerable opportunities to work on various technologies viz-Java/J2Ee, Liferay, AEM, DXP to name few, with competitive wages and encouraging work-environment. Candidate Skills Level Technologies Required Remunerations Per Anum Level-I Core Java + HTML, CSS, Bootstrap Up to 1,00,000 LPA Level-II Core Java, JSP, Servlets + HTML, CSS, Bootstrap Up to 1,80,000 LPA Level-III Core Java, JSP, Servlets, Spring & Hibernate Frameworks + HTML, CSS, Bootstrap Up to 2,50,000 LPA Level-IV Core Java, JSP, Servlets, Spring & Hibernate Frameworks + HTML, CSS, Bootstrap + Angular Up to 3,00,000 LPA. Walk-in Date/ Time: 7th September , 10 AM onwards Interview Venue: Adjecti Solutions Private Limited 123, Level-II, Tower-A The Corenthum Building A-41, Sector 62 Noida - 201301 Office Landline 0120-4089940","location":"Noida","experience":"0 - 1 Years"},{"date":"7 - Sept - 2019","skills":"Java Fullstack/ React JS/ Spring boot Microservices/ Angular, Spring Boot/ Spring","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Capgemini India Private Limited, Campus 6B, Pritech Park, RMZ Ecospace, Bellandur BANGALORE - 37","phone":"9632078131","profile":"Java Developers \nCapgemini India Private Limited","description":"Capgemini India Private Limited is hiring Java Developers with 3 to 9 years of experience in Java Fullstack/ React JS/ Spring boot Microservices/ Angular, Spring Boot/ Spring/ Hibernate/ Core Java/ Rest / SOAP/ Webservices (any combination) Work Experience: 3 to 9 years Job Location: Bangalore Walk-in Date: 7th September 2019 (Saturday) Time: 10:00 AM to 3:00 PM Interview Venue: Capgemini India Private Limited Campus 6B, Pritech Park, RMZ Ecospace, Bellandur BANGALORE - 37 Spoc- Sonam Singh/ Priyanka Saha Call or message at-least before 1 hr reaching the premises- 9632078131","location":"Bangalore","experience":"3 - 9 Years"},{"date":"6 - Sept - 2019","skills":"Java 8 Platform, Microservices, Spring Cloud & Spring Boot","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Wipro Limited, PDC-2, Hinjewadi Phase - 2, Pune","phone":"Not Provided","profile":"Java Developers \nWipro Limited","description":"Candidates must have exceptional knowledge of the Java 8 Platform, especially in areas of concurrency, NIO, and collections. Understanding of Microservices based architecture and Domain Driven Design is an advantage especially using Spring Cloud & Spring Boot. Previous exposure to Service design, Messaging, Event Sourcing/ CQRS patterns and related technologies is required Hands on experience with scalable messaging systems like Akka / Kafka is desirable Hands-on experience with any of the Integration tools like Camel is preferred Experience with NOSQL databases (like MongoDB), cache implementation (like Redis or ehCache), Cloud implementation are very much desired. Strong design and development experience using popular Spring Middleware (like Spring Data, Batch, and Security) Must have hands-on experience with popular J2EE frameworks like Spring, Hibernate, etc. Candidates must be very comfortable using XML and related technologies. Work Experience: 3 to 8 Years Walk-in Date: 6th September 2019 - Friday Time : 10 AM to 3 PM Interview Venue: Wipro Limited, PDC-2, Hinjewadi Phase - 2, Pune Contact Person : Steffi D'cunha","location":"Pune","experience":"3 - 8 Years"},{"date":"7 - Sept - 2019","skills":"Java/ J2EE, Spring, Webservices (REST/ SOAP), Hibernate, Spring Boot, SQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Banca Sella S.p.A. Chennai Branch (IT Division) 4th Floor, Block 1, Cee Dee Yes Tyche Towers No. 2, MGR Nedunchalai (Perungudi Bye Pass Road) Kandhanchavadi, Chennai - 600 096","phone":"Not Provided","profile":"Java Developer \nBanca Sella S.P.A","description":"Candidate should have strong experience in following skill-sets. Java/ J2EE Spring Webservices (REST/ SOAP) Hibernate Spring Boot (Preferable) SQL Collection Framework, Exception Handling, Multithreading * Banking domain experience is preferable * Should be good in logical thinking * Must have good communication skills Interview Process : * Technical Discussion * Coding Test (Using Core Java) * Project Manager / HR Round Walk-in Date/ Time: 7th September 2019, 11 AM onwards Interview Venue: Banca Sella S.p.A. Chennai Branch (IT Division) 4th Floor, Block 1, Cee Dee Yes Tyche Towers No. 2, MGR Nedunchalai (Perungudi Bye Pass Road) Kandhanchavadi, Chennai - 600 096","location":"Chennai","experience":"2 - 7 Years"},{"date":"6 - Sept - 2019","skills":"Backend Operations, Policy Management, Claims Processing, Credit Control","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"AXA XL (Formerly Known as XL Catlin), 5th Floor, 2A Building, West Tower, Vrindavan Tech Village (Embassy Tech Village), SEZ Devarabeesanahalli, Varthur Hobli, Outer Ring Road, Bengaluru - 560 103","phone":"8042524554","profile":"Backend Operations Executive \nXL India Business Services Pvt. Limited","description":"University degree with minimum aggregate of 50%. Min. 1- 4 years of experience in BFSI or IT/ITES or insurance oriented roles. Must have excellent communication skills. Basic MS Excel skills. Ability to investigate, open-mind: Attention to details, analytical thinking skills, Ability to search for new solutions, proactive, team player. Walkin Interview on 6th September from 9 AM onwards Interview Venue: AXA XL (Formerly Known as XL Catlin) 5th Floor, 2A Building, West Tower, Vrindavan Tech Village (Embassy Tech Village), SEZ Devarabeesanahalli, Varthur Hobli, Outer Ring Road, Bengaluru - 560 103","location":"Bangalore","experience":"1 - 4 Years"},{"date":"7 - Sept - 2019","skills":"Core JAVA, Spring Boot","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"CBRE South Asia Pvt Limited | Digital Technology - India Gate No 4 , Level 1 , Unit 2A & 2B, Octave Block , Salarpuria Knowledge City Hyderabad, Telangana 500081","phone":"8143032004","profile":"Java Developer \nCBRE South Asia Private Limited","description":"CBRE South Asia Private Limited is looking for Sr. Software Engineer (Core JAVA, Spring Boot ) Years of Experience: 2-5 Years Work Location: Hyderabad Notice Period : Immediate 15 Days Required Skills: Solid programming experience with Below Skills Core Java Spring Spring Boot REST API Good to Have Skills: AWS Cloud Interview Date: 7th Sep 19 (Saturday) Time: 10 AM to 2 PM Interview Address: CBRE South Asia Pvt Limited | Digital Technology - India Gate No 4 , Level 1 , Unit 2A & 2B, Octave Block , Salarpuria Knowledge City Hyderabad, Telangana 500081 Kindly share references and updated CV on shanti.kumar@Cbre.com Contact No : 8143032004 / Whastapp :8019718573","location":"Hyderabad","experience":"2 - 6 Years"},{"date":"7 - Sept - 2019","skills":"Java/ J2EE, JDBC, SQL, Stored Procedures and related tools","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"TurningPoint Software Solutions Private Limited, No.31, Ground Floor, TBR Tower, 1st Cross, New Mission Road J.C. Road, Bangalore - 560 027","phone":"9739336661","profile":"Java Developers \nTurningPoint Software Solutions Pvt. Limited","description":"Candidate should have Bachelors degree or its equivalent in Computer Science, Information Technology, Engineering, or related technical field with 2 to 4 years of overall programming work experience, or any equivalent combination of education and experience. Two years of Core Java/ J2EE experience at the minimum. Good understanding of JDBC, SQL, Stored Procedures and related tools. Must have strong understanding of database design and structures. Ability to understand and construct complex database designs is required. Experience on industry standard frameworks like spring (or similar frameworks) and Hibernate Good analytical ability to breakdown problem statements into solutions Working knowledge of various development tools like IDEs (eclipse), source control systems (Subversion) Good written and verbal communication skills and the ability to follow verbal/written instructions Walk-in Date: 7th September 2019 Timings: 10 am to 3 pm Interview Venue: TurningPoint Software Solutions Private Limited No.31, Ground Floor, TBR Tower, 1st Cross, New Mission Road J.C. Road, Bangalore - 560 027","location":"Bangalore","experience":"2 - 4 Years"},{"date":"7 - Sept - 2019","skills":"Java/ J2EE, Spring, MVC/ Spring Boot, RESTFUL Services, MySQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Revature Consultancy Services Pvt. Limited, 434/203, TTK Road, Alwarpet, Chennai - 600 018","phone":"Not Provided","profile":"Java Full Stack Developer \nRevature Consultancy Services Pvt. Limited","description":"Candidate should have 2 to 4 years of experience in Java/ J2EE, Spring, MVC/ Spring Boot, RESTFUL Services, MySQL, Hibernate, HTML, JavaScript, CSS Nice to Have: JSF, Typscript, CI/CD and AWS Added Advantage: Micro-Services exposure, AngularJS/ Angular2+ No. of Openings: 5 Walk-in Date/ Time: 7th September , 10 AM onwards Interview Venue: Revature Consultancy Services Pvt. Limited 434/203, TTK Road, Alwarpet, Chennai - 600 018","location":"Chennai","experience":"2 - 4 Years"},{"date":"6 - Sept - 2019","skills":"Java Angularjs CSS jQuery Multithreading OOPS Html5 J2Ee","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"YAMAHA Motor Solutions India Pvt. Limited, (Gate No. 1) 19/6, Mathura Road, FARIDABAD, Haryana - 121 006 (Landmark: Opp. Escorts Mujesar Metro Station)","phone":"0129-4013957","profile":"Full Stack Java Developer \nYamaha Motor Solutions India Pvt. Limited","description":"Looking for Full Stack Java Developer with 2 to 4 years of experience. Strong in Core Java, Spring, Multithreading, Collections, OOPs concepts Good hands on experience on HTML5, jQuery, CSS3. Should have good exposure on web applications development. QUALIFICATIONS REQUIRED: B.Tech./ M.Tech./ MCA/ M.Sc. or equivalent (Regular) DESIGNATION: JAVA Developer (Software Engineer) DUTIES AND RESPONSIBILITIES: Responsible for coding, debugging and support of applications. Responsible for adhering to defined processes, timeliness & quality. Responsible for ensuring developed code is as per the design and business requirement. Open to work on Open Source Software/Products for POC/Projects Should be proactive and flexible to learn new programs and script languages. REQUIRED SKILLS: Good Knowledge of Webservices (REST) Good knowledge of relational databases (e.g. PostgreSQL, MySQL) Familiarity with Linux commands. Must have good understanding of JQuery, CSS3, HTML5, Node.js, angular 5 Experience with Tomcat, WildFly. Ability to work independently and within team. Excellent analytical and Problem-solving skills, combined with the ability to provide quick resolutions to the issues/problem. Strong written and verbal skills WALK-IN Details: Date: 6 September 2019 (Friday) Time in between: 10 AM - 12 PM Address: YAMAHA Motor Solutions India Pvt. Ltd. (Gate No. 1) 19/6, Mathura Road, FARIDABAD, Haryana - 121 006 (Landmark: Opp. Escorts Mujesar Metro Station) Contact Person: Ms. Anu Contact No: 0129-4013957 Mandates - You need to carry your updated resume & pen. Do not carry pendrive, laptop etc.","location":"Faridabad","experience":"2 - 4 Years"},{"date":"10 - Sept - 2019","skills":"AngularJS 4, JavaScript and HTML5","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Resbird Technologies Private Limited, Vatika Triangle, Ground floor Behind DT City Centre Mall Sushant Lok Phase-1 Gurgaon, Haryana. Nearest Metro Station- MG Road Gate No. 1","phone":"011-41336647","profile":"Angular Developer \nResbird Technologies Pvt. Limited","description":"Education Qualifications: B.Tech/ BE/ BCA/ MCA/ M.Tech (full time), or any equivalent degree Diploma holders. Work Experience: Minimum 2 years of relevant experience is required. Skills & Qualifications: Proficiency with JavaScript and HTML5 Professional, precise communication skills Deep knowledge of AngularJS 4 and above practices and commonly used modules based on extensive work experience Professional Skills: Strong creative, organizational, problem solving and time-management skills. Excellent interpersonal and communication skills. Work well with tight deadlines in a team environment. Proactive and innovative. Remains calm under pressure and not easily overwhelmed by multiple tasks. Walk-in Date: 10th September 2019 Time: 10 AM to 4 PM Interview Venue: Resbird Technologies Private Limited Vatika Triangle, Ground floor Behind DT City Centre Mall Sushant Lok Phase-1 Gurgaon, Haryana. Nearest Metro Station- MG Road Gate No. 1 Documents required at Venue: 10th proof (Either Mark sheet or Certificate any one). Highest Education Proof (Either Mark sheet or Certificate or Degree- any one). Pan Card Copy. Aadhaar Card. KYC Proof copy from UAN portal. Passport copy and Voter ID-card. Appointment and Experience Letter from Current Company. Last 3 months salary slip. Experience Letter from All Previous Companies","location":"Gurgaon","experience":"2 - 3 Years"},{"date":"7 - Sept - 2019","skills":"Technical Support, Application Support, Windows Administration, Networking Skills","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Altran Technologies India Private Limited, Unitech Infospace SEZ, Tikri, Sohna Road, Sector 48, Tower 5 , Ground Floor Gurgaon, Haryana - 122 018","phone":"Not Provided","profile":"Technical Support/ Linux Administrator \nAltran Technologies India Private Limited","description":"Candidate should have minimum 2 to 3 years of relevant experience. Possess hands on experience or good knowledge on any of the Linux flavour (Solaris/ Linux) Networking skills- Basic internetworking knowledge. CCNA certification will be an added advantage. Basic windows administration knowledge Prior NMS application support and VMware knowledge will be an added advantage Basic scripting knowledge (Shell, Perl, Python, etc.) Excellent communication skills (Verbal and written) Education - Bachelors and above Preferred Certifications- RHCSA, RHCE & CCNA Technical Support Engineer will be the primary point of contact for all assigned Accounts/ Products/ Tools. Diagnose and fix known technical problems for the given set of tools/products supported for the region or accounts. Communicate with customer Point-of-Contact/Partner as well as Cisco internal engineers. Need to be flexible to work on other platforms than their area of expertise, open to learn new technologies. Flexible Skill set - Engineer (Linux + Networking) Eligible candidates can appear for the selection process at following mentioned venue : Interview Date : 7th September 2019 (Saturday) Timings : 10 A.M - 2 P.M Venue Details- Altran Technologies India Private Limited Unitech Infospace SEZ, Tikri, Sohna Road, Sector 48, Tower 5 , Ground Floor Gurgaon, Haryana - 122 018 Contact Person : Rohit Bhat Contact No :- 7889971614","location":"Gurgaon","experience":"2 - 3 Years"},{"date":"7 - Sept - 2019","skills":"Technical Support, Voice Process, Customer Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Cognizant Technology Solutions India Limited, 2nd Floor, Building No 9, Mindspace, Opposite Airoli Station, Airoli East, Mumbai - 400 708","phone":"Not Provided","profile":"Technical Support (Voice Process) \nCognizant Technology Solutions India Limited","description":"We are looking for enthusiastic professionals for International Voice Process who possess flawless communication and expertise in Technical skills. If you have excellent customer handling skills, are tech-savvy, love learning and implementing new technology, with the passion to guide to customers, we'd love to talk to you. Education : Any Graduate (Under Graduates are also Eligible) Work Experience : 1 to 3 Years Job Location : Pune Mandatory Experience - Minimum 1 year experience in an International BPO. Experience in Voice/Semi Voice process. Expertise in Technical Skills. Desirable Experience- Experience in International Calling Experience in Technical Support domain Experience in Salesforce, CRM Excellent Customer handling skills Responsibilities : Ability to understand customer issue and route to appropriate team Ticket Creation/ Categorization/ Prioritization Incident resolution and recovery Ensure on meeting daily KPIs Receiving and making end user calls Provide first level resolutions Ticket escalation to respective Support Group Mode of Interview : Face to Face Interview Date : 7th September 2019 (Saturday) Interview time : 11 AM - 2 PM Interview Location: Cognizant Technology Solutions India Limited 2nd Floor, Building No 9, Mindspace, Opposite Airoli Station, Airoli East, Mumbai - 400 708","location":"Pune","experience":"1 - 3 Years"},{"date":"6, 7 - Sept - 2019","skills":"ASP .Net, C#, SQL Server 2008, Javascript, JQuery, Reporting Services","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"FULL Creative Private Limited, Ascendas Tech Park, Pinnacle Building - Phase I, 4th Floor, CSIR Road, Taramani, Chennai.","phone":"42666652","profile":"Software Engineer - Java \nFULL Creative Private Limited","description":"Excellent programming skills in Java Script & Core Java Write well designed & efficient codes. Ensure the designs are in compliance with specifications Should build an interface with the customers, management & the team. Knowledge of version control systems like GIT & TDD. Should have experience in Amazon-AWS /Google Cloud Good Communication Skills. Walk-in Date/ Time: 6th - 7th September , 10 AM onwards Interview Venue: FULL Creative Private Limited Ascendas Tech Park, Pinnacle Building - Phase I, 4th Floor, CSIR Road, Taramani, Chennai.","location":"Chennai","experience":"1 - 4 Years"},{"date":"7 - Sept - 2019","skills":"Technical Helpdesk, Service desk, Inbound calls, Technical Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Locuz Enterprise Solutions Limited, #401, 4th Floor, Krishe Sapphire, Main Road, Madhapur, Hyderabad - 500081","phone":"040-45004607","profile":"Technical Service/ IT Helpdesk \nLocuz Enterprise Solutions Limited","description":"We are looking for enthusiastic professionals who possess flawless communication and expertise in Technical skills. If you have excellent customer handling skills, are tech-savvy, love learning and implementing new technology, with the passion to guide to customers, we'd love to talk to you. Designation : Technical Service Desk Shift : 24/7 Shift (Rotational Shifts) Work Experience : 1 - 4 years Job Responsibilities: Ability to understand customer issue and route to appropriate team Ticket Creation/ Categorization/ Prioritization Incident resolution and recovery Ensure on meeting daily KPIs Receiving and making end user calls Provide first level resolutions Ticket escalation to respective Support Group Desirable Experience- Experience in International Calling Experience in Technical Support domain Excellent Customer handling skills Mode of Interview : Face to Face Walk-in Date : 7th September 2019 (Saturday) Interview time : 10:00 AM 4:00 PM Interview Venue: Locuz Enterprise Solutions Limited #401, 4th Floor, Krishe Sapphire, Main Road, Madhapur, Hyderabad - 500081 Landmark: Opposite Durgam Metro Station Point of Contact: Gopi (HR) Desk # 040-45004607 Note : Candidates with excellent communication are only applicable for this process Only candidates interested to work in International Voice Process and willing to work in night shifts are eligible for this process Referrals are invited","location":"Hyderabad","experience":"1 - 4 Years"},{"date":"7 - Sept - 2019","skills":"Java Servlets, JSP JSP Tag Libraries Spring 3.0, RDBMS","qualification":"B.E./B.Tech, MCA/PGDCA","address":"SmarTek21 Private Limited, IT - 05, Ground Floor, Qubix SEZ Plot #2, Blue Ridge Township, Near Rajiv Gandhi Infotech Park, Phase I, Hinjewadi, Pune - 411 057","phone":"Not Provided","profile":"Java Developer \nSmarTek21 Private Limited","description":"Candidate should be BE, B.Tech, MCA, M.Sc with 3 to 5 years of industry experience in Java with solid understanding of object-oriented programming. Must have good experience in JSP/ Servlets development & Frontend development. Good Experience in Core Java, J2EE and Spring Framework Good experience in any RDBMS database like Oracle, MySql etc. Very good working experience in JSP tag libraries Experience with any one of the Source controls like SVN, Git, TFS etc Experience in Continous Integration tools like Jenkins/Go Primary Technical Skills : Java Servlets & JSP JSP Tag Libraries Spring 3.0 RDBMS (Oracle or MSSQL or MySQL) Ant/ Maven/ Gradle Junit JMockit Jenkins Any Scripting language - JavaScript or jQuery or Backbone.js Secondary Technical Skills : Web services (RESTful & SOAP) Apache CXF, Axis, Jersy or any other Webservices framework Walk-in Date/ Time: 7th September 2019, 10 AM onwards Interview Venue: SmarTek21 Private Limited IT - 05, Ground Floor, Qubix SEZ Plot #2, Blue Ridge Township, Near Rajiv Gandhi Infotech Park, Phase I, Hinjewadi, Pune - 411 057","location":"Pune","experience":"3 - 5 Years"},{"date":"9, 10 - Sept - 2019","skills":"Software Troubleshooting, Technical Support, Windows Troubleshooting","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Ample Technologies Private Limited, 4th Floor, NCC Windsor, Opposite Flying Club, International Airport Road, Jakkur, Bengaluru - 560 064","phone":"Not Provided","profile":"Technical Support Engineer \nAmple Technologies Private Limited","description":"We are looking for on-site engineers for Bangalore and Hyderabad location who can join immediately. Job Responsibility- Handling customer queries/ issues related to the product through Onsite support. Installing & troubleshooting hardware & software systems. Manually setup computer and hardware, install software programs of user, troubleshoot or restore or setup. Test functionality and assess, solve problems by operating system or related. Timely and professionally handle field service calls and issues arising from field service visits. Develop Service Technical documentation. Greeting and attending customers. If interested, please send your resume at akanksha.prasad@ample.co.in or walk-in in the below given address for interview and meet Akanksha Date: 9th - 10th September 2019, Timings: 10 AM onwards Interview Venue: Ample Technologies Private Limited 4th Floor, NCC Windsor, Opposite Flying Club, International Airport Road, Jakkur, Bengaluru - 560 064","location":"Bangalore","experience":"1 - 4 Years"},{"date":"6, 7, 9, 10, 11, 12, 13, 14, 16, 17, 18, 19, 20 - Sept - 2019","skills":"Customer Service, Technical Support, Problem Solving Skills","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Amazon Development Centre (India) Pvt. Limited, 6th Floor, Tower 1, Laxmi Infobahn Pvt. Limited. SEZ, Survey No. 107 (p), kokapet, Village, Gandipet Mandal, Ranga Reddy, District Hyderabad - 500 032","phone":"9818176604","profile":"Customer Support Associate \nAmazon Development Centre (India) Pvt. Limited","description":"Work from home for the largest e-commerce company as a Customer Service Associate. Amazon CS is hiring in The City of Pearls Hyderabad and we are looking for aspirants who wants to build their career while working for the global leader. Eligibility Criteria -Minimum qualification required 10+2 -Excellent written and Verbal communication, comprehension and problem solving skills. -Willing to work in a 24x7 environment. -24 hour Power Back-up and Internet Connection of up to 48 Mbps is required Additional Benefits: -Monthly Internet Reimbursement (after submission of bill) up to INR 1250/- -Zeta Meal Card INR 1100 Per month i.e. 13,200/- PA -Night Shift Allowance INR 115/Night -Overtime Allowance as per company policy -Laptop provided by the company -Five days working -Rotational Shifts -Each employee and their dependents (Spouse and 2 Children) are covered up to Rs.500,000 under the floater benefit scheme Walk-in Dates: 4th to 20th September, 2019 Time: 10:00 AM to 2:00 PM Interview Venue : Amazon Development Centre (India) Pvt. Limited 6th Floor, Tower 1, Laxmi Infobahn Pvt. Limited. SEZ, Survey No. 107 (p), kokapet, Village, Gandipet Mandal, Ranga Reddy, District Hyderabad - 500 032 Contact Person: Vivin Davis Documents Required -Updated Resume. -1 passport size Photograph. -Valid Government ID Proof (Aadhar Card and PAN Card) Limited Time Opportunity. Hiring is on only for 12 days For Job related queries, kindly contact, Abhay Saxena Contact No. : +91-9818176604 / +91-7011328383 Email : saxeabha@amazon.com Please write my name 'HR Abhay' as your source on top your resume and other registrations. Please Note -Candidates who have applied in the last 3 months are not eligible. -Candidates currently pursuing any regular course of education will not be considered.","location":"Hyderabad","experience":"0 - 5 Years"},{"date":"6, 7 - Sept - 2019","skills":"Technical Support, SQL Server, Server Administration","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"HCL Technologies Limited, A-22, Sector 60, Noida (Near Noida Sector 59 Metro Station)","phone":"8586077296","profile":"Product Support Engineer \nHCL Technologies Limited","description":"HCL BSERV is hiring for PLSQL- Engineer Product Support with good technical knowledge and command over spoken English language the client is a prestigious US based Healthcare Equipment manufacturing organization. Candidates who can join HCL immediately should only appear for interview Candidates who only have experience in MySQL/ SQL should not appear for the interview Candidates should have working knowledge experience in PLSQL language. Good communication and interpersonal skills Shift US shift (Mandatory) Experience: 1 to 4 Years (Minimum 1-year experience in PLSQL development mandatory) Job Location : Noida Job Profile : It included providing B2B support on PLSQL to the client and calling as well . Candidate must be comfortable working in 24*7 rotational shifts/ Rotational Week offs Outstanding English Communication is Must. Please come down for a face to face Interview Interview Rounds Includes: 1. HR Assessment 2. Versant Test (To check Communication Skills) 3. Operations/ Technical Round (To check PLSQL proficiency) Please write HR Jyoti Gupta on the top of your resume Interview Date 6th & 7th September, 2019 Timings 11:00 am 5:00 pm Interview Venue: HCL Technologies Limited, A-22, Sector 60, Noida (Near Noida Sector 59 Metro Station) Contact Person Jyoti Gupta (8586077296) Kindly carry 1.A copy of your updated resume 2.A govt. address/Id proof","location":"Noida","experience":"1 - 4 Years"},{"date":"6 - Sept - 2019","skills":"Networking, Maintenance Planning, Technical Support, Service Desk, Incident Management, Software Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Attra Infotech Private Limited, Quasitum (Next to Fidelity) EC2 Gateway Campus, Silicon Town, Electronic City II, Bengaluru - 560 100","phone":"08197562649","profile":"Technical Support/ Service Desk (L1) \nAttra Infotech Private Limited","description":"Candidate must have basic knowledge in IT Service Management (ITSM) Incident Management, Change Management. Knowledge in Computers, Networking, OS Platforms etc. The position is open for both Male and Female candidates. Crisp Communication Skills (Able to Comprehend User Issues and Articulate Solutions, Effective Listening Skills, Maintain tone and voice) Impressive documentation skills Follow Ticket Templates, Create Basic Reports (conversant with MS Office) Real-time Monitoring of Transaction, Performance, Job/Batch Runs - Acknowledgement and perform L1 action Triage of the issue before assigning to Tier 2/Tier 3 team 100% Adherence to Escalation Matrix if alert turns into an incident and ensure collaboration Proactively Liaising with vendors regarding the planned maintenance & communicate the impact to the stakeholders Service Now or other ticketing platform exposure is desired Participation in all outages - laid out Incident Management process needs to be followed [help in Post Incident Report preparation with timelines if reqd. , SER drafts , CNs sent real-time, checking with users about issue resolution] Ensure adherence and enforcement of information security standards Adhere to the rules and regulations defined in people practice handbook Adhoc assignment of tasks additional to job role is to be performed accurately and in a time bound manner Mentoring junior resources, quick learning capability Able to deal with ambiguity Interested applicants are requested to walk-in anytime between 9 am to 5 pm on 6th September 2019 at the below mentioned venue: Attra Infotech Private Limited Quasitum (Next to Fidelity) EC2 Gateway Campus, Silicon Town, Electronic City II, Bengaluru - 560 100 Contact Person: Dominic Savio - 08197562649 We would really appreciate if you could pass on this information to the right candidates who might fit this requirement. Regards Dominic Savio Sr Executive; Talent Acquisition| Niche Banking, Cards & Payment Specialist| Email: dominic.savio@attra.com.au","location":"Bangalore","experience":"0 - 2 Years"},{"date":"4, 5, 6, 7 - Sept - 2019","skills":".Net, C# .NET, ASP .NET , MVC 3.0/4.0, SQL Database Server","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Logicsoft International Private Limited, 464, Udyog Vihar, Phase 5, GURGAON, Haryana - 122 016","phone":"Not Provided","profile":"ASP .Net Developer \nLogicsoft International Private Limited","description":"We urgently required Asp.Net Developer, who has strong Asp.net technical skills. If you are interested please come for interview on mentioned date and time. Candidate should have 6 months to 2 years of working experience in Asp.net technologies with MVC. Must have hands on coding in C# .NET, ASP .NET , MVC 3.0/4.0 Must have working knowledge on Entity Framework Must have working knowledge on Web services and WCF Must have working knowledge on JQuery, HTML, DHTML and Java Script Must have knowledge on SQL Database Server Working experience with source controls i.e. VSS, TFS or SVN Should be a Team Player as well as Individual Contributor Should have worked atleast in 2 to 4 live projects Proven understanding of the SDLC We need candidate who can join in 15 to 20 days. Walk-in Date - 4th to 7th September 2019 Time - 10:30 am to 4:00 pm Interview Venue: Logicsoft International Private Limited, 464, Udyog Vihar, Phase 5, GURGAON, Haryana - 122 016","location":"Gurgaon","experience":"0 - 2 Years"},{"date":"5 - Sept - 2019","skills":"Software Testing, ADA Testing, Functional Testing","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Infosys BPM Limited, 4th Floor, South Wing C Block, Tidel Park, 4th Floor Rajiv Gandhi Salai, Taramani, Chennai - 600 113","phone":"Not Provided","profile":"Software Testing Engineer \nInfosys BPM Limited","description":"Infosys BPM Limited, is hiring for ADA Testing (Functional Testing) and PMO role in Chennai on 5th September, 2019 Educational Qualification: Any full time Graduation Experience Required: Min 2 years Relevant Experience Job location: Chennai Shift: Rotational Shifts ADA Testing (Functional Testing) Minimum 3 years of experience in Accessibility Testing (American Disability act testing) Hands on experience in using any of the market tools such as NVDA, JAWS or any other tools used for ADA testing and worked on projects to sign off the same for ADA compliance Good hold on the guidelines to test for ADA as per the WACG 2.0 /2.1 standards Should have strong Analytical abilities, Technical and Communication skills Job Responsibilities: Update existing tests/Create new tests in the automation test suite for ADA testing. Write test planning documentation from requirements specifications. Review all testing documents and other test-related documentation. Assist in implementation of the overall testing strategy. Ensure that quality standards are adhered to during the development of products. Add new tests and expand the automation test suite. Collect and create test data for functional and non-functional testing. Run functional and non-functional tests. Liaise with developers during the Software Development Life Cycle (SDLC). Provide estimates for test activities. Walk-in Date: 5th September, 2019 Time: 9 AM to 11 AM Interview Venue: Infosys BPM Limited, 4th Floor, South Wing C Block, Tidel Park, 4th Floor Rajiv Gandhi Salai, Taramani, Chennai - 600 113 Contact Person: Mohamed Ibrahim Mention: (DS Rituparna) before submitting your CV Kindly refer your friends/ colleagues to walk in if their profile matches the requirement.","location":"Chennai","experience":"2 - 5 Years"},{"date":"4, 5, 6, 7 - Sept - 2019","skills":"Asp .Net, C#, Jquery, WCF, Webservices/ Web Api & SQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Karvy Fintech Private Limited, Karvy Selenium, Tower- B, Plot No 31 & 32, Financial district, Nanakramguda, Serilingampally Mandal, Hyderabad - 500 032","phone":"Not Provided","profile":".Net Developers - Fulltime \nKarvy Fintech Private Limited","description":"Minimum 3 to 5 years of hands-on development experience with the following technologies: ASP.NET/VB.NET projects, Web services and SQL server. Hands on experience in design using object oriented programming principles. Extensive experience in developing N-tier applications. Good experience with reporting tools. Mandatory Skills required for a different positions- 1. Asp .Net, C#, Jquery, WCF, Webservices/ Web Api & SQL 2. Asp & C#. 3. MVC, WebServices & Jquery, Mode of Interview : Face to Face Discussion Walk-in Date: 4th - 7th September 2019 Time Slot: Between 10:00 am -3:00 pm Interview Venue: Karvy Fintech Private Limited Karvy Selenium, Tower- B, Plot No 31 & 32, Financial district, Nanakramguda, Serilingampally Mandal, Hyderabad - 500 032 Contact Person : Kalyan (HR Team)","location":"Hyderabad","experience":"3 - 5 Years"},{"date":"5, 6 - Sept - 2019","skills":"Software Testing, Test Automation, Selenium, Java, SQL","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Infostretch Corporation (India) Private Limited, AWFIS Solutions, Level 6, N Heights, Plot No 38, Phase 2, Siddiq Nagar, Hitech City, Hyderabad, Telangana - 500 081","phone":"9100481628","profile":"Software Testing Engineer \nInfostretch Corporation (India) Pvt. Limited","description":"A Bachelor degree in Computer Science or related field with 4 to 10 years of experience in IT with expertise on Test Automation and Java Stack, with minimum 3 years of relevant experience in Selenium and Java. Very good communication and interpersonal skills. Strong collaboration skills, work hand in hand with development during all stages of application life cycle. Working experience in Test Automation, Selenium, Java, SQL, Continuous Integration tools like Jenkins and Build tools like Maven or Ant. Exposure in working with Unit test frameworks like Junit, TestNG or similar frameworks. Good Understanding of framework design and concepts. Participate in project design meetings. Exposure to Debugging skills with Java. Job location: - Bangalore /Hyderabad Note: There might be a shift of 1:30 Pm to 10:30 Pm depending on the project for which Cab facilities would be provided. Automation Skills: Develop, Review, Execute the Automation Scripts developed using Selenium, Java and Test NG. Need to have a good experience in Database testing. And working experience in Agile methodology, Devops exposure (preferably) is a value add using Jenkins, Ant etc. Secondary Skills: Experience in scripting languages, synthetic test data creation is a plus. Experience in framework designing and customization is a plus. If interested and the opening is suitable for you please walk in to the below address between 11:00 AM to 4:00 PM. Infostretch Corporation (India) Private Limited AWFIS Solutions, Level 6, N Heights, Plot No 38, Phase 2, Siddiq Nagar, Hitech City, Hyderabad, Telangana - 500 081 Contact Person: Shreesha","location":"Hyderabad","experience":"4 - 10 Years"},{"date":"7 - Sept - 2019","skills":"ASP .Net MVC, SQ, Design Patterns","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"ITC Infotech India Limited, No. 18, Gate, 1 & 2, Dodda Banaswadi Main Road, Maruthi Sevanagar, Bengaluru, Karnataka 560005","phone":"Not Specified","profile":"Senior .Net Developer \nITC Infotech India Limited","description":"Educational Qualification: Bachelors / Masters degree in Computer Science / Information Systems Desired Experience: Total experience of 4+ years with 3+ years of development experience in .Net Required Skills: Good programming skill in ASP .Net MVC Good programming skill in SQL. Expertise in usage of .Net design patterns Should have exposure in design and architecture of applications. Should be able work independently with minimal guidance. Job Responsibility: Developing quality code and provides technical guidance to the team Collaborates and adds value through participation in peer code reviews, providing comments and suggestions Works collaboratively and professionally with other associates in cross functional teams to achieve goals Apply a sense of urgency, commitment and focus on the right priorities in developing solutions in a timely fashion Walk-in Date/ Time: 7th September from 10 AM onwards Interview Venue: ITC Infotech India Limited No. 18, Gate, 1 & 2, Dodda Banaswadi Main Road, Maruthi Sevanagar, Bengaluru, Karnataka 560005 Buliding Name: Tripti 'B' Block Contact Person : Mujeeba Pakcliwal","location":"Bangalore","experience":"4 - 7 Years"},{"date":"5, 6, 7 - Sept - 2019","skills":"Software Testing, Defect Tracking HTML, Manual Testing, JMeter, Functional Testing, Integration Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Logicsoft International Private Limited, 464, 2nd Floor, Udyog Vihar- Phase 5, GURGAON, Haryana - 122 016","phone":"4284779","profile":"Quality Analyst/ Software Tester \nLogicsoft International Private Limited","description":"We urgently required Software Quality Analyst, who has strong Manual and Automation Testing skills. If you are interested please come for interview on mentioned date and time. Jobs & Responsibilities: Able to create test cases based on requirement, functional testing, integration testing Experience in supporting all test phases of the project life - cycle Meeting with system users to understand the scope of projects Working with software developers and project support teams Identifying business requirements Monitoring applications and software systems Must have skills: Must have strong technical, analytical and problem solving skills; familiarity with HTML, JavaScript, SQL Experience in using Defect tracking system such Should have worked in Agile environment Experience in Automation testing like Selenium, JMeter will be advantage. Experience in Security, Load and Performance testing using automation tools is a Plus Experience in Mobile App Testing Must have experience in manual testing We need candidate who can join in 15 to 20 days. Experience Required: 1 to 2 Years Good Salary Package. Walk-in Date - 5th to 7th September 2019 Time - 10:30 am to 4:00 pm Interview Venue: Logicsoft International Private Limited 464, 2nd Floor, Udyog Vihar- Phase 5, GURGAON, Haryana - 122 016","location":"Gurgaon","experience":"1 - 2 Years"},{"date":"7 - Sept - 2019","skills":"ISTQB, Embedded Testing Life Cycle, Test Reporting, Software Testing, Test Case Design, Functional Testing","qualification":"B.E./B.Tech","address":"Cyient Limited, Plot No. 2, IT Park, Nanakramguda, Manikonda, Hyderabad - 500 032.","phone":"040-67489921","profile":"Embedded Testing Engineer \nCyient Limited","description":"Qualification: BE/ B.Tech (Electronics/ Computers) Years of Experience: 1 to 6 Years Job Location: Hyderabad Good understanding of complete Software Test life cycle for software in real time embedded control, communication and information systems. Should able to understand system/software requirements for software testing. Create Test specification from requirements, execute testing and create test reports. Experience for creating test case as per standard Test case design techniques. Experience of integration & rig-based functional testing involving both software only and software/hardware integration configurations. Knowledge of simulation test environments. Basic knowledge on C or similar programming language Good understating of real time system, data communication e.g. serial RS232/485 and TCP/IP. ISTQB foundation level certification. IBM Rational tool like DOORS, ClearCase/ ClearQuest or similar Requirements management tool knowledge. Good written/oral communication skills. Walk in Date: 7th September (Saturday) Time: 10.00 AM - 12.00 PM Interview Venue: Cyient Limited, Plot No. 2, IT Park, Nanakramguda, Manikonda, Hyderabad - 500 032. Landmark: Near Continental Hospital Contact Person : Manohar Burri (040-67489921)","location":"Hyderabad","experience":"1 - 6 Years"},{"date":"7 - Sept - 2019","skills":"Test Automation, Selenium Web Driver, Automation Tools, Junit and TestNG framework, Rest, Web Services & API Testin","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"QA Infotech Private Limited, A- 8, Sector- 68 Noida","phone":"0120-6101814","profile":"Automation Testing Engineer \nPerseverance IT Solutions Private Limited","description":"Candidate must have good knowledge of automation frameworks with proven experience in Test Automation. Experience in Selenium WebDriver automation tool. Knowledge of Java programming language is a must. Experience in working on Junit and TestNG framework, Rest web services & API Testing. Extensive testing experience with Web Based Application. Knowledge of standard QA processes, test plans, test case design, test case management, Defect management and reporting. Walk-in Date: 7th September 2019 (Saturday) Timings : 9:00 AM to 10:00 AM Interview Venue QA Infotech Private Limited A- 8, Sector- 68 Noida Contact Person : Ruby Diwakar Please register for the recruitment drive through this given link: https://bit.ly/2lXhH8b Please Note: Late comers and unregistered candidates will not be entertained.","location":"Noida","experience":"2 - 7 Years"},{"date":"7 - Sept - 2019","skills":".Net, ASP .Net, C#, C++, Web Technologies","qualification":"B.Sc, BCA/BCS, MCA/PGDCA","address":"Jay Ushin Limited, GP-14, HSIDC INDL. Estate, Sector-18, Gurgaon - 122 001. Landmark- PASCO Backside","phone":"0124-4623400","profile":"ASP .Net Developer \nJay Ushin Limited","description":"Candidate should have 1 to 4 years of experience in .Net, ASP .Net, C#, C++, Web Technologies. Involved in development of the application in ASP .NET Web form 4. Job Responsbility- Developing various Stored Procedures for the data retrieval from the database and generating different types of reports. Implementing client side validations at Controller level. Walk-in Date/ Time: 7th September , 10 AM onwards Interview Venue: Jay Ushin Limited, GP-14, HSIDC INDL. Estate, Sector-18, Gurgaon - 122 001 Landmark- PASCO Backside","location":"Gurgaon","experience":"1 - 4 Years"},{"date":"4, 5, 6, 7 - Sept - 2019","skills":".Net 4.0+, ASP.Net, MVC, Web API, Angular, HTML5, CSS, Bootstrap, JavaScript, MS SQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Rideau Technology Services India Pvt. Limited, No. 212, CELSTIC TOWER Green Glen Layout, Bellandur, Bangalore - 560 103","phone":"Not Specified","profile":"Software Developer (.Net) \nRideau Technology Services India Pvt. Limited","description":"Looking for a self-motivated individual looking for a challenging career by delivering enterprise class software. You will be working in a SCRUM development environment where all team members share responsibility of design, development, test planning, test execution and documentation of the product. Candidate should have overall 3 to 8 Years of software development experience in a product-based company involving in complete product development particularly using SCRUM Methodology. Experience in product development using Microsoft.Net technologies and Angular. Key Skills: Expert knowledge of .Net 4.0+, ASP.Net, MVC, Web API, Angular, HTML5, CSS, Bootstrap, JavaScript, MS SQL Excellent Web-Based application development using c#, ASP.NET with MVC Strong knowledge in RDBMS and SQL Server Good knowledge in Source Control Management using GIT Responsibilities: Design, code, test and manage various applications Collaborate with engineering team and product team to establish best products Follow outlined standards of quality related to code and systems Design & Develop the application as per functional and system requirements Work closely with the product owners and remote teams for understanding functional and system requirements. Participate in testing process through unit testing and bug fixes. Walk-in Date/ Time: 4th - 7th September , 12 PM onwards Interview Venue: Rideau Technology Services India Pvt. Limited No. 212, CELSTIC TOWER Green Glen Layout, Bellandur, Bangalore - 560 103 Landmark: 4th floor of the same building of M K Express.","location":"Bangalore","experience":"3 - 8 Years"},{"date":"7 - Sept - 2019","skills":"sql Azure microsoft Azure, networking vs","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Sonata Software Limited, No.1-10-176, Begumpet Main Road, Opp Hyd Public School, Hyderabad-500016","phone":"040-2778 2000","profile":"Software Developer - Azure/ .Net \nSonata Software Limited","description":"Work Experience: 3 to 10 Years Job Location: Hyderabad. Shift: Rotational Shift TECHNICAL SKILLS (Preferred/ Optional) Understanding of cloud vs. on premise computing. Solid understanding of fundamentals of cloud computing. Technical understanding of the Azure Platform and architecture A strong knowledge of the Microsoft Windows platform Familiarity with networking concepts including VIPs, NAT, DNS .NET 3.0/3.5/4.0. Visual Studio Languages (VB, C/C#/C++) SQL Azure / SQL Server Distributed application architecture Application Lifecycle Management (ALM) Service Oriented Architectures (SOA). Familiarity with load balancing, geo-redundancy, CDN and VPN technologies preferred Familiarity with Virtualization concepts and virtual system administration Familiarity with Hyper-V configuration and administration Good in prioritization, time management, and has excellent follow through skills SOFT SKILLS Must be able to quickly develop trust and rapport with customers (most of the time they are of this profile: Enterprise Architects, CxO's, Development & Test Management, IT Directors) Passion for customer advocacy in technology domain. Strong communications skills in spoken and written English Walk-in Date/ Time: 7th September , 9 AM onwards Interview Venue: Sonata Software Limited No.1-10-176, Begumpet Main Road, Opp Hyd Public School, Hyderabad-500016 Tel: 040-2778 2000/ 15/ 16/ 170","location":"Bangalore","experience":"3 - 10 Years"},{"date":"7 - Sept - 2019","skills":".Net & T-SQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Altruista Health Services Private Limited, Flat No. 13, Tower 1,Gar Laxmi Infobhan, Sy No. 107 Kokapet Village, Rajendra Nagar, Hyderabad Landmark: Opposite to Babu Khan Arena","phone":"Not Provided","profile":".Net/ SQL Developer \nAltruista Health Services Private Limited","description":"Altruista Health, a pioneer product development company in US Health Care domain is looking for candidates with overall experience of 3 -5 years in Microsoft Technologies. As a software engineer, you will be working with a team of developers and business analysts to develop new products /enhance existing systems in place. To be successful in this role, one must demonstrate their knowledge of critical thinking and problem solving. Please find the Job description in detail given below Position: Software Engineer Experience Required: 3- 5 years in Dot Net & T-SQL Job Location: Hyderabad. Roles and Responsibilities include: Develop workable software as per given requirements and technical specifications Develop user interfaces, databases and client displays. Design, initiate and handle technical designs and develop complex application features. Quickly produce well-organized, optimized and documented source code as per set guidelines. Debug existing source code and polish feature sets. Contribute to technical design documentation. Build and execute unit test cases to ensure quality of code. Test the product in controlled, real situations before going live. Walk-in Date/ Time: 7th September 2019, 9 AM onwards Interview Venue: Altruista Health Services Private Limited Flat No. 13, Tower 1,Gar Laxmi Infobhan, Sy No. 107 Kokapet Village, Rajendra Nagar, Hyderabad Landmark: Opposite to Babu Khan Arena","location":"Hyderabad","experience":"3 - 5 Years"},{"date":"6, 7 - Sept - 2019","skills":"Software Testing, Test Engineering, Automation Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"ICON Clinical Research India Private Limited, Chennai ONE IT Park, North Block - Floor 4, Pallavaram, Thoraipakkam 200 Feet Road, Chennai - 600 097","phone":"Not Provided","profile":"Software Testing Engineer \nICON Clinical Research India Pvt. Limited","description":"ICON Clinical Research is hiring for Automation Test Engineers for Chennai location Position: Automation Test Engineers 5 to 8 years of experience in Automation Testing Web & Windows Testers preferred We have scheduled a Walk-in drive on 6th & 7th September 2019, between 10 am to 4 pm IST. Interview Venue: ICON Clinical Research India Private Limited Chennai ONE IT Park, North Block - Floor 4, Pallavaram, Thoraipakkam 200 Feet Road, Chennai - 600 097","location":"Chennai","experience":"5 - 8 Years"},{"date":"3, 4, 5 - Sept - 2019","skills":"Customer Service, General Administration, Customer Care","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"WNS Global Services Private Limited, 11th FL Block A2 & A3 building, DLF IT SEZ, Sector 30 NH8 Gurgaon. (Near Star Mall)","phone":"Not Provided","profile":"Backend - Admin Support \nWNS Global Services Private Limited","description":"WNS Looking for Backend - Admin Support - Freshers can also apply Educational Qualification: Any Graduate Years of experience - 1+ Year Freshers can also apply Candidate should be flexible with the shift Timings. Join on Immediate basis. Skill Required- Ability to multi-task and to work within a framework of standard processes Good communication skills (both written and verbal) Ability to grasp requirement and deliver as per understanding Proactive team oriented, flexible approach. Job Responsibility: The role involves B2B interaction, providing Administrative support (arranging, travel, filing expenses, data entry) using the client tools remotely. Walk In Details: Date - 3rd - 5th September 2019 Timings: 1:00 PM to 4:00 PM Venue Details: WNS Global Services Private Limited 11th FL Block A2 & A3 building, DLF IT SEZ, Sector 30 NH8 Gurgaon. (Near Star Mall) Contact Person: Shalini","location":"Gurgaon","experience":"0 - 3 Years"},{"date":"3, 4 - Aug - 2019","skills":"Office Management, General Administration, Front Office Operations, & Handling Complaints","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"4th Quarter Technologies Pvt. Limited, MIGSUN Mahaluxmi Metro Tower C-1, C-2, Lower Ground Floor, behind Vaishali Metro Station, Vaishali Sector 4 Ghaziabad - 201 010","phone":"8448989035","profile":"Front Office & Admin Executive \n4th Quarter Technologies Pvt. Limited","description":"Candidate should be Any Graduate with 2 to 5 years of experience in Office Management, General Administration, Front Office Operations, & Handling customer complaints. Must have excellent communication skills. Job Responsibility- 1 . EPABX / IVR Handling (Call Handling) 2. Managing all front office works ,Walk in Handling (Customers, Broker, Banker, Vendor) 3 .Handling general Administration work 4 Entry of customers details in Excel and Maintaining daily report 5 .Event Management like Holi, Diwali, New Year Etc. 6. Preparing n Verifying of Conveyance of field boys Walk-in Date/ Time: 3rd - 4th September 2019, 10 AM onwards Interview Venue: 4th Quarter Technologies Pvt. Limited MIGSUN Mahaluxmi Metro Tower C-1, C-2, Lower Ground Floor, behind Vaishali Metro Station, Vaishali Sector 4 Ghaziabad - 201 010 Contact Person: Monika (8448989035)","location":"Hyderabad","experience":"2 - 5 Years"},{"date":"3, 4, 5, 6, 7 - Sept - 2019","skills":"Job Posting placement Recruitment selection HR","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Swagatham Resource Management India Pvt. Limited, Plot No: 15, 2 A Kakkan Nagar Main Road, Ganesh Nagar, NGO Colony, Adambakkam, Chennai - 600 088.","phone":"7550081511","profile":"HR Executive/ Recruiter \nSwagatham Resource Management India Pvt. Limited","description":"We are looking for an HR Recruiter to manage our full cycle recruitment, from identifying potential hires to interviewing and evaluating candidates. HR Recruiter responsibilities include sourcing candidates online, updating job ads and conducting background checks. If you have experience with various job interview formats, including phone screenings and group interviews, and can help us recruit faster and more effectively, wed like to meet you. Language Hindi must. Walk-in Date/ Time: 3rd - 7th September , 9 AM onwards Interview Venue: Swagatham Resource Management India Pvt. Limited Plot No: 15, 2 A Kakkan Nagar Main Road, Ganesh Nagar, NGO Colony, Adambakkam, Chennai - 600 088. Feel free to call us for any clarification 7550081511/ 7397769049","location":"Chennai","experience":"0 - 1 Years"},{"date":"5, 6, 7 - Sept - 2019","skills":"Counselling, Sales Administration, Front office operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"RK Solar Systems, Office No. B 202, 1st Floor, New Excelsior Complex, Opposite Crown Hotel, Khadki Bazar, Khadki, Pune - 411 003","phone":"Not Provided","profile":"Front Office/ Admin Executive \nRK Solar Systems","description":"Require Female Front Office Executive to handle all front office operations, Co-ordinaton with team members regarding work allotted and completion report, Handle Walk & Telephonic Customers, Work on Account ( Maintain Account Cash & Bank Expanses), Documentation work, Calling for Sales. Walk-in Date/ Time: 5th - 7th September , 10 AM onwards Interview Venue: RK Solar Systems Office No. B 202, 1st Floor, New Excelsior Complex, Opposite Crown Hotel, Khadki Bazar, Khadki, Pune - 411 003","location":"Pune","experience":"1 - 4 Years"},{"date":"3, 4 - Sept - 2019","skills":"Customer Service Desktop Support Networking Remote Support Technical Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Inspirisys Solutions Limited (Formerly Accel Frontline Limited) Dowlath Towers,Second floor, Taylors Rd, Chetpet, Chennai, Tamil Nadu 600010","phone":"Not Provided","profile":"Desktop Support Engineer/ L1 \nInspirisys Solutions Limited","description":"Inspirisys hiring Desktop Support L1 position at Chennai Qualification: - BE/ B.Tech/ BSc/ BCA Experience from 1 to 2.5 Years Must have good communication & exceptional customer service skills and demeanor, along with the innovative ability to communicate with both technical and non-technical customers & clients. Hands-on experience on End-user computing like Desktops, Laptops, network, Wi-Fi devices, etc. on both Hardware & Software. Remote support and application knowledge. Softwares - OS-level troubleshooting in Win 7 & Win 10, MS Office 2016, etc., Outlook / Mail config. Windows applications troubleshooting, Windows updates failure troubleshooting. Antivirus troubleshooting. Wi-Fi Config. Video Conferencing troubleshooting Handle daily technical support activities on desktop support Basic knowledge of server Interaction, Adhering to SLAs. Identify Improvements & quick resolution on day to day IT Operations Interested candidate kindly shares updated resume to naveenkumar.t@inspirisys.com with the below details- Total Expr: Rel Expr: C.CTC: Official NP:","location":"Chennai","experience":"1 - 2 Years"},{"date":"2, 3 - Sept - 2019","skills":"Technical Helpdesk, Technical Support, Product Support","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"HCL Technologies, A-22, Sector 60, Noida","phone":"9971777986","profile":"Product Support Engineer \nHCL Technologies Limited","description":"Designation: Engineer Product Support Education: Any Technical Graduate Job Location: Noida Experience: 1-year experience in hardware troubleshooting, calling experience is preferable. Eligibility Criteria: Only Technical graduates or post graduates can apply. Minimum of 1 year experience in hardware troubleshooting is mandatory. Must have excellent spoken English skills are compulsory!! #Must be comfortable working in US shifts (Night Shifts). Please come down for a face to face Interview on 2nd - 3rd September Timings: 11:00 am to 6 pm Interview Venue: HCL Technologies, A-22, Sector 60, Noida Contact Person: Chander Mohan Contact Details: 9971777986, chander.mohan@hcl.com Kindly carry: 1.A copy of your updated resume 2.A govt. address/ Id proof Please write HR Chander Mohan on top of your resume for gate entry","location":"Noida","experience":"1 - 6 Years"},{"date":"2, 3 - Sept - 2019","skills":"Technical Support, Customer Service/ Troubleshooting","qualification":"B.E./B.Tech, Diploma","address":"Sony India Pvt Limited, A-18, Near Sarita Vihar Metro Station, Mohan Co-operative Estate, Mathura Road, New Delhi","phone":"Not Provided","profile":"Technical Support Engineer \nSony India Private Limited","description":"We are urgently looking for B.Tech/ B.E/ Diploma holder for Technical Support executive Position in our organisation (Third Party Payroll) at New Delhi Office. Will be responsible for attending calls of the customer for Technical Support To manage escalated customers Trouble shooting over phone Punching the calls in software Walk in is planned on 2nd & 3rd Sept' 2019 at 09.30 am to 12.00 pm Interview Venue: Sony India Pvt Limited, A-18, Near Sarita Vihar Metro Station, Mohan Co-operative Estate, Mathura Road, New Delhi","location":"Delhi","experience":"0 - 1 Years"},{"date":"3, 4, 5 - Sept - 2019","skills":"IT Helpdesk, Networking, Technical Support, Customer Handling","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Concentrix Business Services (India) Pvt. Limited, Level 2, D4, Manyata Embassy Business Park, Nagawara Outer Ring Road, Bangalore - 560 045","phone":"7899326333","profile":"Technical Support Engineer \nConcentrix Daksh Services India Pvt. Limited","description":"Candidate should be a Graduate / Engineer from a technical background Garduate with 4+ years of experience in technical support Should have excellent customer handling skills. CCNA or VMware is added advantage. Role & Responsibilities: Advice/educates customers within procedural guidelines to ensure a complete solution to their technology. Identifies and provides input on unique or recurring customer problems. Focuses on delivering positive customer experience. Reviews and distribute pertinent cross-functional Escalates more complex customer technical issues to senior-level support. Walk-in Date/ Time: 3rd - 5th September , 12 PM onwards Interview Venue: Concentrix Business Services (India) Pvt. Limited, Level 2, D4, Manyata Embassy Business Park, Nagawara Outer Ring Road, Bangalore - 560 045","location":"Bangalore","experience":"4 - 6 Years"},{"date":"2, 3, 4, 5, 6, 7 - Sept - 2019","skills":"technical support consultative sales outbound sales outbound calling sales process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Aegis Customer Support Services Pvt. Limited, 41, Old Lakshmi Theatre Building, Essar House, St Johns Road, Bangalore - 560042","phone":"6361275363","profile":"Technical Support Associate \nAegis Customer Support Services Pvt. Limited","description":"Eligibility Criteria:- Mix of UG 50% & Graduate (Any Stream) 50% UG with One Year of Experience Graduate with 3 Month to 1 Year and Fresher. Must possess Very Good English communication skills, and strong Hindi skill (No RTI and MTI). Clarity in speech with neutral accent. Should have problem solving attitude. Positive attitude and commitment to grow with the organization. Basic Knowledge of Computers. Core Outbound Sales Skills. Flair Sales and target driven. Voice Skills. Versant 5 assessment Good Consultative Sales Skills. Voice Portfolio 6 days a week Operations, rotational off. Salary Range Up to 19K to 26K CTC. Interested candidates are requested to come for a direct walk-in interview along with your updated resume between 10 AM to 5 PM at our office address mentioned below; Aegis Customer Support Services Pvt. Limited 41, Old Lakshmi Theatre Building, Essar House, St Johns Road, Bangalore - 560042 Contact Person: Bala-6361275363","location":"Bangalore","experience":"0 - 5 Years"},{"date":"2, 3, 4, 5 - Sept - 2019","skills":"Php/ MySQL, Lamp, Laravel","qualification":"B.E./B.Tech, MCA/PGDCA","address":"TheOS Systems Private Limited, Nirmal Chaya Apartments, 2B, 2nd Floor, Argora Housing Colony, Ranchi. Landmark: Near Sub-Post Office","phone":"Not Provided","profile":"PHP Developer \nTheOS Systems Private Limited","description":"Writing clean, fast PHP to a high standard, in a timely and scalable way. Producing detailed specifications. Troubleshooting, testing and maintaining the core product software and databases. Walk-in Date/ Time: 28th August - 5th September , 12 PM onwards Interview Venue: TheOS Systems Private Limited Nirmal Chaya Apartments, 2B, 2nd Floor, Argora Housing Colony, Ranchi, Landmark: Near Sub-Post Office","location":"Ranchi","experience":"1 - 3 Years"},{"date":"6 - Sept - 2019","skills":"HTML, CSS or any other Front-end (CSS) frameworks, Python, Ruby, PHP, C# and .Net framework","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Ramboll India Private Limited, The Epitome, 17th Floor, Tower B, Building No. 5, DLF Cyber City, Phase III, Next to Rapid Metro Phase 2 Metro Station, Gurgaon - 122 002","phone":"Not Provided","profile":"Full Stack Developer (Php/ .Net) \nRamboll India Private Limited","description":"This role requires you to be able to solve problems in a creative way. Many of the problems that you will deal with do not necessarily have an existing solution implemented. To do so, you need to be an open-minded person with good communication skills to work collaboratively as well as independently as needed Proficiency with fundamental front-end languages such as HTML, CSS or any other Front-end (CSS) frameworks like Foundation or Bootstrap, AJAX. Familiarity with JavaScript frameworks such as React and Amber, Three js or JS-based build tools Libraries like jQuery or Backbone.js Proficiency with server-side languages such as Python, Ruby, PHP, C# and .Net framework Familiarity with database technology such as MySQL, Oracle and MongoDB, RESTful Services Familiarity with Autodesk Revit/ Tekla Navisworks API Development (not mandatory but an added advantage) Prior working experience with scripting tools like Dynamo, grasshopper etc. Walk-in Date: 6th September 2019 Time: 9:30 am to 3 pm Interview Venue: Ramboll India Private Limited, The Epitome, 17th Floor, Tower B, Building No. 5, DLF Cyber City, Phase III, Next to Rapid Metro Phase 2 Metro Station, Gurgaon, Haryana - 122 002 Contact Person: Neha Sharma","location":"Gurgaon","experience":"3 - 7 Years"},{"date":"6, 7 - Sept - 2019","skills":"Java Script & Core Java, SQL/ NoSQL","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Full Creative Private Limited, Ascendas Tech Park, Pinnacle Building - Phase I, 4th Floor, CSIR Road, Taramani, Chennai","phone":"044-42666652","profile":"Software Engineer/ Java \nFull Creative Private Limited","description":"Excellent programming skills in Java Script & Core Java Write well designed & efficient codes. Ensure the designs are in compliance with specifications Should build an interface with the customers, management & the team. Proficiency in Java & JavaScript. Experience in Amazon-AWS /Google Cloud. Design & implementation experience in SQL/ NoSQL (MySQL, PostgreSQL, Google's Cloud Datastore, MongoDB) Knowledge of version control systems like GIT & TDD. Should have Good Communication skills. Walk-in Date/ Time: 6th - 7th September , 10 AM onwards Interview Venue: Full Creative Private Limited Ascendas Tech Park, Pinnacle Building - Phase I, 4th Floor, CSIR Road, Taramani, Chennai","location":"Chennai","experience":"0 - 3 Years"},{"date":"31 - Aug - 2019","skills":"core java j2ee spring hibernate jprofiler visualvm jstack Docker","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"iBoss Tech Solutions Private Limited, D-37, Sector-63, Noida (Near Nissan Showroom)","phone":"Not Provided","profile":"Software Engineer - Java \niBoss Tech Solutions Private Limited","description":"Candidate should have 2 to 6 years hands on development experience using Core Java, J2ee, and spring, HB, Micro-Services and Oracle / MS SQL Server. Must be able to technically guide a team of minimum 2 members with excellent communication and client handling skills are required. Server-side component design, detailed technical design, development, implementation and maintenance In depth knowledge of core java. Solid on coding fundamentals e.g. Object-Oriented design, data structures and dependency injection. Micro services Architecture with container-based deployment is must. Hands-on experience in widely used third party frameworks (e.g. Spring, Hibernate, Web Services) Experience with Java Script framework like Angular, Jquery etc. Strong background Object Oriented analysis and design Hands on experience with Databases technologies preferably MS SQL Server. Walk-in Date: 31st August 2109 Reporting time- 10 AM to 2 PM Interview Venue: iBoss Tech Solutions Private Limited D-37, Sector-63, Noida (Near Nissan Showroom) **Candidates coming after 2 PM won't be considered","location":"Noida","experience":"2 - 6 Years"},{"date":"31 - Aug - 2019","skills":"C C++ Java JDBC Python, CSS, Javascript","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Beovolytics Computing Pvt. Limited, Grand Plaza, 58 Geetha Hall Road, Opp : Railway Station, Behind Cheran Towers, Coimbatore -18","phone":"9176064081","profile":"C/ C++/ Java Developer \nBeovolytics Computing Pvt Limited","description":"Candidate should have good analytical and problem solving skills. Design, build, maintain efficient, reusable, and reliable source code. Independently analyze, solve issues in real time, providing problem resolution end-to-end. Willing to work on MERN (JavaScript) Stack Walk-in Date/ Time: 31st August , 10 AM onwards Interview Venue: Beovolytics Computing Pvt Limited Grand Plaza, 58 Geetha Hall Road, Opp : Railway Station, Behind Cheran Towers, Coimbatore -18","location":"Chennai, Coimbatore","experience":"0 - 1 Years"},{"date":"31 - Aug - 2019","skills":"Angularjs, Java, Rest, GIT, Web Technologies, Javascript, Web Application","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"WNS Global Services Private Limited, Plot No. 8A, RMZ Centennial, Kundalahalli Main Road, Whitefield, Bangalore","phone":"Not Provided","profile":"Fullstack Developer \nWNS Global Services Private Limited","description":"Person should have experience working with graphic designers and converting designs to visual elements. Understanding and implementation of security and data protection. Experience working with restful webservices. Proficient experience using advanced JavaScript libraries and frameworks such as AngularJS, VueJS, BackboneJS, ReactJS etc. Knowledge of Java/ Python. Development experience for both mobile and desktop. Should have knowledge of code versioning tools as Git, Mercurial or SVN Roles & Responsibilities: Knowledge of overall architecture of web application. Maintain quality and ensure responsiveness of applications. Collaborate with the rest of the engineering team to design and launch new features. Maintain code integrity and organization. Walk-in Date/ Time: 31st August from 11 AM onwards Interview Venue: WNS Global Services Private Limited Plot No. 8A, RMZ Centennial, Kundalahalli Main Road, Whitefield, Bangalore","location":"Bangalore","experience":"2 - 4 Years"}]}