{"Walkins":[{"date":"6, 7 - Dec - 2019","skills":"Front Office, Back Office Operations, Data Entry, Back Office Operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Rapidsoft Technologies Private Limited, Plot 63, Udyog Vihar, Phase IV, Gurgaon, Haryana - 122 001","phone":"Not Specified","profile":"Front Desk Executive (Female) \nRapidsoft Technologies Private Limited","description":"Candidate should have good knowledge of office management and basic bookkeeping Excellent knowledge of MS Office (especially Excel and Word) Strong communication and people skills Good organizational and multi-tasking abilities Maintain files and records; update when necessary Job Responsibilities- Responsible for end to end office operations Handle the walk-in as well as telephonic inquiries & maintaining record of visitors. Supervise & administer the Supervisor,keep a check on housekeeping & office staff. Must have Strong interpersonal skills Walk-in Date/ Time: 6th - 7th December 2019, 11 AM onwards Interview Venue: Rapidsoft Technologies Private Limited Plot 63, Udyog Vihar, Phase IV, Gurgaon, Haryana - 122 001","location":"Gurgaon","experience":"1 - 2 Years"},{"date":"7, 8, 9 - Dec - 2019","skills":"Front Desk/ Reception Activities, General Administration","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"COLSTON Bath Spa Private Limited, 65 No, Rajasthani Industrial Area Co-oprative Industrial Estate, New Delhi - 110 033.","phone":"701512413","profile":"Front Desk Officer (Female) \nCOLSTON Bath Spa Private Limited","description":"Candidate should be Any Garduate with good verbal and written communication skills. Must have professional personal presentation. Job Responsbility- Managing the Front desk and handling all calls and Greet visitors/ clients providing a friendly, courteous front office service reflecting the corporate image of the client. Should be able to maintain attendance records and registers through computer/ manually. Should be able to maintain distributing and receiving of mail/courier. Supporting HR functions such as handling the event celebration, maintain housekeeping, support staff and drivers for the smooth working. Administrative Support and Service. Walk-in Date/ Time: 7th - 9th December from 3 PM onwards Interview Venue: COLSTON Bath Spa Private Limited 65 No, Rajasthani Industrial Area Co-oprative Industrial Estate, New Delhi - 110 033. Tel/ Phone: 701512413","location":"Delhi","experience":"1 - 5 Years"},{"date":"7 - Dec - 2019","skills":"HR/ Recruitment, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Cvent India Private Limited, 19th Floor, Tower C& D, Building No. 14, DLF Cyber City SEZ, Gurgaon - 122 002.","phone":"Not Provided","profile":"Recruitment Coordinator \nCvent India Private Limited","description":"Applicant should have 0 to 2 years of experience with at least Bachelor's degree. Knowledgeable in internet recruiting techniques and familiar working with resume management. Ability to prioritize, manage time well, stay organized, quickly address needs and adjust focus as needed Outstanding oral and written communication skills Proficiency with MS Office (Outlook, Word, Excel) Quick learner, with a positive attitude and ability to work well within a team Ability to treat sensitive/confidential information with appropriate discretion Ability to comfortably work in an intensely deadline-oriented environment Walk-in Date: Saturday, December 7th, 2019 Time: 12 PM- 3 PM Interview Venue: Cvent India Private Limited 19th Floor, Tower C& D, Building No. 14, DLF Cyber City SEZ, Gurgaon - 122 002. Contact Person- Tanupriya Saharan","location":"Gurgaon","experience":"0 - 2 Years"},{"date":"7 - Dec - 2019","skills":"Back End Operations, Non-Voice Support","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"HCL Technologies Limited, 1st Floor, WSS Towers or Navins Building, 106 & 107, Langs Garden Road, Mount Road, Pudupet, Chennai - 600 002","phone":"Not Provided","profile":"Backend Process Associate \nHCL Technologies Limited","description":"Walk-in for Healthcare Non-Voice Support - Looking only for Fresher's Work timings will be US shift timings - Night Shifts. Only Graduates- 10+2+3 (No Backlogs) Essential Requirement: Should be flexible to work in Night shifts. Immediate joiners are preferred. Work location is at Sholinganallur. Other Benefits: Doorstep cab pick and drop - Free Transportation for women (T&C Applied). Internal opportunity within HCL BPO after 18 months. Excellent Opportunity for Fresher's to start up their Career. If Interested, you may walk-in with your updated Resume. Date of Interview- 7th December 2019' Timings : 10.30 am to 1 pm Interview Venue: HCL Technologies Limited, 1st Floor, WSS Towers or Navins Building, 106 & 107, Langs Garden Road, Mount Road, Pudupet, Chennai - 600 002 Landmark : Near Casino Theatre Contact HR : Immanuel, HR Please, mention Immanuel on top of your Resume without fail","location":"Chennai","experience":"0 - 1 Years"},{"date":"6, 9, 10, 11, 12, 13 - Dec - 2019","skills":"BPO Operations, Backend Operations, Background Check","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Matrix Business Services India Pvt. Limited, 3rd Floor, E 14B, Sector 8, Noida - 201 301","phone":"9953404600","profile":"Back Office Executive/ Asst. Manager \nMatrix Business Services India Pvt. Limited","description":"We are currently looking for candidates for candidates for various positions for Background Verification process as mentioned below based at Noida Location. Key Requirements: Junior Executive - Fresher or having 1 Year experience with good communication skills Salary 14-15K CTC Senior Executive - Having 2 - 3 Year BGV experience with good communication skills Salary 15-17K CTC Assistant Manager - Having 4 - 5 Year BGV experience with good communication skills Field Executive - Routes Knowledge Salary up to 14K CTC If you are interested you can come and attend the interview in below address on weekdays- (4th December - 13th December , 10 AM onwards) Matrix Business Services India Pvt. Limited, 3rd Floor, E 14B, Sector 8, Noida - 201 301 Contact Person: Ms. Kamiya Tel: 9953404600","location":"Noida","experience":"0 - 5 Years"},{"date":"6, 7 - Dec - 2019","skills":"HR/ Recruitment, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Soft Suave Technologies Private Limited, No-100, 3rd floor, Kundrathur Main Road, MS Nagar, Porur, Chennai - 600 116.","phone":"Not Provided","profile":"HR Executive \nSoft Suave Technologies Private Limited","description":"The expected candidate should be go getter, proactive, and with exceptional english communication skills. Freshers can also apply, at least 1 year of experience is preferred though. Recruiting skills Problem solving skills Decision making skills Inter personal Skills Leadership & Mentoring Forward planning & strategical Thinking Walk-in Date/ Time: 6th - 7th December 2019, 10 AM onwards Interview venue: Soft Suave Technologies Private Limited, No-100, 3rd floor, Kundrathur Main Road, MS Nagar, Porur, Chennai - 600 116. Contact Person- Sudhendra Devi If you wish to attend HR interview on some other day, kindly send your updated resume to teamhr@softsuave.com with choice of your date and time & work location as Chennai, we will confirm by replying to it.","location":"Chennai","experience":"0 - 3 Years"},{"date":"7 - Dec - 2019","skills":"C#/ .NET, Windows Forms, SQL Server Database","qualification":"B.E./B.Tech, MCA/PGDCA","address":"ENuke Software Private Limited, Pavillion Building 339/2 Mehrauli Road Near Mango Blossom Hotel, Anamika Enclave, Gurugram, Haryana - 122 007.","phone":"Not Provided","profile":".Net Developer \nENuke Software Private Limited","description":"Person should have 1 to 3 years of relevant experience in C#/ .NET and Windows Forms and SQL Server Database Development. Good knowledge of using JavaScript, jQuery, Bootstrap, HTML5.0, CSS3, Bootstrap, Ajax. Experience with Visual Studio & expert with ASP .NET Must have great aptitude and desire to learn and work in challenging environment. Candidate should be focused and self-motivated. Must have great willingness to learn. Must have great team working skills. Walk-in Date/ Time: 7th December 2019, 10 AM onwards Interview Venue: ENuke Software Private Limited Pavillion Building 339/2 Mehrauli Road Near Mango Blossom Hotel, Anamika Enclave, Gurugram, Haryana - 122 007. Contact Person- Rachna Jha","location":"Gurgaon","experience":"1 - 3 Years"},{"date":"12, 13 - Dec - 2019","skills":"Automation Testing, REST ASSURED/ JUnit framework for API testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"MS Technology Private Limited 2, Community Centre, IInd Floor, Basant Lok, Vasant Vihar, New Delhi.","phone":"Not Provided","profile":"Software Testing Engineer \nMS Technology Private Limited","description":"Candidate should have 1 to 3 years of experience in Automation Testing. Hands on experience of working with at least one of GUI based test automation tools for desktop and/or mobile automation using Selenium. Experience on other tools will be added advantage. Should have good knowledge of maven. Knowledge of REST ASSURED/ JUnit framework for API testing Hands on experience in any Java IDE (e.g. Eclipse) Hands on experience on GIT, JIRA, Jenkins Good understanding of OOPS concepts and strong programming skills in Java Selenium with Java (Interfaces, classes) Hands on experience on JMeter Knowledge of standard QA processes, test plans, test case design, test case management, Defect management and reporting. Walk-in Date/ Time: 12th & 13th December 2019, 11 AM onwards Interview Venue: MS Technology Private Limited 2, Community Centre, IInd Floor, Basant Lok, Vasant Vihar, New Delhi. Landmark: Opposite Hero Corporate office","location":"Delhi","experience":"1 - 3 Years"},{"date":"7 - Dec - 2019","skills":"Java/ PHP/ .NET","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Girikon Solutions Private Limited, B-24, Sector 65, Noida - 201 301","phone":"Not Provided","profile":"Software Developer (Java/ PHP/ .Net) \nGirikon Solutions Private Limited","description":"We are looking for talented Engineers to join us in our Noida office. You will be a talented engineer with a penchant to learn and grow yourself in the domain of cloud engineering. Person must have Ability to understand the requirements and have excellent knowledge of good coding standards. Should have 1+ year of Software development experience in developing web applications and web services using any of Java/ PHP/ .NET, Good written and oral communication skills. Good team player. Good Coding skills in any language. A positive/ open attitude for switching tech to cloud computing. Knowledge of Angular JS will be added advantage. Walk-in Date/ Time: 7th December from 11 AM onwards Interview Venue: Girikon Solutions Private Limited B-24, Sector 65, Noida - 201 301 Note: Candidate must carry a hard copy of updated CV along with 2 photos & ID Proof (any).","location":"Noida","experience":"1 - 2 Years"},{"date":"7 - Dec - 2019","skills":"ASP .Net, MVC core, AZURE ACS, SQL Server, Angular","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Mindteck (India) Limited, 23, A.M.R. Tech Park, Block -1, 3rd Floor, # 664, 24, Hosur Rd, Bommanahalli, Bengaluru, Karnataka - 560 068","phone":"Not Provided","profile":".Net Developer \nMindteck (India) Limited","description":"Candidate should have strong experience on ASP .Net, MVC core, AZURE ACS, SQL Server, Angular. Expertise building solutions in the Microsoft stack, Azure and cloud native application. Must have working knowledge of building Web MVC applications. Working knowledge of building .NET Core applications Experience with building Web APIs (REST) Experience using/ building applications using an Entity Framework Expertise with relational databases, especially SQL Server Building scripts using Javascript, jQuery Walk-in Date/ Time: 7th December 2019, 10 AM onwards Interview Venue: Mindteck (India) Limited 23, A.M.R. Tech Park, Block -1, 3rd Floor, # 664, 24, Hosur Rd, Bommanahalli, Bengaluru, Karnataka - 560 068. Contact Person- Ashish Mahajan","location":"Bangalore","experience":"5 - 10 Years"},{"date":"13 - Dec - 2019","skills":"ASP .Net C# web application, MS SQL programming and XAMARIN","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Cruxzen Technologies Private Limited, 5, Vijay Complex, S.No. 77/1/7, Near Sai Chowk, New Sangavi, Pune Maharashtra - 411 027.","phone":"8408856557","profile":".Net Developers \nCruxzen Technologies Pvt. Limited","description":"Applicant should have done C# .Net certification after Graduation. Mobile app development would be added advantages. Should not have an education gap. DOB should be after 1/1/1992. Should ready to work at the client location. Xamarin app. Experience dynamic candidates for software development. Design, Development of ASP .Net C# web application. Hands on MS SQL programming and XAMARIN must. Should have C# .Net Certificate for fresher. Mobile app programming. Walk-in Date/ Time: 13th December 2019, 10 AM onwards Interview Venue: Cruxzen Technologies Private Limited 5, Vijay Complex, S.No. 77/1/7, Near Sai Chowk, New Sangavi, Pune Maharashtra - 411 027. Contact No. 8408856557","location":"Hyderabad","experience":"0 - 4 Years"},{"date":"6 - Dec - 2019","skills":"ASP .Net, C# .Net, VB.Net with preferably Oracle Database","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"DXC Technology India Private Limited, Surya Wave, Electronics City Phase 1, Electronic City, Bengaluru - 560 100.","phone":"Not Provided","profile":".Net Developers \nDXC Technology India Private Limited","description":"Skills Required for Microsoft 1. ASP .Net, C# .Net, VB.Net with preferably Oracle Database 2. C++ knowledge/ experience is preferred General Requirements: At least 3-10 years of work experience on these generic skillsets Experience managing and supporting multiple application Experience supporting IT applications in Citrix, Win7 and Unix environments Packaging knowledge with SCCM and App-V etc. Experience with Ticketing Systems (eg. ServiceNow, Remedy etc.) General Windows Server and network knowledge Knowledge/Experience with databases, SQL queries and PL/SQL scripting with Oracle and/or SQL server Walk-in Date/ Time: 6th December 2019, 10 AM onwards Interview Venue: DXC Technology India Private Limited Surya Wave, Electronics City Phase 1, Electronic City, Bengaluru - 560 100. Contact Person - Vijay","location":"Bangalore","experience":"3 - 10 Years"},{"date":"5, 6 - Dec - 2019","skills":"CorePHP, Laravel framework, MySQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Colan Infotech Private Limited, Murugesan Nayakar Complex, Unit-2, D 84, B Block, 4th Floor, Greams Road, Thousand Lights, Chennai - 600 006.","phone":"9042055701","profile":"PHP Laravel Developer \nColan Infotech Private Limited","description":"Candidate must have good work experience in CorePHP & Laravel framework Good to have knowledge with any CMS OR Frameworks (Optional) Knowledge in MySQL Should have good communication skills Positive Attitude Walk-in Date/ Time: 4th - 6th December , 10 AM onwards Interview Venue: Colan Infotech Private Limited Murugesan Nayakar Complex, Unit-2, D 84, B Block, 4th Floor, Greams Road, Thousand Lights, Chennai - 600 006. Landmark: (Opposite Road to Sea Shell Hotel) Contact person- Kalai/ Vignesh Tel Number: 9042055701 Interested candidates can forward your resumes to kalaichelvi.k@colanonline.com","location":"Chennai","experience":"4 - 8 Years"},{"date":"5, 6, 9, 10, 11, 12, 13, 16, 17, 18, 19, 20 - Dec - 2019","skills":".NET web framework DotNet 4 or above including MVC","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Sitel India Private Limited, 5th Floor, B Wing Boomerang Building, Chandivali, Andheri (East) Mumbai - 400 072","phone":"Not Provided","profile":".Net Developer \nSitel India Private Limited","description":"We are seeking a .NET Developer responsible for building .NET applications using C# .Net 4 or above including MVC with focus is on front-end and back-end development. Required Skills: Strong knowledge of .NET web framework DotNet 4 or above including MVC with focus is on front-end and back-end development Proficient in C#, with a good knowledge of their ecosystems Strong understanding of object-oriented programming Skill for writing reusable libraries Familiar with various design and architectural patterns Knowledge of concurrency patterns Proficient with Microsoft SQL Server Responsibilities: Translate application storyboards and use cases into functional applications Design, build, and maintain efficient, reusable, and reliable code Integrate data storage solutions which includes databases, key-value stores, blob stores, etc. Ensure the best possible performance, quality, and responsiveness of applications Identify bottlenecks and bugs, and devise solutions to mitigate and address these issues Help maintain code quality, organization, and automatization Walk-in Date/ Time: 4th - 20th December from 4 PM onwards Interview Venue: Sitel India Private Limited 5th Floor, B Wing Boomerang Building, Chandivali, Andheri (East) Mumbai - 400 072","location":"Mumbai","experience":"1 - 5 Years"},{"date":"9, 10, 11, 12, 13 - Dec - 2019","skills":"ASP .NET, C#, MVC, SQL, Web API, Angular JS, HTML, CSS, JQuery, Bootstrap","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Digital Minds Software Solutions Pvt. Limited, 2nd Floor, A-Wing, Softsol Building, #4 Infocity, Beside Mindspace,Hi-tech City, Madhapur, Hyderabad, Telangana - 500 081.","phone":"040 66885669","profile":"Software Engineer (ASP .Net) \nDigital Minds Software Solution Pvt. Limited","description":"Educatioanl Qualification: B. Tech/ MCA Work Experience: 2 to 3 Years Process: .Net Domain Shift Timings: 9:00 am to 6:00 pm. Skill Set: ASP .NET, C#, MVC, SQL, Web API, Angular JS, HTML, CSS, JQuery, Bootstrap. Experience in designing web applications using HTML, CSS, Bootstarp, JQuery, Angular JS. Experience on Developing applications using ASP.Net MVC & C#. Writing and Consuming Web services & Web API. Experience on SQL Server and dealing database using Entity Framework. Knowledge on Kentico is an added advantage. Walk-in Date/ Time: 9th - 13th December 2019, 10 AM onwards Interview Venue: Digital Minds Software Solutions Pvt. Limited 2nd Floor, A-Wing, Softsol Building, #4 Infocity, Beside Mindspace,Hi-tech City, Madhapur, Hyderabad, Telangana - 500 081. Contact No. 9063610208/ 040 66885669 Email: hr@digitalminds.solutions Note: Those who attended the interview with in Six Months, kindly ignore.","location":"Hyderabad","experience":"2 - 3 Years"},{"date":"7 - Dec - 2019","skills":".Net, Javascript framework/ Library (Angular), MS SQL Server/ MySQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Nitor Infotech Private Limited, 5th Floor (B Wing), Rhine, Block 1.5, Embassy Tech Zone, Rajiv Gandhi InfoTech Park, Hinjewadi, Pune - 411 057","phone":"Not Provided","profile":".Net Developers \nNitor Infotech Private Limited","description":"Candidate must have 1 year experience in .Net Technology with minimum 6 months experience of working with one of the Javascript framework/ Library (Angular). Must be having excellent knowledge of Object Oriented Programming concepts. Must have good knowledge of SQL. Must have good knowledge of HTML, CSS, Javascript. Experience in working with one of the database like - MS SQL Server/ MySQL Soft skills Excellent interpersonal skills. Good communication skills. Walk-in Date/ Time: 7th December 2019, 10 AM onwards Interview Venue: Nitor Infotech Private Limited 5th Floor (B Wing), Rhine, Block 1.5, Embassy Tech Zone, Rajiv Gandhi InfoTech Park, Hinjewadi, Pune - 411 057 Landmark: Same premises as IBM & ATOS, ahead of Wipro Circle Phase-2 Contact Person- Prachi Jadhav","location":"Pune","experience":"1 - 3 Years"},{"date":"7 - Dec - 2019","skills":"Dotnet, Asp .Net, Azure","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"HCL Technologies Limited, Survey No. 30, 34, 35 & 38, Avance Business Hub, Tower H01 Phoenix Infocity Pvt. Limited SEZ, Phase 2, Hyderabad, Telangana - 500 081.","phone":"Not Provided","profile":".Net Developers \nHCL Technologies Limited","description":"We are planning to conduct Scheduled Weekend Drive & the discussion would take place on Saturday 7th December 2019 @ HCL Technologies - Hyderabad location Candidate must have good experience in Dotnet, Asp .Net, Azure. Willing to learn New Technologies and willing to work as a Fullstack Developer. Must have good communication skills Kindly go through and interested candidates are requested to share profiles along with basic information to screen and schedule interviews. Interview Process : 2 Technical Rounds + HR Discussion (All the process will get completed on Same day (7th Dec-2019) If you are interested; kindly share your resume to ahmed_s@hcl.com Interview Venue: HCL Technologies Limited Survey No. 30, 34, 35 & 38, Avance Business Hub, Tower H01 Phoenix Infocity Pvt. Limited SEZ, Phase 2, Hyderabad, Telangana - 500 081. POC : Naresh Reddy","location":"Hyderabad","experience":"4 - 11 Years"},{"date":"6 - Dec - 2019","skills":"PHP and PHP based MVC frameworks like CodeIgniter, Laravel, Symphony, YII, MySQL","qualification":"B.E./B.Tech, M.Tech","address":"HETERO Healthcare Limited, MELANGE TOWERS, 4th Floor, C Wing Patrikanagar, Madhapur, Hyderabad, Telangana - 500 081.","phone":"Not Provided","profile":"Web/ Php Developer \nHetero Healthcare Limited","description":"Candidate should have 2 to 4 years of experience in PHP and PHP based MVC frameworks like CodeIgniter, Laravel, symphony, YII etc. Proficient in MySQL, proficient with database design, optimization and tuning in MySQL. Expertise in versioning control, preferably GIT. Knowledge on Angular JS, Angular. Strong knowledge JQuery, Java Script, validations. Proficient in creating Microservices. Basic Knowledge HTML 5, CSS3, SASS, LESS, Bootstrap. Strong Knowledge of Linux required, for ex. working experience with LAMP stack setup, shell scripting etc. Walk-in Date/ Time: 6th December 2019 from 10 AM onwards Interview Venue: HETERO Healthcare Limited MELANGE TOWERS, 4th Floor, C Wing Patrikanagar, Madhapur, Hyderabad, Telangana - 500 081. Landmark: Besides Ratnadeep Supermarket","location":"Hyderabad","experience":"2 - 4 Years"},{"date":"5, 6 - Dec - 2019","skills":"PHP Bootstrap, AngularJS, BackboneJS, HTML5/ CSS3, SQL Database","qualification":"B.E./B.Tech, MCA/PGDCA","address":"The Miiint Solutions, 5th Floor, Nirmal Plaza, Opp. Vanaz Engineering, Paud Road, Kothrud, Pune - 411 038.","phone":"7620921424","profile":"Software Developer (PHP) \nThe Miiint Solutions","description":"We are looking for smart, enthusiastic, hard working Web/ Mobile App developers. You are required to work on multiple technologies like hardcore PHP (on multiple frameworks), complex SQL Databases, challenging different visualization libraries with advanced HTML5/ CSS3 techniques. We use various front end libraries such as Bootstrap, AngularJS, backboneJS. We also work on Cross Platform and Native iOS/Andriod Mobile Apps. Passing Year: 2018 (if exp) & 2019 only 60% aggregate. Must Have Excellent Logical Thinking. Pune localites only need to apply Clear understanding of technical skills as mentioned in the job description. Highly energetic and self-starter. Able to multi-task the activities Walk-in Date/ Time: 3rd - 6th December , 10 AM onwards Interview Venue: The Miiint Solutions, 5th Floor, Nirmal Plaza, Opp. Vanaz Engineering, Paud Road, Kothrud, Pune - 411 038. Contact - Shamika ( 7620921424 )","location":"Pune","experience":"0 - 1 Years"},{"date":"5, 6, 7, 9, 10 - Dec - 2019","skills":"PHP web frameworks (Laravel, Symfony), October CMS","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Mahindra First Choice Wheels Limited, FERNS Icon, 3rd Floor, Unit -4, Survey No: 28 36/5, Doodanekundi, Outer Ring Road, Bangalore - 37","phone":"Not Provided","profile":"PHP Developer \nMahindra First Choice Wheels Limited","description":"Candidate should be B.Tech/ BE with strong knowledge of PHP web frameworks (Laravel, Symfony), October CMS with excellent design skills. CDAC is added Advantage Understanding the fully synchronous behaviour of PHP Understanding of MVC design patterns Thorough understanding of front-end technologies, such as JavaScript, HTML5, and CSS3 Knowledge of object oriented PHP programming Walk-in Date/ Time: 4th - 10th December 2019, 10 AM onwards Interview Venue: Mahindra First Choice Wheels Limited, FERNS Icon, 3rd Floor, Unit -4, Survey No: 28 36/5, Doodanekundi, Outer Ring Road, Bangalore - 37 Contact Person- Archana P","location":"Bangalore","experience":"4 - 8 Years"},{"date":"7 - Dec - 2019","skills":"C# .Net, ASP .Net, JavaScript, JQuery, AngularJS, MVC, JQuery, AngularJS","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Vidushi Infotech Software Solutions Pvt. Limited, Cerebrum IT Park, Unit No-3A, Building B3, 2nd floor, Kalyani Nagar, Pune - 411 014.","phone":"9665552089","profile":".Net Developer \nVidushi Infotech Software Solutions Pvt. Limited","description":"Vidushi Infotech a CMMI Level 3 company is NOW HIRING Software Developer/ Senior Software Developer having 3-4 years of experience in .NET Technology. Required Skills- Expertise and hands on experience in .NET based design, development and deployment. Strong C# .Net and ASP .Net Experience with MVC. Working experience with JavaScript, JQuery, AngularJS. Must know HTML, CSS. Strong SQL skill set is mandatory. Responsible for quality and accountability of deliverable. Strong coding and debugging skills Candidates who are available to Join Immediately will be give first preference Male candidates only Walk-in Date/ Time: 7th December 2019, 10 AM onwards Interview Venue: Vidushi Infotech Software Solutions Pvt. Limited Cerebrum IT Park, Unit No-3A, Building B3, 2nd floor, Kalyani Nagar, Pune - 411 014. Contact Person- Rohit Salvi Phone No: 9665552089","location":"Pune","experience":"3 - 4 Years"},{"date":"4, 5 - Dec - 2019","skills":"Front Desk/ Receptionist Activities, Book Keeping, Office Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Livguard Energy Technologies Pvt. Limited, 221, Udyog Vihar Phase - I, Gurgaon, Haryana - 122 016","phone":"Not Provided","profile":"Front Office Executive \nLivguard Energy Technologies Pvt. Limited","description":"We are looking for a pleasant Front Desk Representative to undertake all receptionist Work. You will be the 'face' of the company for all visitors and will be responsible for the first impression we make. Key Requirements: Proven experience as front desk representative, agent or relevant position Familiarity with office machines (e.g. fax, printer etc.) Knowledge of office management and basic bookkeeping Proficient in English (oral and written) Excellent knowledge of MS Office (especially Excel and Word) Strong communication and people skills Problem-solving skills Customer service orientation Job Responsibilities: Keep front desk tidy and presentable. Greet and welcome guests Answer questions and address complaints Answer all incoming calls and redirect them or keep messages Receive letters, packages etc. Monitor office supplies and place orders when necessary Walk-in Date/ Time: 4th - 5th December, 12 AM onwards Interview Venue: Livguard Energy Technologies Pvt. Limited 221, Udyog Vihar Phase - I, Gurgaon, Haryana - 122 016 Contact Person- Mitanshu","location":"Gurgaon","experience":"2 - 5 Years"},{"date":"7 - Dec - 2019","skills":"Automation tools like Jmeter, Selenium or Katalon Studio","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Techwave Consulting India Private Limited, Phoenix Avance Business HUB. IT/ ITES SEZ, Level 4, Building Number - H-06, Hi-tech City, Hyderabad, Telangana - 500 081","phone":"9154930533","profile":"Automation Testing Engineer \nTechwave Consulting India Private Limited","description":"Candidate must have strong experience with Automation tools like Jmeter, Selenium or Katalon studio (Min 1+ Years with good coding skills). Should have experience in designing of frameworks, methodologies. Must have basic Java programming skills Experience with Agile Methodology Experience on Jira and Confluence Experience with Linux, Unix ( optional ) Excellent written and verbal communication skills Roles & Responsibilities: Understanding the customer requirements Collaborate with other team members to verify and validate deliverables Quickly produce well organized, optimized, and documented test cases Should be able to work independently Should always meet the customer expectations Acquiring knowledge on customer's business processes and enhancements Continuously learn and improve skills Walk-in Date/ Time: 7th December 2019 from 10 AM onwards Interview Venue: Techwave Consulting India Private Limited Phoenix Avance Business HUB. IT/ ITES SEZ, Level 4, Building Number - H-06, Hi-tech City, Hyderabad, Telangana - 500 081","location":"Hyderabad","experience":"5 - 8 Years"},{"date":"7 - Dec - 2019","skills":"Software Testing/ Fresher","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"AVA Software Private Limited, Alpha City (SSPDL), 2nd Floor Gamma Block, Old Mahabalipuram, Navalur, Chennai - 600130","phone":"98405 76396","profile":"Trainee - Software Testing \nAVA Software Private Limited","description":"Looking for Fresher candidates with Certification (or) Internship (or) Training in Software Testing and candidates experienced between 3 Months - 1 yr can take part in the interview. Freshers with NO CERTIFICATION are not preferred. Candidates who had taken an interview with us in the last 2 months will not be evaluated Walk-in Date/ Time: 7th December 2019, 10 AM onwards Interview Venue: AVA Software Private Limited Alpha City (SSPDL), 2nd Floor Gamma Block, Old Mahabalipuram, Navalur, Chennai - 600130 Contact Person- Jayarmanan","location":"Chennai","experience":"0 - 1 Years"},{"date":"7 - Dec - 2019","skills":"Manual Testing, Database Testing, MS SQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"D2K Technologies (India) Private Limited, 605, Pujit Plaza, Plot No 67, Sector-11, CBD Belapur, Navi Mumbai","phone":"022-27562853","profile":"Software Tester/ Fresher \nD2K Technologies (India) Private Limited","description":"Good knolwdge in Manual Testing, Database Testing, MS SQL Must have good communication skills. Client Site traveling. (Male candidate preferable) Willing to work beyond the working hours if the work demands. Should be willing to work on any technologies. Good Attitude. Eager to learn. Walk-in Date/ Time: 7th December 2019, 10 AM onwards Interview Venue: D2K Technologies (India) Private Limited 605, Pujit Plaza, Plot No 67, Sector-11, CBD Belapur, Navi Mumbai Contact Person- Verunika Sorte Tel: 022-27562853","location":"Mumbai","experience":"0 - 1 Years"},{"date":"4, 5, 6, 7 - Dec - 2019","skills":"General Administration, Email Support, Letter Drafting, Secretarial Activities, Follow Ups, etc","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Ocean Lifespaces India Private Limited, MF-1, Industrial Estate, CIPET Hostel Road, Guindy, Chennai - 600 032.","phone":"044-2225 9926","profile":"Admin/ Executive Assistant \nOcean Lifespaces India Private Limited","description":"Candidate should be Any Graduate with 3 to 8 years of experience in General Administration, Email Support, Letter Drafting, Secretarial Activities, Follow Ups, etc Key Responsibilities- Assisting the Executive Director in his day to day routine activities Handling and responding accordingly to Executive Director emails, correspondence, drafting letters, screening calls, conference arrangements, dispatch Taking care of daily& weekly Walk-in Date/ Time: 3rd December - 17th January , 11 AM onwards Interview Venue: Ocean Lifespaces India Private Limited, MF-1, Industrial Estate, CIPET Hostel Road, Guindy, Chennai - 600 032. Tamil Nadu Contact Person- Bervin Antony Michael Contact No: 044-2225 9926","location":"Noida","experience":"3 - 8 Years"},{"date":"4, 5, 6 - Dec - 2019","skills":"MIS Reports on Daily, Weekly, & Monthly metrics","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Lenskart Solutions Private Limited, 6th Floor Tower D Vatika Towers, Near Sarai Metro Station Faridabad.","phone":"Not Provided","profile":"Admin/ MIS Executive \nLenskart Solutions Private Limited","description":"Lenskart Solutions Private Limited, is looking for MIS Executive (excel Expert). Analyzing the data/ Data Analysis report generation. Must have good communication skills. Responsible for preparation & maintenance of MIS Reports on Daily, Weekly, & Monthly metrics. Preparation of monthly/quarterly dashboards on PowerPoint/ MS Excel for review. Work with stakeholders on adhoc requests. Prepare ageing report. V lookup, H Lookup, Pivot Table. Macros Advance Excel Inventory Management Walk-in Date/ Time: 4th - 6th December , 9 AM onwards Interview Venue: Lenskart Solutions Private Limited 6th Floor Tower D Vatika Towers, Near Sarai Metro Station Faridabad. Contact Person- Peyush Bansal","location":"Faridabad","experience":"3 - 4 Years"},{"date":"7 - Dec - 2019","skills":"General Administration, Calendar Planning, Email Writing, Personal Assistance, Minutes of meeting","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Nutravo Lifecare Private Limited, 219, Udyog Vihar Phase 4, Sector 18, Gurugram, Haryana.","phone":"9711294479","profile":"Admin Executive/ Assistant \nNutravo Lifecare Private Limited","description":"Candidate should be Any Graduate with 2 to 5 years of experience in General Administration, Calendar Planning, Email Writing, Personal Assistance, Minutes of meeting. Must have excellent communication skills. Job Responsibility- Prepares MOM, manages executive's calendar, point of contact to the team, anticipate travel plans, creates itinerary, Assists with miscellaneous complex administrative tasks,accounts reconciliation support, developing trusting relationship. Walk-in Date/ Time: 7th December 2019, 10 AM onwards Interview Venue: Nutravo Lifecare Private Limited 219, Udyog Vihar Phase 4, Sector 18, Gurugram, Haryana. Contact Person- Nikita ( 9711294479 )","location":"Gurgaon","experience":"2 - 5 Years"},{"date":"6 - Dec - 2019","skills":"Front office/ Guest relations/ Front desk Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"OYO Corporate Office, Capital Towers, Nungambakkam High Road, Tirumurthy Nagar, Nungambakkam, Chennai, Tamil Nadu - 600 006.","phone":"8639174639","profile":"Guest Relation Executive \nOravel Stays Private Limited","description":"PREREQUISITES: Well developed communication and customer relations skills. Highly organized, results-oriented with the ability to be flexible and work well under pressure. EDUCATION: Degree or Diploma in Hospitality Management is an asset or Graduates bachelor degree and/or diploma in hotel or other related field. Computer Knowledge and experience in MS office programs. JOB RESPONSIBILITY: Customer Satisfaction (Guest Feedback, Social Media Review). Financial Performance (Up selling, Room Revenue, Operation Auditing). Showing Initiative, Problem Solving, Staff Training, Team Leading. Manages and motivates the Front Office team in order to provide a high standard of service for customers. Welcomes guests and fosters customer loyalty through his/her friendly manner. Develops high quality relationships with guests throughout their stay. Walk-in Date/ Time: 6th December 2019, 10 AM onwards Interview Venue: OYO Corporate Office Capital Towers, Nungambakkam High Road, Tirumurthy Nagar, Nungambakkam, Chennai, Tamil Nadu - 600 006. Contact Person : Sai Prasad Phone No: 8639174639","location":"Chennai","experience":"0 - 2 Years"},{"date":"4, 5, 6, 7, 9, 10 - Dec - 2019","skills":"Customer Care, Technical Support, BPO Voice Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Thite Valuers Engineers Pvt. Limited, 3rd floor, 'Gayatri', 2060 Sadashiv Peth, Vijaynagar Colony, Behind S. P. College, Off, Lokmanya Bal Gangadhar Tilak Rd, Sadashiv Peth, Pune - 411 030.","phone":"9371236553","profile":"Computer Operator/ Data Entry \nThite Valuers Engineers Pvt. Limited","description":"Work Experience: 3 to 8 Years Role & Responsibility: 1. Typing various valuation reports in appropriate formats 2. Do the corrections if & wherever required 3. Print final reports with photographs 4. Mention value & adopted rate in register 5. Letter typing 6. Feeding Sale instances 7. Co-ordinate with engineers for timely delivery of reports 8. Review pending reports & follow up with engineers regarding them 9. Any other official work assigned by seniors from time to time Walk-in Date/ Time: 4th - 10th December , 11 AM onwards Interview Venue: Thite Valuers Engineers Pvt. Limited 3rd floor, 'Gayatri', 2060 Sadashiv Peth, Vijaynagar Colony, Behind S. P. College, Off, Lokmanya Bal Gangadhar Tilak Rd, Sadashiv Peth, Pune, Maharashtra - 411 030. Contact - Tanuja Ranade ( 9371236553 )","location":"Pune","experience":"3 - 8 Years"},{"date":"3, 4, 5, 6, 7, 9, 10, 11, 12, 13, 14, 16, 17, 18, 19, 20, 21, 23 - Dec - 2019","skills":"General Administration, Call Center Operations, MIS Reporting, Inbound/ Outbound Calling","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Medeor Hospitals Limited, B-33-34, Qutab Institutional Area, New Delhi - 110 016","phone":"011-41222222","profile":"Senior Executive/ Asst. Manager \nMedeor Hospitals Limited","description":"Candidate should be Any Graduate with experience in General Administration, Call Center Operations, MIS Reporting, Inbound/ Outbound Calling. Must have excellent communication skills. Job Responsibility- To handle both inbound & outbound calls for all the unit of Medeor hospital in Delhi/NCR. To educate the people calling about the facilities offered by the hospital, e.g. the packages offered & specialties. To transfer the incoming calls to the correct extension. Proper diversion or handling of calls in case the person is not available. Ensure prompt handling of calls with due attention. Interview Date/ Time: 3rd - 23rd December 2019, 10 AM onwards Interview Venue: Medeor Hospitals Limited B-33-34, Qutab Institutional Area, New Delhi - 110 016 Contact Person- Vibha Jain Tel No: 011-41222222","location":"Delhi","experience":"0 - 1 Years"},{"date":"7 - Dec - 2019","skills":"Manual Testing/ Automation Testing with SQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Xavient Software Solutions India Pvt. Limited, E-54, Sector 81, NSEZ, Noida.","phone":"Not Provided","profile":"Software Testing Engineer \nXavient Software Solutions India Pvt. Limited","description":"Inviting 'Software Test Engineer/ Module Lead' with Manual Testing and SQL on Saturday, 7th December 2019 Work Experience- 3 to 8 years Location- 54, NSEZ , Noida Phase 2. Candidate should have good experience in Manual Testing/ Automation Testing with SQL Exposure in SOAP UI/ REST API, Web services testing, SOA testing. Hands on expertise in writing queries in SQL . Understanding of testing artifacts like test plan, test case Good knowledge of test life cycle and defect life cycle Should be able to handle client communication independently Execute test scripts, log defects and provide defect status reports. Strong communication and interpersonal skills networking, building relationships, teamwork. Self-motivated, work well in a team structure or independently & a good team player. Good to have working experience in Healthcare domain . Walk-in Date/ Time: 7th December 2019, 10 AM onwards Interview Venue: Xavient Software Solutions India Pvt. Limited, E-54, Sector 81, NSEZ, Noida. Contact Person- Ahana Jawed","location":"Noida","experience":"3 - 8 Years"},{"date":"4, 5, 6 - Dec - 2019","skills":"Automation Testing, API, REST ASSURED, Framework Development","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Maveric Systems Limited, Anchorage Towers, 5th Floor, Richmond Road, Bengaluru - 560 025.","phone":"8939042333","profile":"Automation Testers \nMaveric Systems Limited","description":"Job Title: Automation Tester (API + Selenium) or (Mobile Appium + Selenium) Level of Experience: 3 to 8 Years max Job Type: Permanent position Required Skills: - API - REST ASSURED - Framework Development - Must worked framework development from scratch or Enhancement (Read & Understand existing codes to modify or change the program) as necessary in project - Banking domain/ Insurance domain preferred - Experience from UI/ Web services/ API Apparently looking for ideal candidates with good attitude to join immediately. Do feel free to call or walk down to our office for F2F Interview and walk out with an offer in hand. Walk-in Date/ Time: 4th December - 6th December , 9 AM onwards Venue: Maveric Systems Limited. Anchorage Towers, 5th Floor, Richmond Road, Bengaluru - 560 025. Contact Person: Mr. Sankar Contact No: 8939042333 Kindly do mention my name (Jeevan) on top of your RESUME to avoid duplication's and make the Interview process smoother and faster to lead into success.","location":"Bangalore","experience":"3 - 8 Years"},{"date":"4 - Dec - 2019","skills":"Java, C++/ C, Python, SQL","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"eClerx Services Limited, Quadron Business Park, Phase 2, Hinjewadi, Pune - 411 057","phone":"Not Provided","profile":"Software Programmer (Java/ Python) \neClerx Services Limited","description":"Applicant must be good in python and any scripting based programming. Should have good communication & training skills It's an advantage if the candidate has experience in script development for website data download using python or any scripting language. Highly motivated/ self-starter with a sense of ownership, willingness to learn, and desire to succeed. Must perform well in high pressure situations, balance competing priorities, and demonstrate the ability to work SHIFT TIMINGS - Rotational Shift except night shift Role & Responsbility: Develop a script which will allow to download the data from websites To learn new technology and platform quickly Ability to work with multiple internal stack holders Candidate need to prepared a report using excel 70% work will be related to development and 30% work related to reporting Very Good team player Walk-in Date: 4th December 2019 Timings: 10 AM to 12 Noon (No entry after 12) Interview Venue: eClerx Services Limited Quadron Business Park, Phase 2, Hinjewadi, Pune - 411 057 Lower Ground Floor-HR Bay POC-Illa Bachheti Contact Person- Illa Bachheti Note: Please carry all your educational,identity proof documents Mention ILLA BACHHETI-HR on the top of your CV We can offer 15100/- as a gross salary, interested should apply Please carry your CV along with an identity proof. Computer background that includes B.Tech's or BCA and MCA shall only apply Freshers can apply","location":"Pune","experience":"0 - 1 Years"},{"date":"3, 4 - Dec - 2019","skills":"Core Java and SQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Ionidea Interactive Private Limited, # 38-40, EPIP, Besides SAP LABS Whitefield, Bangalore - 560 066.","phone":"080-66581500","profile":"Java Developers \nIonidea Interactive Private Limited","description":"Educational Qualification: Graduates or Post Graduate Work Experience: 2 to 2.5 Years Skills Set: Core Java and SQL Should be ready to work at our client location Candidates interested can walk-in directly to the below address: Date: 3rd - 4th December , 9 AM onwards Interview Venue: Ionidea Interactive Private Limited, # 38-40, EPIP, Besides SAP LABS Whitefield, Bangalore - 560 066. Landmark: KTPO Stop, Near Ginger Hotel Contact Person: Suchitra Tel: 080-66581500","location":"Bangalore","experience":"2 - 5 Years"},{"date":"7 - Dec - 2019","skills":"C, C++ or JAVA","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Maventic Innovative Solutions Pvt. Limited, AECS Layout - C Block, Brookefield Bengaluru, Karnataka - 560 037","phone":"9008258494","profile":"Software Developer (Java) \nMaventic Innovative Solutions Pvt. Limited","description":"BE/ B-Tech/ MCA/ MSc/ M-Tech - 2017/ 2018/ 2019 Passouts NO Current Backlogs Should have minimum 6 months of experience in Java Programming Strong in at least One Programming Languages like C, C++ or JAVA Experience with test-driven development Must be very strong in JAVA Programming There will be a written coding / programming assessment, so candidates must be prepared for it. Walk-in Date/ Time: 7th December 2019, 9 AM onwards Interview Venue: Maventic Innovative Solutions Pvt. Limited AECS Layout - C Block, Brookefield Bengaluru, Karnataka - 560 037 Contact Person - Soumi Mitra Tel: 9008258494 PLEASE BRING ALONG 2 PASSPORT SIZE PHOTOGRAPH FOR THE INTERVIEW","location":"Bangalore","experience":"1 - 4 Years"},{"date":"3, 4, 5 - Dec - 2019","skills":"Java/ J2ee, Struts, Spring, Hibernate, Tomcat CSS, HTML, JavaScript","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Spoors Technology Solutions India Pvt. Limited, 4th Floor, Sai Prithvi - Cyber Arcades, Above Bata Showroom, Indian Oil Petrol Bunk, Madhapur, Hyderabad.","phone":"Not Provided","profile":"Java/ J2EE Developer \nSpoors Technology Solutions Pvt. Limited","description":"Candidates should have 2 to 6 years experience as a Java/ J2EE developer. Experience with Struts, Spring, Hibernate and Tomcat CSS, HTML, JavaScript, XML, JSON, AJAX and JSP. Knowledge of Javascript and HTML is desirable. Database design and modelling skills (preferably in MySQL) Looking for Immediate joins only Walk-in Date/ Time: 3rd - 5th December , 10 AM onwards Interview Venue: Spoors Technology Solutions India Pvt. Limited, 4th Floor, Sai Prithvi - Cyber Arcades, Above Bata Showroom, Indian Oil Petrol Bunk, Madhapur, Hyderabad. Contact Person - Sudeepthi","location":"Hyderabad","experience":"2 - 6 Years"},{"date":"3, 4 - Dec - 2019","skills":"Java, J2EE, Spring, JDBC, GWT, Multithreading","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Estel Technologies Private Limited, #126, Sector 44, Institutional Area Gurgaon, Haryana","phone":"0124-2578204","profile":"Sr. Java Professional \nEstel Technologies Private Limited","description":"Person must have 2.5+ to 8 years of Core JAVA in an application development environment. Well versed in Core Java. Which includes Springs, Hibernate, Webservices and Multi-threading. Knowledge of Java related technologies such as J2EE, Spring, JDBC, GWT, Multithreading. Proficient in: SQL/ Database Concepts/ LINUX/ UNIX/ ORACLE Development, deployment and testing Agile Methodology Review currently running architecture Strong Core JAVA development experience Good understanding Architectural Design Patterns Experience in refactoring and working with existing code Solid database experience Walk-in Date/ Time: 3rd - 4th December 2019, 11 AM onwards Interview Venue: Estel Technologies Private Limited #126, Sector 44, Institutional Area Gurgaon, Haryana Contact Person - Nitanjali/ Saif/ Smita Phone No. 0124-2578204","location":"Gurgaon","experience":"2 - 8 Years"},{"date":"7 - Dec - 2019","skills":"Core Java and App Server/ Web server (Jboss/ Tomcat), OOPS Concepts","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Zycus Infotech Private Limited, Seepz Gate No.3, Andheri East, Mumbai, Maharashtra","phone":"Not Provided","profile":"Sr. Java Developer/ Lead \nZycus Infotech Private Limited","description":"Zycus is conducting a drive for good Java Developers with experience of about 2 to 8 years, and having strong hands working with Core Java and App Server/ Web server (Jboss/ Tomcat). Strong Understanding of OOPS concepts Expert in Core Java and in-depth knowledge on technology and end to end development processes. Good Understanding of BPM frameworks - jBPM Basic Understanding of BigData and Text Processing Frameworks - MapReduce, NoSQL, Lucene, Solr. Proficient understanding of J2EE Strong understanding of APIs (REST/SOAP) Good knowledge in API design. Proficient understanding of RDBMS Concepts Strong understanding of Databases. Strong Understanding of Application Servers - jBOSS (Community/Enterprise ), Weblogic Good Understanding of ESB, ETL Good Understanding of SOA based frameworks Good Knowledge on Design Patterns. Knowledge of Agile product management. Walk-in Date: 7th December 2019 Time: 9 AM - 12:00 PM Interview Venue: Zycus Infotech Private Limited Seepz Gate No.3, Andheri East, Mumbai, Maharashtra INTERVIEW PROCESS: Coding Test Personal Interview Final Interview Please bring 2 copies of your resume. No Two Wheelers/ four Wheelers are allowed inside SEEPZ for interview process.","location":"Mumbai","experience":"2 - 8 Years"},{"date":"7 - Dec - 2019","skills":"Java Script, React JS, J2EE, Java, Spring, Hibernate, EST APIs, Redis, Elastic Search","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Habile Technologies Private Limited, 1st floor, Janaki Complex, L. B Road, Thiruvanmiyur, Chennai - 600 041","phone":"8754518610","profile":"Full Stack Java Developer \nHabile Technologies Private Limited","description":"We have urgent requirement for Full Stack/ Java Developers with the below skill sets- Experience with Front end & Back end, Web App, development in Java Script, React JS, J2EE, Java, Spring, Hibernate, EST APIs, Redis, Elastic Search, MySQL, HTML, Angular JS. Experience with Amazon Web Services, with knowledge of AWS Services. Experience Range: 4 to 5 Years Notice Period: Immediate to 2 Month Walk-in Date/ Time: 7th December 2019, 10 AM onwards Interview Venue: Habile Technologies Private Limited 1st floor, Janaki Complex, L. B Road, Thiruvanmiyur, Chennai - 600 041 Contact Person- Janet Tel: 8754518610","location":"Chennai","experience":"4 - 5 Years"},{"date":"6 - Dec - 2019","skills":"Java/ J2ee, Spring/ Spring boot and Webservices","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Renault Nissan Technology (India) Pvt. Limited, Ascendas Tech Park, Mahindra World City SEZ, Plot No TP2/1, Natham Sub Post Office, Phase I, 3rd Floor, Chengalpet, Kancheepuram District, Tamilnadu - 603 002","phone":"Not Provided","profile":"Java Developers \nRenault Nissan Technology (India) Pvt. Limited","description":"RENAULT NISSAN TECHNOLOGY & BUSINESS CENTER INDIA PVT LTD is looking for Java developer. Candidate should have experience in the development of Responsive Web applications Strong Experience in Java/ J2ee, Spring/ Spring boot and Webservices Good knowledge in Agile methodology Good Communication & Analytical skills If you are interested to apply for the above position you can directly come down for F2F interview also request to share your updated resume with the below details. Interview Date 6th December 2019 Time: 9.30 am to 2.00 pm Interview Venue: Renault Nissan Technology (India) Pvt. Limited Ascendas Tech Park, Mahindra World City SEZ, Plot No TP2/1, Natham Sub Post Office, Phase I, 3rd Floor, Chengalpet, Kancheepuram District, Tamilnadu - 603 002 Contact Person Name Vimala.M Contact No. 9444074291","location":"Chennai","experience":"3 - 5 Years"},{"date":"7 - Dec - 2019","skills":"Java Script or Angular 6 and above or MEAN Stack/ Node","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Mirafra Software Technologies Pvt. Limited, Akshay Tech Park, 2nd Floor, EPIP Zone, Whitefield, Bangalore - 560 066.","phone":"Not Provided","profile":"UI Developer (Java Script/ Angular) \nMirafra Software Technologies Pvt. Limited","description":"We are conducting Face- to- Face interview on Dec 7th,2019 @ Mirafra Technologies in Whitefiled. Required Skills: Strong in Java Script or Angular 6 and above or Strong in MEAN Stack/ Node Must be good in Software Programming Walk-in Date/ Time: 7th December 2019, 9 AM onwards Interview Venue: Mirafra Software Technologies Pvt. Limited Akshay Tech Park, 2nd Floor, EPIP Zone, Whitefield, Bangalore - 560 066. LAND MARK:- Back Side of GE Health, Vydehi bus stop Contact person: Geetu Mishra Note : Irrelevant profiles will not be taken ahead in interview process.","location":"Bangalore","experience":"3 - 8 Years"},{"date":"3 - Dec - 2019","skills":"Backend Operations, Policy Management, Claims Processing","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"AXA XL (Formerly Known as XL Catlin) 5th Floor, 2A Building, West Tower Vrindavan Tech Village (Embassy Tech Village), SEZ Devarabeesanahalli, Varthur Hobli Outer Ring Road, Bengaluru - 560 103","phone":"8042524554","profile":"Backend Process Executive \nXL India Business Services Pvt. Limited","description":"Candidate should have University Degree with minimum aggregate of 50% Should have 1 to 4 years of experience in BFSI or IT/ ITES or insurance oriented roles. Must have excellent communication skills. Basic MS Excel skills. Attention to details, analytical thinking skills, Ability to investigate, open-mind: Ability to search for new solutions, proactive, team player. Walk In Drive on Tuesday, 3rd December 2019, Timing: 9.30 AM to 12.30 PM Address- AXA XL (Formerly Known as XL Catlin) 5th Floor, 2A Building, West Tower Vrindavan Tech Village (Embassy Tech Village), SEZ Devarabeesanahalli, Varthur Hobli Outer Ring Road, Bengaluru - 560 103","location":"Bangalore","experience":"1 - 4 Years"},{"date":"3, 4, 5 - Dec - 2019","skills":"Technical Support, window support, OS, Networking","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Sutherland Global Services Private Limited, SHRIRAM THE GATEWAY, IT / ITES SEZ, A1 Ground Floor, # 16, GST Road, Perungalathur, Chennai - 600 063","phone":"Not Provided","profile":"Technical Support (Voice Process) \nSutherland Global Services Private Limited","description":"Candidate should have good knowledge on window support, OS, Networking, Connectivity issue knowledge. Looking for candidate who join immediately and 15 days of notice can apply. Candidate should be flexible to work for rotational night shift. Cab facility will be given for night shift. Eligibility Criteria: Freshers with excellent communication and basic Technical knowledge are eligible for this process. Candidates with minimum 6 months of Technical support with position L1/L2 International voice experience are eligible. Candidates from a Non BPO with Technical Support Experience with good communication skills are eligible to apply. Benefits : Cab facilities (Within the boundary limits) Excellent Growth Huge Incentives Looking for people who are flexible to work in any shift timings (pre-dominantely nights). Age not above 32yrs. Job location : Chennai Interview Dates : 3rd to 5th December 2019 Time : 10.00 Am to 12.30 Pm Interview Venue: Sutherland Global Services Private Limited SHRIRAM THE GATEWAY, IT / ITES SEZ, A1 Ground Floor, # 16, GST Road, Perungalathur, Chennai - 600 063 Reference ID : Vandhana HR [Write on top of your resume] Carry your ID proof for security clearance and don't carry any gadgets like Laptop, pendrive, etc","location":"Chennai","experience":"1 - 5 Years"},{"date":"3, 4 - Dec - 2019","skills":"Customer Service / International Voice / Chat Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Tech Mahindra Limited, Opposite to Wipro, Beside Bhullaya College, Gate No: 1, Madillapalem, Visakhapatnam","phone":"Not Provided","profile":"Customer Support (Chat Process) \nTech Mahindra Limited","description":"Education: Undergraduate or Graduate (Any Stream) Preferably Freshers or Experienced. Key Skills Required: Strong soft skills and need to have a good command over English. Proficient in Typing Skills (30wpm, 90%) Work Location: Visakhapatnam Shift Timings: 24*7 Immediate Joining Walk-In Date: 3rd - 4th December 2019, 10 AM onwards Timings from 10.30 AM to 3:00 PM Interview Venue: Tech Mahindra Limited, Opposite to Wipro, Beside Bhullaya College, Gate No: 1, Madillapalem, Visakhapatnam Contact Person- Vishal Khanna","location":"Visakhapatnam","experience":"0 - 3 Years"},{"date":"2, 3, 4, 5, 6, 7 - Dec - 2019","skills":"Email Support, International Voice Process, Customer Service, Content Writing","qualification":"Diploma, B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"IGT Solutions Private Limited, 3rd Floor, InfoTech Centre, 14/2 Old Delhi Gurgaon, Dundahera, Gurgaon Haryana - 122 016","phone":"7838661787","profile":"Back Office Associate \nIGT Solutions Private Limited","description":"IGT is hiring for Travel executives for an International process, the profiles includes B2C, B2G, B2T & Loyality Membership handling for customers through Calls, emails and back office activities including- Claim Re-issue/ Cancellation/ Refund New Reservation Claim Handling Loyality Membership Management Transport: Both side transport facility Shifts: Rotational/ Night Requirements: Graduate/ Undergraduate/ Drop out Fresher /Experience can apply Excellent Verbal and written skills Required Walk-in Date/ Time 2nd - 7th December 2019, 12 PM onwards Interview Venue: IGT Solutions Private Limited 3rd Floor, InfoTech Centre, 14/2 Old Delhi Gurgaon, Dundahera, Gurgaon Haryana - 122 016 Contact Person-Jaspreet Kaur Tel: 7838661787","location":"Gurgaon","experience":"1 - 3 Years"},{"date":"5, 6, 7, 9, 10, 11, 12 - Dec - 2019","skills":"Customer Service, Technical Support, Web Technologies","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Endurance International Group (India) Pvt. Limited, Unit No. 501, 5th Floor, Unit - IT building No. 3, Nesco IT park, Nesco Complex, Western Express Highway, Goregaon (East) Mumbai - 400 063","phone":"Not Provided","profile":"Technical Support Engineer \nEndurance International Group (India) Pvt. Limited","description":"Educational Qualifications: Graduate from any stream. Any Engineering, or BSc (IT or Computers) preferred Experience: 0 to 2 years in Customer Service or similar capacity, preferably on an IT platform Must be customer focused and willing to do whatever it takes to resolve customer issue Strong customer interaction skills and ability to work in a variety of customer situations Outstanding written and verbal communication skills Ability to solve complex problems quickly, inventively and resourcefully Good working knowledge of computers and the internet; strong ability to develop new skills Job Responsibilities: Troubleshooting, resolving all technical issues related to our software and the range of products and services it provisions Interacting with clients via. live chat, web based systems, online forums and telephone to resolve their problems and gather feedback Testing & analysis of all products & services Identifying any bugs/issues in the system and assisting in their resolution Recording, tracking and reporting problem activity Building strategies to improve efficiency, profitability and quality of service Reviewing existing product/feature documentation publish documentation in internal knowledge bases Walk-in Date/ Time: 5th - 12th December 2019, 10 AM onwards Interview Venue: Endurance International Group (India) Pvt. Limited Unit No. 501, 5th Floor, Unit - IT building No. 3, Nesco IT park, Nesco Complex, Western Express Highway, Goregaon (East) Mumbai - 400 063. Contact Person- Srishti","location":"Mumbai","experience":"0 - 2 Years"},{"date":"3, 4 - Dec - 2019","skills":"Technical Support, Product Support, Customer Support","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"HCL Technologies Limited, BSERV A-22, Sector -60, Noida. Nearest Metro Station- Noida, Sector-59.","phone":"9971154226","profile":"Hardware Support Engineer \nHCL Technologies Limited","description":"We are looking for Engineers Product Support- Technical Support to provide enterprise-level assistance to international Voice process (US Shift). Diagnose and troubleshoot software and hardware problems and help clients to install applications and programs. Candidate must have proven work experience as a Technical Support Engineer, Desktop Support Engineer, IT Help Desk Technician. Hands-on experience with Windows/ Linux/ Mac OS environments. Ability to diagnose and troubleshoot basic technical issues, Must have excellent problem-solving and communication skills. Good understanding of computer systems, mobile devices and other tech products Ability to provide step-by-step technical help, both written and verbal Additional certification in Microsoft, or similar technologies is a plus. Immediate Joiners required Walk-in Date/ Time: 3rd & 4th December from 11 AM onwards Venue details: HCL Technologies Limited BSERV A-22, Sector -60, Noida. Nearest Metro Station- Noida, Sector-59. Kindly mention Vikas Kapoor as a source on top of your CV. Tel Number -9971154226","location":"Noida","experience":"1 - 6 Years"},{"date":"3 - Dec - 2019","skills":"Technical Support, Networking, Active Directory, System Administration","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Ideapoke Technologies Private Limited, #221, 2nd Floor, 7th Main, 2nd Block, HRBR Layout, Kalyan Nagar, 7th Main Road, HRBR Layout 2nd Block, Banasawadi, Bengaluru, Karnataka - 560 043","phone":"Not Provided","profile":"Network Support & System Administrator \nIdeapoke Technologies Private Limited","description":"Minimum 5+ years' experience in system administration Associate or higher degree in a related field Extensive experience with system support. Advanced knowledge of system vulnerabilities and security issues Ability to respond to help desk requests after hours on a limited basis Preferred Expertise and Certifications: Microsoft Certified Solutions Expert (MCSE) Cisco Certified Network Associate (CCNA) Oracle Certified Associate (OCA) Experience of AV and Video Conferencing hardware and software. Walk-in Date/ Time: 3rd December 2019, 10 AM onwards Interview Venue: Ideapoke Technologies Private Limited #221, 2nd Floor, 7th Main, 2nd Block, HRBR Layout, Kalyan Nagar, 7th Main Road, HRBR Layout 2nd Block, Banasawadi, Bengaluru, Karnataka - 560 043 Contact Person- Suman","location":"Bangalore","experience":"5 - 8 Years"},{"date":"2, 3, 4, 5, 6, 7 - Dec - 2019","skills":"Data Processing, Publishing, Backend/ Non Voice Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Patel Information Technology Services, 4th Floor, DN-11, DN Block, Sector V, Bidhannagar, Kolkata, West Bengal - 700 091.","phone":"Not Provided","profile":"Data Processing Executive \nPatel Information Technology Services","description":"Candidate should have Any Degree/ Diploma able to read basic English. Must have good command over keyboard and mouse. Should know Ms Office and Photoshop. Job Work: Copy / Paste and Edit data from source files into word files. Edit images from source file into jpeg files. Use basic software and tools provided by the company. Job has a basic target and incentive for crossing tragets, Walk-in Date/ Time: 2nd - 7th December 2019, 10 AM onwards Interview Venue: Patel Information Technology Services 4th Floor, DN-11, DN Block, Sector V, Bidhannagar, Kolkata, West Bengal - 700 091. Contact Person- AKSHAT PANDEY","location":"Kolkata","experience":"0 - 2 Years"},{"date":"2, 3, 4, 5, 6 - Dec - 2019","skills":"ASP .NET, C#, MVC, SQL, Web API, Angular JS, HTML, CSS, JQuery, Bootstrap.","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Digital Minds Software Solutions Private Limited, 2nd Floor, A-Wing, Softsol Building, #4 Infocity, Beside Mindspace, Hi-tech City, Madhapur, Hyderabad, Telangana - 500 081.","phone":"040 66885669","profile":"Software Engineers (.Net) \nDigital Minds Software Solution Pvt. Limited","description":"Educational Qualification: B. Tech/ MCA Work Experience: 2 to 3 Years Process: .Net Domain Shift Timings: 9:00 am to 6:00 pm. Experience in designing web applications using HTML, CSS, Bootstarp, JQuery, Angular JS. Experience on Developing applications using ASP .Net MVC & C#. Writing and Consuming Web services & Web API. Experience on SQL Server and dealing database using Entity Framework. Knowledge on Kentico is an added advantage. Interview Date: 2nd to 6th December 2019 Timings: 10:00 Am to 4:00 Pm Interview Venue: Digital Minds Software Solutions Private Limited 2nd Floor, A-Wing, Softsol Building, #4 Infocity, Beside Mindspace, Hi-tech City, Madhapur, Hyderabad, Telangana - 500 081. Contact Person- Kalpna G Contact No. 9063610208/ 040 66885669","location":"Bangalore","experience":"2 - 3 Years"},{"date":"7 - Dec - 2019","skills":".NET Core 2.0, MVC, SQL, Azure, Bootstrap, Angular, WebAPI","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Wipro Limited, EC4, Tower-15, GF, B-Wing, Electronics City, Bangalore","phone":"Not Provided","profile":".Net MVC Professional \nWipro Limited","description":"Work Experience : 4 years to 10 years Required Skills- ASP .NET Core (Mandatory) Primary Skills: .NET Core 2.0 (Mandatory) MVC (Mandatory) SQL Azure Bootstrap for .Net MVC 5 Angular WebAPI Walk-In Date : 7th December 2019 (Sat) Time : 9:30 AM onwards Walk In Location: Wipro Limited, EC4, Tower-15, GF, B-Wing, Electronics City, Bangalore","location":"Bangalore","experience":"4 - 10 Years"},{"date":"7 - Dec - 2019","skills":"ASP .NET/ C#.NET, SQL Server, AJAX","qualification":"B.E./B.Tech, MCA/PGDCA","address":"ProPhoenix Technologies Pvt. Limited, Campus Tek Meadows, C Block First Floor, No: 51 Rajiv Gandhi Salai, Sholinganallur, Chennai - 600 119","phone":"48686111","profile":".Net Developer/ Team Lead \nProPhoenix Technologies Pvt. Limited","description":"We have excellent immediate openings for .Net developers/ Senior Software Engineers/ Team Lead/ Tech Lead . Required skills: ASP .NET/ C#.NET, SQL Server, AJAX Excellent in Design, Programming, Analyzing, Debugging and implementing new features. Should be able to do peers code review. Should have SDLC Process. Good communication skills. If interested, please directly Walk-in to the below mention address: Interview Date: 7th Dec 2019 (Saturday) Time: 9:00 AM to 12:00 PM Interview Venue: ProPhoenix Technologies Pvt. Limited Campus Tek Meadows, C Block First Floor, No: 51 Rajiv Gandhi Salai, Sholinganallur, Chennai - 600 119 Land mark: Opposite to Accenture Bus Stop: Dollar Bus stop (next to Karapakkam) Contact Person: Asha Asha@prophoenix.com or 9003999546 Divya - divya@prophoenix.com or 9003999597","location":"Chennai","experience":"4 - 9 Years"},{"date":"3 - Dec - 2019","skills":".Net, ASP .Net, MVC, Angular JS","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Congruent Info-Tech Private Limited, Type II/4, Dr.V.S.I. Estate, Thiruvanmiyur Chennai - 600 041.","phone":"Not Provided","profile":".Net Developer/ Fresher \nCongruent Info-Tech Private Limited","description":"Candidate should have 0 to 2 years of experience in Software Development using .Net, ASP .Net, MVC, Angular JS. Substantially contribute to the development efforts for a product through the entire software development lifecycle - including architecture, development and QA. Support the development and maintenance of the project schedule based on individual as well as project team availability. Actively manage project scope to keep project on schedule. Exercise judgment within generally defined best practices and policies in selecting methods and techniques for providing solutions. Troubleshoot, debug, and sustain product through lifecycle. Walk-in Date/ Time: 3rd December 2019, 10 AM onwards Interview Venue: Congruent Info-Tech Private Limited Type II/4, Dr.V.S.I. Estate, Thiruvanmiyur Chennai - 600 041. Contact Person- K. Priya","location":"Chennai","experience":"0 - 2 Years"},{"date":"2, 3, 4, 5, 6, 7, 9, 10, 11, 12, 13, 14 - Dec - 2019","skills":".NET MVC/ Web API, C#, Microsoft Azure, SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Cuembux Software Solutions Pvt. Limited, Vatika Business Centre, Level-5, Panchsheel Tech Park One Shashtri Nagar, Yerwada, Pune, Maharashtra - 411 006","phone":"8263072261","profile":"Senior .Net Developer \nCuembux Software Solutions Pvt. Limited","description":"Minimum 3-5 years of experience in .NET MVC/ Web API, C# Basic knowledge of Microsoft Azure. Candidate should have worked on Entity framework 6.0 Candidate should have working experience with SQL Server. Candidate should be expert in C#, REST APIs. Good to Have skills: .NET Core is added advantage. Knowledge of Any other cloud platform is again added. Angular 2.0+, JavaScript/ jQuery. Good communication skill. Walk-in Date/ Time: 15th November - 31st December , 10 AM onwards Interview Venue: Cuembux Software Solutions Pvt. Limited, Vatika Business Centre, Level-5, Panchsheel Tech Park One Shashtri Nagar, Yerwada, Pune, Maharashtra - 411 006 Contact - HR (8263072261)","location":"Pune","experience":"3 - 8 Years"},{"date":"2, 3, 4, 5, 6, 9, 10, 11, 12, 13 - Dec - 2019","skills":".Net, OOP's, Java Script, Jquery, RDLC, SQL, MVC","qualification":"B.E./B.Tech, MCA/PGDCA","address":"INNOWAVE COMPANY, Office No. 501 504 5th floor Pentagon 3 Magarpatta City, Hadpasar Pune - 411 013.","phone":"020 67000000","profile":".Net Developer \nS2 Infotech International Limited","description":"Person must have strong knowledge of OOP's, Java Script, Jquery, RDLC, Reports Design. Should have basic knowledge of SQL, MVC and Third Party control Like Telerik. Walk-in Date: 2nd - 30 December (Monday to Friday) Timing : 10.30 AM to 5.30 PM Venue: INNOWAVE COMPANY Office No. 501 504 5th floor Pentagon 3 Magarpatta City, Hadpasar Pune - 411 013. Contact Person- Ms Ashwini Contact No: 020 67000000","location":"Pune","experience":"1 - 5 Years"},{"date":"2, 3 - Dec - 2019","skills":"Java, OOPS, .Net","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Mystifly Consulting India Private Limited, Azygos Building, No. 885, 1st Stage 4th Block, HBR Layout Bangalore - 560 043.","phone":"Not Provided","profile":"Software Engineers (Java/ .Net) \nMystifly Consulting India Private Limited","description":"Qualification: BE/ B.Tech/ ME/ M.Tech (2019 Passout Only) Very good programming skills Knowledge of OOPs concept Good Aptitude, analytical and problem solving skills are necessary Very good communication skills Willing to learn new skills Walk-in Date/ Time: 2nd - 3rd December 2019, 12 PM onwards Interview Venue: Mystifly Consulting India Private Limited Azygos Building, No. 885, 1st Stage 4th Block, HBR Layout Bangalore - 560 043. Contact Person- Benoy J K","location":"Bangalore","experience":"0 - 1 Years"},{"date":"2, 3 - Dec - 2019","skills":"Software Testing, QA methodologies, Testing fundamentals and STLC process.","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Contrado Imaging India Pvt. Limited, B-1908, 1909, 1910, Westgate, Near YMCA Club, S.G. Road, Ahmedabad (Gujarat),","phone":"Not Provided","profile":"QA Engineer/ Manual Tester \nContrado Imaging India Pvt. Limited","description":"Educational Qualifications: Atleast Bachelor's Degree in Computer Experience: 1-4 years of experience in QA Essential Skills - Abilities Proven work experience in Software testing and quality assurance. Strong knowledge of S/W QA methodologies, Testing fundamentals and STLC process. Strong understanding of SDLC and methodologies. Experience writing clear, comprehensive and concise test cases/scenarios. Hands on experience with Black-box testing and grey-box should be added advantage. Good analytical skill is essential to make the testing work easier. Well versed with any defect tracking tool and added advantage if test management tool is known. Experience working in AGILE/Scrum methodology. Should have basic understanding and knowledge on any Database system. Automation knowledge will be an added advantage. Experience with performance and/or security tool will be an added advantage. Benefits- Enjoyable atmosphere, fast-paced, fun, and creative environment Competitive salary to skill level with potential 10-15% overtime bonus 50% preferential staff discount Employee of the month bonus Walk-in Date: 2nd - 3rd December 2019 Reporting Time: 9 AM to 11 AM (Mon-Tues) Interview Venue: Contrado Imaging India Pvt. Limited B-1908, 1909, 1910, Westgate, Near YMCA Club, S.G. Road, Ahmedabad (Gujarat), Contact Person- Pooja","location":"Ahmedabad","experience":"1 - 4 Years"},{"date":"3 - Dec - 2019","skills":"PHP, Perl, Ruby, Shell Scripting, MySQL","qualification":"B.E./B.Tech","address":"Ebizon Net Info Private Limited, 7th Floor, Tower A, Logix Cyber Park, C-28-29, Industrial Area, Sector 62, Noida","phone":"Not Provided","profile":"PHP Developer \nEbizon Net Info Private Limited","description":"Candidate should be B.Tech (CS/ IT) with 70% throughout academics Good communication, ability to perform in team environment. Must have strong coding and Strong analytical skills Familiarity with at least one modernPHP-based web or application development framework. Experience with at least one modern programming or scripting languages. PHP, Perl, Ruby, Shell Scripting is preferable. Database experience (preferably MySQL) Enthusiasm for open-source philosophy and community involvement. Hard working, motivated and driven by an unknown force to improve the web. Intellectual curiosity and passion for making really cool apps for web. WALK-IN Details: Date - 3rd December 2019/ Tuesday Time - 11:00 AM - 3:00 PM Interview Venue- Ebizon Net Info Private Limited 7th Floor, Tower A, Logix Cyber Park, C-28-29, Industrial Area, Sector 62, Noida","location":"Noida","experience":"1 - 3 Years"},{"date":"2, 3, 4, 5 - Dec - 2019","skills":"General Administration, Travel Desk, Hotel Booking & Vendor Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Shubhalakshmi Polyesters Limited, 6th Floor, Deluxe House B/50, Off New Link Road, Opposite City Mall, Andheri West, Mumbai - 400053","phone":"Not Provided","profile":"Administration Executive \nShubhalakshmi Polyesters Limited","description":"Candidate should be minimum Graduate in any stream with 2 to 4 years of experience in General Administration, Travel Desk, Hotel Booking & Vendor Management. Should have excellent communication skills Job Responsibilities- Vendor Management Travel Desk Making all Travel arrangement & Booking, Hotel booking, Car booking All Office administrative work Managing stationary, Housekeeping, all AMC etc. Walk-in Date/ Time: 2nd - 5th December , 11 AM onwards Interview Venue: Shubhalakshmi Polyesters Limited 6th Floor, Deluxe House B/50, Off New Link Road, Opposite City Mall, Andheri West, Mumbai - 400053 Contact Person - Anamika","location":"Mumbai","experience":"2 - 4 Years"},{"date":"2, 3 - Dec - 2019","skills":"IT Fresher/ Tester","qualification":"B.E./B.Tech, MCA/PGDCA","address":"ThinkSys Software Private Limited, Discovery Tower, A-17, Block A,7th Floor, Sector 62, Noida, Uttar Pradesh - 201 301.","phone":"0120-4562034","profile":"Trainee Developer/ Tester \nThinkSys Software Private Limited","description":"Looking for B.Tech, BE & MCA (2019 Batch) students for Three months In house Training programme for Software Development & Software Testing. Freshers of 2019 Batch Pass outs only. Academics 70% throughout (In 10th, 12th & Graduation) Mandatory Must have good communication skills Selected candidates have to undergo an in house Training. (Training Duration: Initial 3 months) Stipend (during training period): Rs. 12,000 per month During training period candidates will work on live projects. After Training Period one assessment test will be there, candidates who will clear this test will be taken on roll. Selection process 1. Written Test comprising Math, Reasoning and English questions. 2. Technical Interview Walk-in Date: 27th November - 3rd December, 2019 Timings:10:30 AM - 4 PM Interview Venue: ThinkSys Software Private Limited Discovery Tower, A-17, Block A,7th Floor, Sector 62, Noida, Uttar Pradesh - 201 301.","location":"Noida","experience":"0 - 1 Years"},{"date":"3, 4, 5, 6 - Dec - 2019","skills":"Automation Testing, Test engineering, Automation tools, Selenium, testing tools","qualification":"B.E./B.Tech, MCA/PGDCA","address":"India IS Global Service Center (GSC), 10th, Floor Prestige Centre Court,, Chennai, Tamilnadu - 600 026","phone":"66051102","profile":"Automation Test Engineer \nExpeditors International (India) Pvt. Limited","description":"Qualifications: Preferably MCA/ B Tech/ BE/ Bachelors Degree in Computer Science Essential Experience: 5+ years of experience in a technical Quality Assurance role Proficient in at least one object-oriented programming language (Preferably Java Proficient in automation tool Protractor with Jasmine for Angular application Proficient at scripting in one or more languages(Preferably TypeScript/JavaScript) Proficient at working with databases, web application frameworks and command line interfaces Proficient at developing test automation framework from scratch Good to have experience in Selenium with Cucumber Should train and enhance other QA team members Preferred Experience: Strong object-oriented design and coding skills Working knowledge of Java application development and Windows/ UNIX/ Linux systems Experience in Agile development Understanding of the transportation/global logistics industry Walk-in Date/ Time: 3rd - 6th December , 10 AM onwards Interview Venue: The Forum Vijaya Mall, 10th Floor, Prestige Center Court, 183, N.S.K. Salai, Kumaran Colony, Vadapalani, Chennai, Tamil Nadu - 600 026 Contact Person- Sindhuja Amilthamozhian Tel: 66051102","location":"Chennai","experience":"4 - 7 Years"},{"date":"2, 3, 4, 5, 6, 9, 10, 11, 12, 13 - Dec - 2019","skills":"Software Testing, SDLC, Waterfall and Agile/ SCRUM Methodologies","qualification":"B.E./B.Tech, MCA/PGDCA","address":"INNOWAVE COMPANY, Office No. 501 504 5th floor Pentagon 3, Magarpatta City Hadpasar, Pune - 411 013","phone":"020 67000000","profile":"Software Tester \nS2 Infotech International Limited","description":"Person must have excellent understanding of Software Development Lifecycle (SDLC), including Waterfall and Agile/ SCRUM methodologies. Should have experience in creating Test plans, implementing automation frameworks and converting Functional Specifications into test scenarios. Experience with SW lifecycle tools like defect management, test case management, release management etc. Knowledgeable in database applications and data management with the skills to manipulate test data and experience with SQL. Experience with RDBMS, preferably SQL Server and technology background in .Net, C# Walk-in Date: 2nd - 30th December 2019 (Monday to Friday) Timing : 10.30 AM to 5.30 PM Interview Venue: INNOWAVE COMPANY Office No. 501 504 5th floor Pentagon 3, Magarpatta City Hadpasar, Pune - 411 013 Contact No : 020 67000000 Contact Person - Ms Ashwini","location":"Pune","experience":"1 - 6 Years"},{"date":"2, 3, 4, 5, 6, 9, 10, 11, 12, 13 - Dec - 2019","skills":"General Administration, Front Office/ Receptionist Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"GGS Information Services (India) Pvt. Limited, Trifecta Adatto Techpark, No 66/2. 67/1, 10th Floor, Whitefield Main Road, Garudacharpalya, Mahadevpura Post, Bangalore - 560 048","phone":"8050369001","profile":"Front Office/ Admin Executive \nGGS Information Services (India) Pvt. Limited","description":"Candidate should be Any Graduate with 0 to 1 year of experience in General Administration, Front Office/ Receptionist Activities. Must have excellent communication skills. Duties & Responsibilities: Greeting and attending to inquires HR Activities Admin Activities Organise and maintain files and records; update when necessary Basic Computer Knowledge Strong communication and people skills Good organizational and multi-tasking abilities Walk IN with your CV/ Resume between 10:30 Am to 5 Pm Date: 2nd - 13th December 2019 (Monday to Friday) Interview Venue: GGS Information Services (India) Pvt. Limited Trifecta Adatto Techpark, No 66/2. 67/1, 10th Floor, Whitefield Main Road, Garudacharpalya, Mahadevpura Post, Bangalore - 560 048 Landmark: Next to Phoenix Mall (Near Decathlon)","location":"Bangalore","experience":"0 - 1 Years"},{"date":"2, 3, 4, 5, 6, 7, 9, 10 - Dec - 2019","skills":"Front Desk/ Receptionist Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Hamstech India Private Limited, HR , 2nd Floor, RK Plaza, above PAVN Mor Jewellers, Panjagutta, Hyderabad","phone":"9100910278","profile":"Front Office Executive (Female) \nHamstech India Private Limited","description":"We are hiring Smart Female candidates for various profiles. Counsellor, Telecalling Executive, Front office, Admin. Must be Smart and good communication skills. On call experience/ freshers also can apply and walk-in for interview Walk-in Date/ Time: 2nd to 10th December , 10 AM onwards Interview Venue: Hamstech India Private Limited HR , 2nd Floor, RK Plaza, above PAVN Mor Jewellers, Panjagutta, Hyderabad Contact HR - Gazla 9100910278 / Anitha 9100445953","location":"Hyderabad","experience":"0 - 5 Years"},{"date":"30 - Dec - 2019","skills":"Manual & Functional testing, Design, write and execute","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Xavient Digital-Powered by Telus International, Plot No - 54NSEZ Phase - 2, Sector 81 Noida, Uttar Pradesh","phone":"Not Provided","profile":"Testing Engineer (Telecom) \nXavient Software Solutions India Pvt. Limited","description":"Candidate should have experience in Manual & Functional testing. Should have experience in Telecom domain in any of the components such as Billing, Provisioning, Order management etc. Design, write and execute repeatable test cases/ scripts using Quality Center. Experience of working in Agile. Create or modify test data and expected results to be used for validation using a variety of tools. Should have fair knowledge of database - SQL. Must have good understanding of entire Software Testing Life Cycle. Candidates should have good logical and analytical skills to comprehend business requirements and convert them to test cases independently. Should have good communication skills with strong client handling capabilities. Should be flexible with timings as per Project Requirements. Flexible to support different shifts as per project requirements. Experience required: 2 to 5 Years Notice Period: 30- 45 days Shift timings :- 2 pm - 11 pm Walk-in Date/ Time: 30th November 2019, 10 AM onwards Interview Venue: Xavient Digital-Powered by Telus International Plot No - 54NSEZ Phase - 2, Sector 81 Noida, Uttar Pradesh SPOC :- Jaspreet Gill/ Anchal Sharma","location":"Noida","experience":"2 - 5 Years"},{"date":"2 - Dec - 2019","skills":"Back Office, Data entry, Insurance/ Banking Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Datamatics Global Services Limited, 5th Floor, The Great Oasis Building, Road No.21, MIDC, Andheri - East, Mumbai","phone":"Not Provided","profile":"Back Office/ Data Entry (Male Only) \nDatamatics Global Services Limited","description":"We have an excellent opportunity in Insurance Data entry for Reputed Bank Process: Desired Skills : H.S.C. pass / Any Graduate Freshers are welcome Basic Typing speed Employment Type : Contractual (6 months) Work Experience : 0 to 1 year No of Openings : 30 Shifts: (Rotational) : Night - 11.30 pm to 6.30 am (Major) Afternoon - 3 pm to 11.30 pm Job Responsbility: Medical Data entry for Bank insurance process Process Training will be provided Salary : Net - 10,000/- per month Walk-in Date: Monday, 2nd December Interview Time: 2 pm to 5 pm Interview Venue : Datamatics Global Services Limited 5th Floor, The Great Oasis Building, Road No.21, MIDC, Andheri (East) Mumbai Landmark : Passport Office building Near Sainath Nagar Bus stop (Bus from station - 434)","location":"Mumbai","experience":"0 - 1 Years"},{"date":"2, 3, 4, 5, 6 - Dec - 2019","skills":"C/ C++, PHP, JavaScript, JQuery, HTML, CSS, Jquery, WordPress, Codeigniter","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Council of Education & Development Pvt. Limited, 5th Floor, New English High School, Ram Maruti Road, Thane (Weat) - 400 602","phone":"9152013064","profile":"PHP Developer \nCouncil of Education & Development","description":"Council of Education and Development Programmes Private Limited is looking for PHP Developer Web Technologies. HTML, CSS, Jquery, WordPress, Codeigniter Languages C, C++, PHP, JavaScript, JQuery, Database My SQL Candidates having relevant experience may walk in for an interview at our Thane office. Date - 29 Nov 2019 - 6 December 2019 Time : 11:00 AM - 3:00 PM Interview Venue: Council of Education & Development Pvt. Limited 5th Floor, New English High School, Ram Maruti Road, Thane (West) - 400 602 Contact Person: Ms . Swati Tel No - 9152013064 Please mail your cv at jobs@cedp-edu.com before coming for interview.","location":"Mumbai","experience":"1 - 3 Years"},{"date":"7 - Dec - 2019","skills":"Php, LAMP Stack, HTML, CSS, JavaScript, AJAX, jQuery, JSON and XML","qualification":"B.E./B.Tech, MCA/PGDCA","address":"We Work, C/o Muvi LLC , 5th Floor, Spectrum Tower, Chincholi Bunder Road, Rajan Pada, Mindspace, Malad West, Mumbai - 400 064","phone":"Not Provided","profile":"PHP Developers \nMuvi Entertainment Private Limited","description":"We are hiring multiple positions at mid-senior level PHP Developers to join Muvis growing Engineering team. You will be working on some latest and greatest technology stack like Big Data, AI, Blockchain. To be successful at this role, you should be a self driven problem solver and excellent coder. Responsibilities: Build modular, testable, and reusable PHP modules Contribute in all phases of the feature release cycle Contribute ideas on using latest technologies Solve complex performance problems and architectural challenges Pay strong attention to DB designing and module dependencies Basic Requirements: 1+ years development experience on LAMP stack Front-End development with technologies such as HTML, CSS, JavaScript, AJAX, jQuery, JSON and XML Experience on any framework like Zend, YII, Symfony, Laravel, CodeIgniter, CakePHP Strong knowledge of databases modelling and design Strong experience in API design and REST based services Good understanding of Accessibility and Security Compliance Knowledge of Cloud Services and Clusters like AWS EC2, S3 Knowledge of Service Oriented Architecture would be a bonus Have Self-directed work ethic with attention to detail and good communication skills Walk-in Date/ Time: 7th December 2019, 9 AM onwards Interview Venue: We Work, C/o Muvi LLC , 5th Floor, Spectrum Tower, Chincholi Bunder Road, Rajan Pada, Mindspace, Malad West, Mumbai - 400 064 Contact - Manisha Singh","location":"Mumbai","experience":"1 - 6 Years"},{"date":"2, 3, 4, 5, 6, 9, 10, 11, 12, 13 - Dec - 2019","skills":"PHP 5+, LINUX, APACHE, MYSQL, MVC, HTML","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Greynium Information Technologies Pvt. Limited, # 74/2, 2nd Floor, Sanjana Plaza, Elephant Rock Road, 3rd Block, Jayanagar, Bengaluru - 560 011","phone":"9886610338","profile":"Web Developer (LAM/ PHP) \nGreynium Information Technologies Pvt. Limited","description":"Candidate must have experience on LAMP (Linux, Apache, MySQL, PHP) Should have experience PHP 5+ and MVC Framework Experience with web development using HTML, CSS3, JavaScript, Jquery and AJAX Experience with modern development techniques such as memcaching and REDIS Experience using a JavaScript framework such as jQuery. Experience with smarty templates and version control mechanisms Knowledge in NoSQL databases like Couchbase Walk-in Date: 25th Nov - 13th Dec, 11 AM onwards Interview Venue: Greynium Information Technologies Private Limited # 74/2, 2nd Floor, Sanjana Plaza, Elephant Rock Road, 3rd Block, Jayanagar, Bengaluru - 560 011 Contact - Ms. Vidya (9886610338) If Interested, Please contact company HR at vidya.m@oneindia.co.in Or contact on 9886610338 (WhatsApp / Call)","location":"Bangalore","experience":"1 - 6 Years"},{"date":"14 - Dec - 2019","skills":"PHP, Java Script, MySQL, Oops, Ajax, Jquer","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Biztech IT Consultancy Private Limited, C/ 801, Dev Aurum Commercial, Near Anandnagar Cross Roads, Prahlad Nagar, Ahmedabad, Gujarat - 380 015.","phone":"9537117529","profile":"PHP Developer - Trainee \nBiztech IT Consultancy Private Limited","description":"PHP - Trainee (Passout Year - 2019-2020) Benefits with Biztech: 6 M Training (stipend: Rs. 4,000 p.m) + 1.5 Yr Job Offer Live Project Work Basic to Advanced level training Soft Skill Training Guidance from experieced TL/Sr. Developers Walk-in Date/ Time: 14th December 2019, 10 AM onwards Interview Venue: Biztech IT Consultancy Private Limited C/ 801, Dev Aurum Commercial, Near Anandnagar Cross Roads, Prahlad Nagar, Ahmedabad, Gujarat - 380 015. Contact Person- Ms. Vidhi Mehta Tel: 9537117529 Note : Those who have applied before at Biztech can not reapply for the same) Role","location":"Ahmedabad","experience":"0 - 1 Years"},{"date":"2, 3, 4, 5, 6, 7 - Dec - 2019","skills":"PHP/ Codeigniter Framework MySQL/ Jquery)","qualification":"B.E./B.Tech, MCA/PGDCA","address":"FinInfocom Private Limited, VNR Arcade, Plot No 20A, 4th Floor, X Road, Nagole, Hyderabad, Telangana - 500 068.","phone":"7981744087","profile":"PHP Developer \nFinInfocom Private Limited","description":"Candidate should have 2 to 5 years of experience in PHP/ Codeigniter Framework MySQL/ Jquery with proficiency in at least one of the frameworks (CodeIgniter) Should have experience in jQuery, REST APIs, etc. Experience in handling projects independently Good language and communication skills Walk-in Date/ Time: 27 November - 31st January , 10 AM onwards Interview Venue: FinInfocom Private Limited VNR Arcade, Plot No 20A, 4th Floor, X Road, Nagole, Hyderabad, Telangana - 500 068. Contact Person- Joseph Phone: 7981744087","location":"Hyderabad","experience":"2 - 5 Years"},{"date":"2, 3 - Dec - 2019","skills":"Back Office Operations, Non Voice Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"EXL Services India Private Limited, A- 18, Noida Sector 59 Near Noida Sector 59 Metro Station","phone":"Not Provided","profile":"Back Office Executive (Female) \nEXL Services India Private Limited","description":"EXL Services India Private Limited is hiring for Non Voice/ Back Office Associates (Special Walk-in for Female Candidates) Qualification Required - Any Graduate can apply Experience: Minimum 6 months of any experience Fresher can apply Candidate should have excellent communication skills Should be OK with night/ rotational shifts Should have typing speed of 25-30+ wpm Only Female candidates need to apply Interested can walk-in on 2nd & 3rd December 2019 Time: 11:00 AM to 3 PM Interview Venue: EXL Services India Private Limited A- 18, Noida Sector 59 Near Noida Sector 59 Metro Station Contact Person - Kritika Madan Resume and Aadhar Card (original + 2 photocopy) along with 2 passport size photographs is mandatory to carry to enter inside the premises.","location":"Noida","experience":"1 - 3 Years"},{"date":"30 - Nov - 2019","skills":"Software Testing, Support, Testing Execution, Software Engineering","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Concerto Software & Systems Private Limited, Building No. 305, 2nd Floor, A- Wing, Sector 2, Millennium Business Park, Mahape, Navi Mumbai - 400 710.","phone":"Not Provided","profile":"Trainee - Software Tester \nConcerto Software & Systems Pvt. Limited","description":"Candidate will be involved in Software Testing, Support, Execution of the tasks related to support and testing. Must be clear with Basic Technology, concepts & Logic Skills Required: Should have analytical and logic skills Candidate must have good communications and interpersonal skills Should have positive & proactive attitude Candidate has to sign the service level agreement for specified tenure with the company (Mandatory). Walk-in Date: 30 November 2019 Time: 10 AM to 12 PM. Interview Venue- Concerto Software & Systems Private Limited Building No. 305, 2nd Floor, A- Wing, Sector 2, Millennium Business Park, Mahape, Navi Mumbai - 400 710. Contact Person - Komal Gavali Please carry Adhar card and Pan card.","location":"Mumbai","experience":"0 - 1 Years"},{"date":"30 - Nov - 2019","skills":"C#, .NET Framework 4.0/ 4.5, ASP .Net, AJAX, CSS 2.0/ 3.0, JQuery, LINQ MVC","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Configurator Solutions - Sahir Projects, Shoppers Orbit, Office No. 212 - 213, 2nd Floor, D - Wing, Above Big Bazar, VISHRANTWADI, PUNE - 411 015","phone":"Not Mentioned","profile":".NET Developer \nConfigurator Solutions - Sahir Projects","description":"Work Experience: 0 - 3 Years Skills & Abilities: C#, .NET Framework 4.0/ 4.5 ASP .Net, AJAX, CSS 2.0/ 3.0, JQuery, LINQ, MVC MS SQL SERVER & Other RDBMS Strong OOPS Concepts & SQL Strong problem solving & Analytical Skills Job Responsibilities: Coding & Unit Testing System Documentation Candidates with .Net & SQL Skills will be only entertained. Walk-in Date/ Time: 30 November 2019, 10 AM onwards Interview Venue: Configurator Solutions - Sahir Projects, Shoppers Orbit, Office No. 212 - 213, 2nd Floor, D - Wing, Above Big Bazar, VISHRANTWADI, PUNE - 411 015","location":"Pune","experience":"0 - 3 Years"},{"date":"30 - Nov - 2019","skills":"Java, Application Development","qualification":"B.E./B.Tech, MCA/PGDCA","address":"eCIFM Solutions India Private Limited, Plot No-507 Udyog Vihar Phase 5 Gurgaon, Haryana","phone":"Not Provided","profile":"Software Engineer - Freshers \nTech Mahindra Limited","description":"eCIFM are looking for an Application Developer engineer to develop TRIRIGA applications with quality. Candidate will be responsible for the implementation of customization within the TRIRIGA application platform, including Data validation, Form Builder, Workflow and integration and TRIRIGA Report Builder development. Developer's responsibilities include designing and implementing technical solutions along with unit testing the code developed. Desired candidate should hold a College or University degree in Computer Science or a related discipline required. Must have excellent communication skills and strong desire to learn. Strong analytical and numerical skills. Must have strong programming skills. Fresher's from a good B .School are preferred. Should be ready to join at earliest. Walk-in Date: 30th November 2019 Time: 10 am-12 pm Interview Venue: eCIFM Solutions India Private Limited Plot No-507 Udyog Vihar Phase 5 Gurgaon, Haryana Contact Person- Pooja Gupta","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"30 - Nov - 2019","skills":"Java Trained/ Freshers","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Ionidea Interactive Private Limited, # 38-40, EPIP, Besides SAP LABS Whitefield, Bangalore - 560 066.","phone":"080-66581500","profile":"Java Developer/ Freshers \nIonidea Interactive Private Limited","description":"Educational Qualification: BE/ B-TECH/ MCA/ M-TECH Eligibility : Above 60% in UG, PG, 12th and 10th Year of Pass out: 2017/ 2018/ 2019 Walk-in Date: 30 November - 1st December 2019 Time : 9.00 AM to 12.00 PM Interview Venue: Ionidea Interactive Private Limited # 38-40, EPIP, Besides SAP LABS Whitefield, Bangalore - 560 066. Landmark: KTPO Stop, Near Ginger Hotel Contact Person- Mercia ( 66581500 )","location":"Bangalore","experience":"0 - 1 Years"},{"date":"28, 29, 30 - Nov - 2019","skills":"Java MVC frameworks like Spring, Struts2, Play, etc.","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Spring Computing Technologies Pvt. Limited, Vijay Commercial Complex, DP Road, Near Guruganesh Nagar, Kothrud, Pune - 411 038","phone":"Not Provided","profile":"Java Developer \nSpring Computing Technologies Pvt. Limited","description":"Candidate should be BE or ME in CS / IT, MSc CS, MCS, MCA 3 to 10 years of hands-on experience in Java MVC frameworks like Spring, Struts2, Play, etc. Good experience in working with Databases, Schema Design, SQL Queries, ORM frameworks like Hibernate, etc. Exposure to web security features like SSL, OAuth2, etc. and web security frameworks like Spring Security, Apache Shiro, etc. Thorough understanding of Object Oriented Designing Experience on HTML/ HTML5, CSS/ CSS3, JSP, JavaScript & JQuery is desired Nice to have knowledge of Bootstrap, Thyme leaf and Angular JS Familiarity with Unit Testing frameworks Excellent logic development and analytical skills Good written and verbal communication Experience in banking domain (BFS) is an added advantage Key Responsibilities: Requirements understanding and analysis Assistance in creating software specification and software design Software development on server platforms Writing high quality optimized code Effective use of development, debugging and testing tools Guidance to other team members Walk-in Date: 28th - 30th November 2019 Time : 10.00 am to 3.00 pm Interview Venue: Spring Computing Technologies Pvt. Limited Vijay Commercial Complex, DP Road, Near Guruganesh Nagar, Kothrud, Pune - 411 038 Contact - Ms. Anushree Chaubal Important Notes : 1) Please do come for the interview with mentioned documents at scheduled date & time. 2) Work Location : Kothrud, Pune. Request you to apply if the location is convenient. 3) PLease apply if your notice period is 30 days or less (for longer notice period, please apply only if it can be negotiated)","location":"Pune","experience":"4 - 10 Years"},{"date":"7 - Dec - 2019","skills":"Java, J2ee, JSP, Servlet, JQuery, JavaScript, JSON, SQL Server","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"SHL (India) Private Limited, Tower 10B, 9th Floor, DLF Cyber City, Gurgaon, Haryana - 122 002.","phone":"Not Provided","profile":"Java Developers \nSHL (India) Private Limited","description":"Candidate should have 4 to 8 years of relevant experience with thorough understanding of OO concepts & its application in development. Should have previously worked in the position as a Java/ Web Developer developing web site/ applications. Hands-on with Spring 3.0 + Hands-on with Hibernate / JPA Hands-on with AOP Hands-on with JSP, Servlet, JQuery, JavaScript, JSON Hands-on with SQL Server Hands-on with REST Services Must have worked on one application or Web server like Glassfish, Tomcat. Experience with RDBMS database SQL Server 2012 or later, Knowledge of Oracle/ My SQL will be add-ons. Strong understanding and practical knowledge of distributed version control systems like Git. Strong knowledge of DevOps technologies and processes related to cloud solutions. Good hands on experience in using cloud based development platforms such as AWS or Azure. Walk-in Date/ Time: 7th, December 2019 from 10 AM onwards Interview Venue: SHL (India) Private Limited Tower 10B, 9th Floor, DLF Cyber City, Gurgaon, Haryana - 122 002","location":"Gurgaon","experience":"4 - 8 Years"},{"date":"30 - Nov - 2019","skills":"Java, J2EE, HTML, CSS, Java Script and AngularJS, SQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Atria Convergence Technologies Limited, ACT Fibernet Head office, 8-2-618/B, Mithila Nagar, Banjara Hills Road Number 11, Hyderabad - 500 034","phone":"9513206011","profile":"Java Developers \nAtria Convergence Technologies Limited","description":"We are looking for an Server Side Java developer responsible for the development and maintenance of applications. Your primary focus will be development of applications and their integration with other services along with constant eye of improvements through customer/user feedback. Candidate should have 1+ years of development experience Proficient with Linux, Java, J2EE, SQL Familiarity with HTML, CSS, JavaScript and AngularJS Experience with frameworks such as spring, SpringBoot and hibernate Experience with Eclipse IDE Familiarity with RESTful and SOAP APIs Knowledge of other web technologies and UI/ UX standards Knack for benchmarking and optimization Proficient understanding of code versioning tools {such as Git, Mercurial or SVN} Experience with Agile and Waterfall SDLC models Walk-in Date/ Time: 30th November 2019, 10 AM onwards Interview Venue: Atria Convergence Technologies Limited ACT Fibernet Head office, 8-2-618/B, Mithila Nagar, Banjara Hills Road Number 11, Hyderabad - 500 034 Landmarks : Care Hospital-Outpatient Center & Karvy Data Contact Person- Ranjit Joshi Tel: 9513206011","location":"Hyderabad","experience":"1 - 3 Years"},{"date":"30 - Nov - 2019","skills":"Azure, dot net, javascript, jquery, sql, Angular 8","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Technovert Solutions Pvt. Limited, Plot No 104, Kavuri Hills, Hyderabad (Land Mark - State Art Gallery/ Maa TV)","phone":"Not Mentioned","profile":"Senior .Net Developer \nTechnovert Solutions Pvt. Limited","description":"The candidate must understand very well the HTTP protocol and web app nuances. Well versed with internal workings of MVC engine Routing, Action Filters, HTTP Helpers etc. Solid C# coding skills and understanding of .NET framework Linq, Lambda, Generics, Async etc. Work Experience: 3 to 5 Years Location: Dubai/ UAE, Hyderabad Salary: INR 5,00,000 - 12,00,000 P.A. Must have strong SQL Design and development skills. Advanced Programming Principles Dependency Injection, Unit Test are plus. Experience in developing and deploying onto Azure Environment is great plus! Walk-in Date/ Time: 30 November 2019, 10 AM onwards Interview Venue: Technovert Solutions Pvt. Limited, Plot No 104, Kavuri Hills, Hyderabad (Land Mark - State Art Gallery/ Maa TV)","location":"Hyderabad","experience":"3 - 5 Years"},{"date":"22, 25, 26, 27, 28, 29 - Nov - 2019","skills":"OOPS and .Net Concepts, C#, ASP .Net, and MS SQL 2008/ 2012","qualification":"B.E./B.Tech, MCA/PGDCA","address":"nThrive Global Sloutions Private Limited (Formerly e4e Healthcare Business Services Pvt. Limited), 15th Floor, Tower C Unitech Cyber Park Sector 39, Gurugram, Haryana - 122 002.","phone":"Not Provided","profile":"Software Engineers (.Net) \nnThrive Global Solutions Private Limited","description":"Candidate should have good knowledge of OOPS and .Net Concepts. Must have strong programming and troubleshooting skills using C#, ASP .Net, and MS SQL 2008/ 2012. Good knowledge of MVC framework. Good experience of working on JavaScript and jQuery, HTML, CSS. As a part of the technology team, member is expected to perform end-to-end development/maintenance of Microsoft .Net based applications. Member will be engaged in coding, unit testing, and build readiness activities related to assigned tasks. Walk-in Date/ Time: 22nd - 29th November from 1 PM onwards Interview Venue: nThrive Global Sloutions Private Limited (Formerly e4e Healthcare Business Services Pvt. Limited) 15th Floor, Tower C Unitech Cyber Park Sector 39, Gurugram, Haryana - 122 002.","location":"Gurgaon","experience":"1 - 3 Years"},{"date":"30 - Nov - 2019","skills":"Core Java, J2EE, OOPs Concept, Web Services (SOAP/ REST)","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Zenmonics software Private Limited, ITPL, Discoverer Building 10th Floor ITPL Tech Park, Whitefields, Bangalore.","phone":"9160510091","profile":"Java Developer/ Tech Lead \nZenmonics Software Private Limited","description":"An exciting opportunity awaits you as Zenmonics a Product Based and FINTECH TOP 100 Company is hiring for UI Developers/ Tech Leads at Bangalore. Work Experience: 4 to 8 Years Job Location: Bangalore. Preferred who can join early. Person must have strong experience in design and development of Core Java and J2EE based applications. Excellent knowledge of OOPs Concept. Hands on experience in developing web services (SOAP/ REST). Experience on working with Frameworks like Struts/ Spring. Should have worked on Hibernate/ iBatis. Working knowledge of databases such as DB2/ Oracle/ any other databases. Should have participated in, and be familiar with, SDLC and Agile (Scrum) project methodologies. Should have excellent communication, presentation and client management skills. Should be a good problem solver, quick learner. Notice Period: 15-30 days Max Walk-in Date/ Time: 30 November 2019, 11 AM onwards Interview Venue: Zenmonics software Private Limited ITPL, Discoverer Building 10th Floor ITPL Tech Park, Whitefields, Bangalore. Contact Person- Jagan Pamu Tel: 9160510091 Interested ones can share their updated resume to Jagan.Pamu@zenmonics.com","location":"Bangalore","experience":"4 - 8 Years"},{"date":"30 - Nov - 2019","skills":"Hadoop, Sqoop, Hive, Pyspark, Spark, Java, Unix Shell Scripting","qualification":"B.E./B.Tech, MCA/PGDCA","address":"CenturyLink Technologies India Private Limited, Salarpuria Touchstone, Fourth Floor, Survey No. 15/3 & 16, Kadubeesana Halli, Varthur Hobli, Outer Ring Road, Bangalore - 560 087","phone":"Not Mentioned","profile":"Hadoop/ Java Developer \nCenturyLink Technologies India Pvt. Limited","description":"Candidate should have good knowledge Hadoop ecosystem with hands-on experience in Hive, Sqoop, Pyspark, Spark, Unix Shell Scripting. Should have good knowledge of Java. Good written and verbal communication skills are required to interact with offshore and onshore counter parts (scrum masters / business analysts / managers. Work Experience: 2 to 6 Years Primary Skills: Hadoop, Sqoop, Hive, Pyspark, Spark, Java, Unix Shell Scripting Job involves, 16x7 Shifts (Sunday to Saturday, 365 days, India day time) Ability to code, unit test, support system testing and user acceptance Awareness of configuration management and release process Interview Date & Time: 30th November 2019 @ 10:30 AM to 5:00 PM Mode of Interview: Face 2 Face Interview Venue: CenturyLink Technologies India Private Limited Salarpuria Touchstone, Fourth Floor, Survey No. 15/3 & 16, Kadubeesana Halli, Varthur Hobli, Outer Ring Road, Bangalore - 560 087 Contact Person: Mary Vinutha Note : Looking for candidates who can join us less than 30 days","location":"Bangalore","experience":"2 - 6 Years"},{"date":"30 - Nov - 2019","skills":"Core Java, Hibernate, Spring boot, Microservices","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"HCL Technologies Limited, New Cafeteria, Sholinganallur Campus, Chennai","phone":"Not Provided","profile":"Java Developer \nHCL Technologies Limited","description":"We are pleased to inform you that we currently have opening for Java Developer @ Chennai Educational Qualification: BE/ B.Tech/ MCA Work Experience: 3 - 9 Years Required Skills: Core Java, Hibernate, Spring boot, Microservices The candidates who are interested & ready to attend interview, please share your resume with below details to ahmed_s @hcl.com Walk-in Date: 30th November 2019 Timing: 9:00 to 12:00 PM Interview Location : HCL Technologies Limited New Cafeteria, Sholinganallur Campus, Chennai Spoc: Shaik Ahmed","location":"Chennai","experience":"3 - 9 Years"},{"date":"21, 22, 25, 26, 27, 28, 29 - Nov - 2019","skills":"Core Java, OOP Concepts","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Tacktile Systems, 2nd Floor Above Ochre Furnitures Hiwary Layout Wardhman Nagar, Nagpur Opposite Old INOX Poonam Mall","phone":"2766150","profile":"Java Developer - Freshers \nTacktile Systems","description":"We are looking to hire fresh graduates with good aptitude, basic programming skills and strong OOP concepts. You would be trained for 2-3 months and hired with Tacktile Systems itself as JAVA developer on successful completion of training You should be good with - OOP Concepts - Core Java - Strong Aptitude - Basic Programming skills - Ability to learn quickly - Good Communication Skills Walkins from Monday to Saturday (10 AM - 4 PM) 21st - 29th November 2019 Interview Venue: Tacktile Systems, 2nd Floor Above Ochre Furnitures Hiwary Layout Wardhman Nagar, Nagpur Opposite Old INOX Poonam Mall Contact - HR ( 2766150 )","location":"Nagpur","experience":"0 - 1 Years"},{"date":"2 - Dec - 2019","skills":"Java Trained/ Fresher","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Snap-on Business Solutions India Pvt. Limited, 1st floor, Tower C, Logix Techno Park Plot No. 5, Sector 127, Noida.","phone":"0120-4508462","profile":"Software Engineer/ Java Trainee \nSnap-on Business Solutions India Pvt. Limited","description":"Applicant must be B.Tech/ B.E/ MCA/ M.Tech from 2018-19 batch with 60% overall and regular academic background. Any project / Internship / certification course on Java is mandatory. Should have good communication and analytical Skills Positive and learning attitude Angular is preferred. Walk-in Date/ Time: 2nd December 2019, 11 AM onwards Interview Venue: Snap-on Business Solutions India Pvt. Limited 1st floor, Tower C, Logix Techno Park Plot No. 5, Sector 127, Noida. Contact Person- Priyanshi Tel: 01204508462 Please Note: 1. Candidates reaching after 11.00 AM will not be entertained in any condition. 2. Candidate should be ready to sign a service agreement of 1.5 years. 3. Please do not apply if you have already attended any interview process at our company in last 6 months.","location":"Noida","experience":"0 - 1 Years"},{"date":"30 - Nov - 2019","skills":"Core Java, Servlets, JSPs, J2EE, Spring, Hibernate etc.","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Hetero Healthcare Limited, Sy. No.80-84, Melange Towers, 5th Floor, B Wing, Patrikanagar Madhapur, Hyderabad - 500 081.","phone":"040 40473500","profile":"Java Developers \nHetero Healthcare Limited","description":"Candidate must have strong knowledge of Core Java, Servlets, JSPs and J2EE Should have Java framework knowledge such as Spring, Hibernate etc. Experience with web services is an advantage. JavaScript, HTML, CSS knowledge required. Experience in integrating web services with mobile clients such as iPhone/ iPad applications is optional. Walkin Interview on 30th November from 9 AM onwards Interview Venue: Hetero Healthcare Limited Sy. No.80-84, Melange Towers, 5th Floor, B Wing, Patrikanagar Madhapur, Hyderabad - 500 081. Tel No. 040 40473500","location":"Hyderabad","experience":"2 - 4 Years"},{"date":"2, 3, 4, 5, 6, 7, 9, 10, 11, 12, 13, 14 - Dec - 2019","skills":"Core Java, Stored Procedure, Web Services SOAP/ REST APIs, SQL Queries","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Prospecta Soft Private Limited, IRIS Tech Park, Unit No. 206, 2nd Floor, Block A, Sector 48, Gurugram","phone":"Not Provided","profile":"Java (API) Developer \nProspecta Soft Private Limited","description":"Person must have strong hands-on experience with Core Java Must and Strong knowledge of SQL Queries and Stored Procedure Must have knowledge of API's Good to have experience on Web Services SOAP/ REST APIs Should have good communication skills Job Responsbility- To produce high quality documentation for our customers related to assigned work To decompose technical tasks and provide accurate estimates To undertake project related API/Development tasks without supervision, including programming and testing within a Test-Driven process Walk-in Date/ Time: 30 November - 15th December , 9 AM onwards Interview Venue: Prospecta Soft Private Limited IRIS Tech Park, Unit No. 206, 2nd Floor, Block A, Sector 48, Gurugram Contact Person- Isha Sharma Interested candidates can share their updated resume on shalini.singh@prospecta.com","location":"Gurgaon","experience":"2 - 4 Years"},{"date":"29, 30 - Nov - 2019","skills":"Core Java, Hibernate, SpringBoot, RestAPI, MySQL, Angular, Multi-threading","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Amazin Automation Solutions India Pvt. Limited, Unit No. 50, 51, Ground Floor, JMD Megapolis, Sohna Road, Sector 48, Gurgaon - 122 018","phone":"9711454083","profile":"Java Developer \nAmazin Automation Solutions India Pvt. Limited","description":"Candidate should have 3 to 7 years of experience in Software Development using Core Java, Hibernate, Spring Boot, RestAPI, MySQL, Angular, Multi-threading, OOPs Concept, Java Swing, AWT Preferred Skills - Adapts to changes in work (i.e. new client requirements or specifications). Adjusts working hours to accommodate busy periods. Walk-in Date/ Time: 29th - 30th November , 10 AM onwards VENUE: Amazin Automation Solutions India Pvt. Limited Unit No. 50, 51, Ground Floor, JMD Megapolis, Sohna Road, Sector 48, Gurgaon - 122 018 Contact Person- Prachi Khurana Tel: 9711454083","location":"Gurgaon","experience":"3 - 7 Years"},{"date":"29 - Nov - 2019","skills":"Manual - Automation Testing","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"NIIT Technologies Limited, 223 -224, Udyog Vihar, Ph-I, Gurgaon, Haryana - 122 002. Land Mark: MDH and S&D Building","phone":"Not Provided","profile":"Software Testing Engineer \nNIIT Technologies Limited","description":"Candidate should have B-Tech/ BCA or MCA with 1 to 4 years Experience / Diploma / Training in Manual - Automation Testing. Should have knowledge / experience specific to software testing or Database testing. Should be comfortable working in 24*7 shifts (Mainly Evening Shifts) and bond for 1 year. Work Location- Gurgaon Both side free cab facility will be provided within Hiring Zone. Key Competencies TESTING: Solid experience with testing tools, techniques, processes, methodologies Experience in managing testing utilizing both manual and with automated testing tools Experience with development and implementation of business and applications systems testing strategy and framework, including functional, system integration and performance testing, GUI testing, regression testing and smoke testing Know-how of Applications systems testing with automation tools, white box and black box, and the preparation of Automation framework for testing Experience in defining test strategy, RTM & test planning, test cases Exposure to ETL/ DW/ BI testing Data Analysis skills TECHNICAL: Expertise in back end querying with PL SQL Ability to write and execute simple to medium complexity Queries and joins in PL SQL Experience in testing and validation of Data Extracts, File based loaders and APIs Requirements, Test and Defect management tools experience User oriented perspective to be able to successfully envision and execute test cases Requirement Analysis skills PROJECT/ SOFT SKILLS: Solid experience with Agile as well as Waterfall methodologies with the knowledge on SDLC & STLC Experience with Test effort estimation and ability meet multiple challenging deadlines Team player Excellent oral and written communication skills Walk in Date: 29th November, 2019 Interview Timing: 12:30 PM to 4:00 PM Interested candidates are requested to directly visit us at the below mentioned address and schedule: NIIT Technologies Limited, 223 -224, Udyog Vihar, Ph-I, Gurgaon, Haryana - 122 002. Land Mark: MDH and S&D Building Contact Person: Anika","location":"Gurgaon","experience":"1 - 4 Years"},{"date":"29 - Nov - 2019","skills":"Back-Office Operations, Insurance/ Banking Process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"GENPACT India Private Limited, Sector-18, Udyog Vihar, Gurgaon Nearest Metro - M.G. Road","phone":"9667357055","profile":"Back-Office Associate \nGENPACT India Private Limited","description":"GENPACT India Private Limited is Inviting applications for Back-Office Operations Job Location: Noida/ Gurgaon Shifts: 24*7 Educational Qualification: Any Non-Technical Graduate can apply. Any Graduate with an experience in Back-Office Operations is applicable. Freshers are eligible to apply Skills & Responsibilities: Insurance/ Banking exposure Good client servicing skills Knowledge of excel/ advanced excel/ V-look/ H-look up Good analytical and problem solving skills Able to communicate verbally and through emails Input appropriate categories Your role will require you to utilize your knowledge in the insurance and reinsurance fields to manage and process transactions, interact with clients, manage processes and data, and improve processes. Walk-in Date - 29th November, 2019 Timings - 11 am to 2 pm Interview Location - GENPACT India Private Limited Sector-18, Udyog Vihar, Gurgaon Nearest Metro - M.G. Road Contact - HR MANEESHA @ 9667357055 MENTION 'HR MANEESHA' AS YOUR REFERENCE ON THE TOP OF YOUR CV Documents to be carried: 2 UPDATED COPIES OF RESUME ORIGINAL AADHAR And PAN CARD IS MANDATORY 2 XEROX COPIES OF ID PROOF 2 PASSPORT SIZE PHOTOGRAPHS LAST 3 MONTHS PAY SLIPS ( IF ANY )","location":"Gurgaon","experience":"0 - 2 Years"},{"date":"2, 3 - Dec - 2019","skills":"Java, .Net, OOPs Concept","qualification":"B.E./B.Tech, M.Tech","address":"Mystifly Consulting India Private Limited, Azygos Building, No. 885, 1st Stage 4th Block, HBR Layout Bangalore - 560 043.","phone":"Not Provided","profile":"Software Engineers (Java/ .Net) \nMystifly Consulting (India) Pvt. Limited","description":"Educational Qualification: BE/ B.Tech/ ME/ M.Tech Batch: 2019 Passout Only Work Experience: Fresher Very good programming good communication skills Good Aptitude, analytical and problem solving skills are necessary Must have good knowledge of OOPs Concept Willing to learn new skills Walk-in Date/ Time: 2nd - 3rd December 2019, 12 PM onwards Interview Venue: Mystifly Consulting India Private Limited Azygos Building, No. 885, 1st Stage 4th Block, HBR Layout Bangalore - 560 043. Contact Person- Benoy J K","location":"Bangalore","experience":"0 - 1 Years"},{"date":"29 - Nov - 2019","skills":"Technical Support, IT Helpdesk/ Service Desk, Voice Process","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"DXC Technology India Private Limited, Surya Tech Park, Electronic City, Bengaluru, Karnataka - 560 100.","phone":"Not Provided","profile":"Technical Support - Voice Process \nDXC Technology India Private Limited","description":"Candidate should have Graduation with 10+2+3/4 preferably. Typically requires 0 - 3 years general experience, or equivalent combination of experience and college level education. Knowledge and Skills: Superior skills in both written and verbal communication. Experience in customer facing role either remote or face to face. Computer proficiency with applicable software applications (for example Microsoft Office, CAD, Adobe Suite, programming. Should have good problem solving skills Accuracy in data entry. Interview Details: Date: 29th November 2019 (Friday). Time: 10:00 AM to 12:00 PM Interview Venue: DXC Technology India Private Limited, Surya Tech Park, Electronic City, Bengaluru, Karnataka - 560 100. Point of Contact: Anantha Sricharan","location":"Bangalore","experience":"0 - 3 Years"},{"date":"29, 30 - Nov - 2019","skills":"Technical Support, International Voice Process, Customer Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"HCL Technologies Limited, Surya Sapphire, Electronic City Phase 1 Near D- Mart, Bangalore - 560 100","phone":"Not Provided","profile":"Technical Support (Voice Process) \nHCL Technologies Limited","description":"Work Experience: 6 months - 3 years of Service Desk (Voice) Global support experience mandatory Technical support,active directory ,voice customer service, and support experience with problem solving involving troubleshooting hardware, involving hardware, software, and networks issues. Job Responsbility- Provide hardware / software / network problem diagnosis / resolution via telephone/email/chat for customers end users. Route problems to internal 2nd and 3rd level IT support staff. Coordinate and manage relationships with vendors and support staff that provide hardware / software / network problem resolution. Walk-in Details:- Date:26th to 30th Nov- 2019 Time - 10:00 AM to 1:30 PM Venue: HCL Technologies Limited Surya Sapphire, Electronic City Phase 1 Near D- Mart, Bangalore - 560 100 Spoc: Shobhana Mandatory* Doc's:- Hard Copy of your updated Resume. Printout / Screenshot of this walk-in post One Government ID proof Xerox copy (Preferable Passport ) One Passport size photograph.","location":"Bangalore","experience":"0 - 3 Years"},{"date":"30 - Nov - 2019","skills":"Technical Support, Customer Service/ Voice Process","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"HCL Technologies Limited, AMB 6 South Phase, MTH Road, SIDCO Industrial Estate, Ambattur, Chennai, Tamil Nadu - 600 058","phone":"Not Provided","profile":"Technical Support/ IT Service Desk \nHCL Technologies Limited","description":"HCL hiring for Service desk L1 Technical Support (Voice) Candidate should have 6 months - 3 years of Service desk (voice) Global support experience mandatory Technical support,active directory ,voice customer service, and support experience with problem solving involving troubleshooting hardware, involving hardware, software, and networks issues. Job Responsbility- Provide hardware / software / network problem diagnosis / resolution via telephone/email/chat for customers end users Route problems to internal 2nd and 3rd level IT support staff. Coordinate and manage relationships with vendors and support staff that provide hardware / software / network problem resolution. Administer and provide User account provisioning. Walkin Interview on 30th November from 10 AM onwards Venue Details: HCL Technologies Limited AMB 6 South Phase, MTH Road, SIDCO Industrial Estate, Ambattur, Chennai, Tamil Nadu - 600 058","location":"Chennai","experience":"0 - 3 Years"}]}