{"Walkins":[{"date":"13, 14, 15, 17, 18, 19, 20 - Jun - 2019","skills":"chat technical support international process technology solutions","qualification":"B.Sc, BCA/BCS, B.E./B.Tech, B.A., B.Com, B.B.A, B.Sc","address":"Stellar Information Technology Pvt. Limited, D 16, Infocity II, Sector 33, Gurugram, Haryana - 122 001","phone":"Not Provided","profile":"Technical Support Executives \nStellar Information Technology Private Limited","description":"Stellar is looking for technical support executives to handle its Voice and web process. The role involves handling inbound and outbound calls / web, chat and email queries. The profile involves dedication in assisting customers to use our software well in a professional manner and get a good WOM generated. A quality score of minimum 85% is to be maintained. Handle Inbound calls & Outbound calls Web support > Chat and Emails Response in defined TAT Maintain Quality benchmark Generate product sales Generate business through upsell Desired Qualification, Skills & Experience: Graduate, BCA or BSC (IT) Preferred Excellent command over English language (Oral & Written) Good writing skills Good time management skills Willingness to work in 24/5 Shift environment 1-3 years experience out of which minimum six months experience in International technical support process is needed Soft Skills & Communication Skills A candidate must have - Good communication skills with a clear diction Ability to construct simple and sensible sentences Ability to understand spoken American English Good problem solving skills Ability to approach problems logically Strong customer service focus Ability to work under pressure Technical Knowledge & Skills Technical troubleshooting skills Familiarity with Operating Systems (Windows 10, 8, Vista, 2000/NT, Mac etc.) Knowledge of computer hardware & networking Knowledge of Browsers & Internet based applications Knowledge of Email applications and usage Knowledge of HDD, memory cards, Card Readers and Flash Drives. Good Typing speed : 30-40 words / min Technical troubleshooting skills Familiarity with Operating Systems (Windows 10, 8, Vista, 2000/NT, Mac etc.) Knowledge of computer hardware & networking Knowledge of Browsers & Internet based applications Knowledge of Email applications and usage Knowledge of HDD, memory cards, Card Readers and Flash Drives. Good Typing speed : 30-40 words / min 5 days working / Saturday Sunday fixed off/ Blended process Candidates residing in Gurgaon or willing to relocate could apply for this opening 24*5 rotational shifts month wise (in bound calls environment) 3 shift timings : (5 AM-2 PM), (12 PM-9), PM), (8 PM-5AM) For Girls : Fixed Morning Shift 8:00 am- 05:00 PM Date of Interview : 13th to 20th June 2019 / Sunday off Time: 9:00 AM - 03:00 PM Venue Details: Stellar Information Technology Pvt. Limited, D 16, Infocity II, Sector 33, Gurugram, Haryana - 122 001 Contact Person : Dinesh (HR)","location":"Gurgaon","experience":"1 - 4 Years"},{"date":"13 - Jun - 2019","skills":"Customer Service, Customer Support, Inbound Calls, Customer Complaints","qualification":"B.Sc, BCA/BCS, B.E./B.Tech, B.A., B.Com, B.B.A, B.Sc","address":"Kotak Mahindra Life Insurance Co. Limited, No.102 & 105, 1st Floor, Cears Plaza, No.136, Residency Road, Bangalore - 560025","phone":"Not Provided","profile":"Customer Support Executive/ Fresher \nKotak Mahindra Life Insurance Company Limited","description":"Here is an opportunity for Graduate/ Freshers to get associate and enhance your career with a leading brand. Qualification: Only Full time Graduates can apply Work Experience: Fresher Job location: Bangalore (Residency Road) Job Responsibilities- 1. Recruiting Organize and run recruitment events for APs and LAs Be an expert in the recruitment processes i.e. have the ability to identify the prospective LAS and APS for the unit 2. Planning and Goal Setting Conduct review discussions/ wake-up meetings as and when required Plan goals & performance needs for APs in a periodic manner Be an expert in the sales process and conduct mechanisms to build the same with ones team through periodic on-floor coaching Own the operational aspects of coding a new AP and other day-to-day interactions with support functions whenever required 3. Developing and Coaching Handle the selection to on-boarding process of the Aps Take responsibility for the APs income Help whenever needed in prospecting/suspecting activity in the field Operate as a product Subject Matter Expert Attend joint field work activity Contact APs who are falling short of the Contract Maintenance criteria to either reactivate them or arrange for their training 4. Key points to Highlight Only Graduates can apply. Must be current year passed - out 2019. No arrears in previous semesters. Must be the locate of Bangalore. 2 months as interns then on-rolls . Walk In Date: 13th June 2019 Timings - 11:00 AM- 3:00 PM Interview Address : Kotak Mahindra Life Insurance Co. Limited, No.102 & 105, 1st Floor, Cears Plaza, No.136, Residency Road, Bangalore - 560025 Interviewer: Pramod Kundapur","location":"Bangalore","experience":"0 - 1 Years"},{"date":"13, 14 - Jun - 2019","skills":"technical supportinternational voice processinbound calls","qualification":"B.Sc, BCA/BCS, B.E./B.Tech, B.A., B.Com, B.B.A, B.Sc","address":"Mphasis Limited, EON Infrastructure, Wing 2 Cluster C, Ground Floor, Kharadi, Pune","phone":"Not Provided","profile":"Technical Support Associate \nKotak Mahindra Old Mutual Life Insurance Ltd.","description":"Mphasis Hiring for Technical Support International Voice process, looking for immediate joiners only Qualification- Any Graduate/ Undergraduate Hiring only for voice process 1+ years of experience in Service Desk/ IT Helpdesk/ Technical Support domain or International Voice Process. Job Responsibilities: Problem and Incident management under Global Service Desk environment where the Tech support Engineer has to manage clients queries and technical problems via inbound calls, emails, chat and web tickets within defined SLAs Logging incidents and service requests, categorizing and prioritizing them, and managing their life cycle as per ITIL guidelines.Update users about request status and close request when users are satisfied with solutions Level 1, Level 2 and Level 3 troubleshooting mainly related to desktop/OS, Custom and COTS applications, Exchange related, End devices, VPN, VOIP and share point as per guidelines in the knowledge base. Remote desktop troubleshooting. Escalate complex incidents / requests to upstream technical groups Should be comfortable for: 5 days working Night Shift may require to do Day shift during training and transition 2 Days Weekly Off Any 2 Days of the week 9 Hours Login ( With 1 Hour Break ) Excellent command on English (Verbal and Written) Other Benefits: Pick up and Drop Global Standards work environment Proper Desk job Performance linked incentives Walk-in Date/ Time: 13th June - 14th June from 9 AM onwards Interview Venue: Mphasis Limited, EON Infrastructure, Wing 2 Cluster C, Ground Floor, Kharadi, Pune Contact Person: HR Tausif NOTE: Please remember to mention your job code as 'Tausif ' while appearing for the walk-in interview on your resume. Please carry all your academic and employment documents (If any) along with your updated CV and photo copy of your photo ID proof and copy of this email.","location":"Pune","experience":"1 - 4 Years"},{"date":"12, 13, 14, 15 - Jun - 2019","skills":"General Administration, Facility Management, Statutory Compliance, Event Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Prism Johnson Limited, 4-97, L Godown, Saint Johns, Regional Seminary Church Compound, Ramanthapur, Hyderabad - 500 013","phone":"9920952662","profile":"Administration Coordinator \nPrism Johnson Limited","description":"Candidate should be Any Graduate with 3 to 8 years experience in General Administration, Facility Management, Statutory Compliance, Event Management. Must have excellent communication skills Job Responsbility- General Administration & Facilities Legal & Statutory Compliance Facilitate People and Business Initiatives Facilitate Employee Engagement and R&R People and Business Event Management Employee Facility Management (ID card, Medical Card, SIM Card, Tab & Laptop, Work Station / Cabin allocation) Travel and Accommodation Management IT Properties and Other Office Equipment Maintenance. Monthly Admin MIS, Attendance and Statutory reports submission to HO Walk-in Date/ Time: 12th June - 15th June , 9 AM onwards Interview Venue: Prism Johnson Limited, 4-97, L Godown, Saint Johns, Regional Seminary Church Compound, Ramanthapur, Hyderabad - 500 013 Contact Person: Mr. Vijayragahvan Iyengar Tel: 9920952662/ 9980783878","location":"Chennai","experience":"3 - 8 Years"},{"date":"15 - Jun - 2019","skills":"General Administration, Back Office Activities, Facility Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Queen's Hotel, 46/6, Ramakrishna Road Salem - 636 007","phone":"9384998433","profile":"Admin Executive - Female Only \nQueens Hotel","description":"Candidate should be Any Graduate with good command in English, Well groomed professional. Job Responsbility- Administrative Executive will be responsible for providing administrative support to management and employees to ensure efficient in office operation. Salary: INR 1,75,000 - 3,00,000 P.A Free Accommodation would be provided Apply with Photograph, Walk-in Date/ Time: 12th June - 11th July , 9 AM onwards Interview Venue: Queen's Hotel 46/6, Ramakrishna Road Salem - 636 007","location":"Salem","experience":"0 - 5 Years"},{"date":"15 - Jun - 2019","skills":"General administration, office coordination, ms office, asset management","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Syncfusion Software Private Limited, Eymard Complex, AJ-217, 4th Avenue, Shanthi Colony, Anna Nagar, Chennai - 600 040.","phone":"044-26210413","profile":"Office Coordinator / Admin \nSyncfusion Software Private Limited","description":"We are conducting Walk-in for Office Coordinator / Admin on June 15, 2019. Office Coordinator / Admin (Fresher's can apply) Eligibility: Any degree (Regular) 2017 & 2018 pass-outs with minimum 60% in all academics No gaps of any kind Well versed in MS-Office Good communication skills Experience 0 - 1 year in relevant field Females only Roles: General office maintenance \\ admin tasks Maintenance of employee records Asset management Inventory record maintenance Customer support coordination Any other duties assigned Working Hours: 9:00 AM to 6:00 PM. Saturdays working (As needed) Walk-in Date: 15th June 2019 Timings: 10 AM to 2 PM Interview Venue: Syncfusion Software Private Limited Eymard Complex, AJ-217, 4th Avenue, Shanthi Colony, Anna Nagar, Chennai - 600 040. Landline: 044-26210413 Extn: 413","location":"Chennai","experience":"0 - 1 Years"},{"date":"14 - Jun - 2019","skills":"technical support it helpdesk service desk","qualification":"B.Sc, BCA/BCS, B.E./B.Tech, B.A., B.Com, B.B.A, B.Sc","address":"Tata Consultancy Services Limited, No 769, Spencer plaza, Mangal Tirth Estate 3rd Phase, 9th Floor, Annasalai, Mount road, Chennai - 600 002","phone":"Not Provided","profile":"Technical Support/ Service Desk Professionals \nTata Consultancy Services Limited","description":"Eligibility: Any Graduate with (2 to 4 years) (Technical Support / IT Help desk / Service Desk / L1 support ) experience in any one of the skill can apply. Should have experience in Technical Voice. Should have good communication skill. Minimum 15 yrs of regular education (10th + 12th + 3 years Graduation) Relieving letters from all the previous companies are mandatory. Graduates through Open Universities/Correspondence graduates need not apply Not more than 2 years of gap in Graduation or Employment. Willingness to work in any Shifts. Interview Date: Friday (14th-June-2019) Time: 11:00 am to 1:00 pm Mandatory Requirements (How to generate your EPCN) EPCN number is mandatory for eligibility of the interview. Follow the below steps to register and mention the EPCN number on your resume Step 1: Go to link www.careers.tcs.com Step 2: Select India geography & next click on Experienced Professionals link Step 3: Go to Create your profile (For New Users) link & fill the details. (Please select area of interest as BPS) Step 4: You will get the EPCN number & Password to your personal e-mail ID. Interview Venue: Tata Consultancy Services Limited No 769, Spencer plaza, Mangal Tirth Estate 3rd Phase, 9th Floor, Annasalai, Mount road, Chennai - 600 002 Contact Person: Nithya Y Please carry any GOVT original ID (voters ID/ PAN CARD/ driving license) for your identity purpose & Invite mail Kindly share this information with your friends and bring them along with you Note: Candidates who have attended the selection process in the last 6 months will not be eligible to apply again.","location":"Chennai","experience":"2 - 4 Years"},{"date":"13, 14, 15, 17 - Jun - 2019","skills":"outbound calling voice process inbound semi voice email support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech, B.A., B.Com, B.B.A, B.Sc","address":"Medi Assist Insurance TPA, 2nd Floor, RWD Atlantis Building, Nelson Manikam Road, Near Metha Nagar Bus stop, Chennai - 29","phone":"Not Provided","profile":"Technical Support (Semi Voice Process) \nMedi Assist Insurance TPA Private Limited","description":"Medi Assist Insurance TPA Private Limited, is having an immediate opening for Female Candidates for Semi Voice Process with our organization. Experience & Skills required: Minimum 6 Months to 1 Year experience in voice or semi voice process. Experience in handling inbound & outbound calls/drafting emails. Experience in basic word & excel. Candidates who can join immediately will be given first preference. Good in Communication, Key roles & Responsibilities: Ability to take calls and to provide & receive info. Fluent communication in English & Hindi must (Tamil will be an added advantage) Responsible for attending calls & have to co-ordinate with internal & external customers in regard. Responsible for conducting briefing about any changes / new updates or process change from time to time Should manage 50% Voice & 50% email support Handling Escalation Emails & Calls Require Good oral and written communication. Ability to effectively deal with and manage stressful situation Willing to learn and grow in changing environment Interested candidates can directly come for a face 2 face interview in the below mentioned address: Date: 13th - 17th June , 9 AM onwards Interview Venue: Medi Assist Insurance TPA, 2nd Floor, RWD Atlantis Building, Nelson Manikam Road, Near Metha Nagar Bus stop, Chennai - 29","location":"Chennai","experience":"1 - 2 Years"},{"date":"11, 12, 13, 14, 15, 17 - Jun - 2019","skills":"General Administration, Vendor Management, Handling petty cash, Facility Management, Housekeeping","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Reliable Spaces Private Limited, No. 51, Rajiv Gandhi Salai (OMR) | Rattha TEK MEADOWS, C Block, 1st floor | Sholinganallur | Chennai - 600 119.","phone":"7904356739","profile":"Administration Executive \nReliable Spaces Private Limited","description":"We have immediate job opening for Admin Executive. Requirements: Only Male Candidates. Should have BPO Experience. Roles & Responsibilities: Follow up with vendors. Handling vendors payments. Record keeping of bills processed. Booking Arrangements of vehicles, Cars and Flights etc. Booking of guest house, Hotels for clients and employees. Assigning work to office boys, housekeepers and security staffs. Send request for ID and Access cards of new joining staff. Keep records of IT Equipment. Arrangement of meetings, events and parties. All the maintenance work of office and its requirements. Handling petty cash. Handling work order and purchase order. Inventory Management. Knowledge of AMC and CMC. Job Location : Shollinganallur, Chennai. Walk-in Date/ Time: 11th June - 17th June , 10 AM onwards Interview Venue: Reliable Spaces Private Limited No. 51, Rajiv Gandhi Salai (OMR) | Rattha TEK MEADOWS, C Block, 1st floor | Sholinganallur | Chennai - 600 119. Tel: 022 3375 0037| Ext: 50037| T: 7904356739 Email: indra.kumar@reliablebss.com","location":"Chennai","experience":"1 - 3 Years"},{"date":"12, 13, 14 - Jun - 2019","skills":".Net, PHP, Python or JavaScript technologies","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Travelyaari, No. 412, Third Floor, 100 ft Road, 4th Block, Koramangala, Bangalore - 560 034","phone":"080-43727990","profile":"Software Developer (PHP/ .Net) \nMantis Technologies Private Limited","description":"We are hiring for Freshers and near-Freshers who have good programming knowledge and strong exposure to algorithms and data structures. You should be willing to learn new technologies and programming on the go, currently, you will be working on .Net, PHP, Python or JavaScript technologies. Work Experience: Fresher till 1 year of work experience Job Location: Koramangala, Bangalore If you are interested, please walk-in to our office between 12th-June till 14th June, 2019. Please find below the office address- Travelyaari No.412, Third Floor, 100 ft Road, 4th Block, Koramangala, Bangalore - 560 034 Landmark: Opp to Sukh Sagar Hotel Interview process- Round 1 - Written aptitude and programming test Round 2 - face to face technical interview with the team Round 3 - face to face interview with the manager","location":"Bangalore","experience":"0 - 1 Years"},{"date":"10, 11, 12, 13, 14 - Jun - 2019","skills":"Java, Hibernate, Spring, Web Services, Software Engineering, Web Technologies","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Enterprise Touch Private Limited, Ground Floor, RR Tower IV, Thiru Vi Ka Industrial Estate, SIDCO Industrial Estate, Guindy, Chennai - 600 032","phone":"Not Provided","profile":"Sr. Software Engineer (Java) \nEnterprise Touch Private Limited","description":"Proficient in web services development for Mobile and web apps Knowledge in any mobile development framework Experience in banking domain desirable Experienced Spring Hibernate & Agile Proficiency in analyzing & solving problems related to project Walk-in Date/ Time: 10th - 14th June 2019, 2 PM onwards Interview Venue: Enterprise Touch Private Limited Ground Floor, RR Tower IV, Thiru Vi Ka Industrial Estate, SIDCO Industrial Estate, Guindy, Chennai - 600 032","location":"Hyderabad","experience":"2 - 4 Years"},{"date":"11, 12, 13, 14 - Jun - 2019","skills":"Java/ J2EE, Core Java, Javascript, Struts, Data Structures, and Multi-threading","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"BancTec India Private Limited (Now a part of Exela Technologies), 9th Floor, ICC Tech Park Tower A, Senapati Bapat Road, Pune - 411 016","phone":"020-67437690","profile":"Java/ Angular Developer \nBancTec India Private Limited","description":"Java Developer with experience in building high-performing, scalable, enterprise-grade applications. You will be part of a talented software team that works on mission-critical applications. You will be responsible for Java application development while providing expertise in the full software development lifecycle, from concept and design to testing. Primary Skills: 3+ years of hands-on Software Development experience 3+ years of experience in Java Web Application Development Hands on experience in Core Java with good in OOPS Concepts. Hands on experience in HTML5, CSS3, Bootstrap and XML. Framework: Spring, Hibernate Angular 2/4/5/6 (Mandatory), Webservices. Core JAVA, JDBC, Hibernate Hands on experience in jQuery, Javascript & Ajax Framework Hands on experience in designing and developing applications using Java platforms Hands on experience in the Web service Development Hands on experience in Eclipse IDE, Version Control System CVS/SVN/other Experience in developing web applications using at least one popular web framework (Struts , Spring MVC) Profound insight of Java and JEE internals (Class loading, Memory Management, Multithreading, Transaction management etc.) Hands on experience in Apache Tomcat / JBoss Graduate in B.E/B.Tech/M.E./M.Tech/MCA or equivalent Excellent verbal and written communication skills Secondary Skills: Good knowledge of Relational Databases, SQL and PSQL ORM technologies like Hibernate Hands on JMS ( Java Messaging Service ) Hands on GIT, Maven, Ant and Jenkins or equivalent If you hold similar experience as per our requirement then please walk in to the below address: BancTec India Private Limited (Now a part of Exela Technologies), 9th Floor, ICC Tech Park Tower A, Senapati Bapat Road, Pune - 411 016 Walk-in Date: 11th June to 14th June Time: 11.00 am - 3.00 pm Contact Number: 020-67437690/020-67437573 *Hands on experience in Angular is a must *Immediate Joiners Only","location":"Pune","experience":"3 - 5 Years"},{"date":"11, 12, 13, 14, 15 - Jun - 2019","skills":"General Administration, Project Coordination, Back - Office Processing","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Genzeon Technology Solutions Private Limited, #408, 4th Floor PSR Prime Towers, Beside DLF Building Gachibowli, Hyderabad - 500 32","phone":"Not Provided","profile":"Java Developers \nGenzeon Technology Solutions Pvt. Limited","description":"Genzeon Technology Solutions Pvt. Limited, is looking for Multiple Java Developers to join our team at Hyderabad office. Required Skills: Minimum 2 year of experience working with: Core Java, Spring, Hibernate Experience with Web Technologies like XML, XSL, JSON, Angular & Dojo Expertise with RDMS Databases (SQL, Oracle, DB2) Should have proficiency in Multi-threading, Caching, and Data Structures Strong analysis and design skills including OO design patterns Performance tuning skills. Experience building highly scalable, high performance, highly integrated web applications. Nice to Have: IBM - ILOG JRules BRMS(Business Rules Management System) IBM - Sterling OMS(Sterling Order Management System) E-commerce Domain experience Walk-in Date/ Time: 11th June - 28th June , 11 AM onwards Interview Venue: Genzeon Technology Solutions Private Limited, #408, 4th Floor PSR Prime Towers, Beside DLF Building Gachibowli, Hyderabad - 500 32","location":"Hyderabad","experience":"2 - 5 Years"},{"date":"11, 12, 13, 14 - Jun - 2019","skills":"General Administration, Office Management, Record Keeping","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Provana India Private Limited, A-32, Ground Floor, Sector-2, Noida - 201 301. Near by 15 Metro Station","phone":"Not Provided","profile":"Administration Executive \nProvana India Private Limited","description":"Candidate should be Any Garduate with 1 to 4 years of experience in General Administration, Office Management, Record Keeping, Water Supply, Air Conditioning and Office Administration Job Responsibility- Inventory check of the in-house stock To ensure power, water supply & air conditioning in the office all the time Cab ordering for employees and record keeping. Seating plan check Managing office requirement on working Saturday Open for rotat shift Walk-in Date/ Time: 11th June - 14th June , 11 AM onwards Interview Venue: Provana India Private Limited A-32, Ground Floor, Sector-2, Noida - 201 301. Near by 15 Metro Station Please mention 'Gopal Sharma' on Resume","location":"Noida","experience":"1 - 4 Years"},{"date":"11, 12 - Jun - 2019","skills":"General Administration, Office Management, Front desk/ Receptionist Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"V Protect Powered By SIS Prosegur Pvt. Limited, Plot No. 10, GNG Tower 4th Floor, Sector -44 Gurgaon (Nearest Metro station Huda City Center)","phone":"9899206328","profile":"Admin Executive (Female) \nV Protect Powered By SIS Prosegur Pvt. Limited","description":"Person should be Any Garduate/ Computer literate with programmes such as word, excel, etc. Must have good Interpersonal and communicative skills. Organisational skills and ability to prioritise. Only Female candidates can apply. Job Responsibilities- Responsible for managing entire day today admin activities, Ticket bookings, hotel bookings for the clients and for business trips Forming and maintaining employee records Updating databases internally, such as attendance and leave records. Vendor & Invoice management. Communicating with external partner Assisting with payroll by providing the department with relevant employee information, i.e. holiday and sick days taken Helping with various arrangements internally, from travel to processing expenses Walk-in Date: 11th - 12th June 2019 Timings : 1100 am- 2:00 pm only Interview Venue: V Protect Powered By SIS Prosegur Pvt. Limited Plot No. 10, GNG Tower 4th Floor, Sector -44 Gurgaon (Nearest Metro station Huda City Center) Contact Person: Pallavi Bhatnagar Contact No. 9899206328","location":"Gurgaon","experience":"1 - 4 Years"},{"date":"10, 11, 12 - Jun - 2019","skills":"Java/ JSP/ Servlet/ JQuery, Java Script, XML Programming, HTML, CSS etc","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Concentrix Daksh Services India Pvt. Limited, Plot No 5 and 43, Divyasree Trinity, Ground Floor and First Floor HitecCity; Lane Next to Lemon tree, (Opposite to HSBC; Next JPMC) Madhapur, Hyderabad Telangana - 500 081","phone":"Not Provided","profile":"Core Java Developer \nConcentrix Daksh Services India Pvt. Limited","description":"Open Walk-in for Core Java Developer from 10th - 12th June 2019, at Concentrix Daksh Services India Pvt. Limited - Hyderabad Years of Experience: 2 to 4 Years Must-have Skills: Hands on design/ coding experience on Core Java programming language. XML - Be an expert Web services - Should be handson Basic knowledge on JavaScript, JSON is required. Junit, code coverage in Java code would be required. Basic knowledge on VoiceXML would be added advantage. Working experience on source code repository such as SVN, BIT Bucket, GitHub etc. is required. Working experience on Eclipse IDE and linking source code repository. Working experience on bug tracking tools such as Jira, Bugzilla, IBM Clearcase, HPs ALM tool etc. is required. Knowledge on Agile methodology would be added advantage. Great Analytical and Trouble-Shooting skills. Excellent communication (written, spoken, and presentation) skills. Date : Monday 10th June 2019 to Wednesday 12th June 2019 Walk-in Timings :- 10 AM to 4.00 PM Venue Details:- Concentrix Daksh Services India Pvt. Limited Plot No 5 and 43, Divyasree Trinity, Ground Floor and First Floor HitecCity; Lane Next to Lemon tree, (Opposite to HSBC; Next JPMC) Madhapur, Hyderabad Telangana - 500 081 Required :- Someone who is Serving NP/ Who are available to join at the earliest","location":"Hyderabad","experience":"2 - 4 Years"},{"date":"11, 12, 13 - Jun - 2019","skills":"OOPS, Java / C, C++, HTML","qualification":"B.E./B.Tech","address":"LeewayHertz Technologies Private Limited, Tower B - 1501; Unitech Cyber Park; Sector 39; Gurgaon; Haryana - 122 002","phone":"0124-4530666","profile":"Full Stack Developer/ Java Trainee \nLeewayHertz Technologies Pvt. Limited","description":"Candidate must have done B.Tech - CS/ IT Should have strong knowledge of OOPS, Java / C, C++, HTML Should be keen to learn multiple technologies. Passionate to work on mobile and web development Programmer/ Coder only Aable to learn and responsible to develop either iOS, Android or Web Applications. Able to learn and responsible to develop a cross-platform application Developing re-usable application frameworks and user interface Walk-in Date/ Time: 11th June - 13th June , 10 AM onwards Interview Venue: LeewayHertz Technologies Private Limited Tower B - 1501; Unitech Cyber Park; Sector 39; Gurgaon; Haryana - 122 002","location":"Gurgaon","experience":"0 - 1 Years"},{"date":"15 - Jun - 2019","skills":"JAVA/ J2EE, Spring MVC & Spring Core","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Concerto Software & Systems Private Limited, Building No. 305, 2nd Floor, A- Wing, Sector 2, Millennium Business Park, Mahape, Navi Mumbai - 400 710","phone":"Not Provided","profile":"Software Engineer - Java/ J2EE \nConcerto Software & Systems Pvt. Limited","description":"Skills Required: 1-3 year experience on JAVA/ J2EE projects. Should have experience working on Spring MVC & Spring Core. Candidate must have expertise in Core Java Should have worked on Servlet, JSP, HTML5, CSS, JQuery, JavaScript and AJAX Should have worked on Hibernate. Should have worked in n-Tier applications Should have worked on MSSQL / Oracle and should have experience in writing queries. Roles & Responsibilities: The roles and responsibilities include: Analyse the requirement and prepare understanding document & impact document Develop & Unit test n-Tier applications Deliver applications with quality and within timelines Co-ordinate with TL for requirement understanding Follow code management processes & coding standards Learn new technologies if required and implement in the projects Walk-in Date: 15th June 2019 Timing:- 10 am to 1 pm Interview Venue: Concerto Software & Systems Private Limited Building No. 305, 2nd Floor, A- Wing, Sector 2, Millennium Business Park, Mahape, Navi Mumbai - 400 710","location":"Mumbai","experience":"1 - 3 Years"},{"date":"15 - Jun - 2019","skills":"Back-Office Processing, Non Voice, Backend Operations","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"PruTech Solutions India Private Limited, Location: 4th Floor, A Block Unit 1, MJR Magnifique, Khajaguda X Road, Hyderabad - 500 008","phone":"Not Provided","profile":"Java Developer/ Freshers \nPruTech Solutions India Pvt. Limited","description":"Walk-in Drive for Java Developer/ Freshers at PruTech CMMI Level 3 Company on Saturday (15.06.2019) We are hiring Freshers for the positions of Java Developers DotNet Developers and Python Developers. Candidates should have undergone for the Training either on Core Java/ DotNet/ Python Eligibility Criteria: Qualification: MCA/ BE/ B.Tech - 2017, 2018 and 2019 Pass Outs Work Experience: 0 - 1 Years Job Location: Hyderabad Should have good Knowledge on the Programming Lanaguages like Java/ DotNet/ Python Should have excellence in the Academins Should possess Good Communication Skills Notice Period: Immediate Interview Process: Written Test, Group Discussion and Technical Interview Venue Details : PruTech Solutions India Private Limited, Location: 4th Floor, A Block Unit 1, MJR Magnifique, Khajaguda X Road, Hyderabad - 500 008 Contact Person Name : Keerthi Chekuri","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"15 - Jun - 2019","skills":"Java Script , JQuery or Anuglar JS, Spring, Hibernate & JSF/ Spring Boot","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"3i Infotech Limited, ICICI Towers, Plot No. 12, Tower III, South Wing, 5th Floor, Financial District, Nanakramguda, Gachibowli, Hyderabad - 500 032","phone":"044-71622450","profile":"Java Developers \n3i Infotech Limited","description":"Work Experience: 3 to 5 Years Language: Java Front end Technologies: Java Script, JQuery or Anuglar JS Frameworks: Spring, Hibernate & JSF/ Spring Boot Interested candidates can walk-in to the below venue- Date: 15th June, 2019 Time: 10 AM to 12.30 PM Venue: 3i Infotech Limited ICICI Towers, Plot No. 12, Tower III, South Wing, 5th Floor, Financial District, Nanakramguda, Gachibowli, Hyderabad - 500 032 Contact Person: Satya Note: Candidate must carry Govt.ID Proof and should be in full formals.","location":"Hyderabad","experience":"3 - 5 Years"},{"date":"11 - Jun - 2019","skills":"JAVA, Core-Java, HTML, C++, C","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Northcorp Software Private Limited, Tower-A, 502-503, Digital Greens, Sector 61, Gurugram - 122 102","phone":"8630370961","profile":"Java Developer/ Fresher \nNorthcorp Software Private Limited","description":"Northcorp Software Private Limited, is looking for Java Developer/ Fresher. Candidate should have skills like JAVA, Core-Java, HTML, C++, C Walk-in Date/ Time: 11th June 2019, 10 AM onwards Interview Venue: Northcorp Software Private Limited, Tower-A, 502-503, Digital Greens, Sector 61, Gurugram - 122 102 Contact Person - Deepa Tripathi Tel: 8630370961","location":"Gurgaon","experience":"0 - 1 Years"},{"date":"13, 14 - Jun - 2019","skills":"Insurance Process Back - Office Processing, Admin operations","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Indium Software (India) Limited, #64, Ganesh Chambers, Eldams Road, Chennai - 85","phone":"Not Provided","profile":"Trainee - Java Developer \nIndium Software (India) Limited","description":"Indium Software (India) Limited is looking for Trainee Java Developer at Chennai Fresher with 0- 6 months experience from 2018/19 batch with BE/ B. Tech/ MCA/ BCA background Excellent knowledge in OOPS, Core JAVA, Database concepts Excellent communication is mandatory Walk-in Date/ Time: 13th - 14th June , 10 AM onwards Interview Venue: Indium Software (India) Limited #64, Ganesh Chambers, Eldams Road, Chennai - 85","location":"Chennai","experience":"0 - 1 Years"},{"date":"12, 13 - Jun - 2019","skills":"JSE/ JEE, Spring MVC, JSP/ Java Scripts, Ajax, Jquery, Hibernate/ JPA, SQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Concentrix Daksh Services India Pvt. Limited, Prasad Technology Park Tower A, No: 97, EPIP (Whitefield Ind. Area), Survey no. 152, Hoody Hobli, Krishnarajapuram taluk, Bangalore - 560 066","phone":"8867996428","profile":"Software Engineers - Java \nConcentrix Daksh Services India Pvt. Limited","description":"Candidate should have 2 to 4 years of experience in Core and Advanced Java, Spring & Hibernate and Tools like SVN, maven. Should have experience on working HTML, CSS and JavaScript/ jQuery. Must have excellent written and verbal communication skills Experience in Database technology: Oracle Ability to absorb, understand, analyze and identify critical problems that may result in an outage Desire to work in a collaborative, small-team, fast-paced and demanding support environment. Willing to learn new technology and implement the same Write well-designed, testable code Develop software verification plans and quality assurance procedures Document and maintain software functionality Troubleshoot, debug and upgrade existing systems (Production Support) Desired Skills & Knowledge: JSE/ JEE -Mandatory Spring MVC -Mandatory JSP/ Java Scripts - Mandatory Ajax & Jquery - Mandatory Hibernate / JPA - Mandatory SQL - Mandatory Walk-in Date/ Time: 12th June - 13th June , 9 AM onwards Interview Venue: Concentrix Daksh Services India Pvt. Limited Prasad Technology Park Tower A, No: 97, EPIP (Whitefield Ind. Area), Survey no. 152, Hoody Hobli, Krishnarajapuram taluk, Bangalore - 560 066","location":"Bangalore","experience":"2 - 4 Years"},{"date":"10, 11, 12, 13, 14, 15 - Jun - 2019","skills":"General Administration, Travel Management, Office Administration","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Nipun Net Solutions Private Limited, 5th Floor, Flat No: 501 & 502, Plot No: 802 & 803, Ayyappa Central, Sri Swamy Ayyappa Society, Madhapur, Hyderabad - 500 081","phone":"Not Provided","profile":"Administration Executive \nNipun Net Solutions Private Limited","description":"Candidate should be Any Graduate with 0 to 1 year experience in General Administration, Travel Management, Office Administration. Must have excellent communication skills. Job Responsbility- Needs to Look after Complete Office administration Need to maintain Inward and Outward Register of Stock Need to Maintain and file the Purchase and Sales invoices Need to book the travel tickets to the employees for tours Walk-in Date/ Time: 10th - 15th June , 10 AM onwards Interview Venue: Nipun Net Solutions Private Limited, 5th Floor, Flat No: 501 & 502, Plot No: 802 & 803, Ayyappa Central, Sri Swamy Ayyappa Society, Madhapur, Hyderabad - 500 081","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"10, 11, 12, 13 - Jun - 2019","skills":"Manual and Automation testing, Appium, Performance Testing: Jmeter, FloodIO","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Apalya Technologies Private Limited, 8-2-293/ 82/A/ 1098, 2nd floor, KPR Building, Road No. 36, Jubilee Hills, Hyderabad - 500 033","phone":"Not Specified","profile":"QA - Testing Engineer \nApalya Technologies Private Limited","description":"Candidate should have experience in both Manual and Automation testing: Should have experience in the Mobile automation tools -Appium, Performance Testing: Jmeter, FloodIO API testing experience - Runscope Internal Audit and QMS(software) Preferred OTT platform experience Walk-in Date/ Time: 10th June - 13th June , 9 AM onwards Interview Venue: Apalya Technologies Private Limited 8-2-293/ 82/A/ 1098, 2nd floor, KPR Building, Road No. 36, Jubilee Hills, Hyderabad - 500 033","location":"Hyderabad","experience":"2 - 4 Years"},{"date":"10, 11, 12 - Jun - 2019","skills":"Administration, Facilities Management, Housekeeping, Canteen/ Transportation","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Continuum Managed Solutions Pvt. Limited, Block Rhine, A Wing, 5th Floor, Embassy Tech Zone, Hinjawadi Phase II, Hinjewadi Rajiv Gandhi Infotech Park, Hinjawadi, Pune, Maharashtra - 411 057","phone":"7391055666","profile":"Administration Executive \nContinuum Managed Solutions Pvt. Limited","description":"Candidate should have atleast 2 years of experience in Admin & facilities Management Should be good in communication skills. be comfortable to work in 24*7 shifts. Required skills: Should have handled Housekeeping, Cafeteria, Security, Transport General office administration. Working knowledge on HVAC, Fire alarm systems, Plumbing & Electricals supplies Roles & Responsibility: Ensuring Zero Downtime of business process and Office facility services to be made available 24*7. Providing Safe & smooth working conditions in the office premises. Monitoring Group/ Department Policies & Procedures Vendor Management and Statutory Compliances Walk-in Date/ Time: 10th - 12th June , 11 AM onwards Interview Venue: Continuum Managed Solutions Pvt. Limited Block Rhine, A Wing, 5th Floor, Embassy Tech Zone, Hinjawadi Phase II, Hinjewadi Rajiv Gandhi Infotech Park, Hinjawadi, Pune, Maharashtra - 411 057","location":"Pune","experience":"2 - 7 Years"},{"date":"10 - Jun - 2019","skills":"General Administration, Back Office Assistance, Branch Operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Koenig Solutions Private Limited, 2nd Floor, KLJ Complex-II, Plot No. 70, Opp. Police Station, Moti Nagar, New Delhi - 110 015","phone":"8826055199","profile":"Administration Executive \nKoenig Solutions Pvt. Limited","description":"Koenig Solutions Pvt. Limited, is looking for candidates with Administration/ Sales Coordination experience. Work Timings 8:30 to 5:00pm Monday to Saturday Job Responsbility- Center Operations, Administrative assignments, Student handling Walk-in Date/ Time: 10th June 2019, 9 AM onwards Interview Venue: Koenig Solutions Private Limited 2nd Floor, KLJ Complex-II, Plot No. 70, Opp. Police Station, Moti Nagar, New Delhi - 110 015","location":"Delhi","experience":"2 - 7 Years"},{"date":"10 - Jun - 2019","skills":"Core Java, J2EE and framework like Struts, Hibernate, Spring, MVC","qualification":"B.Sc, BCA/BCS, B.E./B.Tech, B.A., B.Com, B.B.A, B.Sc","address":"Amazon Development Centre (India) Pvt. Limited, Ground Floor, Infinity tower, Tata Ramanujan IT City SEZ, Rajiv Gandhi Salai, Near Tidal Park, Old Mahabalipuram Rd, Taramani, Chennai - 600 113","phone":"Not Provided","profile":"Quality Assurance Associate \nAmazon Development Centre (India) Pvt. Ltd","description":"Amazon is hiring Quality Assurance Associate for Chennai location, this is a Contract role for a period of 6 months. Please find the below Job Description for the same and criteria to apply for this role. You may appear for the interview if you find yourself matching the below criteria. Eligibility Criteria: Freshers / candidates with less than one year of experience. Course Completion Year: 2017/2018/2019 Passed Outs (Only candidates, who have completed & cleared their educational degree and have all Semester Mark sheets should apply) Immediate Joiners preferred Basic Qualifications: Functioning knowledge of Microsoft systems including: Word, Excel Fluent English language skills (spoken and written) Ability to meet deadlines in a fast-paced work environment driven by software systems and processes Ability to trouble-shoot and make visual quick decisions based on training Ability to work weekends Preferred Qualifications: Knowledge/experience in publishing industry would be preferred Experience in quality assurance Experience in tracking data Aptitude to quickly learn new systems and software Ability to multi-task and prioritize, with strong organizational and follow-up skills Interview Date: 10th June 2019 Walk-in Time : 10:30 AM to 2:00 PM Interview Venue: Amazon Development Centre (India) Pvt. Limited Ground Floor, Infinity tower, Tata Ramanujan IT City SEZ, Rajiv Gandhi Salai, Near Tidal Park, Old Mahabalipuram Rd, Taramani, Chennai - 600 113 Valid ID proof needed : Carry a valid photo identification proof (Aadhar Card, Pan Card or any other Government recognized photo identification) Interview Process: Written Test Managerial interviews","location":"Chennai","experience":"0 - 1 Years"},{"date":"10, 11 - Jun - 2019","skills":"Automation Testing, Selenium, QTP, White Box Testing, Functional Testing, Smoke Testing","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Infiniti-Research Marketing Solutions India Pvt. Limited, Bangalore Cessna Business Park, Embassy Signet, 1st Floor - Left Wing Kadubeesanahalli, Bangalore - 560 087.","phone":"080-61914606","profile":"Software Testing Engineer \nInfiniti Research Marketing Solutions India Pvt. Limited","description":"Key Requirements: 3-4 Years of hands on experience in Automation testing with good product experience Having good experience in Nunit testing, smoke testing, functional testing, blackbox & whitebox testing. Strong debugging and basic programming skills Automation tool experience will be preferred (Selenium, QTP etc. , ) Understanding of the principles and framework of Agile development Strong technical skills and logic are required. Primary Responsibilities: The candidate will be responsible for analyzing, testing, and evaluating software products. Ensure all products meet end-user and Company requirements and standards. Essential Responsibilities: Test for overall quality, accuracy, functionality and performance. Working closely with Development and Product Management teams, assist in the design of features for baseline and custom software development. Analyze, test, and evaluate software to ensure all products meet end-user and Company requirements and standards. . Work with Support and other technical staff to analyze and resolve product related issues. As a team member, help formulate solutions to complex problems and work to resolve open software issues. Walk-in Date/ Time: 10th - 11th June , 11 AM onwards Interview Venue: Infiniti-Research Marketing Solutions India Pvt. Limited Bangalore Cessna Business Park, Embassy Signet, 1st Floor - Left Wing Kadubeesanahalli, Bangalore - 560 087. (Opp. to Walmart Labs, Near New Horizon Engineering College) Contact Person: Shruti","location":"Bangalore","experience":"3 - 5 Years"},{"date":"10 - Jun - 2019","skills":"SQL Queries, Regression Testing, Manual Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Wipro; Candor Info Space Building 2, Subhash Chowk, Tikri, Sec 48 Gurgaon - 122 001","phone":"Not Provided","profile":"Software Testing Engineer \nWipro HR Services Private Limited","description":"Education Qualification - B.E./B.Tech./MCA Experience - 1.6 to 3 Years Immediate joiner - can join within 1 month Designation - Analyst Knowledge of SQL Queries, Regression Testing, Manual Testing Knowledge of designing Test Plan Able to work on assigned tasks independently and also handle queries from fellow team members Good Analytical Skills & problem solving skills Have the ability to escalate issues with a view to bringing about a win-win resolution Good written & spoken communication skills Walk in on - 10th June (Monday) Walk in time - 11:00am to 1:00pm Interview Venue: Wipro; Candor Info Space Building 2, Subhash Chowk, Tikri, Sec 48 Gurgaon - 122 001 Contact Person - Kajol Singh","location":"Gurgaon","experience":"1 - 3 Years"},{"date":"10 - Jun - 2019","skills":"Manual Testing Software Testing Test Engineering UI Testing Writing Test Cases","qualification":"B.E./B.Tech","address":"EbizON Netinfo Private Limited, 7th Floor, Tower A Logix Cyber Park, C-28-29, Industrial Area, Sector 62, Noida","phone":"Not Provided","profile":"Quality Analyst/ Software Tester \nEbizON Netinfo Private Limited","description":"Urgent openings for Quality Analyst role with problem solving abilities and the aptitude to take corrective action and support interesting projects. Education : B.Tech with 70% throughout the academics. Experience : 0.6 - 2 Years of experience Preferred : Immediate or early joiners. Must have good Analytical skills (i.e should be able to well understand the requirements) Should have experience in Usability testing, UI testing and writing Test cases Should have good communication skills Job Responsibility: Work with the development teams to ensure each release meets high quality standards Create test plans and test cases from wire-frames Execute manual test cases, report and track issues in ticketing systems, and verify fixes Building a strong working relationship with all the teams More to offer: Competitive salary and timely increments Potential Career Growth to Lead role for high performers Team & Individual Learning and Development is part of our culture Vibrant community and regular team outs Great team members & energy filled work environment Interview Date : 10th June 2019/Monday. Time : 11AM - 2 PM Interview/ Work Location : EbizON Netinfo Private Limited 7th Floor, Tower A Logix Cyber Park, C-28-29, Industrial Area, Sector 62, Noida","location":"Noida","experience":"0 - 2 Years"},{"date":"10, 11 - Jun - 2019","skills":".NET Projects, HTML and SQL Server","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Karvy Fintech Private Limited, (Formerly known as KCPL Advisory Services Pvt. Limited), Karvy Selenium Tower B, Plot Nos. 31 & 32, Financial District Nanakramguda, Serilingampally Mandal, Hyderabad - 500 032","phone":"040 33215106","profile":".Net Developers \nKarvy Fintech Private Limited","description":"Opportunity in one of our leading Business Unit for .Net Developers with HTML & SQL understanding too. Candidate should have minimum 1 to 3 years of hands-on development experience with the following technologies: .NET Projects, HTML and SQL Server. Must have extensive experience in developing N-tier applications. Should have good experience with reporting tools. DATE: 10th - 11th June 2019 TIME: 12 PM to 3 PM VENUE: Karvy Fintech Private Limited (Formerly known as KCPL Advisory Services Pvt. Limited) Karvy Selenium Tower B, Plot Nos. 31 & 32, Financial District Nanakramguda, Serilingampally Mandal, Hyderabad - 500 032 Tel: 040 33215106 CONTACT PERSON: SHRUTHI The following documents are mandatory and we request you to bring these for the discussion 1. Copy of your updated resume (Mention Shruthi on the top of your CV) 2. Proof of identification 3. Passport Size photograph.","location":"Hyderabad","experience":"1 - 3 Years"},{"date":"10, 11, 12 - Jun - 2019","skills":"ASP .NET framework, SQL Server and Design/ Architectural Patterns","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Spigot Software Private Limited, 531/144, 3rd Floor, Outer Ring Road, Agara Village, 1st Sector, HSR Layout, Bengaluru, Karnataka - 560 102","phone":"Not Provided","profile":".Net Developer \nSpigot Software Private Limited","description":"Required Skills- 4 to 7 years knowledge of .NET Web framework. Familiarity with the ASP .NET framework, SQL Server and Design/ Architectural Patterns (e.g. Model-View-Controller (MVC)) Knowledge of at least one of the .NET languages (e.g. C#, Visual Basic .NET) and HTML5/ CSS3. Strong understanding of object-oriented programming. Experience creating database schemas that represent and support business processes. Knack for writing clean, readable, and easily maintainable code. Experience advocating for and using new technology to build applications of the future. Job Responsibilities: Assist in the design, development, and support of an enterprise web hosting plat formand related components. Translate application storyboards and use cases into functional applications. Design, build, and maintain efficient, reusable, and reliable code. Integrate data storage solutions in SQL server. Ensure the best possible performance, quality, and responsiveness of applications. Participate in all phases of the lifecycle of software application development with an emphasis on design, quality and implementation. Walk-in Date/ Time: 10th - 12th June , 10 AM onwards Interview Venue: Spigot Software Private Limited 531/144, 3rd Floor, Outer Ring Road, Agara Village, 1st Sector, HSR Layout, Bengaluru, Karnataka - 560 102 Contact Person: Subburaj P Mobile: 9036016263 Interested Candidates, please mail your updated cv to subburaj.p@spigotsoft.com","location":"Bangalore","experience":"4 - 7 Years"},{"date":"10, 11, 12, 13, 14, 15 - Jun - 2019","skills":"Asp .Net, C#, Ajax, MVC, .Net framework 3.5 & above","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Jayam Solutions Private Limited, Anjaneyanagar Colony, Plot # 277 Moosape, Hyderabad","phone":"040-48526868","profile":"Senior .Net Developer \nJayam Solutions Private Limited","description":"Person must have good hands-on development experience in the following: Asp .Net, C#, Ajax, MVC (Must) .Net framework 3.5 & above IDE: Visual Studio MS SQL Server HTML 5, CSS 3, Angular Js, JQuery Walk-in Date/ Time: 10th - 15th June 2019, 10 AM onwards Interview Venue: Jayam Solutions Private Limited Anjaneyanagar Colony, Plot # 277 Moosape, Hyderabad NOTE : MALE CANDIDATES ONLY","location":"Hyderabad","experience":"2 - 4 Years"},{"date":"10, 11, 12 - Jun - 2019","skills":"C#, Win Form, MVC, Web API, SQL Server 2012","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Fidelity National Financial India Pvt. Limited, Umiya Business Bay Tower 2, 6th Floor, Cessna Business Park, Kadubisanahalli, Bangalore - 560 103","phone":"Not Provided","profile":".Net Developer \nFidelity National Financial India Pvt. Limited","description":"Work Experience: 1 to 6 Years 1 year contract role (Convertable to permanent position) Rotational Shift Required Key Skills: Highly Proficient in C#, Win Form Excellent Debugging, analytical and problem-solving skills Knowledge on Relational Databases and SQL Server 2012 onwards Hands on experience in designing interactive applications, Window Based Applications, and developing Microsoft Console applications Having Knowledge of MVC and WebAPI. Ability to work productively in a team Job Responsibilities: Develop, enhance and execute entire lifecycle of software products Code, test, debug software products by testing for and fixing errors Integrate software components into a fully functional software system and Develop software verification plans and quality assurance procedures Assure compliance with coding standards and project plans aligned with clients protocols Adhere to the workflow, standard processes hence optimizing the source code Configuration Manager has TFS Configuration knowledge with Development Skill as above Walk-in Date/ Time: 10th - 12th June 2109, 11 AM onwards Interview Venue: Fidelity National Financial India Pvt. Limited Umiya Business Bay Tower 2, 6th Floor, Cessna Business Park, Kadubisanahalli, Bangalore - 560 103 Contact Person: Sseema Bhat","location":"Bangalore","experience":"1 - 6 Years"},{"date":"10, 11, 12, 13, 14, 15, 16 - Jun - 2019","skills":"C# .Net, VB .Net, WPF, MVVM (Model View View Model), SQL Database","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Marg ERP Limited, Marg House, Plot No. 7, Press Area Wazirpur, Near D.T.C Depot Opp, Netaji Subash Place, New Delhi - 110 035","phone":"Not Provided","profile":".Net Developers - WPF \nMarg ERP Limited","description":"Candidate should have proven experience in desktop solutions by using like C# .Net, VB .Net, WPF, MVVM (Model View View Model), SQL Database. Proven experience on qualification of the desktop solutions. Must be strong in OOPS concepts. Excellent Programming Skills using C#, WPF, MVVM, Winforms Solid Understanding of Multi-Threading and Parallel Programming. Solid understanding of Windows Operating System Internals (Process, Threads, Memory Management). Solid understanding of OOP and OOAD Excellent application debugging skills using Visual Studio Debugger Work Experience: 3-8 Years Mandatory Skills: C#, WPF, MVVM CTC Best in the market Walk-in Date - 10th to 16th June 2019 Timing - 10 AM to 5 PM Interview Venue- Marg ERP Limited Marg House, Plot No. 7, Press Area Wazirpur, Near D.T.C Depot Opp, Netaji Subash Place, New Delhi - 110 035 Interested can share their Resume/ CV to Kulvinder.s@margerp.com with below required details- Current CTC : Notice Period: Total experience: Expereince in WPF: Avaialibility for the interview:","location":"Delhi","experience":"3 - 8 Years"},{"date":"11 - Jun - 2019","skills":"C#, .Net, Micro services development using Web API","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"IMS Health Analytics Service Pvt. Limited, IQVIA- Wing A,5th Floor, KGISL Campus, Saravanampatti, Coimbatore - 641 035.","phone":"Not Mentioned","profile":"Full Stack Developer (.Net) \nIMS Health Analytics Service Pvt. Limited","description":"Candidate must have strong Foundation in .NET Concepts and Object Oriented Programming. Should have 3+ years of experience with C#, .Net, Micro services development using Web API. Knowledge in WCF and SOAP Web Services Must have strong Hands-on working experience in ORM (Entity Framework, Dapper, Auto mapper) Strong Hands-on experience in at-least one Javascript SPA Web frameworks (Angular, ReactJS, Vue.js) Hands-on Experience in Asynchronous Programming (Rabbit MQ , Active MQ) Strong Hands-on experience in at-least one Javascript based UI Component Frameworks (Telerik) Sufficient Knowledge in Data Modelling. Strong knowledge in Database development preferably SQL Server. Experience in performance tuning for the sqL queries. Strong Hands-on experience in at-least one No-SQL technologies (Preferably Mongo-DB, Cassandra) Strong knowledge in Unit-Testing , Mock Frameworks and Design Patterns Adaptable as a Polyglot Full stack developer capable of learning new technologies quickly. Knowledge in .NET Core, Cloud technologies are Essential. Must have strong communication and interaction skills. Should have work experience in Devops and agile development methodology. Experience with Healthcare domain is added advantage. Interested candidates please walk-in to below venue on 11th June, 2019 between 10 am to 12 pm. IMS Health Analytics Service Pvt. Limited IQVIA- Wing A,5th Floor, KGISL Campus, Saravanampatti, Coimbatore - 641 035.","location":"Coimbatore","experience":"3 - 8 Years"},{"date":"10, 11, 12, 13, 14, 15 - Jun - 2019","skills":"C#, ASP .NET (4.0 and 4.5), SQL Server, HTML, CSS, AJAX, JQuery, MVC framework","qualification":"B.Sc, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"A R Software Private Limited, 414, 415 A -4th Floor, DLF Center Point, Sector -11 Near Bata Mod, Faridabad. Nearst Metro Station - Bata Chowk","phone":"0129-4175058","profile":"Software Developers (.Net) \nA R Software Private Limited","description":"Candidate should be expert in C#, ASP .NET (4.0 and 4.5), SQL Server, HTML, CSS, AJAX, JQuery, MVC framework. Must have demonstrated experience in the support of Microsoft SQL Server 2008 and 2012. Configure MS SQL Server and deploy Data Base. Job Responsbility- Responsible for full SDLC activities. Plan, Analyze, Design, Code, Test and Deploy .NET Web Application & Windows Application. The individual will work on all the tasks independently. Walk-in Date/ Time: 10th - 15th June , 9 AM onwards Interview Venue: A R Software Private Limited 414, 415 A -4th Floor, DLF Center Point, Sector -11 Near Bata Mod, Faridabad. Nearst Metro Station - Bata Chowk","location":"Faridabad","experience":"2 - 5 Years"},{"date":"10, 11, 12, 13, 14 - Jun - 2019","skills":"Automation Testing, Functional Testing, Regression Testing, Web Application Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Acknown Technologies Private Limited, 420, 4th Floor, Nirvana Courtyard, Nirvana Country, Sector- 50 Gurgaon,","phone":"9625882814","profile":"QA/ Testing Engineer \nAcknown Technologies Private Limited","description":"We are looking for a QA Tester to assess software quality through manual and automated testing. You will be responsible for finding and reporting bugs and glitches. In this role, you should have a keen eye for detail and excellent communication skills. If you are also competent in executing test cases and are passionate about quality, wed like to meet you. Ultimately, you will ensure that our products, applications and systems work correctly. Candidate must have proven experience as a QA Tester should have experience in QA methodology Ability to document and troubleshoot errors Excellent communication skills Analytical mind and problem-solving aptitude Strong organizational skills Candidate must be familiar with software testing process and its documentation (i.e test plan, test cases, test report etc.). Familiar with different type of software testing techniques. i.e. Functional Testing, regression testing, sanity, and smoke, Browser based testing, Responsive application testing. Must have exposure in web application testing and Mobile app (iOs or Android) testing. Must have understanding about different aspects of web sites security. Must have knowledge about defect/ bug reporting and its life cycle. Knowledge of web services testing (REST and SOAP) would be preferred. Knowledge of Selenium webdriver and Jmeter would be preferred. Job Responsibilities:- Ability to understand application requirement given by client/ business team and he/she should be able to prepare documents for test cases, test scenarios for provided requirements. Walk in Details: Date : 10th June - 14th June Time: 12 PM- 6 PM Interview Venue: Acknown Technologies Private Limited 420, 4th Floor, Nirvana Courtyard, Nirvana Country, Sector- 50 Gurgaon, Contact Person: Kapil Tel: #9625882814","location":"Gurgaon","experience":"3 - 6 Years"},{"date":"10, 11 - Jun - 2019","skills":"PHP Web frameworks such as Laravel, MySQL Server","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Cogent E-Services Private Limited, C-121 Sector 63, Noida","phone":"9582987088","profile":"PHP Developer \nCogent E-Services Private Limited","description":"Candidate should be B-Tech/ MCA with strong knowledge of PHP Web frameworks such as Laravel, MySQL Server and its objects. Must have understanding of MVC Design Patterns. Basic understanding of front-end technologies, such as JavaScript, HTML5, and CSS3 Should have understanding of Ajax and Jquery Knowledge of object oriented PHP programming Integration of multiple data sources and databases into one system Proficient understanding of code versioning tools, such as SVN, Git Walk-in Date/ Time: 10th - 11th June , 9 AM onwards Interview Venue: Cogent E-Services Private Limited C-121 Sector 63, Noida","location":"Noida","experience":"1 - 4 Years"},{"date":"10, 11, 12, 13, 14, 15 - Jun - 2019","skills":"API, MySQL, Core PHP, AJAX, CSS, etc","qualification":"B.E./B.Tech","address":"Abchlor Investment Advisors Pvt. Limited, 409, Laxmi Mall, Link, Andheri West, Mumbai - 400 053","phone":"022-40713322","profile":"PHP Web Developer \nInvestOnline.in (Abchlor Investment Advisors)","description":"Candidates with minimum 2 years of relevant experience in API, MySQL, Core PHP, AJAX, CSS may apply. - Demonstrable knowledge of web technologies including HTML, CSS, Javascript, AJAX etc. - Good knowledge of MySQL. - Experience in integrating third-party APIs. - Passion for best design & coding practices. - Desire to develop new bold ideas. Job Responsbility: - Write clean, well designed code. - Troubleshoot, test and maintain the core product software and databases to ensure smooth functionality. Walk-in Date/ Time: 10th - 20th June , 10 AM onwards Interview Venue: InvestOnline.in Abchlor Investment Advisors Pvt. Limited 409, Laxmi Mall, Link, Andheri West, Mumbai - 400 053","location":"Mumbai","experience":"2 - 5 Years"},{"date":"15 - Jun - 2019","skills":"Core Java - Fresher","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Compass Systems Private Limited, E84 Sector 63 Noida","phone":"Not Provided","profile":"Java Developer - Fresher \nCompass Systems Private Limited","description":"Candidate should be BE/ B.Tech/ BCA or MCA with good communication skills. Must be an Innovative, creative & a fresh thinker. Job Responsibility- Core Java development and profiling using JVMPI/ JMTI/ BCI and other Java profiling tools. Performance monitoring, profiling, analysis and tuning of Java based applications, Monitor and Evaluate OS resource utilization, Monitor and Tune Garbage Collector performance, JVM, Java Applications, Examine and tune 64 bit JVMs, Optimize the JVM for Multi-core platforms Walk-in Date/ Time: 15th June 2019 from 11 AM onwards Interview Venue: Compass Systems Private Limited E84 Sector 63 Noida","location":"Noida","experience":"0 - 1 Years"},{"date":"10 - Jun - 2019","skills":"PHP, Word Press, HTML and JQuery","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Info Edge India Limited, Express Trade Tower (ETT), B 36, 3rd Floor, Tower I, Sector 132, Noida","phone":"01203082090","profile":"PHP Developer \nInfo Edge India Limited","description":"Requirements: Any Graduate - Any Specialization Minimum 2 years experience in PHP, Word Press, HTML and JQuery. Good Knowledge of PHP and Word Press themes. Good Knowledge of Responsive Design, Bootstrap & Html5. Up to 3 years of experience in website landing page HTML Development Experience in Project Development to Deployment Solid background and knowledge of Adobe Photoshop, WordPress HTML5, CSS3, Jquery, Javascript, PHP. Competencies required to do this job well: Collaboration & Team Work People Leadership Focus on Results Customer Focus Execution Excellence Effective Communication Entrepreneurial Orientation Innovation and Openness to Learning Walk-in Date - 10th June 2019 (Monday) Time - 10 AM - 3 PM Interview Venue - Info Edge India Limited Express Trade Tower (ETT), B 36, 3rd Floor, Tower I, Sector 132, Noida Contact Person - Kuldeep Singh (Group Manager)","location":"Noida","experience":"2 - 6 Years"},{"date":"10, 11, 12, 13, 14, 15 - Jun - 2019","skills":"Web Application, Mobile Application, Java, PHP, UI/ UX, Sales force","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Marolix Technology Solutions Pvt. Limited, Nasuja Building, H No.1-89/G/36, Raheja Mindspace, Near Westin Hotel, Hyderabad - 500 081.","phone":"040-43464347","profile":"Software Developers (Web, Java, PHP) \nMarolix Technology Solutions Pvt. Limited","description":"We are looking for a Software Developers (Freshers) responsible for building applications. Candidates should have good levels of Logical Reasoning, Quantitative Aptitude and Computer fundamentals. Should be fluent in English with a learning attitude. Required Skills (Any One) Web Application, Mobile Application, Java, PHP, UI/ UX, Sales force, Python Word Press, Digital Marketing, Testing. Your primary responsibility will be to design and develop the applications, and to coordinate with the rest of the team working on different layers of the infrastructure. Thus, a commitment to collaborative problem solving, sophisticated design, and product quality is essential. Walk-in Date/ Time: 10th - 26th June , 10 AM onwards Interview Venue: Marolix Technology Solutions Pvt. Limited Nasuja Building, H No.1-89/G/36, Raheja Mindspace, Near Westin Hotel, Hyderabad - 500 081. Contact No: 040-43464347 Mobile No:9490000903 Note: Candidate who have attended the interview with Marolix Technology in the last 6 months not eligible.","location":"Hyderabad","experience":"0 - 2 Years"},{"date":"10, 11, 12 - Jun - 2019","skills":"Javascript JQuery MySQL Core PHP Web Development Rest Web Technologies","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Recenturesoft Infotech Pvt. Limited, 304, A-74, Sector 63, Noida","phone":"Not Provided","profile":"PHP Developers \nRecenturesoft Infotech Private Limited","description":"PHP DEVELOPERS: 2 to 4 years experience - 10 positions Salary - 2.4 lacs to 5 lacs pa LEAD PHP DEVELOPERS: 5 to 8 years experience - 5 positions Salary - 6 lacs to 12 lacs pa Required Skills: Strong experience in PHP web development Strong knowledge of Core PHP, Any framework. Understanding the fully synchronous behaviour of PHP. Knowledge on REST API Development. Working on Product based Development. Good understanding and knowledge on various database: 1) JavaScript 2) JQuery 3) Php 4) Opencart 5) MySQL 6) LAMP Environment Team Management experience for lead position Walk-in Date/ Time: 10th - 12th June , 10 AM onwards Interview Venue: Recenturesoft Infotech Pvt. Limited 304, A-74, Sector 63, Noida","location":"Noida","experience":"2 - 8 Years"},{"date":"10, 11, 12, 13, 14, 15 - Jun - 2019","skills":"PHP, React.js, Laravel, Yii Codeigniter, Core PHP, Phalcon","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Remote Programmer Private Limited, 705 Kalikapur Road Kolkata - 700099","phone":"Not Provided","profile":"PHP Developers \nRemote Programmer Private Limited","description":"We need intelligent PHP Developers for overseas Agile projects in Yii2/ Phalcon with React and PgSQL. Good knowledge of HTML, PHP and SQL with 2 + years are must. Knowledge of Yii2 or Phalcon or React or PGSQL are not must. Walk-in Date/ Time: 10th June - 31st July , 10 AM onwards Interview Venue: Remote Programmer Private Limited 705 Kalikapur Road Kolkata - 700099","location":"Kolkata","experience":"2 - 5 Years"},{"date":"15 - Jun - 2019","skills":"Core Java/ DotNet/ Python","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Prutech Solutions India Pvt. Limited, Location: 4th Floor, A Block Unit 1, MJR Magnifique, Khajaguda X Road, Hyderabad - 500 008","phone":"040-48144424","profile":"Software Developer (Java/ .Net/ Python) \nPruTech Solutions India Pvt. Limited","description":"Walk-in Drive for Freshers at PruTech CMMI Level 3 Company on Saturday (15.06.2019) , Hiring Freshers for the positions of Java Developers , DotNet Developers and Python Developers. Candidates should have undergone for the Training either on Core Java/ DotNet/ Python Eligibility Criteria : MCA/ BE/ B.Tech - 2017, 2018 and 2019 Pass Out Experience: 0 - 1 Years Job Location: Hyderabad Notice period: Immediate Should have good Knowledge on the Programming Lanaguages like Java/ DotNet/ Python Should have excellence in the Academins Should possess Good Communication Skills Interview Process: Written Test, Group Discussion and Technical Interview Venue Details : Prutech Solutions India Pvt. Limited, Location: 4th Floor, A Block Unit 1, MJR Magnifique, Khajaguda X Road, Hyderabad - 500 008 Contact Person Name : Keerthi Chekuri Walk-in Date: Saturday (15.06.2019)","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"10, 11, 12, 13, 14 - Jun - 2019","skills":"Keyskills general administration housekeeping electrical maintenance soft services event management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"nThrive Global Solutions Pvt. Limited, Unit 1-5-2, Block A - Eastern Front Wing TECCI Park No: 285, Old Mahabalipuram Road Sholinganallur, Chennai, TN - 600 119","phone":"8448999191","profile":"Administration Executive \nnThrive Global Solutions Pvt. Limited","description":"Educational Qualification: Any Graduate/ Post Graduate Experience: 6 to 9 Years in General Administration Industry: IT / ITES / FMS Skills Set Required: Soft Services pertaining to administration Handled physical Security & Process Housekeeping and cleaning Repairs & Maintenance Electrical, Plumbing etc. Event Management Printing & Stationery Travel & Accommodation Inventory Management Languages & Communication Skills: Good spoken and written communication skills. English, Tamil, (Hindi can be added advantage but not must) Technical Skills: Word, Excel, PPT, MIS and usage of various tools. If the above criteria is suitable kindly walk-in for an interview from 10th to 14th June' 2019 between 11am - 4pm at the below mentioned address- nThrive Global Solutions Pvt. Limited, Unit 1-5-2, Block A - Eastern Front Wing TECCI Park No: 285, Old Mahabalipuram Road Sholinganallur, Chennai, TN - 600 119","location":"Chennai","experience":"6 - 9 Years"},{"date":"11 - Jun - 2019","skills":"Office Administration, Back Office Operations, General Administration, Front Office Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"ANAROCK Property Consultants Pvt. Limited (Formerly Jones Lang LaSalle Residential Pvt. Limited), 4th Floor, Rear Block, Chaitanya Imperial, Anna Salai, Teynampet, Chennai - 600 018","phone":"9840658963","profile":"Front Office/ Admin Executive \nAnarock Property Consultant Pvt. Limited","description":"Candidate should be Any Garduate with 3 to 6 years experience in Office Administration, Back Office Operations, General Administration, Front Office Management, Travel Arrangements, and Vendor Management. Job Responsbility- Attending Incoming & Outgoing calls with proper etiquettes and maintaining records for them and Greeting and assisting visitors and Guests. Ensure Visitor and Guest entry in register and Maintenance of Attendance Register. Being the mirror of the organization, to behave in a very professional manner and always acquiring the professional ethics. Taking care of dispatch, keeping records for incoming and outgoing couriers and further distribution to office employees. Monitor, respond to and distribute incoming communications. Interact with external clients. Walk-in Date/ Time: 11th June 2019, 11 AM onwards Interview Venue: ANAROCK Property Consultants Pvt. Limited (Formerly Jones Lang LaSalle Residential Pvt. Limited) 4th Floor, Rear Block, Chaitanya Imperial, Anna Salai, Teynampet, Chennai - 600 018","location":"Chennai","experience":"3 - 6 Years"},{"date":"7, 8, 10 - Jun - 2019","skills":"Technical Support, International Voice Process, Customer Support","qualification":"B.E./B.Tech, B.Sc, BCA/BCS","address":"Shining Stars IT Private Limited, Ist floor, Chanchal Complex, Cant Road, Lucknow","phone":"7905813124","profile":"Technical Support Associate \nShiningStars Institutions & Travels Pvt. Limited","description":"REQUIREMENT: Candidate must be Graduate (BCA, B.Tech, BE) We are looking for excellent communication skills Neutral accent Should have good pronunciation Comfortable with the night Shifts Salary :- Upto 3 LPA Job Location :- Noida /Gurugram Basic Incentives with no capping 24 x 7 security for all employees Cab facility available. Walk-in Date/ Time: 7th - 10th June , 11 AM onwards Interview Venue: Shining Stars IT Private Limited Ist floor, Chanchal Complex, Cant Road, Lucknow LandMark - Opp Medwell Hospital - Burlington Square Feel free to call us any time @ 7905813124 Alia (HR Recruiter) Whatsapp available on the same number 24*7","location":"Noida, Gurgaon, Lucknow","experience":"0 - 2 Years"},{"date":"6, 7 - Jun - 2019","skills":"Technical Support, IT Help desk, Service Desk, Incident Management","qualification":"B.Sc, BCA/BCS, B.E./B.Tech, Diploma, B.A., B.Com, B.B.A, B.Sc","address":"Precision Techserve Private Limited, Plot # 68, Syndicate Bank Colony, ICICI ATM Lane, West Marredpally, Secunderabad - 500 026","phone":"9121274475","profile":"IT Helpdesk/ Support Engineer \nPrecision Techserve Private Limited","description":"Immediate job opportunity for IT Help Desk/ IT service Desk Executive/ IT Help desk Engineer in Hyderabad and Guntur locations. Desired Skills/ Experience: Any Bachelors Degree/ Diploma or Equivalent ITIL certification is preferred but no mandatory Willing to work under 24/7 support Good verbal & written communication skills Should have 1 to 2 Years Experience. Only MALE candidates are required. Willing to relocate to Guntur or Hyderabad. Walk-in Date/ Time: 6th - 7th June , 9 AM onwards Interview Venue: Precision Techserve Private Limited Plot # 68, Syndicate Bank Colony, ICICI ATM Lane, West Marredpally, Secunderabad - 500 026 Landmark: Near West Marredpally Police Station. Note: Looking only IT Help desk role interested candidates can apply immediately.","location":"Hyderabad, Secunderabad","experience":"1 - 2 Years"},{"date":"7, 8 - Jun - 2019","skills":"Customer Service, Inbound/ Technical Support, Network troubleshooting","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"CSS Corp Private Limited, Ground Floor, 32A & 32B, Ground Floor, Ambit IT Park, Ambattur Industrial Estate, Ambattur, Chennai - 600 058","phone":"9789877694","profile":"Technical Support Engineer \nCSS Corp Private Limited","description":"We are looking for a Technical Support Engineer to provide resolution to our customers. Qualification/ Skills: Graduation is Mandatory, or 10+3 years of diploma is acceptable Good communication in English & excellent telephone etiquette. Experience with customer service environment preferred. Logical reasoning and analytical skills. Flexible to work in night shift. Roles & Responsibilities: Troubleshooting network related problems and diagnosing and solving software issues. Providing support, including procedural documentation and documenting relevant reports Handle inbound queries pertaining to the network & application issues. Working with Engineering on customer driven product requests & enhancements and improving product feature offerings by providing customer feedback to internal cross-functional teams. Interview Date: 7th & 8th June-2019 Time: between 11:00 am - 4:00 pm Interview Venue: CSS Corp Private Limited, Ground Floor, 32A & 32B, Ground Floor, Ambit IT Park, Ambattur Industrial Estate, Ambattur, Chennai - 600 058 HR Raghav (9789877694) Documents to Carry: 2 copies of resume. PAN Card or Aadhar Card Please mention HR name (Raghav) on top of your resume","location":"Chennai","experience":"0 - 3 Years"},{"date":"6, 7, 8, 10 - Jun - 2019","skills":"LAN/ WAN Switches, Routing, Hardware/ Networking","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Vindhya e-Infomedia Private Limited, No. 3, 4th Main Road, 2nd Cross, 4th Stage, Industrial Town,Rajajinagar, Bangalore - 560 044","phone":"7020220355","profile":"Technical Support/ Team Leader \nVindhya e-Infomedia Private Limited","description":"We have excellent job opportunity with Technical Support/ Team Leader Qualification: Any Graduate Experience :- in TL 1-2 Years Required Skills :- LAN/ WAN Switches, Routing, Hardware/ Networking, Salary: INR 1,75,000 - 2,50,000 P.A No. of Openings: 2 Walk-in Date/ Time: 6th June - 10th June , 9 AM onwards Interview Venue: Vindhya e-Infomedia Private Limited No. 3, 4th Main Road, 2nd Cross, 4th Stage, Industrial Town,Rajajinagar, Bangalore - 560 044","location":"Bangalore","experience":"2 - 3 Years"},{"date":"7, 8, 10, 11, 12, 13, 14 - Jun - 2019","skills":"Technical Support, Window Support, OS, Networking, Connectivity Troubleshooting","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Sutherland Global Services Private Limited, 45A, Sutherland, Vijayanagaram, Velachery Chennai - 42.","phone":"8939113038","profile":"Technical Support Executive \nSutherland Global Services Pvt. Limited","description":"Sutherland Global Services Pvt. Limited, is Hiring for International client for Technical support process. Candidate should have minimum of 6 months International call taking experience is mandate. Should have good knowledge on window support, OS, Networking, Connectivity issue knowledge. Looking for candidate who join immediately and 15 days of notice can apply. Candidate should be flexible to work for rotational night shift. Cab facility will be given for night shift. Salary range between 2.50L to 3.50L PA. Roles & Responsibility Resolving technical issue for the customer over the phone for product like computer, laptop and mobile support. International call taking process across the globe. Provide completed technical support to the customer. Interested candidate shall walk-in for interview from 7th - 14th June 2019 Interview timing - 1.00 AM to 5.00 PM Interview Venue: 45A, Sutherland, Velachery, Vijayanagaram, Chennai - 42. Interested candidate shall drop in mail- Pavithra.s2@sutherlandglobal.com HR - Pavithra.S Contact - 8939113038","location":"Chennai","experience":"1 - 6 Years"},{"date":"7, 8 - Jun - 2019","skills":"Technical Support, Customer Support, International Voice Process","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Tech Mahindra Limited, Software Development Block -4 Ground Floor, ODC-1 602/3, Elcot SEZ, Sholinganallur Village Chennai - 600 119","phone":"Not Provided","profile":"Technical Support (Voice Process) \nTech Mahindra Limited","description":"Candidate should be Any Graduate having good communication skills Should be flexible to work in Rot night shifts (24/7) support. Should be good in Intracting. Fresher (2019 Pass out are most welcome) Should have basic understanding in Networking, Desktop 2018/2019 Freshers are most welcome (Any Graduates can apply // backlogs are accepted) Candidate should be flexible to work in 24*7 environments (Rotational Shift), Must be comfortable to work in night shifts. Walk-in with Resume and AADHAR on 7th - 8th June 2019 Entry Time: 10.00 AM-3.00 PM Interview Venue: Tech Mahindra Limited, Software Development Block -4 Ground Floor, ODC-1 602/3, Elcot SEZ, Sholinganallur Village Chennai - 600 119","location":"Chennai","experience":"1 - 5 Years"},{"date":"10, 11, 12, 13, 14 - Jun - 2019","skills":"Technical Support, Windows Support, Networking, Application Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Iron Mountain Services Private Limited, Level 10, Citrine Block, Bagmane World Technology Center (BWTC) Mahadevapura, Marathahalli Ring Road, Bangalore - 560 048","phone":"Not Provided","profile":"Systems/ Support Engineer \nIron Mountain Services Private Limited","description":"Must to Have Skills/ Qualification: - Excellent organizational skills and the ability to work on multiple concurrent tasks - Strong English written, verbal communication and presentation skills - Bachelor of Science or equivalent degree in a technical area - Minimum 2 years of related experience - Experience in managing the delivery of global enterprise software solutions (Hosted Service) - Experience with Enterprise File transfer applications like GlobalScape, Vandyke or other - Experience with SSL Certificate services - Experience in advanced TCP/ IP (WINS, DNS, DHCP) - Strong experience with FTP/ SFTP/ SCP - Knowledge of basic networking and firewall configuration - Strong experience with FTP/ SFTP/ SCP/ HTTP/ HTTPS - Exposure to SAN and NAS - Ability to work in a team environment as well as independently - Knowledge of database technical concepts - Knowledge of Virtual and VMWare concepts - Maintain current knowledge of the technology industry including leading tools and best practices - Ability to work in a team environment as well as independently Preferred Skills: Experience or knowledge on using any Managed File Transfer tool Experience in Windows Administration/ Support Walk-in Date/ Time: 10th - 14th June 2019, 3 PM onwards Interview Venue: Iron Mountain Services Private Limited Level 10, Citrine Block, Bagmane World Technology Center (BWTC) Mahadevapura, Marathahalli Ring Road, Bangalore - 560 048","location":"Bangalore","experience":"2 - 3 Years"},{"date":"8, 10, 11, 12, 13, 14, 15 - Jun - 2019","skills":"General Administration, Back Office Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"QualityKiosk Technologies Pvt. Limited, 419 A, Rupa Solitare MBP, Mahape, Navi Mumbai - 400709","phone":"7021684442","profile":"Admin Executive/ Assistant \nMalwal Solutions","description":"WE ARE LOOKING FOR ADMIN EX/ ASSISTANT FOR MANUFACTURING COMPANY. MIN GRADUATE WITH GOOD DRAFTING SKILL, COMPUTER KNOWLEDGE .. MALE FEMALE BOTHE CAN APPLY SHOULD KNOW ALL ADMIN WORK 1 to 6 - YEARS OF EXPERIENCE WALK-IN DATE: 8th - 30th JUNE 2019 TIME: 10 AM onwards MALWAL SOLUTIONS A WING , 4RTH FLOOR, VAIBHAV PATKAR BUILDING , OPPOSITE TO KASTURI PLAZA, MANPADA ROAD, DOMBIVLI (EAST), MUMBAI - 421 201 5 MINS WALING DISTANCE FROM DOMBIVLI STATION CONTACT No- 7021684442/ 9167765890","location":"Mumbai","experience":"1 - 6 Years"},{"date":"10, 11, 12 - Jun - 2019","skills":"General Administration, Facilities Management, Housekeeping, Canteen, Transportation","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Continuum Managed Solutions Pvt. Limited, Block Rhine, A Wing, 5th Floor, Embassy Tech Zone, Hinjawadi Phase II, Hinjewadi Rajiv Gandhi Infotech Park, Hinjawadi, Pune, Maharashtra - 411 057","phone":"7391055666","profile":"Administration Executive \nContinuum Managed Solutions Pvt. Limited","description":"Candidate should be Any Graduate having atleast 2 years of experience in Admin & Facilities Management. Should be good in communication skills. Must be comfortable to work in 24*7 shifts. Required Skills: Should have handled Housekeeping, Cafeteria, Security, Transport . General office administration. Working knowledge on HVAC, Fire alarm systems, Plumbing & Electricals supplies Roles & Responsibility: Ensuring Zero Downtime of business process and Office facility services to be made available 24*7. Providing Safe & smooth working conditions in the office premises. Monitoring Group/ Department Policies & Procedures Vendor Management and Statutory Compliances Planning ,Supervision & Controlling of Facility Management Team and personnel. Liaise and coordinate with Vendors & Consultants to ensure statutory compliance related to on-site vendor staff. Ensuring proper Maintenance & Upkeep of Critical Equipments Walk-in Date/ Time: 10th - 12th June , 11 AM onwards Interview Venue: Continuum Managed Solutions Pvt. Limited Block Rhine, A Wing, 5th Floor, Embassy Tech Zone, Hinjawadi Phase II, Hinjewadi Rajiv Gandhi Infotech Park, Hinjawadi, Pune, Maharashtra - 411 057","location":"Pune","experience":"2 - 7 Years"},{"date":"8 - Jun - 2019","skills":"Java /JEE, Spring 4.x/5.x, Spring Boot","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Sunera Technologies Private Limited, Block-2, 06th Floor, My Home Hub, Hi-Tech City, Hyderabad - 40","phone":"8247651181","profile":"JAVA Developer \nSunera Technologies Private Limited","description":"Experience Level: 6 Months to 3 Years Notice Period: Need resource who can join within 30 Days / immediate Work Location: Hitech city, Hyderabad Requirements : 1year of relevant object-oriented application building experience in a professional environment 1 years of experience in Java /JEE, Spring 4.x/5.x, Spring Boot and other Spring related technologies 1 year of experience designing and developing services for high volume, high transactions environment such as retail e-Commerce websites or real-time events processing 1+ years of experience in building REST services and/or micro-services If interested, kindly Walk-In to your convenient venue to have a right opportunity in your career Walk-in Date/ Time: 8th June 2019, 10 AM onwards Interview Venue: Sunera Technologies Private Limited Block-2, 06th Floor, My Home Hub, Hi-Tech City, Hyderabad - 40 Land Mark : Near Hi tech city circle. Contact : Swetha Mobile No -8247651181","location":"Hyderabad","experience":"0 - 3 Years"},{"date":"7 - Jun - 2019","skills":"Back Office, Administration, Data Analysis, Data Processing","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"3i Infotech Limited, Tower No. 6, 6 th Floor, Vashi Station Complex, Vashi Navi, Mumbai.","phone":"Not Provided","profile":"Interview for Back Office (only Male) \n3i Infotech Limited","description":"We are conducting a walk-in drive on 7th June 2019 (Friday) Experience - 2+ Years of Struts 1.2 Skills Required - Java with Struts (Struts 1.2 is must ) Interview Location: 3i Infotech Limited, Tower No. 6, 6 th Floor, Vashi Station Complex, Vashi Navi, Mumbai","location":"Mumbai","experience":"1 - 6 Years"},{"date":"8 - Jun - 2019","skills":"Core Java, J2EE, Spring MVC framework","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Financial Software & Systems (P) Limited, 1st Floor, Kalpataru Prime IT Park, Plot No. D-3, Road No. 16, Wagle Industrial Estate, MIDC, Thane (West) - 400 604","phone":"Not Provided","profile":"Java Developers \nFinancial Software & Systems (P) Limited","description":"Core Competency Requirements: Experience in Core Java, J2EE Experience in Spring MVC framework Banking OR Non-Banking Other Requirements: Designs develops and implements web-based Java applications to support business requirements and projects Write well designed, testable, efficient code Design and develop features and functionality Proficient with APIs and service-oriented architectures Willing to learn new emerging technology Creates user information solutions by developing, implementing and maintaining Java based components and interfaces Contribute to team meetings, develop new applications that serve existing software systems and further develop current software. Explore opportunities to add value to job accomplishments Great verbal and written communication skills Enthusiastic when embracing new challenges A willingness to teach and help others Adaptable and flexible when new tasks or projects are given Work Experience - 1 to 6 Years Location - Thane, Mumbai Working day - 5 Days Interested candidates please walk-in for the interview on Saturday, 8th June 2019 between 10 AM to 3 PM along with below documents. Hard copy of the resume Last 3 months pay slip Current company offer letter or increment letter 2 Passport Size Photo Interview Venue: Financial Software & Systems (P) Limited 1st Floor, Kalpataru Prime IT Park, Plot No. D-3, Road No. 16, Wagle Industrial Estate, MIDC, Thane (West) - 400 604 Contact Person: - Suraj Singh / Akash Bhosale","location":"Mumbai","experience":"1 - 6 Years"},{"date":"8 - Jun - 2019","skills":"Java, J2ee","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"GSPANN Technologies Pvt. Limited 2nd Floor, N-Height, Plot No: 38, Hitech City, Phase-2, Kondapur, Hyderabad. Landmark: Opposite to Tech Mahindra","phone":"9100441118","profile":"Senior Java Developers \nGSPANN Technologies Pvt. Limited","description":"Walk-In Drive on 8th June 2019 for Senior Java Professionals @ Hyderabad location. Qualification: BE/ B.Tech/ M.Tech/ MCA Work Experience : 5 + Years Job Location : Hyderabad Required Skills : Excellent communication skills with confidence and clarity Experience of interacting with clients. Deliver quality tasks on time. Lead the team and provide technical guidance/mentor other team members. Should be a quick learner. Roles & Responsibilities: Understanding of object-oriented analysis and design (OOAD), software design patterns, and Java coding principles. Hands-on experience in Java, Spring, Spring Boot, Hibernate, RDBMS, NoSQL, Web Services (RESTful API's and SOAP). Experience of working in an Agile/Scrum environment. Experience in Solution Architecture would be a plus. Java (1.7 or higher), J2EE, Spring, Microservices, Spring Boot, and web services (RESTful and SOAP) Please register your self in below link is mandatory. Registration Link : https://bit.ly/2IKhazM Venue Details GSPANN Technologies Pvt. Limited 2nd Floor, N-Height, Plot No: 38, Hitech City, Phase-2, Kondapur, Hyderabad. Landmark: Opposite to Tech Mahindra Google Maps : https://goo.gl/maps/K6Xr8qVk2My","location":"Hyderabad","experience":"5 - 10 Years"},{"date":"7, 8 - Jun - 2019","skills":"Java Coding, JSP. Linux OS, Unix OS, Windows OS,","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Manipal Technologies Limited, No: 10, 3rd Floor, Casa Brigitta, Brunton Road, Bangalore - 560 025","phone":"08202205613","profile":"Software Engineer - Java/ Support \nManipal Technologies Limited","description":"We are Conducting a walk-in for Software Engineers for Bangalore Location. please find the below details for your reference. Qualification: BE/ B.Tech/ MCA/ Diploma Skills Required: 1. 2-4 years of experience in software development/ support / implementation. 2. Excellent knowledge of Java Coding, JSP. Linux OS, Unix OS, Windows OS, Commands Shell Scripts. 3.Familiarity with Tomcat, JBOSS. 4. Good knowledge of SQL queries, familiarity with Oracle, MS, SQL DB2. 5. Knowledge and working experience in in Banking domain is must. Roles & Responsibilities: 1. High drive to learn new things. 2. Implement projects at client location 3. Follow-up and give timely feedback to the reporting authority 4. Interact in a pleasing and effective way with client and vendor personnel 5. Support and Implement product features and manage environment 6. Handling any additional responsibilities as and when given 7. Establish excellent relationships by providing service delivery with client Interested candidates can send your resume to madhukar.h@manipalgroup.info to confirm your availability. Walk-in Date: 07/ 08 June 2019 Time: 10:00 AM - 4:00 PM Interview Venue: Manipal Technologies Limited No: 10, 3rd Floor, Casa Brigitta, Brunton Road, Bangalore - 560 025 Interview Rounds: Written Test Personal interview","location":"Bangalore","experience":"2 - 4 Years"},{"date":"8 - Jun - 2019","skills":"Java, J2EE: Spring, Hibernate, REST, JSP, Servlet","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"EliteEvince Technologies, C-706-708, Siddhivinayak Towers, Near Kataria House, B/h Jaguar Showroom, Makarba, Ahmedabad - 380 051.","phone":"8460499596","profile":"Java/ J2EE Developer \nEliteEvince Technologies","description":"Urgent opening for Sr. Java/ J2EE Developer Required Experience 2 to 4 Years Job Responsibilities & Duties Must have expertise in modeling and designing Java/ J2EE based solutions and should have familiarity with different design patterns Should have good communication skills Write well designed, testable, and efficient code Required Experience, Skills and Qualifications Java: OOPS Concepts J2EE: Spring, Hibernate, REST, JSP, Servlet Web Development: HTML, CSS, jQuery, Bootstrap Database: MySQL MEAN Stack Development skills will be a plus Benefits Professional Development Friendly Environment 5 days working Walk-in Date/ Time: 8th June 2019, 9 AM onwards Interview Venue: EliteEvince Technologies C-706-708, Siddhivinayak Towers, Near Kataria House, B/h Jaguar Showroom, Makarba, Ahmedabad - 380 051.","location":"Ahmedabad","experience":"2 - 4 Years"},{"date":"8 - Jun - 2019","skills":"Java, Microservices, Rest, Spring Boot, Hibernate","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"AgreeYa Mobility India Pvt. Limited, 401-402, Amar Apex, Baner Road, Pune, Maharashtra - 411 045. Landmark: Opposite Bata showroom","phone":"020-67278800","profile":"Java/ J2EE Developer \nAgreeYa Mobility India Pvt. Limited","description":"Looking for immediate joinee for Java/ J2ee position. Work Experience : 3 to 7 Years Job Location : Pune No. of Positions : 15 Notice Period : Not more then 30 days, unless serving. Key Responsibilities: Design and build J2EE / Spring . Analyse customer/internal requirements/specifications and translate these into software designs. Develop high quality software code based on designs. Perform extensive unit and system level testing to insure that all requirements are met and the highest software quality is achieved. Collaborate with cross-functional teams to analyse, design, and ship new applications Ensure the best possible performance, quality, and responsiveness of the application Identify and correct bottlenecks, fix bugs . Help maintain code quality, organization, and automatization. Walk-in Date/ Time: 8th June 2019, 9 AM onwards Interview Venue: AgreeYa Mobility India Pvt. Limited 401-402, Amar Apex, Baner Road, Pune, Maharashtra - 411 045 Landmark: Opposite Bata showroom Share your updated resume in below format : Total experience : Rel Experience CTC: Expected CTC: Notice period: Current location: Current employer: Contact No: F2F interview availability on 8th June (Y/ N) :","location":"Pune","experience":"3 - 7 Years"},{"date":"9 - Jun - 2019","skills":"Python Django Javascript React.Js Angularjs Manual Testing Automation Testing","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Innofin Solutions Private Limited, LenDenClub 602, Quantum Towers, Rambagh Ln, Nadiyawala Colony 2, Malad West, Mumbai - 400 064","phone":"7066753043","profile":"Junior Software Developer \nInnofin Solutions Private Limited","description":"Candidate should have 0 to 3 years of relevant experience Coding knowledge or experience in using JavaScript frameworks such as React Native, ReactJS & AngularJS Coding knowledge or experience in using Python Framework- Django & Flask Immediate Joiners preferred Job Responsibility- Developing front end website architecture Designing user interactions on web pages Developing back end website applications Designing & developing APIs Walk-in Date/ Time: 9th June 2019, 11 AM onwards Interview Venue: Innofin Solutions Private Limited LenDenClub 602, Quantum Towers, Rambagh Ln, Nadiyawala Colony 2, Malad West, Mumbai - 400 064","location":"Mumbai","experience":"0 - 3 Years"},{"date":"8 - Jun - 2019","skills":"SQA Testing Manual Testing Java","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Ebix Software India Private Limited, 7th Floor, Building No: H6A, Phoenix Infocity, Advance Business Hub, Hitech City-2, Hyderabad","phone":"Not Provided","profile":"Java Developer & QA Tester (Freshers) \nEbix Software India Private Limited","description":"Ebix Software India Private Limited is hiring for Freshers - Java Developer & SQA Position 1: Trainee SQA Required Key skills- Basic Knowledge of Manual Testing Basic knowledge of Java Basic Knowledge of SQL Good communication skills Position 2 : Java Developer Required Key skills: Basic Knowledge of Java Good Communication skills Strong in aptitude, problem-solving and logical thinking skills. Quick learner with a great attitude. If interested please walk-in to the below details of the interview. Date : 08th June, 2019 (Saturday) Time: 10:00 AM to 4 PM Venue:- Ebix Software India Private Limited Address -7th Floor, Building No: H6A, Phoenix Infocity, Advance Business Hub, Hitech City-2, Hyderabad Contact Person- Unnatha (HR)","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"6, 7, 8 - Jun - 2019","skills":"Core Java, Web Services, Spring, Hybernate","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"IndusInd Bank Limited, IBL House, 3rd floor, Cross B Road, MIDC, J. B. Nagar Chakala, Off Andheri Kurla Road, Andheri (East), Mumbai - 400 059","phone":"Not Provided","profile":"Java Developer \nIndusInd Bank Limited","description":"Candidate should be BE/ B.Tech/ M.Tech or MCA with 1 to 5 years of experience in Software Development using Core Java-Web Services - Spring, Hybernate + Finacle, Internet Banking Walk-in Date/ Time: 6th - 8th June , 10 AM onwards Interview Venue: IndusInd Bank Limited IBL House, 3rd floor, Cross B Road, MIDC, J. B. Nagar Chakala, Off Andheri Kurla Road, Andheri (East), Mumbai - 400 059","location":"Mumbai","experience":"1 - 5 Years"},{"date":"6, 7, 8 - Jun - 2019","skills":"Java Trainee/ Fresher","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"iPRIMED Education Solutions Pvt. Limited, #62B, Electronics City, Phase-I, Opp EC PO, Bangalore - 560 100","phone":"080-40941642","profile":"Software Trainee (Java) \niPrimed Education Solutions Pvt. Limited","description":"Quinnox is hiring Trainee Software Engineer (Java) Freshers Eligibility Criteria: 60% aggregate only in B.E/ B.Tech/ MCA (CS/ IT/ IS) (No year gap in between education) - 2019 Pass outs Job Location: Bangalore Salary: INR 3,00,000 - 3,50,000 P.A Walk-in Date/ Time: 6th June - 8th June , 11 AM onwards Interview Venue: iPRIMED Education Solutions Pvt. Limited #62B, Electronics City, Phase-I, Opp EC PO, Bangalore - 560 100 Tel : +91-80-40941642, Cell: +91-9036011766","location":"Bangalore","experience":"1 - 5 Years"},{"date":"8 - Jun - 2019","skills":"spring framework core java design patterns multithreading javascript","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"QuEST Global Engineering Services Pvt. Limited, 2nd Floor, Primrose 7B, Embassy Tech Village, Near New Horizon College, Devarabisanahalli, Outer Ring road, Bellandur, Bengaluru - 560 103.","phone":"Not Provided","profile":"Java Professionals \nQuEST Global Engineering Services Pvt. Limited","description":"Desired Skills 3 - 4 years of experience in the design and development Java Applications 1 - 2 years of experience in REST Services and Spring framework. Experience in developing and deploying micro services. Working experience with Node JS Extensive knowledge and work experience in Angular 2 + Extensive experience in Unit Testing. Core Java with knowledge of data structures, multithreading, concurrency, collections, OOAD, design patterns, SOA Essential Job Functions: Responsible for programming a component, feature and or feature set. Works independently and contributes to the immediate team and work with Architects, PO and other team leads. Contributes to design discussions. Job Location: White field, Bangalore. Walk-in Date/ Time: 8th June 2019 from 9 AM onwards Interview Venue: QuEST Global Engineering Services Pvt. Limited 2nd Floor, Primrose 7B, Embassy Tech Village, Near New Horizon College, Devarabisanahalli, Outer Ring road, Bellandur, Bengaluru - 560 103.","location":"Bangalore","experience":"3 - 8 Years"},{"date":"8 - Jun - 2019","skills":"Java J2EE, Spring, Hibernate, Databases","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"GAVS Technologies Private Limited, No: 11, Old Mahabalipuram Road, Sholinganallur, Chennai - 600 119","phone":"Not Provided","profile":"Java Fullstack Developer \nGAVS Technologies Private Limited","description":"We at Gavs are looking out for Java fullstack developers at various levels to work from our Chennai office. Experience/ Skill Sets: * Minimum 3 years of experience in Java Development * Good experience on Java J2EE, Spring, Hibernate, Databases * Experience in CSS, JavaScript [either AngularJS/ ReactJS/ NodeJS is must] Interested candidates can share their updated resume in MS word format to charanya.b@gavstech.com & come for a f2f interview on Saturday [8th June 2019], between 10 am & 1 pm at the below mentioned address- GAVS Technologies Private Limited No: 11, Old Mahabalipuram Road, Sholinganallur, Chennai - 600 119 Landmark: 1) Opp to Gateway Hotel 2) Dollar Bus Stop","location":"Chennai","experience":"3 - 8 Years"},{"date":"6, 7, 8, 9, 10 - Jun - 2019","skills":"General Administration, Front Office, Facility Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Lynks Logistics Limited, 2nd Floor, 108A, Venkatachalam Street, Dr. Radhakrishnan Salai, Mylapore, Chennai - 600 004.","phone":"044-66723400","profile":"Admin/ Front Office Executive \nLynk Logistics Limited","description":"Educational Qualification: Any Graduate Work Experience: 2+ years Job Location: Chennai Job Responsibility: Responsible for managing front desk operations Responsible for day to day Admin activities Supervision of other Admin and House Keeping staff Travel reservations for Office staff Walk-in Date: 6th - 10th June 2019 Timings: 9 AM onwards Interview Venue: Lynks Logistics Limited 2nd Floor, 108A, Venkatachalam Street, Dr. Radhakrishnan Salai, Mylapore, Chennai - 600 004. Tel No: 044-66723400","location":"Hyderabad","experience":"2 - 7 Years"},{"date":"4, 5, 6, 7 - Jun - 2019","skills":"General Administration, Front Office Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Harsha Toyota, (HY02A), Harsha Automotive Private Limited D.No. 2-40/5, Kothaguda, Near Hi-Tech City, Hyderabad - 84.","phone":"040-44374437","profile":"Administration Executive \nHarsha Automotive Private Limited","description":"We have requirement of Admin Executive in Administration Department Educational Qualification: B.Com/ BSc Freshers Should have Letter drop-ting and MS Office skills Excellent communication skills Walk-in Date/ Time: 4th - 7th June 2019, 10 AM onwards Interview Venue: Harsha Toyota, (HY02A), Harsha Automotive Private Limited D.No. 2-40/5, Kothaguda, Near Hi-Tech City, Hyderabad - 84. Tel: 040-44374437/ 23113555, Ext: 938 Fax:040-23113311, Mobile:+919959888676, eMail: hy02a_hrsales@harshaauto.com","location":"Hyderabad","experience":"0 - 2 Years"},{"date":"8 - Jun - 2019","skills":"Selenium Webdriver Test Scenarios Test Scripts SQL Test Cases SDLC","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Bitwise Solutions Private Limited, Bitwise TerraTower, Survey No. 61/1/1, Baner Adjoining Highway, Baner, Pune- 411 045","phone":"020-67181200","profile":"Automation Test Engineer \nBitwise Solutions Private Limited","description":"BITWISE SOLUTIONS WALK_IN FOR AUTOMATION TEST_SELENIUM Qualification: BE, B Tech, MCA Experience: 1 to 5 Years Mandatory Skills: Proficient in either Core Java and Selenium WebDriver or Node.js, Writing SQL statements Should be able to analyze requirements and identify test scenarios and write associated test cases Should be able to analyze existing scripts and design new test scripts using either Selenium or Node.js Should be proficient in compiling the test matrix and test results reporting Should have experience with test/defect management tools like Rally and qTest Exposure and experience of working in Agile SDLC methodology would be preferred Walk-in Date & Time : Saturday, 8th June, 9:00 AM onwards Interview Venue: Bitwise Solutions Private Limited Bitwise TerraTower, Survey No. 61/1/1, Baner Adjoining Highway, Baner, Pune- 411 045 Phone No: 020-67181200 *Candidates appeared in the last 6 months will not be considered .","location":"Pune","experience":"1 - 5 Years"},{"date":"4, 5, 6, 7, 10 - Jun - 2019","skills":"HR Policies, Induction, HR Administration, Leave Management, Onboarding/ Attendance","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Career Catalysts HRC Private Limited, 304-B Wing, Leo Bldg, 24th Road, Off. Linking Road, Behind KFC, Khar (West), Mumbai - 400 052.","phone":"9594619425","profile":"HR / Admin Executive \nCareer Catalysts HRC Private Limited","description":"Job Location: Bandra (West) Mumbai Work Timings: 09.30 AM - 06.30 PM, or 10.00 AM -07.00 PM Working Days: 5 Days (Monday - Friday) Job Responsibility:- Recruitment: Sourcing, screening and interviewing of desired candidates Maintain Database: Attendance & Leave management Joining formalities: Induction and on-boarding of the new recruits to the system and to explain them Hr policies and procedures Documentation: Creation of confirmation letters, experience, relieving letter , monitor contract expiry for renewals& Maintain employee records (soft and hard copies) Vendor management: Maintain relationships with vendors, keep a track of price data & comparison sheet of multiple vendors to get best pricing services. Record keeping of vendors list. Handling :-Petty cash management, insurance-related issues Handling the full and final settlement of the employees Taking care of entire admin activities. Walk-in Date: 4th - 10th June 2019 (Mon -Fri) Timings- 11:00 am to 5:00 pm Interview Venue: Career Catalysts HRC Private Limited 304-B Wing, Leo Bldg, 24th Road, Off. Linking Road, Behind KFC, Khar (West), Mumbai - 400 052.","location":"Mumbai","experience":"0 - 2 Years"},{"date":"8 - Jun - 2019","skills":"C Test Cases Software Testing Test Case Execution Test Scripts Test Case Review Black Box Bug Tracking","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Cyient Limited, Plot No. 2, IT Park, Nanakramguda, Manikonda, Hyderabad - 500 032. Land Mark : Near Continental Hospital","phone":"040-67489921","profile":"Software Testing Engineer \nCyient Limited","description":"Educational Qualification : BE/ B.Tech Years of Experience: 2 to 6 years Job Location : Hyderabad Essential Skills: At least 1 year of C / C++ / C# language experience to develop automation test scripts Must have black box software testing experience on any safety critical applications from any domain Should be able to understand Hardware and Software integration Working knowledge in requirement management, configuration management and defect tracking tools Proven ability to quickly understand existing system and develop system validation test procedures Create, maintain and execute test cases, develop test scripts in C# Review test cases, test specifications and reports generated by peers and give formal feedback Write and maintain clear, precise bug reports to submit to our bug tracking system Test execution on both PC and target environment Document and report status / progress Walk in Date : 8th June (Saturday) Time : 10.00 AM - 12.00 PM Walk-In Venue: Cyient Limited, Plot No. 2, IT Park, Nanakramguda, Manikonda, Hyderabad - 500 032. Land Mark : Near Continental Hospital Contact Person : Manohar Burri Tel: 040-67489921","location":"Hyderabad","experience":"2 - 6 Years"},{"date":"4, 5, 6, 7, 8 - Jun - 2019","skills":"HR, Office Administration, Liaison, Vendor Management","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Zoom Car India Private Limited, 105/106, Suratwala Mark Plazzo, Opp. Fortune Inn Hotel, Hinjewadi, Pune -411 057","phone":"Not Provided","profile":"HR & Admin Executive \nZoom Car India Private Limited","description":"Candidate should be Any Graduate/ MBA (HR) with 2 to 6 years of experience in HR, Office Administration, Liaison, Vendor Management. Key Responsibility- 1. Recruitments 2. General Administrations 3. Legal & Liasoning 4. Vendor Management 5. Basic Idea of Car Operations Walk-in Date/ Time: 4th - 8th June 2019, 10 AM onwards Interview Venue: Zoom Car India Private Limited 105/106, Suratwala Mark Plazzo, Opp. Fortune Inn Hotel, Hinjewadi, Pune - 411 057","location":"Pune","experience":"2 - 6 Years"},{"date":"6, 7, 10, 11, 12, 13, 14 - Jun - 2019","skills":"Game Testing, Mobile application testing, Writing test cases.","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Indium Software (India) Limited, No. 100, 5th Floor, Kay ARR Royal Stone Tech Park, Swami Vivekananda Road, Pai Layout, Benniganahalli, Bengaluru, Karnataka - 560 016","phone":"Not Provided","profile":"Game Tester - QA \nIndium Software (India) Limited","description":"Candidate should have 0 to 6 years of experience into Game Testing Must be good in testing, debugging and analytical skills. Should have experience in Mobile application testing, Writing test cases. Should have experience with JIRA Should have knowledge on gaming domain Should be a Passionate Gamer with experience playing a wide range of Games Should have relevant work experience in Mobile,PC or Console Game testing Creating test cases for games Optimize testing procedure by identifying and eliminating redundancies. Walk-in Date/ Time: 6th - 14th June , 11 AM onwards Interview Venue: Indium Software (India) Limited No. 100, 5th Floor, Kay ARR Royal Stone Tech Park, Swami Vivekananda Road, Pai Layout, Benniganahalli, Bengaluru, Karnataka - 560 016 THIS DRIVE IS EXCLUDING SATURDAY AND SUNDAY","location":"Bangalore","experience":"0 - 5 Years"},{"date":"8 - Jun - 2019","skills":"Automation Testing, Selenium Webdriver, Automation Framework, jMeter","qualification":"B.E./B.Tech","address":"SHL (India) Private Limited, 9th Floor, Building No. 10B, DLF Cyber City, Gurgaon - 122002","phone":"Not Provided","profile":"QA/ Automation Tester \nSHL (India) Private Limited","description":"Education/ Experience Requirements: B.E/ B. Tech in Computer Science, Information Technology or relevant professional experience 3-5 years of experience in an IT or Business environment testing highly scalable applications Excellent communications skills interacting with technical and business audiences Any testing certification is a plus. Candidate Attributes: Effective time management skills and ability to meet deadlines Exceptional communication skills, to both technical and non-technical audiences Excellent organization, multitasking, and prioritization skills Ability to work independently and with a team Good communication skills and ability to work with global teams to define and deliver on projects Intellectual curiosity, passion for technology and keeping up with new trends Walk-in Date: 8th June 2019 Time: 10 am to 5 pm Interview Venue: SHL (India) Private Limited 9th Floor, Building No. 10B, DLF Cyber City, Gurgaon - 122002","location":"Gurgaon","experience":"3 - 5 Years"},{"date":"15 - Jun - 2019","skills":"Application Testing Acceptance Testing Quality Assurance UAT QA Application Integration","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Trident Hotel, Hitech City Main Road, HITECH City, Near Cyber Towers, Madhapur, Hyderabad, Telangana - 500 081","phone":"7994250919","profile":"Manual Testers \nNavigant BPM (India) Private Limited","description":"Opening for Manual Testers: 1) Manual Tester (SQL) 2) Manual Tester (Scrum) 3) SQL + ETL Tester 4) Python Tester Develop and establish quality assurance measures and testing standards for new applications, products, and/or enhancements to existing applications throughout their development/product lifecycles. Adhere to established QA standards for software development, application integration, and information system performance, and corresponding documentation. Create and execute test plans and scripts that will determine optimal application performance according to specifications. Communicate test progress, test results, and other relevant information to manager. Coordinates on QA and UAT process within the team Reviews architecture and technical specifications for conflicts or issues that could affect quality Performs acceptance testing and manages user testing when needed Travel to meet teammates, partners, business owners, and users when required. Work Location: Trivandrum , Kerala Interview Location: Hyderabad Interested candidates may walkin on 15th June from 9 AM onwards to the below venue- Trident Hotel , Hitech City Main Road, HITECH City, Near Cyber Towers, Madhapur, Hyderabad, Telangana - 500 081 or can also ask your friends with similar profile to walkin.","location":"Hyderabad","experience":"2 - 7 Years"}]}