{"Walkins":[{"date":"17, 18, 19, 20, 22, 23, 24 - Jul - 2019","skills":"Java/ J2ee, Core Java, Hibernate, Spring","qualification":"B.E./B.Tech, MCA/PGDCA","address":"iPRIMED Education Solutions Pvt. Limited, Megistic Terrace Building #62B, Phase 1 Electronic City, Bangalore. Opposite, Traffic Police Station","phone":"9902070375","profile":"Software Trainee (Java Fresher) \niPRIMED Education Solutions Pvt. Limited","description":"Quinnox is hiring Software Trainee (Java Fresher) Eligibility Criteria: B.E/ B.Tech/ MCA (CS/ IT/ IS) 60% aggregate (No year gap in between education) 2018 & 2019 Pass outs Only Job Location: Bangalore Salary: 3 - 3.40 LPA Immediate joiners Preferred Walk-in Date/ Time: 17th July - 24th July , 9 AM onwards Interview Venue: iPRIMED Education Solutions Pvt. Limited Megistic Terrace Building #62B, Phase 1 Electronic City, Bangalore Opposite, Traffic Police Station Contact Person : Umar A Ghaffer Tel: 9902070375 : Only Whtsapp","location":"Bangalore","experience":"0 - 1 Years"},{"date":"17, 18, 19 - Jul - 2019","skills":"HTML, CSS, Java Script","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"NIIT Limited, A-24, Sector 34, Infocity Technology Park 1, Gurugram, Haryana","phone":"Not Provided","profile":"Software Engineer/ Fresher \nNIIT Limited","description":"Qualification/ Skill Set: BE/ B.Tech (CS/ IT), MCA, BCA - Fresher Knowledge of HTML, CSS, Java Script Should be from Gurgaon, South Delhi, West Delhi or can relocate to these locations Ready to work on rotational shift (Not night shift) NIIT contract role Walk-in Date: 17th - 19th July 2019 Time: 10:00 AM - 4:00 PM Interview Location: NIIT Limited A-24, Sector 34, Infocity Technology Park 1, Gurugram, Haryana Email: divya.9.taneja@niit.com","location":"Gurgaon","experience":"0 - 1 Years"},{"date":"17, 18, 19, 20, 21, 22, 23 - Jul - 2019","skills":"Front Office/ Front desk, Telephone Operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Good Shepherd Hospitals Private Limited, Plot No 26 & 27, Shobana Colony, Near Maruthi Nursing Home, West Maredpally, Secunderabad, Telangana - 500 026","phone":"Not Provided","profile":"Front Office Executive \nGood Shepherd Hospitals Private Limited","description":"Candidate should be Any Garduate with 0 to 2 years of experience in Front Office/ Front desk, Telephone Operations. Must have pleasing personality with excellent communication skills Job Responsbility- Welcomes visitors by greeting them, in person or on the telephone; answering or referring inquiries. Directs visitors by maintaining employee and department directories,monitoring logbook; issuing visitor badges. Walk-in Date/ Time: 17th July - 23rd July , 9 AM onwards Interview Venue: Good Shepherd Hospitals Private Limited Plot No 26 & 27, Shobana Colony, Near Maruthi Nursing Home, West Maredpally, Secunderabad, Telangana - 500 026","location":"Hyderabad","experience":"0 - 2 Years"},{"date":"18, 19, 20, 21, 22, 23, 24, 25, 26, 27 - Jul - 2019","skills":"Front Office, Receptionist/ Front Desk Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Raj Hospitals, Mahatma Gandhi Main Road, Hindpiri, Ranchi, Jharkhand - 834 001","phone":"9771466647","profile":"Front Office Executive \nRaj Hospitals","description":"Candidate should be Any Graduate with 0 to 3 years of experience in Front Office, Receptionist/ Front Desk Activities. Must have excellent communication skills Job Responsbility- Welcomes patients and visitors by greeting patients and visitors, in person or on the telephone; answering or referring inquiries. Optimizes patients' satisfaction, provider time, and treatment room utilization by scheduling appointments in person. Walk-in Date/ Time: 18th July - 27th July , 11 AM onwards Interview Venue: Raj Hospitals Mahatma Gandhi Main Road, Hindpiri, Ranchi, Jharkhand - 834 001","location":"Ranchi","experience":"0 - 3 Years"},{"date":"17, 18 - Jul - 2019","skills":"Receptionist, Soft Services Front Desk, administration, facility management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"CBRE South Asia Private Limited, Ground Floor, The, Hulkul Brigade Centre, No. 82, Lavelle Road, Shanthala Nagar, Ashok Nagar, Bengaluru - 560 001","phone":"Not Provided","profile":"Front Office Executive \nCBRE South Asia Private Limited","description":"Any Graduate with 2 to 7 years of experience Must be good in verbal and written communication Female Candidate only. Perks and Benefits 35K CTC Job Responsibilities: Greet clients and set a positive office atmosphere Answer the phone, take messages, and redirect calls to appropriate offices. Organize and maintain files and records; update when necessary Create and maintain updated documents and spreadsheets Oversee sorting and distribution of incoming mail Prepare outgoing mail (envelopes, packages, etc.) Operate office equipment, such as photocopier, printers, etc. Organize bookkeeping and issue invoices/checks Record meeting minutes and dictations Perform inventory of office supplies and order what is needed Interested candidates forward CV to Malti.Sharma@cbre.com Walk-in Date: 17th - 18th July 2019 Timing: 11 AM to 2 PM Interview Venue: CBRE South Asia Private Limited, Ground Floor, The, Hulkul Brigade Centre, No. 82, Lavelle Road, Shanthala Nagar, Ashok Nagar, Bengaluru - 560 001","location":"Bangalore","experience":"2 - 7 Years"},{"date":"19 - Jul - 2019","skills":"Core Java, Design Patterns, Web Services, Hibernate, Spring, SOAP, Rest, SQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Aspire Systems (India) Pvt. Limited, D-1, No.1, Sipcot IT Park Siruseri, Chennai","phone":"7824030311","profile":"Java Professionals \nAspire Systems (India) Private Limited","description":"Candidate should have strong experience in Oops and Core Java. Strong experience in Persistence Frameworks (Hibernate) & expertise in Spring Eco system. Should have good experience in Web Services REST/ SOAP. Must be good in SQL/ No SQL Experience in Angular JS, Micro Services will be an added advantage Should have experience in Design patterns, Build Tools/ Deployment Must have experience in Version Control System Exposure in cloud environment Should be with good communication skills. Work Experience Level: 5 to 9 Years Looking for Immediate joiners Interested candidates can share your updated resume to Rohini.rathinaraj@aspiresys.com with below updated details or can directly walk in to below Venue- Total Years of Experience Experience in Java Current CTC Expected CTC Notice Period Available to take interview on 19-July-19: Yes/ No Walk-in Date/ Time: 19th July 2019 from 10 AM onwards Interview Venue: Aspire Systems (India) Pvt. Limited D-1, No.1, Sipcot IT Park Siruseri, Chennai","location":"Chennai","experience":"5 - 9 Years"},{"date":"20 - Jul - 2019","skills":"Java, HTML, Java Script, Node JS, React JS, Angular JS","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Financial Software Systems Pvt. Limited, 1st Floor, Plot No D 1, Kalpataru Prime IT Park, Road No 16, Wagle Industrial Estate-Thane West, Thane - 400 604, Midc","phone":"Not Provided","profile":"Java Developers \nFinancial Software Systems Pvt. Limited","description":"Required Skills: Java (Node JS, React.JS, Angular.JS) Work Experience: 4 to 7 Years Knowledge in payments domain and Card Management Domain Solid experience in Front End technologies, ReactJs workflows Strong understanding of ReactJs and its core principles Must have strong proficiency in HTML, Java Script Deep knowledge of Angular JS practices Understanding of Cloud concepts and micro services is a plus UX design knowledge and proficiency with Git Experience with common front-end development tools Performance Tuning; Debugging issues. Knowledge of end-to-end Systems Development Life Cycles (i.e., waterfall, iterative and other modern approaches to software development) Walk-in Date/ Time: 20th July 2019, 9 AM onwards Interview Venue: Financial Software Systems Pvt. Limited 1st Floor, Plot No D 1, Kalpataru Prime IT Park, Road No 16, Wagle Industrial Estate-Thane West, Thane - 400 604, Midc","location":"Mumbai","experience":"4 - 7 Years"},{"date":"17, 18, 19 - Jul - 2019","skills":"Java / Core Java, EJB, Spring/ Struts/ Hibernate","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Colan Infotech Private Limited, Murugesa Nayakar Complex, B Block, 4th Floor, Greams Road, Thousand Lights, Chennai - 600 006","phone":"90420 55 706","profile":"Java Developer \nColan Infotech Private Limited","description":"Candidate must have strong knowledge/ experience in Java / Core Java, EJB (Mandatory) Knowledge into any frameworks like Spring/ Struts/ Hibernate (Anyone is preferred) Must have strong communication & positive attitude Walk-in Date: 17 - 19 July 2019, Wednesday - Friday Time: 10:00 AM to 06:00 PM Interview Venue: Colan Infotech Private Limited Murugesa Nayakar Complex, B Block, 4th Floor, Greams Road, Thousand Lights, Chennai - 600 006 Landmark: Opposite Road to Seashell Hotel Mail: kalaichelvi@colanonline.com","location":"Chennai","experience":"2 - 6 Years"},{"date":"20 - Jul - 2019","skills":"JAVA, J2EE, Spring, Spring boot, Design Patterns, MVC Concepts","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Daffodil Software Private Limited 9th floor, Tower B1, SEZ DLF Silokhera, Sector 30, Gurugram, Haryana. Nearest Metro Station- Huda City Center Landmark-Star Mall, NH 8, Gurgaon","phone":"Not Provided","profile":"Java Developer \nDaffodil Software Private Limited","description":"Daffodil Software Pvt. Ltd. is looking for Java Developers to expand and strengthen its exceptional team at one of the most prime office spaces at DLF SEZ, Gurgaon. Designation: Associate/ Sr. Associate-IT Work Experience : 1+ Years Job Location: Gurgaon 1+ years of experience in JAVA, J2EE, Spring, Spring boot Thorough comprehension of object oriented programming Design patterns, MVC concepts, develop and document RESTful APIs Willing to work on existing code base and happy to refactor large scale code base JAVA SE 8 Maven build mechanism, Good Experience on Git Repository Spring framework, Spring boot, IOC concept, Spring Data concepts (Repositories), Familiarity with both xml and annotation based configuration Note: Opportunity is for immediate Joiners only. Please use the below mentioned link for Registration: https://bit.ly/2SkQxEq Walk-in Date: 20th July, 2019 Time: 9:00 AM - 12:00 PM Interview Venue: Daffodil Software Private Limited 9th floor, Tower B1, SEZ DLF Silokhera, Sector 30, Gurugram, Haryana Nearest Metro Station- Huda City Center Landmark-Star Mall, NH 8, Gurgaon Contact Person : Swati Chahar","location":"Gurgaon","experience":"1 - 5 Years"},{"date":"16, 17, 18, 19 - Jul - 2019","skills":"Java, Hibernate, Spring, MVC","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Karvy Gateway Building Opposite to Karvy Fintech, Plot No 37 38 3rd Floor Financial District Gachibowli Hyderabad - 500 032","phone":"08639713681","profile":"JAVA Developer \nKarvy Data Management Services Limited","description":"Karvy Data Management Services Limited, is having an urgent opening for Java Developer Required Skills: Java, Hibernate, Spring, MVC Years of experience: 3.5+ Years Work Location: Hyderabad Walk-in Date/ Time: 16th July - 19th July , 9 AM onwards Interview Venue: Karvy Gateway Building Opposite to Karvy Fintech Plot No 37 38 3rd Floor Financial District Gachibowli Hyderabad - 500 032 If interested, please share your updated resume to tejaswini.mahapatro@karvy.com with some details below. Total Experience- Relevant Experience- Notice Period- Current CTC- Expected CTC- Current Location- Higher Education- Availability for face to face (Date /Time)-","location":"Hyderabad","experience":"3 - 8 Years"},{"date":"23 - Jul - 2019","skills":"Core Java, Advanced Java, JSP, MySQL & Oracle","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Bharti Airtel Limited, Plot No. 16, Udyog Vihar Phase IV, Sector 20, Gurugram, Haryana 122015.","phone":"Not Provided","profile":"Software Developer (Java) \nBharti Airtel Limited","description":"Educational Level: B.Tech/ B.E/ MCA Functional Competencies: Data Analytics Work Experience: 1 to 2 Years Required Skills: Hands on experience on Core Java, Advanced Java, JSP Good knowledge of MySQL & Oracle Certification would be an added advantage. Should have excellent communication skills PERSONAL CHARACTERISTICS & BEHAVIOURS Team player Result oriented Decisiveness Customer orientation Optimistic Walk-in Date/ Time: 23rd July from 10 AM onwards Interview Venue: Bharti Airtel Limited Plot No. 16, Udyog Vihar Phase IV, Sector 20, Gurugram, Haryana 122015. Contact person: Soumya (9205674115)","location":"Gurgaon","experience":"1 - 2 Years"},{"date":"27 - Jul - 2019","skills":"Java/ J2EE, Big Data, DevOps, Machine Learning","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"EPSoft Solutions Private Limited, Medha Hi-tech City, Kesarapalli, Gannavaram IT Park Road, Vijayawada, Andhra Pradesh - 521 102","phone":"Not Provided","profile":"Software Engineer (Java/ J2EE) \nEPSoft Solutions Private Limited","description":"There is a requirement for 15 candidates but the count can go to even 20 if we find the best and worthful candidates during the recruitment process. Looking for- Software Developers (Java/ J2EE, Big Data, DevOps, Machine Learning) Engineers (Network Engineer, IT Security Engineer) Analytics (Business Analyst, Data Analytics) Education: B.Tech (CSE/ IT/ ECE/ EEE), MBA, M.Sc 65% (NO BACKLOGS) Must have good Communications skills. Problem-Solving skills Team Player Leadership Skills Honesty Openness to Learning Candidate should be trained in this anyone of these technologies (Java/ J2EE, Big Data, DevOps, Machine Learning, Networking, IT Security) Walk-in Date/ Time: 27th July 2019, 9 AM onwards Interview Venue- EPSoft Solutions Private Limited Medha Hi-tech City, Kesarapalli, Gannavaram IT Park Road, Vijayawada, Andhra Pradesh - 521 102","location":"Vijayawada","experience":"0 - 2 Years"},{"date":"17 - Jul - 2019","skills":"Reception/ Front Office Activities, General Administration","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Zen3 infosolutions Private Limited, Manjeera Trinity Corporate, 12th Floor, JNTU Hitech City Road, Hyderabad. Next to Manjeera Mall","phone":"Not Provided","profile":"Front Office Executive \nZen3 infosolutions Private Limited","description":"Walk-in Drive for Front Office Executive- Receptionist @ Zen3 Infosolutions at Hyderabad Qualification: Any Graduation Experience: Freshers Work location: Hyderabad Should be Good in Communication (English, Telugu) Looking only Female Candidates Shift: General and 5 Days Working No Transport Facility Job Responsbility- Responsible for handling front office reception and administration duties, including greeting guests and offering them a beverage, answering phones, handling company inquiries, and sorting and distributing mail. Mail also schedule meetings and travel for executives. Interested Candidates can walk-in with updated CV to below Address Walk-in Date: 17 July 2019 Interview Timing: 10 Am to 3 PM Interview Venue: Zen3 infosolutions Private Limited Manjeera Trinity Corporate, 12th Floor, JNTU Hitech City Road, Hyderabad Landmark: Next to Manjeera Mall","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"17, 18, 19 - Jul - 2019","skills":"PHP / Wordpress / Mysql / Html5 / jQuery","qualification":"B.Sc, BCA/BCS","address":"Evision Technoserve Private Limited, E- 41 Sector 3, Behind HCL Technology, Noida - 201 301 Nearest Metro: Sector 16","phone":"9315179008","profile":"PHP Wordpress Developer \nEvision Technoserve Private Limited","description":"Candidate should have 0 to 1 year of experience in Custom theme development in Wordpress Working experience with Wordpress plugin development Good knowledge of MySql Database Strong experience of HTML5, CSS3, Javascript, Jquery Ability to convert HTML pages to Wordpress°° Walk-in Date/ Time: 16th July - 19th July , 11 AM onwards Interview Venue: Evision Technoserve Private Limited E- 41 Sector 3, Behind HCL Technology, Noida - 201 301 Nearest Metro: Sector 16 Contact HR Whatsapp No: Ganesh: 9315179008","location":"Noida","experience":"0 - 1 Years"},{"date":"16, 17 - Jul - 2019","skills":"Non Voice, Technical Support, Customer Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Knoah Solutions Private Limited, Unit No. 204, 2nd Floor, The Chambers, Samrat Chowk, Viman Nagar, Pune - 411014.","phone":"020-26630500","profile":"Technical Support (Non Voice Process) \nKnoah Solutions Private Limited","description":"Candidate should be Any Graduate with excellent communication skills. Provide customer service for electronic products such as High-definition Consumer goods, Smart phones and Tablets. Provide technical assistance through web-chat and email-based communication Walk-in Date: 15th to 17 July, 2019 Time: 3 PM - 6 PM Interview Venue: Knoah Solutions Private Limited Unit No. 204, 2nd Floor, The Chambers, Samrat Chowk, Viman Nagar, Pune - 411 014.","location":"Pune","experience":"0 - 2 Years"},{"date":"16, 17, 18, 19, 20 - Jul - 2019","skills":"Technical Support, Desktop Support, IT Service Desk/ Helpdesk","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Dell International Services India Pvt. Limited, 12/1A, 12/2A, 13/1A, Divya Shree Green, Inner Ring Rd,, Near EGL Embassy Business Park, Challaghata Village, Domlur, Bengaluru - 560 071","phone":"Not Provided","profile":"Technical Support Associate \nDell International Services India Pvt. Limited","description":"Candidate requirement: Minimum Graduates in any stream. (10+2+3) Any relevant Certification/ Technical Qualification Undergraduates/Post graduates with at least 12 months of international call center / 24 months of domestic call center or any other work experience full time experience. Should be willing to work in shifts in a 24 x7 work environment Excellent telephone soft skills & thorough telephone functional skills Ability to handle stressful situations. Ability to deal professionally with irate customers Good Knowledge of PC Hardware/Software for desktop & portable systems Benefits- We offer highly competitive salaries, bonus programs, world-class benefits, and unparalleled growth and development opportunities all to create a compelling and rewarding work environment. Walk-in Date/ Time: 16th July - 20th July , 2 PM onwards Interview Venue: Dell International Services India Pvt. Limited 12/1A, 12/2A, 13/1A, Divya Shree Green, Inner Ring Rd,, Near EGL Embassy Business Park, Challaghata Village, Domlur, Bengaluru - 560 071","location":"Bangalore","experience":"1 - 4 Years"},{"date":"15, 16, 17, 18, 19 - Jul - 2019","skills":"Non Voice Process, Customer Service, Technical Support, Amazon Support","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Amazon Development Centre (India) Private Limited, 6th Floor in Tower 1 of Laxmi Infobahn Pvt. Limited SEZ, Survey No. 107(P), Kokapet Village, Gandipet Mandal, Ranga Reddy District","phone":"Not Provided","profile":"Alexa Support Associate (Digital & Device) \nAmazon Development Centre (India) Pvt. Limited","description":"Qualifications required: Minimum qualification is 10 + 2. Any Graduate/ PG is eligible to apply. Knowledge & Skills Required Excellent customer service skills, including maintaining focus on the customer issue in a fast-paced environment Ability to empathize with and prioritize customer needs Demonstrates interpersonal skills with a diverse customer base Demonstrates conflict resolution, negotiation, and de-escalation skills Demonstrates ownership to resolve challenging customer issues, escalating when necessary Salary Range: 2.6 LPA - 3.1 LPA Additional Benefit: Meal Vouchers, Night Shift Allowance, Over Time Payout, Transportation Allowance (work from office) Walk-in Date: 15th - 19th July 2019 Time: 10.30 am to 2 pm Interview Venue: Amazon Development Centre (India) Private Limited 6th Floor in Tower 1 of Laxmi Infobahn Pvt. Limited SEZ, Survey No. 107(P), Kokapet Village, Gandipet Mandal, Ranga Reddy District","location":"Hyderabad","experience":"0 - 5 Years"},{"date":"18 - Jul - 2019","skills":"Technical Support, Hardware/ Networking, Service Desk, Hardware Troubleshooting","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"DXC Technology India Private Limited, Surya tech Park, 100, Outer Ring Road, Electronics City Phase 1, Electronic City, Bengaluru, Karnataka - 560 100","phone":"Not Provided","profile":"Technical Support (Voice Process) \nDXC Technology India Private Limited","description":"Candidate should be Full time Graduates with excellent communication skills with 0-3 Years of work experience in IT Technical Support/ Service Desk is preferred. Flexible to work in any shifts including night shifts. Freshers can also apply Job Responsibility: Troubleshooting Hardware/ Networking/ OS related queries for our global customers over phone. This involves working across different time zones. Take calls from global customers and provide the right response, positively and professionally Walk-in Date: 18th July 2019 Timings : 11 AM to 2 PM Interview Venue: DXC Technology India Private Limited Surya tech Park, 100, Outer Ring Road, Electronics City Phase 1, Electronic City, Bengaluru, Karnataka - 560 100","location":"Bangalore","experience":"0 - 3 Years"},{"date":"16, 17 - Jul - 2019","skills":"Technical Support, Chat/ Email Process, Customer Service","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Knoah Solutions Private Limited, Maximus Towers, 2A, 4th floor, IT Raheja Park, Mindspace, Madhapur, Hyderabad - 31","phone":"040-44309780","profile":"Technical Support Executive \nKnoah Solutions Private Limited","description":"Candidate should be Any Graduate with 0 to 3 years of experience in Technical Support, Chat/ Email Process, Customer Service. Must have excellent communication skills. Job Responsbility- Provide customer service for electronic products such as High-definition Consumer goods, Smart phones and Tablets. Provide technical assistance through web-chat and email-based communication Walk-in Date: 15th to 17th July, 2019 Time:11 AM - 3 PM Interview Venue: Knoah Solutions Private Limited Maximus Towers, 2A, 4th floor, IT Raheja Park, Mindspace, Madhapur, Hyderabad - 31","location":"Hyderabad","experience":"0 - 3 Years"},{"date":"16, 17, 18, 19, 20 - Jul - 2019","skills":"Client Support, Customer Support, Software Support","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Spider Software Private Limited, 212, Rajhans Complex, Near Nirmal Hospital, Ring Road, Surat, Gujarat - 395 002.","phone":"Not Provided","profile":"Technical Support Executive \nSpider Software Private Limited","description":"Candidate must be Graduate (Compulsory) Fresher's & Experienced both can apply Good communication is required Age limit is Upto 28 years Only male can apply Job Responsbility- Responsible for giving software training to the clients Handling doubts & queries of clients. Retention activities. Candidates will get an opportunity to understand about Stock Market & Technical Analysis. Walk-in Date/ Time: 16th - 20th July 2019, 10 AM onwards Interview Venue: Spider Software Private Limited 212, Rajhans Complex, Near Nirmal Hospital, Ring Road, Surat, Gujarat - 395 002.","location":"Surat","experience":"0 - 2 Years"},{"date":"17, 18, 19 - Jul - 2019","skills":"Core PHP, MySQL, JavaScript, jQuery, Angular js","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Plaxonic Technologies Pvt. Limited, B-10 Sector-59 , Noida","phone":"Not Provided","profile":"Core PHP Developer \nPlaxonic Technologies Private Limited","description":"Candidate should have strong knowledge and experience in Core PHP, MySQL, JavaScript, jQuery, Angular JS. Must have a minimum of working knowledge in all stages of the Software Development Life Cycle: requirements gathering, design, development, testing, and implementation. Walk-in Date/ Time: 17th July - 19th July , 10 AM onwards Interview Venue: Plaxonic Technologies Pvt. Limited B-10 Sector-59 , Noida","location":"Noida","experience":"0 - 2 Years"},{"date":"17 - Jul - 2019","skills":"Technical Support, Email Support. writing html SQL","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"GlobalLogic Technologies Limited , ASF Insignia SEZ Private Ltd. Grand Canyon Building, 14th floor, Block D&E, Off Gurgaon, Faridabad Road, Tehsil Sohna, Gwal Pahari, Gurgaon, Haryana - 122003","phone":"Not Provided","profile":"Partner Support Specialist (Non Voice) \nGlobalLogic Technologies Limited","description":"Requirements- Good keyboarding skills along with basic computational ability and internet savviness. Knowledge of Basic SQL, Basic XML and Basic HTML preferred Strong analytical, problem solving and troubleshooting skills Ability to discern trends and suggest solutions to product/process related issues Team player with very good interpersonal skills and forward-looking attitude Open to feedback and zeal for learning new things Open to work in 24/7 environment (including holidays) We offer- Interesting and challenging work in a large and dynamically developing company Exciting projects involving newest technologies Professional development opportunities Excellent compensation and benefits package, performance bonus program Modern and comfortable office facilities Walk-in Date/ Time: 17th July 2019, 9 AM onwards Interview Venue: GlobalLogic Technologies Limited ASF Insignia SEZ Private Ltd. Grand Canyon Building, 14th floor, Block D&E, Off Gurgaon, Faridabad Road, Tehsil Sohna, Gwal Pahari, Gurgaon - 122 003 If interested, please apply through the Registration link given below and HR Team will get back to you. Registration Link- http://bit.ly/2Xn55s2","location":"Gurgaon","experience":"0 - 2 Years"},{"date":"15, 16, 17, 18, 19 - Jul - 2019","skills":"Use Cases Software Testing Agile Product Life Cycle System Integration","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Paperchase Accountancy India Private Limited, 7th Floor Parswhanath Business Park, Prahaladnagar Ahmedabad","phone":"9687600733","profile":"Software Tester \nPaperchase Software Solution Pvt. Limited","description":"Duties and Responsibilities: Analysing users stories and/use cases/requirements for validity and feasibility Collaborate closely with other team members and departments Execute all levels of testing (System, Integration, and Regression) Design and develop automation scripts when needed Detect and track software defects and inconsistencies Provide timely solutions Apply quality engineering principals throughout the Agile product lifecycle Provide support and documentation Prepare use cases for through testing Required Candidate profile 3+ years of experience as a Software Tester or similar role Ability to create automation testing scripts Ability to handle multiple tasks simultaneously 2+ years of experience in data analysis Ability to work in a fast paced environment with minimal supervision Sense of ownership and pride in your performance and its impact on company's success Critical thinker and problem-solving skills Team player Good time-management skills Perks and Benefits No bar for deserving candidate Walk-in Date/ Time: 15th - 19th July 2019 Time: 12 PM onwards (Monday - Friday) Interview Venue: Paperchase Accountancy India Private Limited 7th Floor Parswhanath Business Park, Prahaladnagar Ahmedabad Opposite KFC Restaurant","location":"Ahmedabad","experience":"3 - 7 Years"},{"date":"15, 16, 17 - Jul - 2019","skills":"Core JAVA, JavaScript, Spring Framework, Java script, HTML, MySQL","qualification":"B.E./B.Tech","address":"Spoors Technology Solutions India Pvt. Limited, 4th Floor, Sai Prithvi - Cyber Arcades, Above Bata Showroom, Indian Oil Petrol Bunk, Madhapur, Hyderabad.","phone":"Not Provided","profile":"Java Developer \nSpoors Technology Solutions India Pvt. Limited","description":"Looking for recent pass-outs 2018,2019 for freshers, Exp candidate should have 2 to 4 years experience as a Java/ J2EE developer. Experience with Struts, Spring, Hibernate and Tomcat CSS, HTML, JavaScript, XML, JSON, AJAX and JSP Good in Core JAVA, JavaScript, Spring Framework. Knowledge of Java script and HTML is desirable. Database design and modelling skills (preferably in MySQL) Walk-in Date/ Time: 15th July - 17th July , 10 AM onwards Interview Venue- Spoors Technology Solutions India Pvt. Limited, 4th Floor, Sai Prithvi - Cyber Arcades, Above Bata Showroom, Indian Oil Petrol Bunk, Madhapur, Hyderabad.","location":"Hyderabad","experience":"0 - 4 Years"},{"date":"15, 16, 17, 18, 19 - Jul - 2019","skills":"Java, GWT, Servlets, Hibernate and RESTful APIs, MySQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"ProdEx Technologies, No: 45, Dr RadhaKrishnan Salai, Laxmi Towers, 1st Floor, Mylapore, Chennai - 600 004","phone":"Not Provided","profile":"Java Developers \nProdEx Technologies","description":"* 2+ years of relevant experience in the field of web development (Java, Servlets, MySQL). * Ability to develop and deploy server based applications. * Prototype various technologies and architectures to identify best solutions to given problems. * You will work with Java, GWT, Servlets, Hibernate and RESTful APIs on Windows/ Linux in a fast paced environment. * Opportunity to interact directly with the customer, collect requirements and implement. Desired Profile- * Proven experience building mobile applications for Android (using Java) * Ability to ensure the performance, quality, and responsiveness of applications * Knowledge of a database management systems like MySQL or Oracle, experience of handling big data is a plus. * Constant interest in staying upto date with the latest trends in UI design, Web design, Mobile Apps etc. * Passionate self-starter who can learn quickly. * Excellent verbal and written skills Walk-in Date: 15th to 19th July (Monday to Friday) Timings: 10.00 AM - 4.00 PM Interview Venue: ProdEx Technologies No: 45, Dr RadhaKrishnan Salai, Laxmi Towers, 1st Floor, Mylapore, Chennai - 600 004","location":"Chennai","experience":"2 - 3 Years"},{"date":"15, 16, 17, 18, 19 - Jul - 2019","skills":".Net Trained / Freshers","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Verinon Technology Solutions Private Limited, #305, 3rd Floor, Mayfair Complex, SP Road, Begumpet, Hyderabad - 500 003","phone":"Not Provided","profile":".Net Trainee - Developer \nVerinon Technology Solutions Private Limited","description":"Role : Software Engineer Job Location : Hyderabad Candidate must be trained on .Net Technology Good Communication skills required Good knowledge on SQL Server Interested candidates can walk - in to the below address. Walk-in Date: 15th to 19th July 2019 Time: 11:00 A.M to 5:00 P.M Interview Venue:: Verinon Technology Solutions Private Limited #305, 3rd Floor, Mayfair Complex, SP Road, Begumpet, Hyderabad - 500 003 Landmark - Opposite to Traffic Police Training Center, Above Vodafone Store Email- manasa.kopuri@verinon.com","location":"Hyderabad, Secunderabad","experience":"0 - 1 Years"},{"date":"16 - Jul - 2019","skills":".Net Trained / Freshers","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Atlas Systems Private Limited, No. 56/3, Bannerghatta Main Road, Unit-1B, First Floor, Vakil Square, Gurappana Palya, Bengaluru, Karnataka - 560 029","phone":"080-42615071","profile":".Net Developer/ Freshers \nAtlas Systems Private Limited","description":"Atlas Systems Private Limited, is looking for .Net Fresher Night shift (Male only) Candidate must have good knowledge in .Net Technologies .Net Certification is mandatory Walk-in Date: 16th July 2019 Timing 11:00 AM to 5:00 PM Interview Venue: Atlas Systems Private Limited No. 56/3, Bannerghatta Main Road, Unit-1B, First Floor, Vakil Square, Gurappana Palya, Bengaluru, Karnataka - 560 029 Contact Person : Kalaivani","location":"Bangalore","experience":"0 - 1 Years"},{"date":"15 - Jul - 2019","skills":"Test Engineering QA Testing Tools Product Development Regression Testing","qualification":"B.E./B.Tech","address":"eCIFM Solutions India Pvt. Limited, Plot -507 Udyog Vihar Phase 5, Gurgaon, Haryana","phone":"Not Provided","profile":"Software Test Engineer \neCIFM Solutions India Pvt. Limited","description":"Requirements: * Proven work experience in manual quality assurance. * Strong knowledge of Manual Testing. * Experience in writing clear, concise and comprehensive test plans and test cases * Hands-on experience in black box testing * Hands-on experience with manual testing. * Solid knowledge of SQL and scripting * Experience working in an Agile/Scrum development process * Experience with performance and/or security testing is a plus * BS/MS degree in Computer Science, Engineering or a related subject Perks and Benefits Best in the Industry Walk-in Date: 15th July 2019 Time: 11am to 1pm Interview Venue: eCIFM Solutions India Pvt. Limited Plot -507 Udyog Vihar Phase 5, Gurgaon, Haryana Nearest Metro Rapid Indusind.","location":"Gurgaon","experience":"0 - 3 Years"},{"date":"15 - Jul - 2019","skills":"Testng Defect Life Cycle Automation Framework Automation Testing Test Analysis","qualification":"B.E./B.Tech, MCA/PGDCA","address":"GODREJ INFOTECH LIMITED, Plant 19-A, LBS MARG, VIKHROLI WEST","phone":"Not Provided","profile":"Automation Tester \nGodrej Infotech Limited","description":"Godrej Infotech Limited is on the look for Automation Tester. Job Location: Mumbai (Vikhroli) Experience Required: Within 2-5 Years Notice Period:1 month or 45 Days not more than that Essential Skills: 2-4 years- experience as test analyst Developing test strategies, test plans and test cases; Good web testing experience. At least 2-3 years of Automation testing experience using Selenium. SPECIAL SKILLS- Essential:Dedication to quality and meticulous approach, attention to detail, high level analytical and problem-solving skills, demonstrated ability to investigate complex issues and make informed decisions about them when written guidelines are not necessarily available Fluent English; Good Presentation and Communication skills (both written and verbal) Walk-in Details: 15th July 2019 Timing-9:00 Am to 12 pm Interview Venue: GODREJ INFOTECH LIMITED, Plant 19-A, LBS MARG, VIKHROLI WEST Interested candidate can send me their CV on shwethas@godrej.com","location":"Mumbai","experience":"2 - 5 Years"},{"date":"15, 16, 17, 18, 19 - Jul - 2019","skills":"Automation Testing, Test Scripts, Regression/ Manual testing, Agile, Sellinium","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Resulticks Digitals India Pvt. Limited, No. 37, 6th Floor, PM Tower, Greams Road, Thousand Lights, Chennai- 600 006 (Landmark: IDBI Bank on the Ground Floor)","phone":"Not Provided","profile":"Automation Testers (Selenium) \nResulticks Digitals India Pvt. Limited","description":"Person must have BS/ BA Degree in Computer Science or Information Systems 2+ years of experience in QA field using web-based technology is desired Experience in NCover and Nunit Effectively balance curiosity about tests, test results, and bugs with project constraints on budget and schedule. Good communication skills to work across groups and locations Must have a working knowledge of Quality Assurance methodologies Excellent analytical skills and problem solving ability are a must Must have great attention to detail ISQTP certification is Desirable Walk-in Date: 15th - 19th July 2019 Timing: 11.00 AM - 3.00 PM only Interview Venue: Resulticks Digitals India Pvt. Limited No. 37, 6th Floor, PM Tower, Greams Road, Thousand Lights, Chennai- 600 006 (Landmark: IDBI Bank on the Ground Floor)","location":"Chennai","experience":"4 - 8 Years"},{"date":"15, 16 - Jul - 2019","skills":"Test Engineering, Selenium/ Manual Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Crystal Solutions Limited, 716/717, Reena Complex, Ramdev Nagar Road, Vidya Vihar (West) Mumbai - 86","phone":"89399 19650","profile":"Software Tester/ Freshers \nExceljuta Talent Solution Private Limited","description":"We have an urgent requirement of freshers for the post of Trainee Test Engineer at the fastest growing software Company in Chennai, OMR road. Job location: Chennai, OMR road Looking forward for the support Requirements: Engineering candidates are eligible Testing course is mandatory (Selenium/ Manual) Knowledge in OOPS Concepts Excellent in oral and written communication skills. Walk-in Date: 15th & 16-July-2019 (Monday & Tuesday) Time: 10:30 AM - 3:00 PM Venue Details:- Exceljuta Talent Solution Pvt. Limited No: 30 Srinivasa nagar, 1st Street, Kandanchavadi, OMR, Chennai - 600 096 Landmark: Near Saravana Bhavan Hotel, Lane next to Prince Info Park Phase 1, Beside KVB ATM Contact Person: Pavithra / Santina Contact No: 89399 19650","location":"Chennai","experience":"0 - 1 Years"},{"date":"15, 16, 17, 18, 19 - Jul - 2019","skills":"Non Voice Process, Customer Service, Technical Support, Customer Care","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Amazon Development Centre (India) Private Limited, 6th Floor in Tower 1 of Laxmi Infobahn Pvt. Limited SEZ Survey No. 107(P), Kokapet Village, Gandipet Mandal, Ranga Reddy District","phone":"Not Provided","profile":"Technical Support Associate \nAmazon Development Centre (India) Pvt. Limited","description":"Qualifications required: Minimum qualification is 10 + 2. Any graduate/ PG is eligible to apply. Technical Aptitude: Familiarity with variety of Device Platforms (Desktops, Laptops, Tablets, Mobiles, Gaming consoles, Streaming devices) and Digital Services (Videos, Music, Apps, Video Games, streaming content, Cloud Storage) and associated technical terminologies In-depth knowledge of Wi-Fi technologies (Devices / Connectivity / Types) Working knowledge of all kinds of mobile and computer OS ( Mac / iOS / Windows ) Ability to translate complex technical information / instructions into a simple language that would ensure seamless trouble shooting Basic awareness about Amazons Devices and Digital Services (Subscriptions) Awareness of latest trends and developments in the technology industry Technically inclined with a drive to challenge existing processes and innovate Communication Skills: Excellent communication skills (written and verbal) Ability to communicate correctly and clearly with all customers Excellent documentation skills Good comprehension skills ability to clearly understand and state the issues customers present Ability to concentrate follow customers issues without distraction to resolution Good composition skills ability to compose a grammatically correct, concise, and accurate written response Work successfully in a team environment as well as independently Problem Solving Skills: Effective problem solving skills including decision making, time management and immediate prioritization of tasks as assigned Ability to approach problems logically and rationally Action oriented and self-disciplined Organized and detail-oriented Ability to quickly and effectively prioritize work time in various departments to meet business need Ability to maintain composure in highly escalated situations Qualified candidates will be comfortable in a multi-tasking, high-energy environment. They will be creative and analytical problem solvers with a passion for excellent customer service Salary Range: 2.6 LPA - 3.1 LPA Additional Benefit: Meal Vouchers, Night Shift Allowance, Over Time Payout, Transportation Allowance (work from office) Walk in Details: Interview Date: 15th to 19th July 2019 (Monday- Friday) Time: 10.30 am to 2 pm Interview Venue: Amazon Development Centre (India) Private Limited 6th Floor in Tower 1 of Laxmi Infobahn Pvt. Limited SEZ Survey No. 107(P), Kokapet Village, Gandipet Mandal, Ranga Reddy District","location":"Hyderabad","experience":"0 - 5 Years"},{"date":"13, 15, 16, 17, 18, 19, 20, 22, 23, 24, 25, 26, 27, 29, 30, 31 - Jul - 2019","skills":"QA, Technical Process","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Cognizant Technology Solutions (India) Limited, Building No.12A, 1st floor, Raheja Mind space, Hi-tech city, Hyderabad - 500 032","phone":"Not Provided","profile":"QA/ Process Executive \nCognizant Technology Solutions (India) Limited","description":"Technical - Good Data Interpretation, Logical Reasoning, Quantitative Skills and Reading Comprehension Tech savvy - Ability to understand technological products and troubleshoot Strong familiarity with productivity and collaboration tools Communication - Excellent comprehension skills Good verbal and written communication skills Additional preferences - Experience working in a B2B or B2C environment Broad understanding of driving laws/lane guidelines/traffic signals. Driving experience will be an added advantage Education Criteria: Minimum 15 (10+2+3 / 4) years of education Candidates with standing arrears is not eligible, should be a graduate Interview will be a day long process Parking facility is not available inside Cognizant premises Referrals are invited Walk In Venue Details: Cognizant Technology Solutions (India) Limited Building No.12A, 1st floor, Raheja Mind space, Hi-tech city, Hyderabad - 500 032 Interview Date & Time: July 12th to July 31st (Monday-Saturday) Interview Time : 11AM to 2 PM Interview location & Work Location: Hyderabad Point of Contact: Ashish Joseph Candidates who have attended the interview in last 3 months are not eligible. If you cannot attend the walkin, and are interested in applying for this position, please write to Poojitha Kunduru at Poojitha.Kunduru@cognizant.com . Please mention Applying for [Role - Software Quality Testing Analyst - Tier 1] in your email subject line","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"14 - Jul - 2019","skills":"Writing Test Cases Test Engineering Product Development product design","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"iDisha Infolabs Private Limited (Quick Ride) #96, First floor, 3rd Cross, Behind Coffee Lounge, Opposite Marathahalli Kalamandir Service Road, RJ Garden, Marathahalli, Bengaluru - 560 037","phone":"8197556770","profile":"Software Tester/ Developer (Fresher) \niDisha Infolabs Private Limited (Quick Ride)","description":"We are conducting walk in drive at our Organisation on 14 July 2019 Work Location: Marathahalli, Bangalore Need very good at Programming and keen to work in Product development start-up for minimum 2yrs, then candidate can come over for walk-in discussion . Freshers Required. B.E/ MCA/ M.Sc with CS/ IT/ ECE (Pass out : 2019) Min. Eligibility : 65% and above academics through out from 10th to Graduation. Excellent Java Programming skills is required. Interview Process for Developer 1. Written Test( Aptitude, Technical) 2. Java Programming 3. Managerial Round 4. Final round Interview Process for Test Engineer 1. Written Test( Aptitude, Technical) 2. Finding bugs on mobile app , writing test cases 3. Managerial Round 4. Final round Walk-In Date: 14 July 2019 Time: 9AM to 11AM Interview Address: iDisha Infolabs Private Limited (Quick Ride) #96, First floor, 3rd Cross, Behind Coffee Lounge, Opposite Marathahalli Kalamandir Service Road, RJ Garden, Marathahalli, Bengaluru - 560 037 For applying please fill the link below https://forms.gle/ffee5fmMZDFe8kFN9 For further query feel free to call :8197556770","location":"Bangalore","experience":"0 - 1 Years"},{"date":"12 - Jul - 2019","skills":"HR/ Recruitment, Screening, Telephonic Interviewing, Sourcing","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Plot No. 319, Udhyog Vihar, Phase-4 Gurugram, Haryana - 122 016","phone":"3913939","profile":"Sr. HR Executive (Only Male) \nSpiceJet Limited","description":"We are conducting walk-in interviews for the position of Senior HR Executive (only Male) in our in Human Resources Department on 12th July' 2019 from 10:00 am to 12:00 Noon (Friday) Designation : Senior Executive - HR Department : Human Resources Job Location : Gurgaon Qualification : MBA/ PGDM - HR Experience: 3 - 5 Years Job Responsibilities: * Sourcing /Screening - Resumes/Profiles * End to End Recruitment * Taking Telephonic round of interviews/Face to Face interviews * Coordinating with candidates & interview panelist for the final rounds * Posting job vacancy on job portals * Documentation * Daily MIS * Daily assigned work Required Skills sets: * Willing to travel * Excellent Communication both written & Verbal * Having knowledge of Excel & power-point presentation * Out of the box thinking Kindly report at the below mentioned address and do carry a copy of your updated resume Date : 12th July ' 2019 ( Friday ) Timing: 10 am till 12 noon Interview Venue: Plot No. 319, Udhyog Vihar, Phase-4 Gurugram, Haryana - 122 016 Dress Code: Formals","location":"Gurgaon","experience":"3 - 5 Years"},{"date":"13, 16, 17, 18, 19 - Jul - 2019","skills":"C#.Net 3.0/4.0/4.5, ASP .NET, ADO .NET, JQuery, MVC4, MVC5","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Info-X Software Technology Private Limited, 335 Udyog Vihar Phase 2, Gurugram - 122 016","phone":"836-831-8967","profile":"ASP .Net/ MVC Developer \nInfo-X Software Technology Pvt. Limited","description":"We are looking for a Self-motivated ASP .Net/ MVC Developer who can take up the challenge of developing applications in .NET, MVC and providing end to end solutions. Qualification - Any Graduate with relevant experience, Minimum of 1 year of experience on MVC and had done at least 2 projects on MVC. Candidates who can join immediately or within 10 to 15 days should only apply. Roles and Responsibilities:- Excellent knowledge of C#.Net 3.0/4.0/4.5, ASP .NET, ADO .NET, JQuery, MVC4, MVC5 Experience in developing web applications and web services. Good proficiency CSS, HTML, AJAX, XML, XML Schema, WPF, MVC, Knowledge of Data Adapter, Dataset, Data reader as a part of ADO.NET to access and update the database. Experience in developing T-SQL queries, stored procedures, and triggers using SQL Server 2008/2016 and database maintenance Effective in working independently and collaboratively in teams. Excellent communication skills Should possess knowledge of C# Windows forms / WPF with MVVM, Multithreading, WCF Knowledge of XML, XSLT, XSD (optional) Knowledge of EDI Integration using EDIFACT, Ansi X-12, SAML, FLAT File. Skill Set: Ability to understand the task quickly. Desired candidates should be time flexible along with being ready to work in a competitive and challenging environment. Understand the customer's query and provide an accurate resolution Candidate with a stopgap can also apply. We have multiple openings candidates who can join immediately are most welcome. Candidate should have high energy levels. Candidates who are not working and have a stop gap can also apply. Perks and Benefits Annual Bonus Walk-in Date: 12th July - 19th July, 2019 Timing - 3 PM to 7 PM (Monday to Friday) Interview Venue: Info-X Software Technology Private Limited 335 Udyog Vihar Phase 2, Gurugram - 122 016 Interested candidate kindly send profile on pramod@infoxwebware.net Phone No: 836-831-8967","location":"Gurgaon","experience":"1 - 6 Years"},{"date":"13 - Jul - 2019","skills":"CORE Java, REST, JavaScript, JQuery, Vue.JS, HTML, CSS","qualification":"B.E./B.Tech","address":"3D PLM Global Services Pvt. Limited, Flagship Infrastructure (P) Limited, SEZ, S. No. 123, Fourth Floor at Building IT 09, Rajiv Gandhi InfoTech Park, Phase -I, Hinjewadi, Pune - 411 057","phone":"Not Provided","profile":"Java Developers \n3D PLM Global Services Pvt. Limited","description":"Qualification: Bachelors of Engineering (Computer Science or others) Total Experience: 2 to 6 Years Job Location: Pune Should have experience in JavaScript, JQuery, Vue.JS, HTML, CSS Hands on experience in CORE Java, REST Good problem solving and analytical skills Good English communication skills Good to have the experience of Application Interface. Perks and Benefits- Best in the Industry Walk-in Date: 13th July 2019, Timings: 10 AM - 5 PM onwards Interview Venue: 3D PLM Global Services Pvt. Limited, Flagship Infrastructure (P) Limited, SEZ, S. No. 123, Fourth Floor at Building IT 09, Rajiv Gandhi InfoTech Park, Phase -I, Hinjewadi, Pune - 411 057","location":"Pune","experience":"2 - 6 Years"},{"date":"15, 16, 17 - Jul - 2019","skills":"Java/ J2ee, JSP, Core Java, Hibernate, Javascript , Spring, Advanced Java","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"RS Group of Technologies, New No.33, Old No.16, New Colony 2nd Main Road, Near Municipal Office, Chrompet, Chennai - 600 044","phone":"9962848578","profile":"Java Developer - Freshers \nRS Group of Technologies","description":"Educational Qualification- Diploma / Degree Experience- 0 to 1 year (Freshers only) Candidates with arrears can also apply Both Male & Female can apply Job Location- Chennai Direct walk-in & Direct Joining Process Date: 15th - 17th July 2019 Timing: 10 AM - 5 PM onwards Interview Venue: RS Group of Technologies New No.33, Old No.16, New Colony 2nd Main Road, Near Municipal Office, Chrompet, Chennai - 600 044 Phone No- 9962848578","location":"Chennai","experience":"0 - 1 Years"},{"date":"13 - Jul - 2019","skills":"CORE Java, REST, JavaScript, JQuery, Vue.JS, HTML, CSS","qualification":"B.E./B.Tech","address":"3D PLM Global Services Private Limited (A Dassault Systèmes Company) No. 45, Nanda Towers, 22nd cross, 5th Main Road, 3rd block Jayanagar, Bangalore - 560 011","phone":"Not Provided","profile":"Java Developers \n3D PLM Global Services Pvt. Limited","description":"Bachelors of Engineering (Computer Science or others) Total Experience: 2 to 6 Years Job Location: Bangalore Should have experience in JavaScript, JQuery, Vue.JS, HTML, CSS Hands on experience in CORE Java, REST Good to have the experience of Application Interface. Good problem solving and analytical skills Good English communication skills Walk-in Date/ Time: 13th July 2019, 10 AM - 5 PM onwards Interview Venue: 3D PLM Global Services Private Limited (A Dassault Systèmes Company) No. 45, Nanda Towers, 22nd cross, 5th Main Road, 3rd block Jayanagar, Bangalore - 560 011 Landmark: Near to NMKRV PU College for Women","location":"Bangalore","experience":"2 - 6 Years"},{"date":"17 - Jul - 2019","skills":"Core Java, Spring MVC, Hibernate, Javascript","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"eMudhra Limited, Survey No. 80/2 , Plot No. 23 , 24 - 25, 1st Floor Bellandur Village Varthur Hobli, Bangalore - 560 103","phone":"080-42275316","profile":"Java Developer \neMudhra Limited","description":"Mandatory Skills: 1. Core Java (mandatory) 2. Spring MVC (mandatory) 3. Hibernate (mandatory) 4. Javascript (mandatory) Work Experience: 1.6 to 4 years Notice Period: Immediate /15-30 days Face to face Interview: 17th July 2019 (Wednesday) Timings: 9 AM - 5 PM Interview Venue: eMudhra Limited Survey No. 80/2 , Plot No. 23 , 24 - 25, 1st Floor Bellandur Village Varthur Hobli, Bangalore - 560 103 Landmark: above ICICI Bank, Bellandur Branch Opposite to Akme Apartment Interested candidates who are willing to attend the interview can drop the resume to ramya.c@emudhra.com or can reach on 080-42275316","location":"Bangalore","experience":"1 - 4 Years"},{"date":"13 - Jul - 2019","skills":"Java/ J2Ee, Spring, Mvc, Web Services","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"CenturyLink Technologies India Private Limited, Salarpuria Touchstone, Fourth Floor, Survey no. 15/3 & 16, Kadubeesana Halli, Varthur Hobli, Outer Ring Road, Bangalore - 560 087.","phone":"Not Provided","profile":"Java Developers \nCenturyLink Technologies India Pvt. Limited","description":"Openings for Java Developer (Permanent Role) Work Experience: 2 to 8 Years Job Location: Bangalore Good knowledge and hands on experience in Core Java / J2EE technologies. Essential to have good analytical, written and verbal communication skills Ability to go beyond just the tasks given, and proactively work on additional improvements. Experience with hibernate, Spring MVC & Oracle Strong knowledge and ability to implement/develop micro services. Experience in building soap/restful Webservices. Ability in understanding swagger document to build restful services. Understanding of CenturyLink Billing / Inventory systems Ability to analyze performance issues in the application. Interview Process: Java Online Test, Followed by technical Interviews & Manager Round Walk-in Date & Time: 13th July-2019 @ 9:00 AM to 4:00 PM Mode of Interview: Face 2 Face Interview Venue: CenturyLink Technologies India Private Limited. Salarpuria Touchstone, Fourth Floor, Survey no. 15/3 & 16, Kadubeesana Halli, Varthur Hobli, Outer Ring Road, Bangalore - 560 087. Contact Person: Sindhu / Sowjanya","location":"Bangalore","experience":"2 - 8 Years"},{"date":"12 - Jul - 2019","skills":"Back Office Activities, Excel, Document Verification, Data Entry","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Integreon Managed Solutions (I) Pvt. Limited, 4th Floor, IT Building 03, Nesco IT Park, Nesco Complex, Western Express Highway, Goregaon East, Mumbai - 400 063","phone":"Not Provided","profile":"Back Office Executive \nIntegreon Managed Solutions (I) Pvt. Limited","description":"Key Objective: To work with the team leaders to produce quality assured documents. Educational Requirements: Graduate or equivalent preferred Strong Verbal and Written communication skills Professional approach to problem solving Good knowledge of Word, MS PowerPoint, Excel High level of positive attitude Should be Flexible in terms of movement internally and externally Should be flexible to work in rotating shifts Service mentally and Core value integration Previous Experience Requirements Immigration experience preferred Fluent in written and oral communication in English Specific Duties: To produce client worthy documents ensuring quality To carry out work smoothly and efficiently To continue to develop speed, accuracy To maintain confidentiality of all official and client information To have good co-ordination with team members/colleagues To understand, use and contribute best practices for production To assist the team leaders in training new recruits To follow all SOP maintained for every process Shift- Day shift Job Location: Mumbai CTC: Upto 2,75,000/- Walk-in Date: 12th July 2019 Timing- 10 AM onwards till 2:00 PM Interview Venue: Integreon Managed Solutions (I) Pvt. Limited 4th Floor, IT Building 03, Nesco IT Park, Nesco Complex, Western Express Highway, Goregaon East, Mumbai - 400 063 Contact Person: Anil Kumar","location":"Mumbai","experience":"0 - 3 Years"},{"date":"12, 13, 14, 15, 16, 17, 18, 19 - Jul - 2019","skills":"HR Generalist Activities, Payroll Payroll Processing, Employee Engagement","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Radiance Realty Developers India Limited, Khivraj complex IInd phase 6th Floor, No: 420 Annasalai, Nandhanam, Chennai - 600 035.","phone":"Not Provided","profile":"HR Executive \nRadiance Realty Developers India Ltd.","description":"Candidate should be Any Graduate/ MBA (HR) with 3 to 5 years of experience in Recruitment, HR Generalist Activities, Payroll Payroll Processing, Employee Engagement, Employee Relations, Time Office. Walk-in Date/ Time: 12th - 19th July , 9 AM onwards Interview Venue- Radiance Realty Developers India Limited Khivraj complex IInd phase 6th Floor, No: 420 Annasalai, Nandhanam, Chennai - 600 035.","location":"Chennai","experience":"3 - 5 Years"},{"date":"12, 15, 16, 17, 18, 19, 22 - Jul - 2019","skills":"Recruitment HR Hiring Interviewing","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Photon Interactive Pvt Limited, DLF IT Park, 5th Block 2nd Floor, 1/124, Mount Poonamallee Road, Manapakkam, Chennai - 600 089","phone":"9300012736","profile":"HR Recruiter \nNeuroglia Health Private Limited","description":"We are hiring RECRUITERS! Keeping our strong growth plans in mind, We are growing our HR team to help our recruitment efforts. Young, energetic and great communicators 6 months to 1-year experience Ability to work on both technical and nontech positions Hands-on knowledge of job portals and alternate recruitment channels. Be a team player. work closely with business teams Ability to work with a target-oriented approach. Shift Time: 5 Days - Day shift. Location: JP Nagar 4th Phase, Bengaluru Salary: Open salary (Based on interview performance). Interview Details: Time: 10 AM - 6 PM Date: 12th July (Friday) - 22nd July (Monday) Venue: 3rd Foor, 393, 2nd Cross Road, JP Nagar 4th Phase, Dollars Colony, Phase 4, JP Nagar, Bengaluru - 560 078. POC: Shubham - 9300012736 Feel free to connect at 9300012736 or Mail @ shubham@marrowmed.com","location":"Bangalore","experience":"0 - 2 Years"},{"date":"13 - Jul - 2019","skills":"Java, object oriented analysis and design, coding and implementation","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Zuci Software Testing Solutions Pvt. Limited, No.11, Ground Floor, Rattha Tek Towers, OMR, Thoraipakkam, Chennai - 600 097.","phone":"Not Provided","profile":"Java Developers \nZuci Software Solutions Pvt. Limited","description":"Candidate should have hands-on experience in Java, object oriented analysis and design, coding and implementation in Java Work Experience: 1 - 3 Years Job Location: Chennai Walk-in directly if your profile is suitable! Date: 13th July 2019 Time: 9:30 AM to 3:00 PM Interview Venue: Zuci Software Testing Solutions Pvt. Limited No.11, Ground Floor, Rattha Tek Towers, OMR, Thoraipakkam, Chennai - 600 097. Landmark: Opposite to Hotel Sangeetha, OMR","location":"Chennai","experience":"1 - 3 Years"},{"date":"15, 16 - Jul - 2019","skills":"IT Recruitment recruiter it recruiter it staffing","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Zenith Software Limited, 'Zenith House' 4, Industrial Layout, Koramangala, Bangalore - 560 095","phone":"080 66958771","profile":"IT Recruiter \nZenith Software Limited","description":"We are looking Experienced IT recruiter for our Staffing team. If you are interested Walk -In to our Office of share your resume for further process. IT recruitment Experience - 1 to 3 Years Job Location - Koramangala, Bengaluru Candidate must haver good working experience in end to end IT recruitment Searching Candidates resumes from the job portals as per clients requirement Expertise in the areas of sourcing, screening, validating, interview coordination Build and Maintain candidates' relationship, pipeline, and proven ability to self-manage multiple positions Experience in sourcing and screening profiles from various Job portals Experience in C2H is a plus Walk-in Date/ Time: 15th - 16th July , 10 AM - 5 PM onwards Interview Venue: Zenith Software Limited 'Zenith House' 4, Industrial Layout, Koramangala, Bangalore - 560 095 Phone No: +91 80 66958771 / 72 /73 Email: nutanb@zenithsoft.com","location":"Bangalore","experience":"1 - 3 Years"},{"date":"13 - Jul - 2019","skills":"C# .Net, WPF","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"IDEMIA India, Plot No. 1 A, Sector 73 Noida","phone":"9873680848","profile":"Senior .Net Developer (WPF) \nIDEMIA India","description":"Work Experience : 1 to 6 Years Technical Skills: C# .Net, WPF Job Location: Noida Job Profile: Development Environment: .Net Framework 3.5 and above. Excellent Communication and collaboration skills. Development Skills Object Oriented Concepts and Design Skills. Hands on experience on development on WCF, WPF, Winforms, XML Validation Skills: Must have Hands on experience Automated testing using Test Complete (V12) and Test Link . Must have Ability to write Unit/Integration Test cases and execute test cases, test scenarios. Knowledge of Design patterns Must have Experience on MVVM design Pattern using Prism and Unity Knowledge of Source code management System / Process Must have Familiarity with GIT, Agile processes. Walk-in Date/ Time: 13th July 2019, 9 AM onwards Interview Venue: IDEMIA India Plot No. 1 A, Sector 73 Noida Contact Person :Abhishek Sharma (9873680848)","location":"Noida","experience":"1 - 6 Years"},{"date":"13 - Jul - 2019","skills":".Net Framework 4.0, C#, ASP .Net MVC, SQL Server and Jquery","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"HCL Technologies Limited, A-11, Sector-16, Noida","phone":"Not Provided","profile":".Net Developer \nHCL Technologies Limited","description":"Work Experience: 1-8 Years Primary Skills: .Net Framework 4.0, C#, ASP .Net MVC, SQL Server and Jquery Secondary Sills: Web Services/ WCF/ WPF, Jquery Roles & Responsibilities: Build new systems with Dot Net Framework 4.0, C#, ASP.Net MVC,SQL Server and Jquery, Angular JS Maintenance of existing applications Develop new functionality on our existing software applications. Share knowledge through knowledge-sharing presentations. Under general direction, design, code, test, debug and document source code in order to improve business productivity and/or quality Strong written and oral communication skills Commitment to improvement of customer experience Experience in translating technical requirements into source code Ensure that projects are delivered on time and are of the highest quality, meeting all team standards Document, implement, and provide on-going production support for automation solutions as required Testing Walk-in Date: 13th July (Saturday) Time 9:30 AM 1:30 PM Interview Venue: HCL Technologies Limited, A-11, Sector-16, Noida Mode of interview- Two Rounds of interview Documents to carry Updated Resume, Photograph, and Govt. ID Proof (Dont carry laptops)","location":"Noida","experience":"1 - 8 Years"},{"date":"13 - Jul - 2019","skills":"C# Azure LINQ Javascript Web Application .Net Entity Framework SQL Server MVC ASP.Net MVC","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"CheckMark India Private Limited, 6-2-29/3/9, First Floor, Doulat Plaza, Lakdikapul Road, P & T Officers Colony, Hyderabad, Telangana - 500 004.","phone":"040-29804040","profile":"Senior .Net Developer \nCheckMark India Private Limited","description":"We are looking for an experienced hands-on .Net developer to work with a group of highly skilled developers to build and deliver products. Candidate must have a Bachelors Degree or higher in Computer Science or related field with 2+ years of hands on experience in C#, ASP .Net MVC 4, Jquery .Net framework 3.5/4.0, Linq, Entity Framework, Web API, SQL Server 2008 or above. Must have worked with and have experience leading Agile teams MVC: Implemented more than one application, min experience not less than 1 year. JQuery: Implemented rich user interactive web pages. Should be able to write SQL queries and SPs. Linq and Entity Framework. Experience/ Exposure in using third party controls such as Fast Reports, Payment Gateway etc. Developing ASP .NET Web Application, should be aware of State Management Techniques. Good in C# Coding. Knowledge of Angular Js with type script preferable. Walk-in Date/ Time: 13th July 2019, 10 AM onwards Interview Venue: CheckMark India Private Limited 6-2-29/3/9, First Floor, Doulat Plaza, Lakdikapul Road, P & T Officers Colony, Hyderabad, Telangana - 500 004. Contact No: 040-29804040/ 29704140","location":"Hyderabad","experience":"2 - 4 Years"},{"date":"16, 17 - Jul - 2019","skills":"ASP .NET 2.0 /3.5/4.0, C#, SQL Server 2005","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Changepond Technologies Private Limited, H-2 , SIPCOT IT PARK, OMR, Siruseri, Chennai - 603 103. (Land Mark: Opposite to TCS 2nd Gate)","phone":"47480039","profile":".NET Developer/ Freshers \nChangepond Technologies Private Limited","description":"This is a full-time position for working in exciting and international projects. We are looking for candidates who have trained in .NET domain, Knowledge in RPA is an added advantage. Eligibility Cretra: 2019 / 2018 / 2017 / 2016 passed out only. BE / B Tech / MCA with an Aggregate of min 60% throughout Academics is MANDATORY. Good command of written and spoken English. Required Skills: Strong in .NET Framework, Object oriented programming and database concepts Basic Knowledge in ASP .NET 2.0 /3.5/4.0, C#, SQL Server 2005 Basic knowledge in web applications, windows services and web services AJAX, JQuery would be an added advantage .NET Certification / Course is MANDATORY Walk-in Date/ Time: 16th - 17th July , 9 AM onwards Interview Venue: Changepond Technologies Private Limited, H-2 , SIPCOT IT PARK, OMR, Siruseri, Chennai - 603 103. (Land Mark: Opposite to TCS 2nd Gate)","location":"Chennai","experience":"0 - 1 Years"},{"date":"13 - Jul - 2019","skills":".Net technologies","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Ari Tech Private Limited, #301/ B, 3rd Floor, Silicon Towers, Image Gardens Lane, Hi-Tech City, Madhapur, Hyderabad - 500 081.","phone":"Not Provided","profile":".Net Developer \nAri Tech Private Limited","description":"Educational Qualification: BE/ B.Tech/ BCA/ MCA Work Experience: 1 to 3 Years Job Location: Hyderabad Walk-in Date/ Time: 13th July 2019, 10 AM onwards Interview Date: 13th July 2019 Time: 10.00 Am -12.00 Pm Venue Details- Ari Tech Private Limited #301/ B, 3rd Floor, Silicon Towers, Image Gardens Lane, Hi-Tech City, Madhapur, Hyderabad - 500 081.","location":"Hyderabad","experience":"1 - 3 Years"},{"date":"12 - Jul - 2019","skills":"Core Java /J2EE, Spring MVC, Hibernate, Jquery, JSP Servlets,Oracle /SQL.","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"NSEIT Limited, Trade Globe, Second Floor, J.B Nagar, Andheri - Kurla Road, Andheri (East), Mumbai - 400 059,","phone":"022-4254 7497","profile":"Core Java Developer \nNSEIT Limited","description":"Work Experience: 2 - 5 Years Must have Skills : - Core Java/ J2EE, Spring MVC, Hibernate, Jquery, JSP Servlets,Oracle /SQL. Technical Skills : Full life cycle J2EE solution implementation from conceptualization, requirements, design and specification through development (coding), integration testing, deployment and follow-up support. Knowledge/Experience in J2EE development, JSP, servlets, expression language, JSTL, XSLT etc. Good working knowledge of Web Technologies: JavaScript, CSS and HTML, AJAX Hands On experience on Spring MVC, Spring security and Spring Core. (Must Have) Working knowledge of MySQL or Oracle. Walk-in on 12th July' 2019 Time: 11 am to 5 pm Interview Venue: NSEIT Limited, Trade Globe, Second Floor, J.B Nagar, Andheri - Kurla Road, Andheri (East), Mumbai - 400 059, Landmark: Near Kohinoor Continental Hotel","location":"Mumbai","experience":"2 - 5 Years"},{"date":"13 - Jul - 2019","skills":"C#, ASP .Net, MVC, OOPS, Javascript, HTML5, Angular","qualification":"B.E./B.Tech, MCA/PGDCA","address":"OSI Digital Private Limited, Plot # 37, L&T Infocity Lane, HITEC City Phase 2, Madhapur, Hyderabad, Telangana - 500 081","phone":"Not Provided","profile":".Net Trained/ Fresher \nOSI Digital Private Limited","description":"We are looking for .Net Full Stack Developer (Trained Freshers) Eligibility Criteria: B.Tech/ MCA - 2016, 2017, 2018 batch Passed Outs (No backlogs in academics) 60% is mandatory throughout academics(10th to highest qualification) Must possess Good verbal and written communication skills Work Experience: 0 to 2 years Job Location : Hyderabad Requirements: Should possess excellent analytical , logical and problem solving skills. Highly proficient in C#, ASP .Net, MVC, OOPS, Javascript, HTML5, Angular Self starter - takes initiative and has the ability to take pertinent decisions by himself/herself. Interested candidate should be ready to give 2 yrs commitment. Responsibilities: Develops enterprise-level information technology solutions by analyzing, coding, testing, and implementing new and modifying existing software applications. Good understanding of ASP.Net and MVC framework. Skill for writing reusable C# libraries. Strong understanding of object-oriented programming and its implementation. Good knowledge in SQL Server Reporting Services & Integration Services. The interview Date is on 13th July (Saturday) at 9:00 AM Interview Venue: OSI Digital Private Limited Plot # 37, L&T Infocity Lane, HITEC City Phase 2, Madhapur, Hyderabad, Telangana - 500 081 Contact Person: Madhuri K","location":"Hyderabad","experience":"0 - 2 Years"},{"date":"13 - Jul - 2019","skills":".Net and MVC Concept","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Muthoot Microfin Limited (IT Office), 2nd Floor, RKJ Tower, Kadavanthra, Cochin. Landmark : Kotak Mahindra Bank, Kadavanthara Junction - Kaloor Kadavanthara Road.","phone":"04844345666","profile":"Software Developer (.Net/ MVC) \nMuthoot Microfin Limited","description":"Candidate must have sound knowledge in .Net and MVC Concepts. Should have good Collaboration qualities with Good Interpersonal skills Resilience, Achievement orientation, Initiative, Quality Focus. Flexibility, Decisiveness, Tenacity, Independence, Risk taking, Personal integrity. Job Responsibility- To perform the duties with IT vertical/ functional units during on the job training, under guidance of experienced IT personnel. Support Testing and documentation of software for In-house applications. Support debugging software, in-house applications. Walk-in Date/ Time: 13th July 2019, 11 AM onwards Interview Venue: Muthoot Microfin Limited (IT Office), 2nd Floor, RKJ Tower, Kadavanthra, Cochin. Landmark : Kotak Mahindra Bank, Kadavanthara Junction - Kaloor Kadavanthara Road.","location":"Cochin","experience":"1 - 3 Years"},{"date":"12, 13 - Jul - 2019","skills":"Java, Jsp, Servlets, HTML, CSS, Java script, JQuery, AJAX, JSON","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Hyundai AutoEver India Pvt. Limited, Lotte Building, 4th floor, No: 4/169, Old Mahabalipuram Road (OMR), Kandanchavadi, Chennai - 600 096","phone":"Not Provided","profile":"Java Developer \nHyundai AutoEver India Pvt. Limited","description":"Candidate should have experience in Core Java & Advanced Good in web application development Must have exposure to Database Knowledge on AEM desirable Good hands-on coding using Java, Jsp, Servlets Knowledge in web technologies - HTML, CSS, Java script, JQuery, AJAX, JSON Experience in website or web application development Hands-on Restful web service, Apache sling or Spring MVC On Job Training will be provided by the Company. SHOULD BE ABLE TO JOIN IMMEDIATELY If interested, pls WALK- IN with your CV Walk-in Date/ Time: 12th - 13th July , 8 AM - 5 PM onwards Interview Venue: Hyundai AutoEver India Pvt. Limited Lotte Building, 4th floor, No: 4/169, Old Mahabalipuram Road (OMR), Kandanchavadi, Chennai - 600 096 Landmark: Opp. to Eureka Ford Show Room","location":"Chennai","experience":"1 - 5 Years"},{"date":"13 - Jul - 2019","skills":"Core Java, Spring, Microservices, Web Services, Web Technologies","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"e-Zest Solutions Limited, 3rd Floor, Building IT-09, Qubix business park, SEZ Blueridge, Rajiv Gandhi Infotech Park, Hinjewadi Phase 1, Pune - 411 057","phone":"7420073336","profile":"Java Full Stack Developer \ne-Zest Solutions Limited","description":"Walk-in Drive at e-Zest Solutions Limited for Java Full Stack Developer in Pune Position: Java full Stack (Junior) Work Experience: 2 to 5 Years Required Skills: Core Java, Spring 4+ Experience in Spring framework (Core, Data, Security, Cloud) with Spring Boot/ Spring Security Micro Services/ Webservices Angular 4 or 6 with 2 years + experience Elastic Search Experts Full Stack Developer Interview Day & Date: Saturday, July 13th, 2019 Interview Time: 10:00 AM IST Mode of interview: Face to Face Venue: e-Zest Solutions Limited, 3rd Floor, Building IT-09, Qubix business park, SEZ Blueridge, Rajiv Gandhi Infotech Park, Hinjewadi Phase 1, Pune - 411 057 Contact Person : Manjiri Wable (7420073336) / Niraj Rai Required Joiners only upto 15th August 2019 CTC as per market standards","location":"Pune","experience":"2 - 5 Years"},{"date":"13 - Jul - 2019","skills":".NET framework, JavaScript, JQuery frameworks, HTML /CSS, MS SQL Server","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Hytech Professionals India Pvt. Limited, A-89 Sector-63 Noida","phone":"Not Provided","profile":".Net Developer \nHytech Professionals India Pvt. Limited","description":"Candidate should have 0 to 3 years of -Strong hands-on experience with .NET framework, JavaScript, JQuery frameworks, HTML /CSS, MS SQL Server 2014/ 2017, SSRS and other reporting tool. Must have excellent verbal and written communication skills. Preferably using SQL, C#, .Net, ADO.Net, Entity Framework, LINQ, Web API. Strong OOPS concepts have developed / designed classes using design pattern Individual / Independent contributor to project (Technical / routing delivery / Review etc) Walk-in Date/ Time: 13th July , 10 AM onwards Interview Venue: Hytech Professionals India Pvt. Limited A-89 Sector-63 Noida","location":"Noida","experience":"0 - 3 Years"},{"date":"11, 12, 13 - Jul - 2019","skills":"Front Office, Reception, General Administration and Front Desk Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"CCS Computers Pvt. Limited, 3rd Floor, Skipper House, 62-63, Nehru Place, New Delhi - 110019","phone":"9716953233","profile":"Assistant Manager - Admin \nCCS Computers Private Limited","description":"Skills/ Knowledge required: Minimum 3 year relevant experience as Office Administration. Good Communication Skills in English (Both Verbal & Written). Candidate having friendly & confident personality. Having the ability to interact with people at all levels of the company. Candidate from nearby location will be preferred. Looking for only Male Candidates only. Job Responsbility- Office & Facilities Administration and management like Front Desk, Housekeeping, Security, courier & Stationery. Supervision of overall housekeeping, Courier, driver & pantry staffs. Planning and arrangement of meetings, conferences and conference calls. Handling Petty Cash requirement, Maintain Office records, manage office supplies Arrange & Coordinate with vendors for Ticket Booking for all mode of transportation. Kindly come for the interview along with updated resume at under mentioned address:- CCS Computers Pvt. Limited 3rd Floor, Skipper House, 62-63, Nehru Place, New Delhi - 110019 Land Mark: Near ICICI Bank & Above IndusInd Bank Contact Person - Mr.Rakesh Choudhary / Gourav Interview Date: 11th to 13th July-2019 Timings: 11:00 AM - 5:00 PM Notes:- If you are not interested than please share in your circle. Please check your eligibility criteria before coming for the interview. If you any query than please feel free to call me at 8285999666.","location":"Delhi","experience":"3 - 5 Years"},{"date":"11, 12, 13 - Jul - 2019","skills":"HR/ Recruitment, Employee Relations","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Radical Minds Technologies Pvt. Limited, Plot No. 368, Udyog Vihar, Phase-2, Gurgaon, Haryana","phone":"9873069128","profile":"HR Executive, Recruiter \nRadical Minds Technologies Pvt. Ltd","description":"Candidate should be Any Graduate/ HR with Good Communication Skill. Must be presentable Able to contact candidates regarding job opportunity. Can understand employees issues and resolving it on priority. Able to negotiate in terms of salary Walk-in Date/ Time: 11th - 13th July , 12 PM onwards Interview Venue: Radical Minds Technologies Pvt. Limited, Plot No. 368, Udyog Vihar, Phase-2, Gurgaon, Haryana Plz call on 9873069128 incase if you have any query.","location":"Gurgaon","experience":"0 - 1 Years"},{"date":"11, 12 - Jul - 2019","skills":"interviewing bpo non voice process hiring backend operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Cogito, A-83, Sector 2 Noida","phone":"7827667212","profile":"Back Office Executive \nCogito","description":"Qualification: 12th/ Graduation Gender: Male/ Female 6 Days Working (Rotational) Starting Salary: 12,000 (CTC) Walk in Interview Date: 11th & 12th July 2019 Time: 10:30 am to 1:00 pm & 3:00 pm to 4:00 pm Interview Venue- Cogito A-83, Sector 2 Noida Contact Person: Shalini Singh (7827667212) Meenu Singh (7827668054)","location":"Noida","experience":"0 - 2 Years"},{"date":"9, 10, 11 - Jul - 2019","skills":"HR/ Recruitment, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Valuepoint Knowledgeworks Pvt. Limited, #2, 4th C Cross Road Shamanna Layout EX Service Man Colony Banasawadi, Bengaluru Karnataka - 560 043","phone":"9538674443","profile":"HR Executive - Talent Acquisition \nValuepoint Knowledgeworks Pvt. Limited","description":"Candidate should have Bachelor's degree in relevant field with Excellent verbal and written communication skills. Scrupulous about detailed work. Skilled in MS Office, LinkedIn Recruiter, familiar with Social media campaigns, creating ads and research on new job portals to source talents Able to diagnose problems, identify and make recommendations to drive appropriate solutions Effectively exploring alternatives to reach outcomes that gain all stakeholders support and acceptance High level of initiative and self-motivation High personal standards of excellence, ethics and integrity Key Responsibilities: Review resumes, screen applications, recommend candidates for further consideration for Business partners and FTE. Provide analytical and well documented recruiting reports on a monthly basis. Attend various job fairs, career days, and other recruiting events Highly developed executive search skills (e.g. attraction and selection of talents) and desire to continuously improve the way Walk-in Date/ Time: 9th July - 11th July , 9 AM onwards Interview Venue: Valuepoint Knowledgeworks Pvt. Limited #2, 4th C Cross Road Shamanna Layout EX Service Man Colony Banasawadi, Bengaluru Karnataka - 560 043","location":"Bangalore","experience":"0 - 3 Years"},{"date":"10, 11, 12, 13 - Jul - 2019","skills":"Human Resource Management, Recruitment and General Administration","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Thadesh M, Reliance Office, 8th Floor, RK Salai, Mylapore, Chennai - 600 004","phone":"9600100454","profile":"HR Recruiter \nReliance Industries Limited","description":"Reliance Industries Limited, is looking for Talent Acquisition/ Recruiter DM based at Chennai. Qualification: Graduate/ MBA - HR Work Experience :6 Months 24 Months Should have experience in End to End Recruitment process Hands on in Sourcing, Screening, Scheduling, coordination, Offer management and on boarding activities. Should have good sourcing exp using job portals, social networking and other innovative methods. Good success record in the existing company. Must have good communication skills, multi-tasking and customer Skills. CTC: Best in the Industries Walk-in Date/ Time: 8th July - 13th July , 12 PM onwards Interview Venue: Thadesh M, Reliance Office, 8th Floor, RK Salai, Mylapore, Chennai - 600 004 Contact : 9600100454, 7010150757 Email: thadesh.munusamy@ril.com","location":"Chennai","experience":"1 - 2 Years"},{"date":"9, 10, 11, 12, 13, 15, 16, 17, 18, 19, 20 - Jul - 2019","skills":"Recruitment Administration, interviewing temp hiring hr recruiter contract staffing hiring","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Affluent Global Services Pvt. Limited, Patton House-2, 3rd Floor, 4th B Cross Road, 5th Block, Koramangala, Behind Empire Hotel Bangalore, Karnataka - 560 034.","phone":"9133959955","profile":"HR/ Recruitment Executive \nAffluent Global Services Pvt. Limited","description":"We are looking for an HR Recruiter to manage our full cycle recruitment, from identifying potential hires to interviewing and evaluating candidates. Requirements- Proven work experience as an HR Recruiter or similar role Familiarity with Applicant Tracking Systems and resume databases Experience with sourcing techniques Understanding of referral programs Solid verbal and written communication skills Work Experience: 0-4 Years Location: Bangalore [Kormangala] HR Recruiter responsibilities include sourcing candidates online, updating job ads and conducting background checks. If you have experience with various job interview formats, including phone screenings and group interviews, and can help us recruit faster and more effectively, wed like to meet you. Ultimately, you will play an important part in building a strong employer brand for our company to ensure we attract, hire and retain the most qualified employees. Job Responsibilities- Source potential candidates from various online channels (e.g. social media and professional platforms like Naukri and Monster) Craft recruiting emails to attract passive candidates Screen incoming resumes and application forms Interview candidates (via phone, video and in-person) Provide shortlists of qualified candidates to hiring managers Send job offer emails and answer queries about compensation and benefits Collaborate with managers to identify future hiring needs Walk-in Date/ Time: 9th July - 31st July , 11 AM - 5 PM onwards Interview Venue: Affluent Global Services Pvt. Limited Patton House-2, 3rd Floor, 4th B Cross Road, 5th Block, Koramangala, Behind Empire Hotel Bangalore, Karnataka - 560 034.","location":"Bangalore","experience":"0 - 4 Years"},{"date":"9, 10, 11, 12, 13, 15, 16, 17, 18, 19, 20 - Jul - 2019","skills":"Administration, Admission Counselling, Office Coordination, Front Office","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Braintree Global School, H.S. 27, Sector Sigma 2 (Sector 43), Near Kyampur village, Greater Noida.","phone":"8810444103","profile":"Front Office Coordinator \nBraintree Global School","description":"Looking for a School office coordinator who can handle parents inquiries for new admission as well as issues related to existing students, handling all office documentation and filing work, fee collection and reminders, admission counselling, reception, accounts. Person must be Well versed with computer and attending parents call over the phone and face to face interaction. handling all front office and coordination duties including admissions, fee collection, administration and documentation and coordination work in school Walk-in Date/ Time: 9th July - 20th July , 10 AM onwards Interview Venue: Braintree Global School H.S. 27, Sector Sigma 2 (Sector 43), Near Kyampur village, Greater Noida. Contact no. 8810444103, 9891158090","location":"Noida, Gurgaon","experience":"1 - 6 Years"},{"date":"9, 10, 11 - Jul - 2019","skills":"Payroll hiring field executive leave management Field Work Employee Engagement","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Head Office Rusan Healthcare Pvt. Limited, 58-D, Government Industrial Estate, Babrekar Nagar, Next to Gas & Gas Company Next to IPCA R&D Center, Charkop, Kandivali (West), Mumbai - 400 067","phone":"022 42383000","profile":"Field HR Officer \nRusan Pharma Limited","description":"Candidates with good knowledge in HR activities can apply for this. Good communication both verbal and written is a must should be capable for handling the pressure and deliver the results. Good in sourcing according to the requirement and pre recuritment, screening the profile in job portals. Ready to work as Field HR. Excellent verbal and written English Communication. Good Mircosoft Word and Excel skills. Arranging for interviews & following up on the same Database building, creating and maintaining required and relevant MIS Maintaining the Attendance Sheets of Field Staffs. Walk-in Date: 9th - 11th July 2019 Time: 10 AM - 5 PM onwards Interview Venue : Head Office Rusan Healthcare Pvt. Limited 58-D, Government Industrial Estate, Babrekar Nagar, Next to Gas & Gas Company Next to IPCA R&D Center, Charkop, Kandivali (West), Mumbai - 400 067 Board Line: 022 42383000/ 42383095, Note : Only Pharma Background Candidates Can Apply for this position.","location":"Mumbai","experience":"2 - 5 Years"},{"date":"10, 11, 12, 13, 15, 16, 17, 18, 19, 20 - Jul - 2019","skills":"HR, Recruitment, General Administration, IR","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"ELICO HealthCare Services C56, APIE Extn., Sanathnagar, Hyderabad - 500 018","phone":"8978447766","profile":"Payroll Specialist (Male Only) \nELICO HealthCare Services Pvt. Limited","description":"Educatioanl Qualification: MBA (HR) Regular Work Experience: 2 - 4 Years Job Location : Hyderabad Person should have 2 to 4 years of experience in running payroll and good understanding of Payroll Processing Methodology, ESI, PF Statutory Compliance and licensing including Tax planning & Tax Calculations. Preparing Appointments letter and issuing ID cards for new joinees by coordinating with Recruitment team. Leaves and Attendance management. Employee grievance handling. Weekly & Monthly MIS reports. Updating system data of newly joined employees. Taking care of new joinee files, Original Certificates and update check list in files. Full & Final settlement. Handling Performance Appraisal. Handling Employee group insurance. Excellent verbal/written communication skills required. Good analytical & decision making skills. Willingness to work in different time zones. Capacity to handle 1000 employees in all the location in India . Exclusively looking for Male candidates and Immediate Joiners. Interested candidates, Please Walk In directly for the interview or forward your resume to prasannam@elicohcs.com and chaitanyaka@elicohcs.com with the following details. Experience: Current CTC: Expected CTC: Notice Period: Reason for Job Change: *Please carry your Current Companies Offer Letter and Last 3 months Payslips with you while coming for the Interview walk-in Timings : 10 AM to 5:30 PM Contact Person :Prasanna / Chaitanya Contact Number : 8978447766/ 8008804661","location":"Hyderabad","experience":"2 - 4 Years"},{"date":"10, 11, 12, 15, 16, 17, 18, 19 - Jul - 2019","skills":"Back Office Processing, Data Entry","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"3i Infotech Limited, Akruti Trade Centre, 3rd Floor,, Plot .10, Road No. 7, MIDC Marol, Bhim Nagar, Andheri (East), Mumbai - 400 093","phone":"022 7126 9000","profile":"Back Office Process Associate \n3i Infotech Limited","description":"Walk In Interview for Banking Back office Process in Andheri MIDC Minimum Education HSC Pass Work Experience: 0 - 5 Years Walk In Date: 10th - 19th July (Monday to Friday) Time: 11 to 3 PM Interview Venue: 3i Infotech Limited Akruti Trade Centre, 3rd Floor,, Plot .10, Road No. 7, MIDC Marol, Bhim Nagar, Andheri (East), Mumbai - 400 093 Phone No: 022 7126 9000 Documents require PAN CARD & Aadhar CArd","location":"Mumbai","experience":"0 - 5 Years"},{"date":"8, 9, 10, 11 - Jul - 2019","skills":"PHP, HTML, CSS, Wordpress, Angular, SQL/ MySQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"MS Technology Private Limited, 2, Community Centre, IInd Floor, Basant Lok, Vasant Vihar New Delhi - 110 057","phone":"011-41669396","profile":"Php/ Web Developer \nMS Technology Private Limited","description":"Candidate should have 2 to 3 years of experience with PHP, HTML, CSS Familiarity with Wordpress and Angular, Python or Node.js SQL/ MySQL database experience is required Bootstrap and or Material Design Comfortable jumping in to unfamiliar frameworks/ codebases Experience using version control systems Web optimization Walk-in Date/ Time: 8th July - 11th July , 11 AM onwards Interview Venue: MS Technology Private Limited 2, Community Centre, IInd Floor, Basant Lok, Vasant Vihar New Delhi - 110 057","location":"Delhi","experience":"2 - 3 Years"},{"date":"9, 10, 11, 12, 13 - Jul - 2019","skills":"Customer Care, Customer Support, Helpdesk","qualification":"Diploma, B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"IGT Solutions Private Limited, Purva Primus, OMR, Okkiyam, Next to Reebok show room Thoraipakkam, Chennai - 600 097","phone":"0124-4587309","profile":"Customer Support Associate \nIGT Solutions Private Limited","description":"Education Qualification: 10+2/ Graduate/ Post Graduate in any discipline Candidate must be fluent in English and Hindi (Mandatory) Should be ready to work in 24*7 Age: 18-30 Years Only Job Responsbility- Project handles End to end airline operation. Inbound customer support. Flight Reservations, Bulk bookings, Re-booking, Web site support, Email management for all corporate and travel agent queries. Free travel post completion of 6 months & Employee eligible for IJP after 9 months Walk-in: Mon to Sat Timing: 10:00 AM 5:00 PM Venue: IGT Solutions Private Limited Purva Primus, OMR, Okkiyam, Next to Reebok show room Thoraipakkam, Chennai - 600 097 Contact Person: Meenakshi Ghildiyal Contact No: 0124-4587309","location":"Chennai","experience":"0 - 2 Years"},{"date":"9, 10, 11, 12, 13, 15 - Jul - 2019","skills":"PHP with CodeIgnitor","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Brainers Commercial Private Limited, A-105, 3rd Floor Sector 63, Noida","phone":"Not Provided","profile":"PHP Developer - Codeignitor \nBrainers Commercial Private Limited","description":"Candidate should have good hand on experience as Developer - PHP with CodeIgnitor. Must have expert level knolwdge/ experience on Database, Admin UI, Middleware and API. Walk-in Date/ Time: 9th - 15th July , 11 AM onwards Intervierw Venue: Brainers Commercial Private Limited A-105, 3rd Floor Sector 63, Noida","location":"Noida","experience":"2 - 7 Years"},{"date":"8, 9, 10, 11, 12 - Jul - 2019","skills":"Core PHP, CI, Drupal, Laravel, CMS and Frameworks.","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Cyfuture India Private Limited, Plot No. 197-198, Phase-2, Block-A, Near Sector 82, NSEZ-Noida","phone":"Not Provided","profile":"Core PHP Developer \nCyfuture India Private Limited","description":"Required Skills- Proficient in Core PHP, CMS and Frameworks. Knowledge on CI, Drupal, Laravel will be an added advantage. Should have good communication skills. Should have strong logical, programming, problem solving and analytical skills. Working experience on Good or Large projects. Should be able to deal with clients diligently. Technical Skills: Making projects on PHP (5 & 7), CMS and frameworks. Working on large scale projects. PHP, Wordpress, CI, Drupal, Java Script, Jquery, MySql, AngularJs/ NodeJs will be an additional advantage. Should know how to integrate third party APIs, Has work experience on Linux platform Working Days- 5.5 Days(2nd and 4th sat. off) Shift Timings- General Morning Shift (Shuttle Facility Available) Days of Interview- 8th - 12th July Time- 10 am to 3 pm Interview Venue- Cyfuture India Private Limited Plot No. 197-198, Phase-2, Block-A, Near Sector 82, NSEZ-Noida","location":"Noida","experience":"2 - 5 Years"},{"date":"9 - Jul - 2019","skills":"PHP Fresher/ Interns","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Mayron Digital Networks, 134 ; 135 Karthik Nagar, Doddanekundi, Bangalore - 560 037","phone":"9513632352","profile":"PHP Developer - Intern \nMayron Digital Networks","description":"Mayron Digital Networks is hiring PHP Developer/ Interns for Bangalore location Job Responsbility- Write clean, well-designed code Produce detailed specifications Troubleshoot, test and maintain the core product software and databases to ensure strong optimization and functionality Contribute in all phases of the development lifecycle Walk-in Date/ Time: 9th July 2019, 9 AM onwards Interview Venue: Mayron Digital Networks 134 ; 135 Karthik Nagar, Doddanekundi, Bangalore - 560 037 Contact no: 9513632352/ 9513114031","location":"Bangalore","experience":"0 - 1 Years"},{"date":"8, 9, 10, 11, 12 - Jul - 2019","skills":"Core PHP, MySQL, Bootstrap, MVC Architecture","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Digi Style, D-244, Second Floor, Sector-10 Near Swani Furniture, Noida","phone":"Not Provided","profile":"PHP Developer \nDigi Style","description":"Work Experience- 2 to 4 Years Strong understanding and hold on working with Core PHP. Excellent knowledge about Core PHP, MySQL, Bootstrap Excellent command on PHP and MySQL using MVC Architecture. Expertise on PHP based framework like: codeigniter, laravel, etc... Required Skills Ability to adjust schedules to meet deadlines will be crucial. Must be self-motivated and take responsibilities for his/her own deliverables. Excellent written and verbal communication skills Ability to manage multiple projects & lead the development effort while meeting deadlines and maintaining high-quality results Good analytical, reasoning, logical and troubleshooting skills Walk-in Date/ Time: 8th - 31st July, 11 AM onwards Interview Venue: Digi Style D-244, Second Floor, Sector-10 Near Swani Furniture, Noida","location":"Noida","experience":"2 - 4 Years"},{"date":"9, 10, 11, 12, 13, 15, 16, 17, 18 - Jul - 2019","skills":"Php, CMS, WordPress/ Joomla/ Drupal","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"AISCOR Private Limited, Office No. 202, Suratwala Mark Plazzo, Opposite Hinjewadi Reliance Digital, Hinjewadi, Pune - 411 057","phone":"8555884622","profile":"Web/ Php - CMS Engineer \nAISCOR Private Limited","description":"Candidate should have 1 to 3 years experience working with WordPress/ Joomla/ Drupal. Must have extensive strong working knowledge and experience in PHP and CMS Application Developments and Responsive Designs. Theme development and plugin implementation is a plus Knowledge of Shopify, Wix, Squarespace and Weebly is a plus Good skills and knowledge of Ajax, JScript, Jquery, Json and HTML 5 & CSS3 Better to have Experience/ Knowledge working in Agile Methodology/ Environments Knowledge in MVC Frameworks is a plus Extensive experience writing high quality code or programming and development while applying new techniques to meet business and project goals is crucial. Good Documentation skills and matching code with design solutions that are easy to manage, maintain, customize (themes/ layouts) and configure Ensuring overall responsibilities: reliability, security, availability and high-performance code of solutions Walk-in Date: 8th -18th July 2019 Timing: 11 AM to 4 PM Interview Venue: AISCOR Private Limited Office No. 202, Suratwala Mark Plazzo, Opposite Hinjewadi Reliance Digital, Hinjewadi, Pune - 411 057 Contact No. 8555884622","location":"Pune","experience":"1 - 3 Years"},{"date":"9 - Jul - 2019","skills":"Customer Care, Customer Support, Voice Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Teleperformance Global Services Pvt. Limited, 1st Floor, Kudlu Gate, Bangalore - 68. Landmark - Behind Hyundai Showroom","phone":"8658172220","profile":"Customer Support (Voice Process) \nTeleperformance Global Services Pvt. Limited","description":"Teleperformance Global Services Pvt. Limited is hiring candidates for Voice Process for Bangalore location. Eligibility Criteria- Fresher and Experienced both can apply. Graduates and Under-Graduates both are eligible. Good communication in Gujarati and English Work Location- Bangalore Shifts- Day/ Rotational Interested candidates can directly walk-in to the above mentioned address- Walk-in Date- 9th July 2019 Time- 10.00 am - 3 pm Interview Venue: Teleperformance Global Services Pvt. Limited 1st Floor, Kudlu Gate, Bangalore - 68 Landmark - Behind Hyundai Showroom And Near to Ekka Hotel Contact Person- HR Neha - 8658172220","location":"Bangalore","experience":"0 - 2 Years"},{"date":"10 - Jul - 2019","skills":"Technical Helpdesk, Service Desk, Admin/ Back office Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Allied Digital Services Limited, 13 th floor Unit 22 Bengal Eco Intelligence Park EM Block, Sector 5, Saltlake Kolkata - 700 091","phone":"7304555012","profile":"Technical Support/ Coordinator \nAllied Digital Services Limited","description":"Candidate should be Any Garduate with 1 to 3 years of experience in Technical Helpdesk, Service Desk, Admin/ Back office Support. Must have excellent communication skills Roles & Responsibilities: Monitor IT Helpdesk ticketing tool and allocate tickets to respective locations IT support person Follow-up with location IT Support person till ticket closure Follow-up with third party vendors for IT Support related calls (like Warranty, AMC, MPS vendors etc..) Coordinate between Location IT Support team and AD,Gmail, AV & Network admins Extract daily/ weekly/ monthly/ quarterly SLA reports for IT Services tickets and reports on User feedback Prepare/update documents/ ppts for end user support on using ITSM tool Participate in Monthly review meetings to highlight on the issues and possible solutions to improve IT Services Walk-in Date/ Time: 10th July 2019, 10 AM onwards Interview Venue: Allied Digital Services Limited 13 th floor Unit 22 Bengal Eco Intelligence Park EM Block, Sector 5, Saltlake Kolkata - 700 091 Landmark: Beside Techno India College Campus.","location":"Kolkata","experience":"1 - 3 Years"},{"date":"8, 9, 10, 11, 12, 13, 15, 16, 17, 18 - Jul - 2019","skills":"PHP, JavaScript, PostgreSQL/ MySQL, CMS - Opencart","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Kompanyservices.com, 14/4A, Second Avenue, Sundar Nagar, Ekkaduthangal, Defece Colony, Chennai - 32","phone":"86828 04944","profile":"PHP Developer \nKompanyservices.com","description":"Candidate should have Degree in Computer Science or related field, or equivalent combination of education and experience from which comparable skills and abilities can be acquired; Intermediate experience in the following: o Scripting Languages: PHP, JavaScript o Operating Systems: Mac OS X and Linux o Databases: PostgreSQL/ MySQL o CMS - Opencart, Highly skilled, detail-oriented developer well-versed in Object Oriented Programming and best practices with the ability to re-architect, code, test, and debug existing applications and learn new technologies; Hands-on programming experience with PHP frameworks such as Laravel and Silverstripe, Javascript UI libraries such as Vue and React, RESTful JSON APIs, unit testing (PHPUnit, Dusk, Mockery, Faker), Docker containers, and version control (Git); must be able to show development skills with at least 3 URLs and 2-4 years building and supporting web applications (concept to completion); Walk-in Date/ Time: 8th - 18th July, 2019, 10 am Onwards Interview Venue: Kompanyservices.com 14/4A, Second Avenue, Sundar Nagar, Ekkaduthangal, Defece Colony, Chennai - 32 Contact Person: Mr Narendra Tel: 86828 04944","location":"Chennai","experience":"2 - 4 Years"},{"date":"10 - Jul - 2019","skills":"Technical Support, Email Support, International Voice Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"4th Floor, Cognizant ISH Office, Hinjewadi Phase 1 Pune - 411 014","phone":"Not Provided","profile":"Technical Support Associate \nCognizant Technology Solutions India Limited","description":"Cognizant Technology Solutions India Limited, is looking for experienced professionals for International Voice Process - Pune Location. Skill : International Voice Process (Tech Support) Designation : Senior Process Executive (SPE) Salary Package : 4.2 LPA + Night shift allowance + Cab facility Shift : US Shift timing (Shift allowance will be provided) Educational Qualification : Any Graduate Work Experience : 1 - 3 Years Job Location : Pune Candidates with excellent communication are only applicable for this process Candidates with Provisional certificate / Degree Certificates are only applicable UG is mandatory (Candidates with standing arrears are not eligible) Candidate must have completed 10+2+3/4 education system. Only candidates interested to work in International Voice Process and willing to work in night shifts are eligible for this process Interview Date : July 10th 2019, (Wednesday) Time : 12PM - 2PM Interview Location : 4th Floor, Cognizant ISH Office, Hinjewadi Phase 1 Pune - 411 014 Point of Contact : Jash (HR) Mode of Interview : Face to Face Note : Candidates who have recently taken up interview at Cognizant are not eligible. Referrals are invited","location":"Pune","experience":"1 - 3 Years"},{"date":"13 - Jul - 2019","skills":"Java, Hibernate, NoSQL, Oracle SQL, JUnit, JDBC, JPA","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Ondot Systems India Private Limited, Smartworks Global Technology Park, Block C, 1ST Floor, Outer Ring Road, Adarsh Palm Retreat, Bellandur, Bengaluru, Karnataka - 560 103","phone":"Not Provided","profile":"Java Professionals \nOndot Systems India Private Limited","description":"Ondot Systems India Private Limited is looking for energetic, enthusiastic and driven individuals who share our vision of transforming how consumers interact with their financial institutions. RESPONSIBILITIES- Work closely with product managers, systems architects and immediate team to effectively develop backend systems. Assist in the development of standards, procedures and guidelines to improve the development process. Mentor and help to develop junior talent. REQUIREMENTS- Excellent knowledge of Java programming language concepts, JEE and SQL Extensive experience in Java technology frameworks including: Spring Boot, JUnit, JDBC, JPA and Hibernate Strong experience in data migration, transformation, and processing in different formats and languages Experience with designing and developing microservices based, linearly scalable applications. Expertise with SQL (Oracle preferred) and NoSQL databases Strong collaborator and experienced working in dynamic, global teams working with various Agile methodologies (Scrum, Kanban). Strong analytical and troubleshooting skills QUALIFICATIONS- 2 to 4 years of software engineering experience 2+ years hands on experience with Java 2+ years of work with Unix/ Linux 2+ years of hands on experience of building large scale data processing systems with relational and NoSql Databases Interview Date: 13th July 2019 Timings: 10 AM onwards Interview Venue: Ondot Systems India Private Limited Smartworks Global Technology Park, Block C, 1ST Floor, Outer Ring Road, Adarsh Palm Retreat, Bellandur, Bengaluru, Karnataka - 560 103","location":"Bangalore","experience":"2 - 4 Years"},{"date":"9, 10, 11, 12, 13 - Jul - 2019","skills":"Customer Support, Customer Handling, Process, Voice Process","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Tech Mahindra Limited, A8A, 7th floor, Knowledge Boulevard, Sector-62, Noida.","phone":"7075354583","profile":"Customer Support - Voice Process \nTech Mahindra Limited","description":"We are hiring experienced for E-Commerce Project (Customer Support - Voice Process) Only Day shift & 5 days working . Job Criteria:- Should have minimum 1 year experience in BPO industry Should have handsome experience in handling the domestic premium/ International customers Should have excellent communication skills Should be a Graduate (Any) Job Responsbility:- Voice Inbound Process. Have to handle customer's queries and help them with the right feedback. Rotational day shifts (B/w 9am -9pm any 9hrs) 2 Rotational Weekly off 5 days working Walk-in Date: 9th - 13th July 2019 Time: 10.30 am to 3 pm Venue: Tech Mahindra Limited A8A, 7th floor, Knowledge Boulevard, Sector-62, Noida. Landmark - Beside IMS College (Nearest Metro Station - Electronic city). Contact: Mr. Kiran - 7075354583 Please mention my name (Kiran) on the top of your CV.","location":"Noida","experience":"1 - 6 Years"}]}