{"Walkins":[{"date":"4, 5, 6, 7, 8 - Nov - 2019","skills":"Software Testing, Performance Testing, Database Testing, Manual Testing, Quality Assurance","qualification":"B.E./B.Tech, B.Sc, BCA/BCS","address":"NIIT Limited, A-24, Infocity 1, Sector 34, Gurgaon","phone":"0124-4916889","profile":"QC/ Manual Tester \nNIIT Limited","description":"Candidate should be B.Tech/ BCA with 0 to 2 year of relevant experience in Software Testing, Performance Testing, Database Testing, Manual Testing and Quality Assurance. Must have an outgoing personality and skills in speaking, organizing, listening, leadership, communication and decision making. Must have proficiency in English language Open to work in rotational shift (Cab will be provided for both side) Well organized and customer focused. Proficient in Computer (MS Office) Attention to detail and an ability to work easily with others. Ability to work independently in a flexible and adaptable manner. Working globally, covering different time zones and languages is key Walk-in Date: 4th - 8th November 2019 Timings : 10 am to 2 pm Interview Venue: NIIT Limited A-24, Infocity 1, Sector 34, Gurgaon Contact Person- Deepak Tel: 0124-4916889","location":"Gurgaon","experience":"0 - 2 Years"},{"date":"5, 6, 7, 8 - Nov - 2019","skills":"Java, Automation Testing, Selenium, OOP Concepts","qualification":"B.E./B.Tech, MCA/PGDCA","address":"AQM Technologies Private Limited, 4th Floor, A-Wing, Raheja Plaza, LBS Road Ghatkopar (West) Mumbai - 400 086","phone":"022-40508206","profile":"Freshers - Automation Testing \nAQM Technologies Private Limited","description":"Candidate should have in depth understanding of software testing with strong development/ scripting skills in common languages like Java. Must have good Object Oriented Programming Concepts. Basic SQL Database query skills to create/ edit queries. Participate in troubleshooting Walk-in Date/ Time: 1st November - 15th November , 11 AM onwards Interview Venue: AQM Technologies Private Limited 4th Floor, A-Wing, Raheja Plaza, LBS Road Ghatkopar (West) Mumbai - 400 086 Contact Person- Megha Kamble Phone No: 022-40508206","location":"Mumbai","experience":"0 - 1 Years"},{"date":"5, 6, 7, 8 - Nov - 2019","skills":"Front Office, Reception and Book Keeping","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Mohan Mutha Exports Private Limited, No. 961 Siyat House, Poonamallee High Road, Chennai - 600 084.","phone":"Not Provided","profile":"Front Office Executive \nMohan Mutha Exports Private Limited","description":"Candidate should be Any Graduate with 3 to 5 years of experience in Front Office, Reception and Book Keeping. Must have excellent communication skills. Job Responsbility- Answer phones and operate a switchboard. Route calls to specific people. Answer inquiries about company. Greet visitors warmly and make sure they are comfortable. Call persons waiting for visitor and book them a room to meet in. Schedule meetings and conference rooms. Make coffee and set out food. Ensure reception area is tidy. Walk-in Date/ Time: 5th - 8th November 2019, 11 AM onwards Interview Venue: Mohan Mutha Exports Private Limited No. 961 Siyat House, Poonamallee High Road, Chennai - 600 084. Landmark: Mohan Rau hospital Contact Person: Vikram Babu","location":"Chennai","experience":"3 - 5 Years"},{"date":"6 - Nov - 2019","skills":"Manual Testing, Writing Test Cases, Regression Testing, Functional Testing, Test Scenarios, Defect Reporting","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Prometric Testing Private Limited, 2nd Floor, Infinity Tower A, DLF Cyber City, Gurgaon, Haryana - 122 002","phone":"0124-4517145","profile":"Manual Testing Engineer \nPrometric Testing Private Limited","description":"Bachelors/ Master's Degree in Computer Science, Engineering or a related subject Proven work experience in manual quality assurance. Strong knowledge of Manual Testing. Experience in writing clear, concise and comprehensive test plans and test cases Hands-on experience with manual testing. Experience with performance and/or security testing is a plus Excellent communication skills Good analytical skills Age Limit: 24 - 30 years Job Responsibility- Perform quality testing to ensure the exams operate as expected once delivered to the candidate Understand and analyze specification documents Executing tests as per the specification documents Review for any logical/documentation defects Reporting defects found during testing. Reporting and documentation. Coordinate with all stake holders for successful completion of testing process Walk-in Date: 6th November 2019 Timings: 11:00 am - 4:00 pm Interview Venue: Prometric Testing Private Limited 2nd Floor, Infinity Tower A, DLF Cyber City, Gurgaon, Haryana - 122 002 Contact - HR (0124-4517145)","location":"Gurgaon","experience":"2 - 3 Years"},{"date":"9 - Nov - 2019","skills":"Manual Testing, API (Rest/ SOAP), SQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Xpanxion International Private Limited, Ground Floor Sai Radhe Building, Behind Sheraton Grand Hotel 7, Railway Officers Colony, Pune, Maharashtra - 411 001.","phone":"020-66290500","profile":"Manual Testing Engineer \nXpanxion International Private Limited","description":"We at Xpanxion International are inviting you to walkin for interviews for Manual API Testing Work Experience: 2 - 4 Years Mandatory Skills : Manual Testing, API (Rest/ SOAP), SQL (please note all you must have experience in all the mentioned skills) Good to have: Mobile Testing (iOS) Immediate joiners Are most welcome. Walk-in Date/ Time: 9th November 2019, 10 AM onwards Interview Venue: Xpanxion International Private Limited Ground Floor Sai Radhe Building, Behind Sheraton Grand Hotel 7, Railway Officers Colony, Pune, Maharashtra - 411 001. Contact Person: KASHISH CHAUHAN Tel: 020-66290500 Please walk in directly for the interview with your resumes. Interview process: 1. Test (coding - API and DB) 2. L1 Technical Interview 3. L2 Technical Interview Post Selection the remaining rounds will be done in the succeeding week.","location":"Pune","experience":"2 - 4 Years"},{"date":"9 - Nov - 2019","skills":"QA, Software Testing, Test Strategies and Test Plan","qualification":"B.E./B.Tech, MCA/PGDCA","address":"We Work, Block L, Embassy Tech Village, Outer Ring Road, Bengaluru - 560 103","phone":"Not Provided","profile":"QA/ Software Tester \nDMI Innovations Private Limited","description":"Technical Skills- Need hands on protractor and selenium tool JavaScript/ Typescript experience is must Cucumber/ Jasmine framework hands-on experience OOPS concept and implementation in project QA Excellent to write with test cases for complex applications Understanding of test strategies and test plan, Hands-on would be an added advantage Defect life cycle knowledge Process Hands on in Agile STLC Process Other Excellent communication skills Knowledge on Healthcare domain will be added advantage. Walkin Interview on 9th November from 10 AM onwards Interview Venue: We Work, Block L, Embassy Tech Village, Outer Ring Road, Bengaluru - 560 103","location":"Bangalore","experience":"4 - 9 Years"},{"date":"5, 6, 7, 8 - Nov - 2019","skills":"Automation/ Manual Testing, Any Scripting Like Python/ Shell/ VB Scripting","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Zuti Engineering Solutions Private Limited, Svaya Robotics 2nd Floor, NSL Icon, Road No. 12, Banjara Hills, Hyderabad - 500 034","phone":"7702700960","profile":"QA/ Testing Engineer \nZuti Engineering Solutions Private Limited","description":"Need Automation Testers and Manual Testers along with any Scripting Like Python/ Shell/ VB Scripting is mandatory Candidate should have 2 to 7 years of solid experience in QA, Software Testing. Walk-in Date/ Time: 5th - 8th November 2019, 10 AM onwards Interview Venue: Zuti Engineering Solutions Private Limited Svaya Robotics 2nd Floor, NSL Icon, Road No. 12, Banjara Hills, Hyderabad - 500 034 Landmark: Opposite to ICICI Bank Contact Person : Bhargav. Contact Number : 7702700960","location":"Hyderabad","experience":"2 - 7 Years"},{"date":"5, 6, 7, 8 - Nov - 2019","skills":"Manual Testing/ Test Documents/ SQL/ OOPS","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Ebix Software (India) Private Limited, Plot No - 122 & 123 (Opp. Corporation Bank ATM), Noida Special Economic Zone (NSEZ), Near Sector 82, Phase - II, Noida","phone":"Not Provided","profile":"Manual Testing Engineer \nEbix Software India Private Limited","description":"Ebix Software India Private Limited - a product based CMMi Level-V IT MNC is hiring for 'Manual Testing Engineer' Candidate should have good knowledge of Manual Testing/ Test Documents/ SQL/ OOPS Must have good knowledge of Automation Testing / Selenium. Benefits:- (1) 5 Days Working. (2) Both Side Shuttle Services (3) Free Food. (4) Insurance Facility Walk-in Date - 5th - 8th November, 2019 (Tuesday- Friday) Timings: 11 AM to 3 PM Interview Venue: Ebix Software (India) Private Limited Plot No - 122 & 123 (Opp. Corporation Bank ATM), Noida Special Economic Zone (NSEZ), Near Sector 82, Phase - II, Noida [NSEZ is ahead of bhangel on the way to Greater Noida]","location":"Noida","experience":"2 - 4 Years"},{"date":"4, 5, 6, 7, 8 - Nov - 2019","skills":"Functional, Regression, Security/ Performance Testing, QA tools","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Infinite Computing Systems Private Limited, 601, Ecospace, Mogra Pada, Old Nagardas Road Andheri (East), Mumbai - 400 069","phone":"022-40600200","profile":"QA/ Testing Engineer \nInfinite Computing Systems Pvt. Limited","description":"Infinite Computing Systems Private Limited, is hiring for QA/ Testing Engineer with relevant hands-on experience with Manual Testing. Education: Bachelors in Engineering/ MCA Work Experience: 1 to 4 Years Job Location: Mumbai Experience in Functional, Regression, Security/ Performance testing of highly technically complex products Ability to detect and track software defects and inconsistencies. Should have exposure to QA tools (Bug Tracking, Test Management, Script Management, etc.) Should have exposure to Metrics (Defect, Test Execution), status reports and exit reports Preferable knowledge of Automation (Selenium Webdriver in C#/ Java) experience for writing Test scripts. Effectively collaborate and communicate with other team members and departments Should be highly motivated, self-driven and be able to contribute individually in the team. Strong verbal and written communication skills with the ability to liaise with a variety of stakeholder Walk-in Date/ Time: 4th - 8th November 2019, 12 PM onwards Interview Venue: Infinite Computing Systems Private Limited 601, Ecospace, Mogra Pada, Old Nagardas Road Andheri (East), Mumbai - 400 069 Contact Person- Kirit Nagrecha (40600204)","location":"Mumbai","experience":"1 - 4 Years"},{"date":"16 - Nov - 2019","skills":"ASP .NET, MVC, WEB API, SQL SERVER, C#, JAVA SCRIPT","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Neudesic Technologies Private Limited, 10th Floor, Jyothi Pinnacle, Hitech City Road, Laxmi Cyber City, Whitefields, Kondapur, Hyderabad, Telangana - 500 081","phone":"Not Provided","profile":".NET Developer \nNeudesic Technologies Pvt. Limited","description":"Neudesic Technologies Private Limited is hiring for .NET Developers with below mentioned skill set- ASP .NET, MVC, WEB API, SQL SERVER, C#, JAVA SCRIPT Interview Date: 16th November , 9 AM onwards Venue Details: Neudesic Technologies Private Limited 10th Floor, Jyothi Pinnacle, Hitech City Road, Laxmi Cyber City, Whitefields, Kondapur, Hyderabad, Telangana - 500 081 Contact Person- Mr. Ramu Adapa","location":"Hyderabad","experience":"3 - 8 Years"},{"date":"1, 2 - Nov - 2019","skills":".NET Programming, ASP .Net, SDLC","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Opportune Technologies Private Limited, Gemstar Commercial Complex, 411, Ramchandra Ln, Opp. Religare Office, Kanchpada, Malad West, Mumbai, Maharashtra - 400 064","phone":"022-40365407","profile":"ASP .Net Developer \nOpportune Technologies Private Limited","description":"Opportune Technologies Private Limited, is looking for ASP .Net Developer at Malad Location. Job Responsibility- Write clean, scalable code using .NET programming languages Develop documentation throughout the software development life cycle (SDLC) Walk-in Date/ Time: 1st - 2nd November , 10 AM onwards Interview Venue: Opportune Technologies Private Limited Gemstar Commercial Complex, 411, Ramchandra Ln, Opp. Religare Office, Kanchpada, Malad West, Mumbai, Maharashtra - 400 064 Contact Person- Ms Mini Sharma Tel: 022-40365407","location":"Mumbai","experience":"1 - 4 Years"},{"date":"1, 4, 5, 6, 7, 8 - Nov - 2019","skills":"Payroll Process, Excel, HRO, Data Management","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Hexaware Technologies Limited, Chennai One, Phase 2, 3rd Floor, Pallavaram 200 feet ring Road, Thoraipakkam, Chennai","phone":"9884903575","profile":"Backend Process Executive - HRO \nHexaware Technologies Limited","description":"Candidates should be Any Graduate with 1 to 3 years of experience in HRO, HR shared services, HR Outsourcing. Must have good knowledge in HR Payroll, Retirement, Data management, Benefits. Should have good typing skills Good knowledge in Excel Should be flexible to work in shifts Pickup / Drop would be provided Interested candidates can walk-in directly between Monday - Friday. Walk-in Time: 12 PM to 5 PM Interview Venue: Hexaware Technologies Limited, Chennai One, Phase 2, 3rd Floor, Pallavaram 200 feet ring Road, Thoraipakkam, Chennai. For queries contact., Vignesh : 9884903575, Rajagopal - 9884041634","location":"Chennai","experience":"1 - 3 Years"},{"date":"4, 5, 6 - Nov - 2019","skills":"HR/ Recruitment, Screening/ Hiring/ Staffing","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Careator Technologies Private Limited, SLJ Tower, II Floor, BDA # 297, VII Block, IV Phase, BSK III Stage, Bengaluru - 560 085","phone":"Not Provided","profile":"HR Recruiter \nCareator Technologies Private Limited","description":"We are looking for a Talent Acquisition fresher to join our HR department and help us grow our IT teams. TA specialist responsibilities include sourcing, screening and providing a shortlist of qualified candidates for various technical roles. You will also network online and offline with potential candidates to promote our employer brand, reduce our time-to-hire and ensure we attract the best professionals. Ultimately, you will build a strong tech talent pipeline and help hire and retain skilled employees for our IT positions. Walk-in Date/ Time: 4th - 6th November , 10 AM onwards Interview Details: Careator Technologies Private Limited SLJ Tower, II Floor, BDA # 297, VII Block, IV Phase, BSK III Stage, Bengaluru - 560 085 Contact Person- Saravanan","location":"Bangalore","experience":"0 - 1 Years"},{"date":"2 - Nov - 2019","skills":"Purchase, Back Office, Supply Chain, Back Office Operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Albans Projects Private Limited, 2nd Floor, Malhotra House, Above Tata Motors, Krishanlal Marwah Marg, Saki Vihar Road, Near Marwah Estate, Andheri, Mumbai - 400 072.","phone":"9324771589","profile":"Purchase Executive / Back Office \nAlbans Projects Private Limited","description":"Key Requirements: Work experience as a Purchasing executive. Good understanding of supply chain procedures. Advanced knowledge of MS Excel. Solid organizational skills. Candidate From Andheri and near by would be an Advantage. Responsibilities: Monitor stock levels and identify purchasing needs Research potential vendors. Track orders and ensure timely delivery. Update internal databases with order details .(dates, vendors, quantities, discounts) Conduct market research to identify pricing trends. Evaluate offers from vendors and negotiate better prices. Prepare cost analyses. Maintain updated records of invoices and contracts. Follow up with suppliers, as needed, to confirm or change orders. Liaise with warehouse staff to ensure all products arrive in good condition. Drafting Purchase Order to Supplier. Drafting Brief cotations as per the clients requirement. Walk-in Date/ Time: 2nd November 2019, 10 AM onwards Interview Venue: Albans Projects Private Limited 2nd Floor, Malhotra House, Above Tata Motors, Krishanlal Marwah Marg, Saki Vihar Road, Near Marwah Estate, Andheri, Mumbai - 400 072. Contact - Shweta (9324771589)","location":"Mumbai","experience":"0 - 1 Years"},{"date":"2 - Nov - 2019","skills":"Back End Operations, Non Voice Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Reach Local Services Private Limited, 5th Floor Wing Express Zone, Western Express Highway Goregaon (East) Mumbai - 400 097","phone":"022-67226612","profile":"Back Office Executive \nReach Local Services Private Limited","description":"Candidate should be Any Graduate with around 2 to 3 years of experience in any process/ Industry/ relevant work profile. Must be good in excel (basic analytical skills). Ability to communicate clearly & effectively (English is mandatory) Shift Timings: 9.30 am - 6.30 pm (Monday to Friday) + one Saturday in a month Job Location : Goregaon East Walk-in Date/ Time: 2nd November 2019, 10 AM onwards Interview Venue: Reach Local Services Private Limited 5th Floor Wing Express Zone, Western Express Highway Goregaon (East) Mumbai - 400 097 Contact - Swetha Pujari Tel: 022-67226612","location":"Mumbai","experience":"2 - 3 Years"},{"date":"2 - Nov - 2019","skills":"ASP .NET SQL Server HTML CSS JavaScrip & C#/ VB .NET","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Bombay Stock Exchange Limited, 16th Floor, P.J. Tower Dalal Street, Fort, Mumbai - 400 001","phone":"8369998586","profile":"ASP .Net Developer \nMarketplace Technologies Pvt. Limited","description":"We are expecting from a .NET Developer Utilize established development tools guidelines and conventions including but not limited to ASP .NET SQL Server HTML CSS JavaScrip & C#/ VB .NET, Prepare & maintain code for various .Net applications Database Development. Walk-in Date/ Time: 2nd November 2019, 10 AM onwards Interview Venue: Bombay Stock Exchange Limited 16th Floor, P.J. Tower Dalal Street, Fort, Mumbai - 400 001 Contact Person: Pranav Trivedi, Phone No: 8369998586 Please Carry CV and Identity Proof","location":"Mumbai","experience":"1 - 5 Years"},{"date":"2 - Nov - 2019","skills":"Database Management, Screening, Client Coordination","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Personnel Search Services Private Limited, No. 212, 2nd Floor, Prabhadevi Industrial Estate, Veer Savarkar Marg, Opposite to Kamat Hotel Mumbai - 400 025.","phone":"Not Provided","profile":"Recruitment & Sourcing Executive \nPersonnel Search Services Pvt. Limited","description":"Education: Any Graduate Minimum Work Experience 1 to 2 Years Experience in Recruitments will be preferred Proven track record during past work experience. Good communication skills should have basic HR Knowledge. He / She should have analytical bend of mind & flair for numbers. Good Personality with Strong Communication Skills, Good articulation, Convincing ability, Mature, Self motivated, Target Oriented, Decision Making, Enthusiastic, High on Integrity Walk-in Date/ Time: 2nd November 2019, 9 AM onwards Interview Venue: Personnel Search Services Private Limited No. 212, 2nd Floor, Prabhadevi Industrial Estate, Veer Savarkar Marg, Opposite to Kamat Hotel Mumbai - 400 025 Contact Person- Practice Head","location":"Mumbai","experience":"1 - 2 Years"},{"date":"5, 6, 7 - Nov - 2019","skills":"Java/ .Net Trained (Fresher)","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Broadridge Financial Solutions (India) Pvt. Limited, Divyasree NR Enclave, Plot No-1, EPIP Industrial Area, Whitefield, Bangalore - 560 066, Karnataka","phone":"Not Mentioned","profile":"Java/ .Net Developer (Fresher) \nBroadridge Financial Solutions (India) Pvt. Limited","description":"Qualification: BCA / B.Sc (Comp) / M.Sc (Comp) / M.Sc (IT) / M.Sc (Elect.) Freshers from 2018-19 batch having 65% in graduation. Client Facing Role- Excellent communication skills. Should have knowledge in using MS Office tools and basic programming skills in .net/Java. Excellent written and verbal communication skills and should be a team player. He/She should be willing to work in UK shift hours on rotation basis. Walk in Dates: 5th - 7th November 2019 Timings: 12 pm - 3 pm Walk in Location: Broadridge Financial Solutions (India) Pvt. Limited Divyasree NR Enclave, Plot No-1, EPIP Industrial Area, Whitefield, Bangalore - 560 066, Karnataka Point Of contact: Rahul Roy/ Bhimesh Candidates to carry 2 hard copies of their resumes.","location":"Bangalore","experience":"0 - 1 Years"},{"date":"9 - Nov - 2019","skills":".NET MVC, C#, JavaScript, JQuery, Ajax, Angular JS, HTML5 and CSS","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Excelsoft Technologies Pvt. Limited, 1-B, Hootagalli Industrial Area, Mysore, Karnataka - 570 018","phone":"0821-4282000","profile":".Net Developer \nExcelsoft Technologies Pvt. Limited","description":"Excel Soft Technologies Private Limited, is hiring Software Engineer / Senior Software Engineer / Lead Engineer (.Net) Work Experience: 2 to 7 Years Job Location: Mysore Technical Skills: Fundamentals in .NET MVC, C#, JavaScript, JQuery, Ajax, Angular JS, HTML5 and CSS Fundamentals of SQL server programming Analytical & problem solving skills Capable understanding and creating functional requirement specification, technical design document and other UML diagrams Interview Date: November 9, 2019 Time: 10:00 to 1:00 PM Venue Details: Excelsoft Technologies Pvt. Limited 1-B, Hootagalli Industrial Area, Mysore, Karnataka - 570 018 Contact No.: 0821-4282000/ 4002200 Important Note: Must carry mandatory Documents while attending interview: Updated Resume Passport Size Photo Address Proof Aadhar card/Voter ID/Passport/Driving license Please ask your friends /Colleagues also to walk for the drive if their profile matches the requirement.","location":"Mysore","experience":"2 - 7 Years"},{"date":"6 - Nov - 2019","skills":".Net, C#, ASP .Net, MVC, MySQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Changepond Technologies Pvt. Limited, H-2, SIPCOT IT Park, OMR, Siruseri, Chennai - 603 103","phone":"Not Provided","profile":".Net Developer/ Freshers \nChangepond Technologies Private Limited","description":"Changepond Technologies Private Limited, is hiring .Net Developer/ Freshers for Chennai location Eligibility Cretria: B.E/ B Tech/ MCA Graduates with an aggregate of minimum 60% in Academics Mandatory Qualification: Trained in Dotnet/ Dotnet Certification 2016/ 2017/ 2018 & 2019 passed out students. Must have good communication Skills Drive Date : 6th November 2019 (Wednesday) Timings : 9:00 AM to 12:00 PM Venue Details: Changepond Technologies Pvt. Limited H-2, SIPCOT IT Park, OMR, Siruseri, Chennai - 603 103. Contact Person: AGR Contact Email: rubas.a@changepond.com","location":"Chennai","experience":"0 - 1 Years"},{"date":"1 - Nov - 2019","skills":"HR/ Recruitment, Head Hunting, Maintaining the Database","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Freight Systems India Pvt. Limited, Super A7, Rathna Tower 1, 1st Floor, Thiru Vi Ka Industrial Estate, Guindy, Chennai - 600 032","phone":"Not Provided","profile":"HR Executive \nFreight Systems India Private Limited","description":"Candidate should be an MBA graduate with HR as a specialization. Very Good Communication Skills both Verbal and Written Must have good interpersonal skills Positive attitude Adaptability Motivated Job Responsbility- Handling recruitment and selection process at Global level. Head Hunting, Maintaining the Database Working knowledge of Portals like Naukri, Linked In and other social media websites Taking care of joining formalities, Other Hr related work Walk-in Date/ Time: 1st November 2019, 11 AM onwards Interview Venue: Freight Systems India Pvt. Limited, Super A7, Rathna Tower 1, 1st Floor, Thiru Vi Ka Industrial Estate, Guindy, Chennai - 600 032 Land Mark: Opposite RR Towers 4 Contact - Prasad Reddy","location":"Chennai","experience":"0 - 2 Years"},{"date":"2 - Nov - 2019","skills":".Net, MVC Architecture, ASP .NET Web Forms","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"TechAffinity Global Private Limited, Global Infocity Park Chennai, 8th floor, Module 4B-Block A, No: 40, MGR Salai, Kandanchavadi, Chennai - 600 096.","phone":"044-66806565","profile":".Net Developers \nTechAffinity Global Private Limited","description":"Required Skills: Strong knowledge in object-oriented concepts and .NET frameworks with Xamarin/ web forms Hands-on experience using API and Third Party Libraries Mandatory experience in .Net MVC architecture Mandatory experience in ASP .NET Web Forms Mandatory experience working with LINQ, Entity Framework, Parallel Tasking Mandatory experience in associated TFS based development Critical thinking and problem solving skills Should have good communication skills, both oral and written Ability to work independently and as a team Secondary Skills: Good to have knowledge in SharePoint Good to have knowledge in Xamarin Knowledge in HTML, CSS will be added advantage Knowledge in WCF and Web Services Knowledge in Windows Azure/ AWS and Power BI Interview Date - 2nd November' 2019 (Saturday) Time: 11 am - 4 pm Venue Details- TechAffinity Global Private Limited. Global Infocity Park Chennai, 8th floor, Module 4B-Block A, No: 40, MGR Salai, Kandanchavadi, Chennai - 600 096. Landmark : Next to RMZ Business Park ; Opposite to Gem Hospital Contact Person- Rajesh (044-66806565)","location":"Chennai","experience":"1 - 6 Years"},{"date":"2 - Nov - 2019","skills":"ASP .Net, C#, Python, Jquery, AJAX, OOAD, CSS3, HTML5","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"The Westin Hyderabad, Mindspace Raheja IT Park Hitec City, Madhapur, Hyderabad","phone":"8075893410","profile":"Senior .Net Developer \nNavigant BPM (India) Private Limited","description":"Candidate should have Bachelors or Masters degree in Computer Science or related field with 7 to 10 years progressive experience in Web applications and portal development across multiple web-enabled devices like desktop, mobile and tablet, including techniques like responsive, adaptive web development. Expert Level full stack development experience in ASP .Net technologies. Significant experience in Entity Framework and scripting languages such as C#, Python, Jquery, AJAX Experience with IIS and Tomcat and ability to design and utilize Active Directory and/or LDAP structures for authentication. Significant knowledge and working experience in OOAD, CSS3, HTML5, modern UI/JavaScript frameworks like AngularJS, Node JS, Bootstrap etc. Experience with XML, XSD, XSL, Web Services, SOAP, SOAP Extensions. Knowledge of software design and Architectural styles/ APIs, Patterns like REST, APC, MVC, MVVM and MVM. Job Location :Trivandrum Kerala Walkin Interview on 2nd November from 9 AM onwards Venue Details: The Westin Hyderabad, Mindspace Raheja IT Park Hitec City, Madhapur, Hyderabad","location":"Hyderabad","experience":"7 - 10 Years"},{"date":"1, 4, 5, 6, 7, 8 - Nov - 2019","skills":"Back Office, Voice Campaigns/ Blended Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Info-X Software Technology Pvt. Limited, 335 Udyog Vihar, Phase 2, Gurugram - 122 016","phone":"9910768257","profile":"Back Office Executive \nInfo-X Software Technology Pvt. Limited","description":"Only Graduates with streams like BA, B Com, B Sc, etc.may apply. Minimum experience 1 Year to 6 Years. Candidates with experience is Voice Campaigns/ Blended Process can also apply. Kindly Walk-in for Interview from 29th October 2019 till 15th November 2019 Timings 4:00 PM to 6:00 PM at below mention address. (No Interviews on Saturday and Sunday) Interview Venue: Info-X Software Technology Pvt. Limited 335 Udyog Vihar Phase 2 Gurugram - 122 016 Contact Person- Rishi","location":"Gurgaon","experience":"1 - 6 Years"},{"date":"1, 2 - Nov - 2019","skills":"Front Office Acvtivities, Facility Management, General Administration","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Harsha Automotive Private Limited, D.No. 2-40/5, Kothaguda, Near Hi-Tech City, Hyderabad - 84.","phone":"040-44374437","profile":"Front Office Executive \nHarsha Automotive Private Limited","description":"We have requirement of Front office executive with 2 to 4 years of experience Candidate should be Any Graduate Must have good communication skills Good looking Females would be preferred Walk-in Date/ Time: 29 October - 2nd November , 10 AM onwards Interview Venue Harsha Automotive Private Limited D.No. 2-40/5, Kothaguda, Near Hi-Tech City, Hyderabad - 84. Tel: 040-44374437/ 23113555,Ext:938 Fax: 040-23113311, Mobile:+919959888676 Contact - Mr. Balaswamy","location":"Hyderabad","experience":"2 - 5 Years"},{"date":"2 - Nov - 2019","skills":".Net Framework, C#/ VB .Net, ASP .Net, SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA","address":"GD Research Center Private Limited, Jyothi Pinnacle, Survey No. 11, 5th floor, Kondapur, Hyderabad, Telangana - 500081","phone":"040-67426702","profile":"Software Engineer (.Net) \nGD Research Center Pvt. Limited","description":"Candidate should have Bachelors Degree in Engineering /Technology or MCA with minimum 3 years of experience in .Net Framework, C#/ VB.Net, ASP .Net, SQL Server 2005/ 2008. Well-versed with JavaScript, AJAX, Web services, Threading. Have strong concepts of OOPS, Database (T-SQL) Programming. Hands on experience in product/ project development using MVC. Knowledge of Endeca ITL, NHibernate. Must have good communication skills in English, both written and verbal and analytical skills. Understanding of web usability issues and information architecture. Strong interpersonal and communication skills. Able to work and thrive in a fast-paced team environment and flexible to accommodate demanding Project schedules. Ability to express technical concepts clearly to people with no technical background Ability to think logically to organize information Interview Date - 2nd November 2019 (Saturday) Time - 10 AM to 2 PM (anytime in between) Venue Details: GD Research Center Private Limited, Jyothi Pinnacle, Survey No. 11, 5th floor, Kondapur, Hyderabad, Telangana - 500081 Land Mark : Hi tech city road, near google office Opp. to Prestige IVY league, Adjacently opp. to ePark Building.. Contact - Giridhar/ Salim (HR)","location":"Hyderabad","experience":"3 - 7 Years"},{"date":"2 - Nov - 2019","skills":"Java, J2EE, SQL, HTML, CSS, Java Script and Angular JS","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Atria Convergence Technologies Pvt. Limited, ACT Fibernet Head office 8-2-618/B, Mithila Nagar, Banjara Hills Road No. 11, Hyderabad - 500 034","phone":"Not Provided","profile":"Java Developer \nAtria Convergence Technologies Pvt. Limited","description":"We are looking for an Server Side Java developer responsible for the development and maintenance of applications. Your primary focus will be development of applications and their integration with other services along with constant eye of improvements through customer/user feedback. You will be working alongside other engineers and developers working on different layers of the infrastructure. Therefore, a commitment to collaborative problem solving, sophisticated design, and the creation of quality products is essential. Required Skills/ Experience: 1+ years of development experience Proficient with Linux, Java, J2EE, SQL Familiarity with HTML, CSS, Java Script and Angular JS Experience with frameworks such as spring, SpringBoot and hibernate Experience with Eclipse IDE Familiarity with RESTful and SOAP APIs Knowledge of other web technologies and UI/UX standards Knack for benchmarking and optimization Proficient understanding of code versioning tools {{such as Git, Mercurial or SVN}} Experience with Agile and Waterfall SDLC models Walk-in Date/ Time: 2nd November 2019, 12 PM onwards Interview Venue: Atria Convergence Technologies Pvt. Limited ACT Fibernet Head office 8-2-618/B, Mithila Nagar, Banjara Hills Road No. 11, Hyderabad - 500 034 Landmarks : Care Hospital-Outpatient Center & karvy Data Contact Person - Ranjit Joshi","location":"Hyderabad","experience":"1 - 3 Years"},{"date":"3 - Nov - 2019","skills":"Angular, HTML5, Bootstrap, CSS3, JavaScript/ jQuery, Typescript, Ajax.","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Winner Software Private Limited, Office No. B-705, 7th Floor, Teerth Technospace, Next To Mercedes Benz Showroom (B. U. Bhandari), Mumbai-Pune Express Highway, Baner, Pune - 411045.","phone":"9028060025","profile":"Java Developer - Angulas JS \nWinner Software Private Limited","description":"Winner Software Private Limited is looking for Java Developer Angular for Pune location. Strong experience on Angular 2.0/4.0/5.0/6.0/7.0, HTML5, Bootstrap, CSS3, JavaScript/ jQuery, Typescript, Ajax. Should have strong debugging skills on Developer Tools of the browser and Working with Cross Browser UI knowledge on Web services using REST /SOAP over JSON is a plus. Should have experience in Response / Adoptive Web Design for desktop, tablet and mobile Strong OO programming knowledge. Familiar with concept of Node.js Hands on experience of AngularJS practices and commonly used modules. Good understanding of data structures, relational databases and DBMS technologies. Develop applications and create reporting objects based on client and internal business needs. Work collaboratively with engineers and other designer to build scalable solutions to improve user experience. Strong interpersonal and communication skills. Walk-in Date/ Time: 3rd November 2019, 9 AM onwards Interview Venue: Winner Software Private Limited Office No. B-705, 7th Floor, Teerth Technospace, Next To Mercedes Benz Showroom (B. U. Bhandari), Mumbai-Pune Express Highway, Baner, Pune - 411045. Mobile : +91 9560695044 Landline : 9028060025.","location":"Pune","experience":"3 - 8 Years"},{"date":"2 - Nov - 2019","skills":"Java /JEE, Frameworks like, Spring or Spring boot, Angular2+","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Orange Business Services India Private Limited, Tower B (7th Floor) DLF Infinity Towers DLF Cyber City - Phase II Sector 25 Gurgaon - 122 002 Haryana","phone":"Not Provided","profile":"Java Full Stack Developer \nOrange Business Services India Pvt. Limited","description":"Candidate must have good understanding of n-tier architectures of Java /JEE Must have experience on frameworks like, Spring or Spring boot Must have experience on front end technologies- Angular2+ Must have experience on creating and consuming web services - REST and SOAP Must have good knowledge on Database, MySQL/Oracle and SQL scripts Optional : Prior implementation experience of Agile Scrum process is a plus. Optional : Working experience on Jquery would be a plus. Job Responsibilities: Ensure the activities by holding the commitments in terms of quality, costs and deadlines. Participate in the Release planning and identify the risks Application development Analysis and Problem solving Active member in Scrum team Analyse quality of service and suggest improvements, wherever possible Creation / update of Requirement documents, technical analysis reports etc. Walk-in Date/ Time: 2nd November 2019, 9 AM onwards Interview Venue: Orange Business Services India Private Limited Tower B (7th Floor) DLF Infinity Towers DLF Cyber City - Phase II Sector 25 Gurgaon - 122 002 Haryana Contact Person- Shael Bansal","location":"Gurgaon","experience":"2 - 5 Years"},{"date":"2, 3 - Nov - 2019","skills":"Core Java, Strong knowledge in OOPs concepts, J2EE, HTML, CSS, SQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Soft Suave Technologies Pvt. Limited, Gayatri Tech Park, 4th floor, Plot No 183, EPIP, Near iGate, KIADB Industrial Area, Road 1B, 1B, EPIP Zone Whitefield Rd Kundalahalli, Whitefield Bengaluru, Karnataka - 560 066","phone":"044-42874244","profile":"Software Engineer - Java \nSoft Suave Technologies Pvt. Limited","description":"Eligibility Criteria: BE/ B.Tech/ ME/ M.Tech/ MCA / 2016, 2017, 2018 & 2019 Passed outs. Immediate Joiners required Required Skills: Core Java, Strong knowledge in OOPs concepts, J2EE, HTML, CSS, SQL Logical and analytical thinking towards the Java programming Should have designed at least one project module using object oriented analysis and design techniques Sound knowledge of modern software architecture and development techniques Should be a self initiator and interested in learning new technologies. OPTIONAL: IOS Objective C, Spring, Hibernate Rounds of Interview: Level 1: Technical Aptitude test Level 2: Programming Test Level 3: System Execution of Program Level 4: HR Interview Interview Date : Nov 2 & 3, 2019 (Saturday & Sunday) Timing: 10:00 am to 1:00 pm Soft Suave Technologies Pvt. Limited, Gayatri Tech Park, 4th floor, Plot No 183, EPIP, Near iGate, KIADB Industrial Area, Road 1B, 1B, EPIP Zone Whitefield Rd Kundalahalli, Whitefield Bengaluru, Karnataka - 560 066 Contact Person- Sindhu (044-42874244)","location":"Bangalore","experience":"0 - 2 Years"},{"date":"2 - Nov - 2019","skills":"Core Java, Spring Boot, RESTful, Hibernate, Javascript","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Mitosis Technologies Private Limited, BJ Tower 2nd Floor, # 75, Gokul Nagar, Madambakkam Main Road, Rajakilpakkam, Chennai - 600 073.","phone":"7904205688","profile":"Java Developer \nMitosis Technologies Private Limited","description":"Person must be strong at Core Java, Spring Boot, RESTful, Hibernate, Javascript should be well versed in the front end application expert in collaboration tool [GitHub, Jira Good Written and Oral communication [should have the capability to handle clients independent Walk-in Date/ Time: 2nd November 2019, 11 AM onwards Interview Venue: Mitosis Technologies Private Limited BJ Tower 2nd Floor, # 75, Gokul Nagar, Madambakkam Main Road, Rajakilpakkam, Chennai - 600 073. Contact Person- Harish (7904205688)","location":"Chennai","experience":"3 - 8 Years"},{"date":"2 - Nov - 2019","skills":"JAVA/ UI/ UX / PHP/ Software Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"PennyWise Solutions Private Limited, 1st Floor Solitaire Building, Plot No: 14&15 Software Units Layout, Madhapur, Survey No. 64, Hyderabad - 500 081.","phone":"Not Mentioned","profile":"IT Freshers (JAVA/ PHP/ Testing) \nPennyWise Solutions Private Limited","description":"Educational Qualifications: B.Tech/ BE/ MCA - 2018 & 2019 Pass out Only Percentage - Above 70% (In all Academics 10th, Intermediate & Engineering) Required Skills: JAVA/ UI/ UX / PHP/ Software Testing. Essential Requirements: Strong collaboration and communication skills, both verbal and written. Excellent Analytical, Problem-solving skills and a creative approach for new ideas. The ability to work under pressure & adapt in a fast-paced environment Desire to learn new technologies and systems Roles & Responsibilities: This position is suited for highly motivated and energetic individual. The incumbent would be responsible for the design and development of complete software components. He/She should have urge to harness new technologies and should be passionate about their jobs and be a good team player. Interested candidates may walk-in at the venue for a written Test (Aptitude) along with updated CV & 2 PASSPORT SIZE PHOTOGRAPH. Date 2 November 2019 (Saturday) Time: 10.00 AM to 12.00 Noon Venue: PennyWise Solutions Private Limited 1st Floor Solitaire Building, Plot No: 14&15 Software Units Layout, Madhapur, Survey No. 64, Hyderabad - 500 081. Landmark: Opposite to Novartis Inorbit Mall Road","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"2 - Nov - 2019","skills":"JAVA (API, Spring Boot)","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"CBRE | Digital & Technology, 6th Floor, Novus Tower, 18 Ananth Road, Maruti Udyog, Sector-18 , Gurugram - 122 008.","phone":"Not Provided","profile":"Java Developers \nCBRE South Asia Private Limited","description":"We are conducting Mega Walk-In Drive at CBRE - Digital & Technology Centre (Gurugram) on Saturday 2nd November at 9:00 am- 3:30 PM. please find below details: - Required Skills: JAVA (API, Spring Boot) Developer (Exp.3-10 years) Must have Skills- JAVA, Spring Boot, Restful API. No. of Openings: 7 Role: Software Engineer/ Sr. Software Engineer. (Candidates with 30-45 days Notice period or immediate joiner will be preferred) Walk-in Date/ Time: 2nd November 2019, 9 AM onwards Interview Venue: CBRE | Digital & Technology, 6th Floor, Novus Tower, 18 Ananth Road, Maruti Udyog, Sector-18 , Gurugram - 122 008. (Landmark- Opposite Passport Office) Contact Person- Mr. Surender Singh","location":"Gurgaon","experience":"4 - 9 Years"},{"date":"2 - Nov - 2019","skills":"Core Java, SQLite, Android SDK, Eclipse/ Android Studio XML/ JSON/ REST/ SOAP","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Matrimony.Com Limited, Arihant ePark, Lattice Bridge Road, 2nd Floor, Baktavatsalm Nagar, Adyar, Chennai - 600 020","phone":"Not Provided","profile":"Android/ Java Developer \nMatrimony.com Limited","description":"Candidates must have developed minimum 3 to 5 applications in Android platform Mobile user interface designing Essential skills: Core Java, SQLite, Android SDK, Eclipse/ Android Studio XML/ JSON/ REST/ SOAP Back end computing must include Database Management, Security, Interaction with Hardware, and Memory allocation implementation Experience in Android SDK especially Apps service Architecture, Design Apps for different versions of Android, different screen sizes and permission requirements. Hands-on knowledge of design principles of Android and iOS platforms Ability to think Out of the box and constantly push the boundaries of app design. Walk-in Date/ Time: 2nd November 2019, 11 AM onwards Interview Venue: Matrimony.Com Limited Arihant ePark, Lattice Bridge Road, 2nd Floor, Baktavatsalm Nagar, Adyar, Chennai - 600 020 Landmark: Opposite to Adyar Anantha Bhavan Contact Person: Ms. Gracy L","location":"Chennai","experience":"3 - 4 Years"},{"date":"0, 1, 2, 4, 5, 6, 7, 8, 9 - Nov - 2019","skills":"Java, Angular/ React","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"CloudCore Innovations, S.No 128/4, Near, Balewadi High St, Balewadi Phata, Baner, Pune, Maharashtra - 411 045","phone":"9145200203","profile":"Web/ Java Developer (Freshers) \nCloudCore Innovations","description":"Looking for trainee/ interns who are interested to build a career in one of the following technical track: 1. Web Developer (Angular/ React) 2. Java Developer 3. Machine Learning Specialist/ Data Scientist Walk-in Date/ Time: 1st November - 30 November , 9 AM onwards Interview Venue: CloudCore Innovations S.No 128/4, Near, Balewadi High St, Balewadi Phata, Baner, Pune, Maharashtra - 411 045 Contact No. 9145200203","location":"Pune","experience":"0 - 1 Years"},{"date":"1 - Nov - 2019","skills":"Php, Magento and Drupal","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Velcro Technologies Private Limited, 101/A, 1st Floor, Plot #2, Above Karnataka Bank, Opposite to, Image Gardens Road, HITEC City, Hyderabad, Telangana - 500 081.","phone":"8142516243","profile":"PHP Developer \nVelcro Technologies Private Limited","description":"We are looking for a PHP Developer having good knowledge on interchange of data between the server and the users and knowing the basic fundamentals of Magento and Drupal. Candidates acquiring good communication skills. Walk-in Date/ Time: 1st November 2019, 10 AM onwards Interview Venue: Velcro Technologies Private Limited 101/A, 1st Floor, Plot #2, Above Karnataka Bank, Opposite to, Image Gardens Road, HITEC City, Hyderabad, Telangana - 500 081. Contact Person - SHIRISHA (8142516243)","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"1, 4, 5, 6, 7, 8 - Nov - 2019","skills":"Back End Operations, Non Voice Process","qualification":"Diploma, B.A., B.Com, B.B.A, B.Sc","address":"SSR TechVision Private Limited, A-38 K, Sector-64, Noida - 201 301","phone":"9667230694","profile":"Back Office Executive \nSSR TechVision Private Limited","description":"Minimum Qualification: 12th Passout/ Graduate Should have good typing Speed Knowledge of MS Excel Good Knowledge of Shortcut keys Willing to work in night shift Walk-in Date/ Time: 1st - 8th November , 4 PM onwards Interview Venue- SSR TechVision Private Limited, A-38 K, Sector-64, Noida - 201 301 SALONI (HR) Contact No. 9667230694 Email ID- shikha@ssrtechvision.com","location":"Noida","experience":"0 - 1 Years"},{"date":"5, 6, 7 - Nov - 2019","skills":"Java, Spring Boot, Spring MVC, Microservices, Hibernate","qualification":"B.E./B.Tech, MCA/PGDCA","address":"VNC Digital Services Private Limited, 306B, Brigade IRV Centre, Nallurhalli Road, Whitefield Bengaluru, Karnataka - 560 066","phone":"8722126643","profile":"Java Developer/ Fresher \nVNC Digital Services Private Limited","description":"Candidate should have good knowledge experience on Java technologies In-depth knowledge Spring Boot, Spring MVC, Microservices, Hibernate Knowledge Bootstrap, HTML5 and CSS. Problem-solving abilities and good communication Skills. Walk-in Date/ Time: 5th - 7th November 2019, 10 AM onwards Interview Venue: VNC Digital Services Private Limited 306B, Brigade IRV Centre, Nallurhalli Road, Whitefield Bengaluru, Karnataka - 560 066 Tel: 8722126643/ 8088236059 Contact Person- Maheshwar","location":"Bangalore","experience":"0 - 1 Years"},{"date":"5, 6 - Nov - 2019","skills":"Manual Testing, Database SQL, STLC, Performance Testing, Functional Testing, Regression Testing","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Teleperformance India Private Limited, Plot- 94, 95, Sector-18, Udyog Vihar Phase-4, Near Atlas Chowk, Gurgaon, Haryana","phone":"Not Provided","profile":"Software Tester \nTeleperformance Global Services Pvt. Limited","description":"Teleperformance Global Services Pvt. Limited is hiring Software Tester in Gurgaon location. Eligibility Criteria- 1- Review of software requirements. 2- Preparation of test cases. 3- Execution of tests. 4- Reporting of defects. 5- Preparation of test report, Test Plan, Test Scenarios, Test Cases. Desired Skills- Manual Testing, Database SQL, STLC, Performance Testing, Functional Testing, Regression Testing Addition Knowledge- QTP (UFT), J-Meter, Agile Methalogy, JIRA - Bug Tracking Tool Candidate who have knowledge about HRMS/ CCMS software would be prefer first Well organized, detailed, skeptical, teamwork Must be Proficient in written English Salary - Upto 30k CTC (26k Inhand) Work Location- Gurgaon Working Days- 6 days Interested candidates can directly walk-in for an interview to the below mentioned address- Interview Date- 5th & 6th August 2019 Time- 11 am onwards Teleperformance India Private Limited Plot- 94, 95, Sector-18, Udyog Vihar Phase-4, Near Atlas Chowk, Gurgaon, Haryana Contact Person- Sakshi, Note- Bring 1 Resume & 1 Identity Proof and mention 'Sakshi' as HR Reference.","location":"Gurgaon","experience":"1 - 5 Years"},{"date":"30 - Oct - 2019","skills":"Customer Support, Non Voice Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Mphasis Limited, 4th Floor, WTC 4, Block A, Bagmane World Technology Center, KR Puram, Marathahalli Outer Ring Road, Mahadevapura, Bangalore - 560 048","phone":"080-67505257","profile":"Associate - Non Voice Process \nMphasis Limited","description":"Mphasis Limited is currently hiring for Customer Support Associates (Non Voice Process) at Bangalore Location. Candidate's should have experience in Non Voice Process. Good to have the experience in the capital market. Educational Qualification: PUC/ Graduate Experience: Minimum 1 years experience in BPO Pickup & drop Cab facility is Available. Interview Date: 30th October 2019, Time: 12:00 pm to 3:00 pm Venue: Mphasis Limited 4th Floor, WTC 4, Block A, Bagmane World Technology Center, KR Puram, Marathahalli Outer Ring Road, Mahadevapura, Bangalore - 560 048 Contact Person : Arunima Rai Contact No. : 080-67505257 Email: Arunima.rai@mphasis.com","location":"Bangalore","experience":"1 - 3 Years"},{"date":"30, 31 - Oct - 2019","skills":"Front Office, General Administration, Front Desk/ Reception Activities","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Frontier Life Line Hospital, R 30 C, Ambattur Industrial Estate Road, Mogappair, Tamil Nadu - 600 101","phone":"044 42017575","profile":"Front Office Executive \nFrontier Lifeline Private Limited","description":"Candidate should be Any Graduate with 0 to 1 year of experience in Front Office, General Administration, Front Desk/ Reception Activities. The responsibilities will include the following areas covered under the Front Office- Registration formalities Admission formalities Co-ordination for Guest House Accommodation for patients Allotment of Rooms - Shifting / Admission Walk-in Date/ Time: 30 October - 6th November , 10 AM onwards Interview Venue: Frontier Life Line Hospital R 30 C, Ambattur Industrial Estate Road, Mogappair, Tamil Nadu - 600 101 Tel: 044 42017575 Extn: 611/ 612 Contact Person- Kumaran","location":"Chennai","experience":"0 - 1 Years"},{"date":"30, 31 - Oct - 2019","skills":"Non Voice Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Karvy Fintech Private Limited, Karvy Selenium Tower B, Plot Nos. 31 & 32 Financial District, Nanakramguda, Serilingampally Mandal, Hyderabad - 500 032.","phone":"Not Provided","profile":"Associate - Non Voice Process \nKarvy Fintech Private Limited","description":"We have an opening for Trainee/ Officer in one of our growing Business Units. Looking for Freshers & Experience in Non Voice Process for our Non-Voice process who are ready to join us immediately. ANY GRADUATE EXPERIENCE: 0 to 2 Years Job Pre Requisites- Ready to join immediately Good communication skills written & verbal Flexible for Night Shifts Within 24 km range from Financial District Benefits: Two way cab facility Two meal coupons per day Day and Date: 30th - 31st October 2019 Time: 12 PM to 3 PM Address: Karvy Fintech Private Limited Karvy Selenium Tower B, Plot Nos. 31 & 32 Financial District, Nanakramguda, Serilingampally Mandal, Hyderabad - 500 032. CONTACT PERSON: CHAITALI The candidate should get below mandatory documents: Xerox of all the educational documents Xerox of Aadhar and PAN Card 1 photograph Copy of this email/ posting","location":"Hyderabad","experience":"0 - 2 Years"},{"date":"30 - Oct - 2019","skills":"Back End Operations, Non Voice Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Netscribes (India) Private Limited 4Th Floor, Saberwal House 55B Mirza Ghalib Street, Kolkata - 700 016","phone":"Not Provided","profile":"Back Office Associate \nNetscribes (India) Private Limited","description":"Candidate should have decent communication skill in English both written and verbal and must have an eye for detail. Basic knowledge of E-commerce industry is preferred. Should be a Graduate or awaiting final results. Age Limit - 30 years Job Responsibilities: 1. To write features and attributes of product through extensive secondary research 2. To adhere the feature guidelines sent from client's end 3. Writing short product descriptions wherever necessary 4. To adhere daily target related to production and quality 5. To keep error benchmark at minimum as specified by the client 6. To participate in periodical trainings as and when conducted by mentors. Interview Date: 30th October 2019, Wednesday. Timings: 11 A.M onwards Address: Netscribes (India) Private Limited 4Th Floor, Saberwal House 55B Mirza Ghalib Street, Kolkata - 700 016 Please carry your PAN and Aadhar Card at the time of interview.","location":"Kolkata","experience":"0 - 2 Years"},{"date":"30, 31 - Oct - 2019","skills":"HR Administration, Recruitment, Office Administration","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"SpiceJet Limited, Building No. 319, Udyog Vihar, Phase 4, Gurgaon - 120 016","phone":"Not Mentioned","profile":"HR Executive ( Male Only) \nSpiceJet Limited","description":"Educational Qualification : MBA/ PGDM - HR Work Experience: 0 - 2 Years Job Location: Gurgaon Required Skills: Excellent verbal and written communication skills Knowledge of MS-Excel is must Prior experience of business partnering and HR Operations Open for travelling Eye for detail Job Responsibility: Hr Generalist Joining and On-Boarding formalities. Background Verification Drafting of letter viz. Appointment Letters, NOCs, Transfers, Deputations, Absenteeism, Disciplinary, Visa MIS Preparation Date: 30th - 31st October' 2019 (Wednesday & Thursday) Timing : 10 am till 12 Noon Interview Venue: SpiceJet Limited Building No. 319, Udyog Vihar, Phase 4, Gurgaon - 120 016 Kindly report at the above mentioned address and do carry a copy of your updated resume along: Dress Code : Formals","location":"Gurgaon","experience":"0 - 2 Years"},{"date":"2 - Nov - 2019","skills":"Automation testing using Selenium, Java API/ Rest-assured/ SOAP UI/ POSTMAN/ RESTAPI etc.","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"GSPANN Technologies Private Limited, 2nd floor, N-Height, Plot No: 38, Hitech City, Phase-2, Kondapur, Hyderabad.","phone":"Not Provided","profile":"QA/ Automation Tester \nGSPANN Technologies Inc.","description":"Candidate must be strong on automation testing using Selenium Web driver. Should be Ready to Learn API automation using Java API/ Rest-assured/ SOAP UI/ POSTMAN/ RESTAPI etc. Good with Collections API, File Read/Write and exception handling. Programming experience with Java is required Expertise in any of the BDD frameworks (Cucumber or JBehave) is Desired Well verse with Automation framework design and hands-on exp in UI automation Experience developing highly reusable and efficient Test frameworks. Knowledge of Database basics, SQL Queries etc. Knowledge of Software Development Life Cycle (Agile is a must to have) Hands on experience with Maven, TestNG and JIRA. Good communication skills both oral and written. Registration Link: https://cutt.ly/EefUJTN Walk-in Interview on 2nd November from 9 AM onwards Venue Details GSPANN Technologies Private Limited 2nd floor, N-Height, Plot No: 38, Hitech City, Phase-2, Kondapur, Hyderabad. Contact Person - Rajender Kumar /Usha","location":"Hyderabad","experience":"3 - 8 Years"},{"date":"1, 2 - Nov - 2019","skills":"Automation testing using Selenium and Java, Java Coding or Programming","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Maveric Systems Limited, Plot No. 1 & 2 NP, 2nd Floor, Lords Tower, Block 1, Jawaharlal Nehru Road, Thiru Vi Ka Industrial Estate, Ekkaduthangal, Chennai, Tamil Nadu - 600 032","phone":"Not Provided","profile":"Automation Testing Engineer \nMaveric Systems Limited","description":"Good experience into Automation testing using Selenium and Java. Should be good into Java Coding or Programming. Should have a good exposure or experience or strong knowledge towards API testing or mobile application testing. Work experience in any frameworks (cucumber, maven, BDD, hybrid, etc.,) Should have experience or knowledge in Framework development. Must have a strong knowledge in OOPS concepts. Walk-in Date/ Time: 1st - 2nd November 2019, 9 AM onwards Interview Venue: Maveric Systems Limited Plot No. 1 & 2 NP, 2nd Floor, Lords Tower, Block 1, Jawaharlal Nehru Road, Thiru Vi Ka Industrial Estate, Ekkaduthangal, Chennai, Tamil Nadu - 600 032 Contact Person: Priyadharshni Interested can share their updated CV along with below details on priyadharshnis@maveric-systems.com Total years of experience: Relevant experience towards automation testing: Current CTC: Expected CTC : Notice period: Interview Date: November 1st and 2nd 2019 Interview Time : 9am To 3pm Interview Location : Chennai and Coimbatore Work Location : Chennai / Bangalore (as per the preference)","location":"Bangalore, Chennai","experience":"3 - 8 Years"},{"date":"2 - Nov - 2019","skills":"Automation and Manual testing for Android/ IOS Apps.","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Xavient Software Solutions India Pvt. Limited, Plot No. 54 NSEZ Phase - 2, Sector 81 Noida, Uttar Pradesh","phone":"Not Provided","profile":"Mobile Testing Engineer \nXavient Software Solutions India Pvt. Limited","description":"Key Technical Skills- o Expertise in both automation and manual testing for Android/IOS apps. o Must have hands on experience of Mobile automation tools. o Developed test scripts to automate in Selenium WebDriver, Soap UI, Robot Framework, Appium , Monkey Runner . o Strong automation concepts and proven experience on multiple automation tools preferably Selenium. o Hands on experience in Version Control Software: SVN, GIT, Clear case etc. o Strong SQL skills are essential. o Good knowledge of software development methodologies including agile model. o Test Management Tools knowledge like JIRA o Project and Build Tools: Maven, ANT, Sonar Qube, Eclipse IDE, Jenkins, Android Debugger o Must have worked as an established individual contributor and implemented best test practices in a complex technical environment. o Hands on knowledge of web, client server technologies o A proven background and track record of working in a testing environment within financial services and preferably in Pensions. Walk-in Date/ Time: 2nd November 2019, 10 AM onwards Interview Venue: Xavient Software Solutions India Pvt. Limited Plot No. 54 NSEZ Phase - 2, Sector 81 Noida, Uttar Pradesh Contact Person- Anchal","location":"Noida","experience":"3 - 8 Years"},{"date":"30 - Oct - 2019","skills":"Claims Processing, Back Office Operations","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Optum - A UnitedHealth Group Company, Tower-A, 5th floor, Building No-6, Phase-3, Sector 24 Gurgaon - 122 001","phone":"Not Provided","profile":"Claims Process Associate \nOptum Global Solutions (India) Private Limited","description":"Optum Global Solutions (India) Private Limited is currently looking for dedicated professionals to fulfill the following job responsibilities: Responsible for the accurate processing and completion of medical claims. Process claims that route out of automatic adjudication, within current turnaround standards. Proficiency in product lines applicable to processing unit. Ability to understand and apply plan concepts to include: Deductible Coinsurance Co-pay Out-of-pocket State variations. Candidate should be a Graduate (BE/ B.Tech/ BCA/ MCA are not eligible for claims hiring) Should be comfortable with Night Shifts (5:45 PM to 3:15 AM & 8:30 PM to 6:00 AM) (Both Side Cabs will be provided). Looking for Immediate Joiners only Walk-in Date- 30th October' 2019 (Wednesday) Timings- 11:00 am to 1:00 pm Interview Venue: Optum- A UnitedHealth Group Company Tower-A, 5th floor, Building No-6, Phase-3, Sector 24 Gurgaon - 122 001 Nearest Metro Station- DLF Phase 3 metro station Note: If given interview in last 3 months please ignore this post","location":"Gurgaon","experience":"0 - 2 Years"},{"date":"29, 30, 31 - Oct - 2019","skills":"J2SE, J2EE, Spring, Struts, Webservices and Hibernate","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"DXC Technology India Private Limited, Maruti Concorde Tech Park Service Road, Electronic City Phase II, Electronic City, Bengaluru, Karnataka - 560 100.","phone":"Not Provided","profile":"Senior Java Developer/ Lead \nDXC Technology India Private Limited","description":"Candidate should have 4+ years of experience in software development with Java/ J2EE technologies and Java Portal. Experience in development of enterprise business applications using J2SE, J2EE, Spring, Struts, Webservices and Hibernate. Good experience in Design, Development and Implementation of application using Java, J2EE & Java Should involved in SDLC- Software development life cycle. Good Experience in Developing Applications using Collections, Exception, Multithreading and JDBC. Extensive experience on web-based applications and development environments using Java, Servlet, JSP Restful, SOAP, Hibernate and Spring framework. Should worked on backend tools such as SQL server, MySQL, Oracle Walk-in Date/ Time: 29th - 31st October 2019, 10 AM onwards Interview Venue: DXC Technology India Private Limited Maruti Concorde Tech Park Service Road, Electronic City Phase II, Electronic City, Bengaluru, Karnataka - 560 100. Landmark: Near Maruthi Suzuki Showroom Contact Person - Sonali Dey If interested and available for F2F discussion kindly forward your updated CV to sdey46@dxc.com with the details below: Current Company : Total Experience : Relavant Experience : Highest Qualification: Current CTC : Expected CTC : Availability Date: Time: Notice period:","location":"Bangalore","experience":"4 - 8 Years"},{"date":"2 - Nov - 2019","skills":"Java/ J2EE, JavaScript, AngularJS/ Angular, JQuery, CSS, HTML, and BootStrap","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"GGK Technologies Private Limited, Level-14, Building 2.1 Waverock IT SEZ Nanakramguda Hyderabad - 500 008","phone":"Not Provided","profile":"Java/ Full Stack Developer \nGGK Technologies Private Limited","description":"Candidate should have 3 to 5 years of strong experience in Java and J2EE technologies and Web technologies. Web development skills in JavaScript, AngularJS/ Angular, JQuery, CSS, HTML, and BootStrap. Hands-on experience in Java, Spring Technologies (Spring, Spring MVC, Spring Boot), Hibernate, Web Services (RESTful/ SOAP). Working experience with ORM tools like JPA/ Hibernate/ Spring Data/ MyBatis. Strong RDBMS, SQL/ PLSQL programming skills. Continuous integration experience (Jenkins / JIRA / Maven / Git) Experience in writing unit tests (Junit/Mockito/Easy Mock) etc. Hands on experience in Microservices. Good at the understanding of Software Design patterns and Java coding best practices. Should have worked with cross-cultural teams across multiple locations. Possess excellent interpersonal, analytical, problem-solving, and communication skills. Walk-in Date/ Time: 2nd November 2019, 9 AM onwards Interview Venue: GGK Technologies Private Limited Level-14, Building 2.1 Waverock IT SEZ Nanakramguda Hyderabad - 500 008","location":"Hyderabad","experience":"3 - 5 Years"},{"date":"2 - Nov - 2019","skills":"Automation Testing using Selenium, Test management tools JIRA, QC etc","qualification":"B.E./B.Tech","address":"SHL (India) Private Limited, Tower 10B, 9th Floor, DLF Cyber City, Gurgaon, Haryana - 122 002","phone":"Not Provided","profile":"QA/ Automation Tester \nSHL (India) Private Limited","description":"BE/ B. Tech in Computer Science, Information Technology or relevant professional experience 3-5 years of experience in an IT or Business environment testing highly scalable applications Excellent communications skills interacting with technical and business audiences Any testing certification is a plus. Technical Skills: Strong Java skills Strong experience with automation using selenium Strong understanding of basic concepts to testing principles, all types of Black/Grey Box testing Knowledge of Test management tools JIRA, QC etc. Should be hands on with sql-database Experience in Performance testing and tools like JMETER is a plus. Experience in Agile development environment is a plus. Web Services Testing/ Backend testing: SOAP UI, POSTMAN is a plus Walk-in Date/ Time: 2nd November 2019 from 10 AM onwards Interview Venue: SHL (India) Private Limited Tower 10B, 9th Floor, DLF Cyber City, Gurgaon, Haryana - 122 002","location":"Gurgaon","experience":"3 - 5 Years"},{"date":"2 - Nov - 2019","skills":"Asp .Net, C#, Javascript, Jquery, SQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Navigant BPM (India) Private Limited, Westin Hyderabad Mindspace, Raheja IT Park Hitec City, Madhapur, Hyderabad, Telangana - 500 081","phone":"7994250919","profile":".Net Professionals \nNavigant BPM (India) Private Limited","description":"Navigant BPM (India) Private Limited is recruiting for .Net Professionals on 2nd November, 2019 Required Skills: Full stack _Asp .Net, C#, Javascript, Jquery, SQL Work Experience : 3 to 8 years Job Location: Trivandrum Walk-in Date/ Time: 2nd November 2019 from 9 AM onwards Interview Venue: Navigant BPM (India) Private Limited Westin Hyderabad Mindspace, Raheja IT Park Hitec City, Madhapur, Hyderabad, Telangana - 500 081","location":"Hyderabad","experience":"3 - 8 Years"},{"date":"28, 29, 30, 31 - Oct - 2019","skills":"Java, Angular, HTML5, Kafka, Spring, Hibernate, JavaScript, HTML,CSS, SQL, XML, JMS","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Expeditors International (India) Pvt. Limited, The Forum Vijaya Mall, 10th Floor, Prestige Center Court, 183, N. S. K. Salai, Kumaran Colony, Vadapalani, Chennai, Tamil Nadu - 600 026","phone":"044-66051102","profile":"Java Developers \nExpeditors International (India) Pvt. Limited","description":"Essential Experience: Object-oriented programming and component-based development with Java. Enterprise software development and leadership experience. Customer service-oriented attitude, top-notch time management, and quality driven designs. Experience with Angular, HTML5, Kafka, Spring, Hibernate, JavaScript, HTML,CSS, SQL, XML, JMS, Linux operating systems, relational and document-oriented databases. Experience with Agile software development methodologies. At least 6 years of professional software development experience. Preferred Experience: BS in Computer Science or comparable work experience. Core JAVA certification Event-driven Architecture. Experience with transportation and logistics. Experience with Axon Framework, Domain Driven Design, Distributed Systems, CQRS. Experience with Eclipse or IntelliJ IDEs, various plug-ins,Maven, Nexus, Git. Walk-in Date/ Time: 28 October - 1st November , 10 AM onwards Interview Venue: Expeditors International (India) Pvt. Limited The Forum Vijaya Mall, 10th Floor, Prestige Center Court, 183, N. S. K. Salai, Kumaran Colony, Vadapalani, Chennai, Tamil Nadu - 600 026 Contact Person- Sindhuja Amilthamozhian Tel: 044-66051102","location":"Chennai","experience":"5 - 8 Years"},{"date":"2 - Nov - 2019","skills":"Core Java and Android Platform, Android SDK and tools","qualification":"B.E./B.Tech, MCA/PGDCA","address":"D2K Technologies (India) Pvt. Limited, 605, Pujit Plaza, Plot No 67, Sector-11, CBD Belapur, Navi Mumbai.","phone":"8422933982","profile":"Android Developer/ Java \nD2K Technologies (India) Pvt. Limited","description":"Candidate must have strong knowledge of Core Java and Android Platform, with expertise in Android SDK and tools. Experience in on Java/ Eclipse/ Multithreading/ JSON, OOPS, Design and Patterns, Java, SQLite, JSON parsing, Activity Fragments, UI design. Skills Required: Java, I Development, Rest API, Android Activities, Services, Broadcast Receiver, Fragments, Content Provider, SQLite, ORMLite, JSON Candidate will be working on Java and Android Platform Min 6 months experience is required Job Location: Navi Mumbai. Walk-in Date/ Time: 2nd November 2019, 10 AM onwards Interview Venue: D2K Technologies (India) Pvt. Limited 605, Pujit Plaza, Plot No 67, Sector-11, CBD Belapur, Navi Mumbai. Contact Person- Verunika (8422933982)","location":"Mumbai","experience":"1 - 3 Years"},{"date":"9 - Nov - 2019","skills":"Java, J2EE, JSP, Spring, XML, Xpath, JSON","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Key Prima Hotel Parc Estique, Pune-Ahmednagar Road, Viman Nagar, Pune, Maharashtra - 411 014","phone":"Not Provided","profile":"Java Developer \nNisum Consulting Private Limited","description":"Required Skills: Strong with Spring Core, Boot, MVC, Transaction, JMS etc across various Spring versions. Experience with Java/J2EE - capable to write Rest services and expose them securely, Microservices development Servers (Tomcat), Apache httpd rewrite engine & rules, Advanced GIT skills Unit Testing for each line of new code introduced, Peer code review process using GIT Pull Requests & Crucible (for SVN), Ensure that the code meets the required development standards and is optimized for performance. Mentor junior developers. Value Adds: Experience designing and executing responsive web applications, Experience building Java web applications, JSP, Spring, XML, Xpath, JSON and with J2EE application Experience with NodeJS, ExpressJS, GruntJS, Bower and NPM is highly preferable. Webpack / grunt, CSS SASS. Functional design and development of RIA (internet rich applications), enhance application performance and provide troubleshooting support using AJAX, XSL, XSLT, CSS, JavaScript, DHTML and XHTML for all major browsers. Walk-in Date/ Time: 9th November 2019, 10 AM onwards Interview Venue: Key Prima Hotel Parc Estique Pune-Ahmednagar Road, Viman Nagar, Pune, Maharashtra - 411 014","location":"Pune","experience":"5 - 10 Years"},{"date":"2 - Nov - 2019","skills":"Software Testing, Automation Testing, Manual Testing","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Syncfusion Software Private Limited, AJ-217, 4th Avenue, Shanthi Colony, Anna Nagar, Chennai - 600 040.","phone":"Not Provided","profile":"Software Testing Engineer \nSyncfusion Software Private Limited","description":"Syncfusion Software Private Limited is looking for Testing Engineers to be based in Chennai. Syncfusion is a fast paced, growing organization that offers a challenging work environment with excellent rewards for the right candidate. Eligibility Criteria: BE/ B.Tech, ME/ M.Tech, M.Sc, MCA with over 65% in all academics. 2019 pass-outs with minimum 65% in all academics No gaps of any kind Experience : Not required but candidates with relevant experience will be preferred. Requirements: Strong knowledge of software testing. Candidates with knowledge of automated testing will be preferred. Basic knowledge of a programming language will be preferred. Knowledge of web, desktop and mobile testing is essential. Should have good overall communication skills. Should be willing to learn on the job and progress quickly. Should be hard working and self-motivated. Roles and Responsibilities: Perform manual and automated testing under tight deadlines. Be responsible for accurately recording issues with all relevant details. Able to switch between products and platforms with ease. Handle other tasks as assigned. Walk-in Date: 2nd November 2019 Timings : 10:00 AM to 2:00 PM Interview Venue: Syncfusion Software Private Limited, AJ-217, 4th Avenue, Shanthi Colony, Anna Nagar, Chennai - 600 040. Contact - Daniel Jebaraj Email ID - recruitment@syncfusion.com","location":"Chennai","experience":"0 - 1 Years"},{"date":"29, 30, 31 - Oct - 2019","skills":"Software Testing, Functional Testing, Quality Control","qualification":"B.E./B.Tech, B.Sc, BCA/BCS","address":"NIIT Limited, A-24, Infocity 1, Sector 34, Gurgaon, Haryana","phone":"0124-4916889","profile":"Manual Testing Engineer \nNIIT Limited","description":"Qualification: B.Tech/ BCA Candidates can apply Experience: 0 to 2 year of Experience Required Skills : Open to work in rotational shift. (Cab will be provided for both side) Must have an outgoing personality and skills in speaking, organizing, listening, Excellent leadership, communication and decision making skills Proficient in Computer (MS Office) and English language Well organized and customer focused. Attention to detail and an ability to work easily with others. Ability to work independently in a flexible and adaptable manner. Working globally, covering different time zones and languages is key Understand and execute test cases. Find bugs and describe them in a concise and clear manner and in customer-facing language. Walk-in Date: 28 October - 1st November 2019 Timings : 10 am to 2 pm Interview Venue: NIIT Limited A-24, Infocity 1, Sector 34, Gurgaon, Haryana Contact Prson- Deepak (0124-4916889)","location":"Gurgaon","experience":"0 - 2 Years"},{"date":"29, 30, 31 - Oct - 2019","skills":"test engineering, automation testing, test cases, manual software testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Adaequare Info Private Limited, Northeast Block, First Floor, Display Building, NAC Campus, Kondapur Post, Cyberabad, Hyderabad - 500 032.","phone":"Not Provided","profile":"Automation Test Engineer \nAdaequare Info Private Limited","description":"The candidate will be responsible for preparing the test cases, automating the test cases. Reporting the defects.should have knowledge on Complete QA process. Shows creativity and initiative to improve product coverage and effectiveness. Must have Excellent Communication Skills. Right attitude and work ethic. Flexible to multitask and hunger to learn. Work Experience: 3 to 4 Years Notice period : 15 Days. Interested candidates can walk-in on below address and also forward resumes on mgurukani@adaequare.com Walk-in Date/ Time: 28 October - 8th November , 10 AM onwards Interview Venue: Adaequare Info Private Limited Northeast Block, First Floor, Display Building, NAC Campus, Kondapur Post, Cyberabad, Hyderabad - 500 032. Contact Person- Deepika Agarwal","location":"Hyderabad","experience":"3 - 4 Years"},{"date":"29 - Oct - 2019","skills":"Office Administration, General Administration, Housekeeping Facilities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Datamatics Global Services Limited, Knowledge Center (Head office), Plot No. 58, Road No.17, MIDC, Andheri (East), Mumbai - 93.","phone":"Not Mentioned","profile":"Administration Executive \nDatamatics Global Services Limited","description":"Key Personality Traits required- * Team player * Decision-making skills * Liasoning skills (with both government & non-government officials) * Flexibility for shift-timings / additional work hours, if required * Excellent communication skills [English Written and Verbal] * Computer proficiency (MS Excel and Word are must) Job Responsibilities- * House Keeping * Maintenance work * AMC Renewal * Client Hospitality / Event Management * Reports * General administration Walk-in Date: Tuesday, 29th October 2019 Timings: 11.00 am - 2.00 pm Interview Venue: Datamatics Global Services Limited Knowledge Center (Head office), Plot No. 58, Road No.17, MIDC, Andheri (East). Mumbai - 93. Landmark - ESIC Corporate Office/ Gautam Nagar Bus stop Contact - Priyam Vyas","location":"Mumbai","experience":"2 - 5 Years"},{"date":"28, 29, 30, 31 - Oct - 2019","skills":"Office Administrative Activities, Facility Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"DIN Engineering Services LLP, B - 106, Sector - 2, Noida. Nearest Metro Station Sector - 15","phone":"9315912452","profile":"Administration Executive \nDIN Engineering Services LLP","description":"Candidate must have good knowledge Microsoft Outlook, MS Word, MS Excel, PPT etc Familiar with all office administrative activities Must have excellent Interpersonal Skills Must be a team player Job Responsibility- Administration of entire office during night shift Facility management of the entire office in the night shift Coordination with vendors, taking quotations and cost negotiations Preparing quotations, invoices, different vouchers and receipts Walk-in Date/ Time: 28 October - 1st November, 10 AM onwards Interview Venue: DIN Engineering Services LLP, B - 106, Sector - 2, Noida Nearest Metro Station Sector - 15 Contact - Sanah Siddique (9315912452)","location":"Noida","experience":"1 - 2 Years"},{"date":"26 - Oct - 2019","skills":"Core Java/ Swing, Object-Oriented Concepts","qualification":"B.E./B.Tech, MCA/PGDCA","address":"QuEST Global Engineering Services Pvt. Limited, QuEST Towers, Technopark, Trivandrum, Kerala","phone":"Not Provided","profile":"Core Java Developer \nQuEST Global Engineering Services Pvt. Limited","description":"Candidate should have 2 to 8 years of experience in design and development of software applications and frameworks. Must have strong experience in developing Linux/ Unix based desktop applications using Core Java. Deep knowledge in Object-Oriented concepts and experience in implementing the same using Java. Essential Job Functions: Design and development applications using Core Java/ Swing. Take ownership of assigned jobs that are part of new feature implementations, bug fixes and enhancement activities. Technical communication with internal and external stake holders will be part of job. If you are interested for the said opportunity, kindly walk-in for an interview with your updated resume, and a passport sized photograph. Date & Time : 26th October 2019 Timings: 9.00 AM to 2.00 PM Interview Venue: QuEST Global Engineering Services Pvt. Limited QuEST Towers, Technopark, Trivandrum, Kerala","location":"Trivandrum","experience":"2 - 8 Years"},{"date":"26 - Oct - 2019","skills":"HR Assistance, General Administration, Data Entry","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Bergenia Consultancy Services Private Limited, Office No. 904, 9th Floor, Bhumiraj Costarica, Plot No. 1&2, Sector 18, Palm Beach Road, Sanpada, Navi Mumbai - 400 705","phone":"Not Specified","profile":"Office Assistant (HR/ Admin/ General) \nBergenia Consultancy Services Private Limited","description":"Candidate should be Any Graduate with 60% in last year / Freshers Or 1 year experience. Should be Flexible and open to learn / Co-ordination with other employees / If required Data entry. Must have good communication skills (English & Hindi), Good In Drafting Mail, Good In Excel/ Word Salary from 17K to 22K (ONLY MALE CANDIDATE) No. of Positions - 2 (IMMEDIATE JOINING) Candidates should be from NAVI MUMBAI Walk-in Date: 26th October 20019 Timings: 10.30 am to 4.30 pm. Interview Venue: Bergenia Consultancy Services Private Limited Office No. 904, 9th Floor, Bhumiraj Costarica, Plot No. 1&2, Sector 18, Palm Beach Road, Sanpada, Navi Mumbai - 400 705 Contact Person- Rakesh Chavan","location":"Mumbai","experience":"0 - 1 Years"},{"date":"25, 26, 28, 29, 30, 31 - Oct - 2019","skills":"Core Java/ J2EE, Spring, JDBC, Hibernate, SQL Sever","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Nexgile Technologies Private Limited, 4th Floor, Win-Win Towers, Tower B, Hi-Tech City, Hyderabad - 500 081","phone":"9989343212","profile":"Core Java Developer \nNexgile Technologies Private Limited","description":"Qualification: Degree or Above Need to have good communication skills and interpersonal skills Required Skills: Strong knolwdge in Core Java/ J2EE, Strong in Spring Strong in JDBC Hibernate, SQL Sever Walk-in Date/ Time: 22nd October - 20th November , 10 AM onwards Interview Venue: Nexgile Technologies Private Limited 4th Floor, Win-Win Towers, Tower B, Hi-Tech City, Hyderabad - 500 081 Contact Person- Siva Sai (9989343212)","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"26, 28, 29, 30, 31 - Oct - 2019","skills":"HR Administration/ HR Functions, Office Administration","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Nico Digital Private Limited, 33A Jawaharlal Nehru Road 10th Floor Room 10 Chatterjee International Center Kolkata - 700 071","phone":"98301 57668","profile":"HR & Administration Executive \nNico Digital Private Limited","description":"Candidate must have EXCELLENT English communication and interpersonal skills - This is the most important skill-set for this position, and we request you NOT to apply for this position if you cannot rate yourself 10/10 in communication. Job Responsibility- 1. Handling parts of our internal recruitment process. 2. Screening & short listing candidates for the initial stages of recruitment. 3. Follow up with candidates till the joining date and coordinate with the candidates until they get settled. Walk-in Date/ Time: 26 October - 30 November , 11 AM onwards Interview Venue: Nico Digital Private Limited 33A Jawaharlal Nehru Road 10th Floor Room 10 Chatterjee International Center Kolkata - 700 071 (Beside Park Street Metro Station) Contact Person- Malinee Dutta Phone No: +91 98301 57668","location":"Kolkata","experience":"0 - 3 Years"},{"date":"24, 25 - Oct - 2019","skills":"Technical Support/ Service Desk/ Hardware Support/ IT Help-desk/ Network Support","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Tech Mahindra Limited, Software Development Block -4 Ground Floor, ODC-1 602/3, Elcot SEZ, Sholinganallur Village, Chennai - 600 119.","phone":"Not Provided","profile":"Service Desk/ Technical Support \nTech Mahindra Limited","description":"Hiring going-on for Associate - Service Desk Support (International Voice). Tech Mahindra Limited is looking for Immediate Joiners and Graduation is must. Candidate should have 0 to 2 years of experience in Technical Support/ Service Desk/ Hardware Support/ IT Help-desk/ Network Support. Must have strong knowledge of Microsoft based operating systems with emphasis on Windows 7, Windows 10 and Office 2013. Should have strong communication skills. Experience from International Support. Good knowledge on outlooks, Active Directory, VPN, and Network Printer will be preferred. Can join Immediately. Ready to work in 24/7 environment. Job Responsibility: Voice Support & technical Support to ensure closure as per ITIL Incident Management process. Follow-up/ update ticket for every call to ensure timely closure. Call ownership, drive to resolution and communication with Client. Perform Life Cycle of Incident Management Process. Telephonic support to End Users and co-ordination with Vendors, Client Problem Management team. Proactive monitoring & Perform documented Escalation process. Troubleshooting on Application Support (Off Shelf or Customized) Troubleshooting on Printers & MFDs Troubleshooting on VPN software and Collaboration tools Troubleshooting on Password Reset tools and Remote Control tools Troubleshooting of MS Windows & Office, Desktops, Laptops, iPAD Peripherals and Networking Troubleshooting Application and Workplace IT & Communications & Collaboration Support Experience with using and troubleshooting Outlook 2013 within a network environment (permissions, calendar sharing, delegation) Essential Skills/ Experience: Exposure on ticketing tools Exposure to similar role for a minimum of 6 months - 2 years Experience of working in 24/7 environment. Exposure on Printer/Scanner or other h/w resolutions. Walk-in Date/ Time: 24th & 25th October 2019, 10 AM onwards Interview Venue: Tech Mahindra Limited, Software Development Block -4 Ground Floor, ODC-1 602/3, Elcot SEZ, Sholinganallur Village, Chennai - 600 119. Contact Person- Prithvi","location":"Chennai","experience":"0 - 2 Years"},{"date":"24, 25 - Oct - 2019","skills":"ASP. NET framework, SQL Server and Design/ Architectural Patterns","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Aforeserve.com Limited, B - 21, Sector - 8, Noida. Landmark: Near Swani Furniture. Nearest Metro - Sector - 15 Noida","phone":"7303898936","profile":"ASP .Net/ MVC Developer \nAforeserve.com Limited","description":"We have an urgent opening for 'ASP .Net MVC Developer' profile with our company Aforeserve.com Limited Educational Qualification: B.Tech/ BE or MCA Work Experience: 1 to 3 Years Job Location:- Noida Candidate must have proven experience as a .NET Developer or Application Developer Familiarity with the ASP. NET framework, SQL Server and design/architectural patterns (e.g. Model-View-Controller (MVC)) Knowledge of at least one of the .NET languages (e.g. C#, Visual Basic .NET) and HTML5/CSS3 Familiarity with architecture styles/APIs (REST, RPC) Understanding of Agile methodologies Excellent troubleshooting and communication skills Ability to develop large scale web/database applications Walk-in Date/ Time: 24th & 25th October 2019, 10 AM onwards Interview Venue: Aforeserve.com Limited B - 21, Sector - 8, Noida. Landmark: Near Swani Furniture Nearest Metro - Sector - 15 Noida Contact Person: Gaurav Singh Contact no. 7303898936 Interested candidates can send the updated profiles at gaurav.s@aforeserve.co.in with below details: Current Inhand Expected inhand Notice period Or directly call at 7303898936","location":"Noida","experience":"1 - 3 Years"},{"date":"23, 24, 25 - Oct - 2019","skills":"ASP .Net, jQuery C# .Net MVC 5, API, MySQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Amnet Systems Private Limited, No. 501, 3rd Floor, JVL Plaza, Anna Salai, Teynampet, Chennai - 18. Landmark -Voltas & SIET College Signal)","phone":"Not Provided","profile":"ASP .Net Developer \nAmnet Systems Private Limited","description":"Candidate should be Any Graduate with minimum 2 to 4 years experience in following technology- ASP .Net (2+ years) jQuery C# .Net MVC 5, API MySQL Microsoft .NET technologies Visual Studio Walk-in Date/ Time: 22nd - 25th October from 9 AM onwards Interview Venue: Amnet Systems Private Limited No. 501, 3rd Floor, JVL Plaza, Anna Salai, Teynampet, Chennai - 18. Landmark -Voltas & SIET College Signal)","location":"Chennai","experience":"2 - 4 Years"},{"date":"24, 25, 26, 28, 29, 30, 31 - Oct - 2019","skills":"Asp .NET, Javascript, JQuery, Angularjs, SQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Suvarna Technosoft, Plot No. 8, Durga Nagar Colony, Opposite Chandana Brothers Lane, Aneerpet, Hyderabad - 500 016.","phone":"9963426420","profile":"ASP .Net Developer \nSuvarna Technosoft","description":"Candidate should be Any Graduate with 0 to 1 year of experience. Must be proficient in Asp .NET, Javascript, JQuery, Angularjs, SQL. Walk-in Date/ Time: 21st - 31st October 2019, 11 AM onwards Interview Venue: Suvarna Technosoft Plot No. 8, Durga Nagar Colony, Opposite Chandana Brothers Lane, Aneerpet, Hyderabad - 500 016. Contact Persson- Mr. Bhupathi Srinivas Tel No: 9963426420","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"24, 25, 26 - Oct - 2019","skills":"Technical Support, International Voice Process, Customer Support","qualification":"Diploma, B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Tech-Mahindra Limited, Takshashila Block, Gate-1, Survey No. 62/1 A, Qutubullapur Mandal, Bahadurpally, Hyderabad, Telangana - 500 043.","phone":"6303224297","profile":"Technical Support Associate \nTech Mahindra Limited","description":"Qualification: Undergraduate/ Graduate/ Post Graduate Experience from BPO background is only considered Should have excellent communication skills (Oral & Verbal) Must be flexible working for Rotational shifts Looking for Immediate Joiners Candidate should be aware of basic technical knowledge in LAN, WAN and handling basic Internet issues. Troubleshooting of technical related issues and ensure to resolve the issues or queries over the call. Research, diagnose, troubleshoot and identify solutions to resolve customer issues. Core Competencies: Pleasant, professional and courteous personality. Excellent Problem Solving and Customer Service Skills Ability to think creatively and should have positive attitude. Strong analytical & Interpersonal skills Walk-in Date/ Time: 22nd - 26 October 2019, 12 PM onwards Interview Venue: Tech-Mahindra Limited, Takshashila Block, Gate-1, Survey No. 62/1 A, Qutubullapur Mandal, Bahadurpally, Hyderabad, Telangana - 500 043. List of Mandatory Documents required: Resume Passport Size photographs All Educational Certificates & Experience Certificates(Xerox Copies) Original ID Proof- DL / Passport / PAN Card / Voter ID/ Aadhar card. Govt Original ID proof and same Xerox copy of original ID proof. Contact Person- Bhagya Lakshmi ( 6303224297 )","location":"Hyderabad","experience":"1 - 5 Years"},{"date":"24, 25 - Oct - 2019","skills":"General Administration, Front Office Management, Office Coordination","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Kotak Mahindra Life Insurance Company Limited, Neelima Nirupama, 4th Floor, Plot No- 55, Old no -22A, Vijay Raghava Road, T Nagar, Near Andhra Club, Chennai - 600 017.","phone":"Not Provided","profile":"Admin Executive (Female) \nKotak Mahindra Life Insurance Company Limited","description":"Candidate should be a Graduate with min 6 month work-experience. Age should not be more than 28 Knowledge of Admin role is a must Aware of Local language must Preferences -(Only Female Candidates can apply) Candidates with experience in the below profiles will not be suitable - (Tele calling or customer care profiles (Insurance, Credit card, Holiday Selling etc), Sales background, Account Assistant/Purchase Assistant, Secretaries/Receptionists, Telephone Operators and Admin profiles from educational institutions.) Walk-in Date/ Time: 24 October - 25 October , 11 AM onwards Interview Venue: Kotak Mahindra Life Insurance Company Limited Neelima Nirupama, 4th Floor, Plot No- 55, Old no -22A, Vijay Raghava Road, T Nagar, Near Andhra Club, Chennai - 600 017. Contact - Jayshree Bhati ( 022-66057050 )","location":"Chennai","experience":"0 - 1 Years"},{"date":"24, 25 - Oct - 2019","skills":"Technical Support, Voice Process, Customer Support","qualification":"Diploma, B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"[24]7 Customer Private Limited, Ground Floor NSL Arena Town Centre, Behind Cricket Stadium, Ramanthapur Road, Uppal, Hyderabad - 500 039.","phone":"Not Provided","profile":"Technical Support Executive \n[24]7 Customer Private Limited","description":"Eligibility Criteria: Under Graduate/ Graduate & Postgraduate - Freshers and experienced are eligible to apply. Skills Required: Good Verbal and Written Communication skills. Good logical reasoning & analytical skills. Able to interact with customers via chat, should be able to answer servicing questions. Able to work in rotational night shifts (US). Interview Rounds: Personal Introduction Round Online Test Operations Round Benefits: Free Transport facility both ways (Home Pick and Home Drop) Walk-in Date: 24th & 25 October 2019 Interview Time: 10:30 am to 3 pm Venue Address: [24]7 Customer Private Limited, Ground Floor NSL Arena Town Centre, Behind Cricket Stadium, Ramanthapur Road, Uppal, Hyderabad - 500 039. Landmark: Next to Bhadra's Grand. NOTE: Kindly Carry copy of your Resume and ID proof Xerox Copy. Mention 'Swathi 025' on the top of the resume.","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"24, 25 - Oct - 2019","skills":"C#, SQL, .NET, ASP .NET","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Chamunda Tech-Net Services Pvt. Limited, 401, L Wing Tex Center Naryan Plaza Chandivali Andheri (East) Mumbai","phone":"Not Provided","profile":"Software Developers (.Net) \nChamunda Tech-Net Services Pvt. Limited","description":"Candidate should be BE/ B.Tech or MCA with excellent knowledge of C#, SQL, .NET, ASP .NET Walk-in Date/ Time: 18th October - 25 October , 11 AM onwards Interview Venue: Chamunda Tech-Net Services Pvt. Limited 401, L Wing Tex Center Naryan Plaza Chandivali Andheri (East) Mumbai Contact Person- Rupesh Patil","location":"Mumbai","experience":"1 - 5 Years"},{"date":"24, 25 - Oct - 2019","skills":"General Administration, Travel Desk, Customer Management, Housekeeping","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"FM India Supply Chain Private Limited, 2nd Floor, A. G. Technology Park, Server Space, Off I.T.I Road, Aundh, Pune - 411 007.","phone":"Not Provided","profile":"Senior Executive - Admin \nFM India Supply Chain Private Limited","description":"Person would be responsible for all Housekeeping and Security supervision and also he needs to make regular visits to the premises of the organization on regular interventions. Be a part or implementation of policies and rules made by the management. Statutory compliance and maintaining records Office maintenance Catering management Transportation arrangements Accommodation booking Travel ticket booking Stationery and other purchase part handling Housekeeping day to day role and functions tracking. Ensure planning and execution of preparations for smooth operations. Coordinate and Cooperate with all staff executives, supervisors, & company staffs. Walk-in Date/ Time: 24 October - 25 October , 10 AM onwards Interview Venue: FM India Supply Chain Private Limited 2nd Floor, A. G. Technology Park, Server Space, Off I.T.I Road, Aundh, Pune - 411 007. Contact Person- Bablesh Kaushik","location":"Pune","experience":"2 - 5 Years"},{"date":"31 - Oct - 2019","skills":"Application Support, Customer Support, Technical Support, Software Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Cirrius Technologies Private Limited, Cirrius Centre A-19 MIDC Area Cross Road B Andheri (East) Mumbai - 400 093","phone":"Not Provided","profile":"Technical Support/ Business Analyst \nCirrius Technologies Private Limited","description":"Candidate should be Any Graduate with 0 to 2 years of relevant experience Must have excellent verbal & written communication skills. Ability to understand and grasp software products Customer management skills Good knowledge in Excel Required Skills- Techno-Functional Role Handling customer queries over phones and emails. Ensuring resolution within stipulated time coordination with development team. Product Training, Customer Data management using excel Software Requirement Documentation Walk-in Date: 31st October, 2019 Time : 10:00 AM to 12:00 Noon Interview Venue: Cirrius Technologies Private Limited Cirrius Centre A-19 MIDC Area Cross Road B Andheri (East) Mumbai - 400 093 Railway Station: Ghatkopar (Central)/ Andheri (Western) Landmark: JB Nagar/ Chakala (Metro Stn.), MIDC Police Station Contact Person- Ms. Ruchira Candidates who have appeared in past 6 months are not eligible for an interview.","location":"Mumbai","experience":"0 - 2 Years"},{"date":"23, 24, 25 - Oct - 2019","skills":"General Administration, Facility Management, Housekeeping, Security","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Verity Global Solutions Private Limited, 402, 4th Floor, Synergy Park, Goregaon (East), Mumbai - 400 063.","phone":"Not Provided","profile":"Admin Executive (Female) \nVerity Global Solutions Private Limited","description":"Qualifications: Any Graduation (Female applicants only) 0-3 years of experience in the field or in a related area. Must have proven admin or assistant experience Proficient in MS Office Knowledge of office management systems and procedures Excellent time management skills and ability to multi-task and prioritize work Attention to detail and problem-solving skills Excellent written and verbal communication skills Strong organizational and planning skills Walk-in Date/ Time: 21st October - 25 October , 3 PM onwards Interview Venue: Verity Global Solutions Private Limited, 402, 4th Floor, Synergy Park, Goregaon (East), Mumbai - 400 063. Contact Person - Karthik","location":"Mumbai","experience":"0 - 3 Years"},{"date":"24, 25, 26 - Oct - 2019","skills":".Net Framework 4.5+ ASP .NET MVC C# JavaScript CSS SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Mouser Electronics India Private Limited, No.9, 5th Floor, Esquire Centre, Mahatma Gandhi Road, Bangalore - 560 001.","phone":"7349371940","profile":"Web/ .Net Developer \nMouser Electronics (India) Private Limited","description":"Requires a Bachelors degree and at least 3 to 6 years of experience in Web Development making use of several of the languages, tools, and applications listed in the Skills section of this document. Required Skills: Thorough knowledge of: .Net Framework 4.5+ ASP .NET MVC C# JavaScript CSS SQL Server 2012/2016 Visual Studio 2015/2017 Knowledge of: Team Foundation Server (TFS) ASP.NET Web Forms JQuery Bootstrap Web API/ WCF/ REST Web Services LINQ XML JSON AJAX HTML5 Unit test frameworks Source Code Control (SCC) apps Agile and Scrum methodologies CERTIFICATIONS Preferred: Microsoft Certified Solutions Associate (MCSA): Web Applications Walk-in Date: 23rd - 26th October 2019 Time: 12:00 PM to 5:00 P.M Venue Details: Mouser Electronics India Private Limited No.9, 5th Floor, Esquire Centre, Mahatma Gandhi Road, Bangalore - 560 001. Mobile No- 7349371940 Contact - Abhilasha Kumari","location":"Bangalore","experience":"3 - 6 Years"},{"date":"24, 25 - Oct - 2019","skills":"Technical Support, Voice Process, Customer Support","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"GENPACT India Private Limited, Salarpuria Soft Zone, Bellandur Bengaluru. Next to Indian Oil Petrol Bunk,","phone":"Not Provided","profile":"Technical Support (Voice Process) \nGENPACT India Private Limited","description":"Required Skills : 1. Excellent Communication skills in English 2. Freshers till Max 18 months experience in Tech Support and Customer Service(Any domain) 3. Demonstrated proficiency in English & Hindi 4. Must be able to work on flexible schedule 5. Fresher's are good to hire. 6. Must be willing to work for 24*7 shifts Responsibilities : 1. Need to support Tech support. 2. Respond to Customer inquiries and problem escalations. 3. Provide E-mail and Phone support to trouble shoot and resolve issues experience. 4. Provide excellent Tech service to our customers. Walk-in Date: 24th & 25th October 2019 Timings: 11 am to 2 pm Interview Venue- GENPACT India Private Limited, Salarpuria Soft Zone, Bellandur Bengaluru Next to Indian Oil Petrol Bunk, Please carry the below mentioned documents: 1) Updated Resume 2) Passport Size Photo 3) Aadhar Card","location":"Bangalore","experience":"0 - 2 Years"},{"date":"23, 24, 25 - Oct - 2019","skills":".NET, C#, Web coding, MVC","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Galax E. Solutions India Pvt. Limited, 1st Floor, Voyager Building ITPL, Bangalore.","phone":"080-41429658","profile":".Net Developer \nGalax E.Solutions India Private Limited","description":"Person must have strong .NET, C#, Web coding skills, with emphasis on MVC Strong JavaScript skills including jQuery coding experience Ability to work with front-end web technologies like HTML5/ CSS3/ Bootstrap/ Responsive Design Ability to write and troubleshoot SQL beyond basic CRUD Experience using Git and standard Git based repos & workflows Experience with Test Driven development(TDD) Good to have Familiarity with cloud technologies like AWS/Azure is plus Familiarity with .NET Core 2.x Familiarity with DevOps concepts is plus(Bit bucket pipelines, Bamboo, Jenkins , Azure Deployment , AWS Code Deploy or similar CI/CD pipelines) Any experience with scripting language like PowerShell/bash is plus Walk-in Date/ Time: 23 October - 25 October , 10 AM onwards Interview Venue: Galax E. Solutions India Pvt. Limited 1st Floor, Voyager Building ITPL, Bangalore. Land Mark : Near Hotel Taj Vivanta & Park Square Mall Contact Person- Padmini Tel: 080-41429658","location":"Bangalore","experience":"3 - 8 Years"},{"date":"23 - Oct - 2019","skills":"Manual testing, Test Methodology & well versed with STLC","qualification":"B.E./B.Tech, MCA/PGDCA","address":"VSERV Business Solutions Private Limited, 605-610, 6th floor, Bestech Business Tower, Sector 48, Sohna Road, Gurgaon.","phone":"0124-4967200","profile":"Manual Testing Engineer \nVSERV Business Solutions Private Limited","description":"Candidate must have at least 2 years of relevant experience in Manual testing. Firm Understanding of Test Methodology & well versed with STLC. Must have Firm Knowledge of complete testing life cycle -- like test specification preparation, test execution, test reporting, test-bed configuration, bug reporting, for multiple product releases. Conduct test design impact analysis for proposed changes or for problems in system. Review test plans submitted by support SQA Engineers for assigned projects Candidate should have hands on expertise on e-commerce domain. Candidate must have experience on Integration testing. Walk-in Date/ Time: 23 October 2019, 10 AM onwards Interview Venue: VSERV Business Solutions Private Limited, 605-610, 6th floor, Bestech Business Tower, Sector 48, Sohna Road, Gurgaon. Contact Person: Akhil Malhotra/ 9818920350 If interested, then kindly send your updated resume along with below information/ details on akhil.malhotra@intsof.com Current CTC Expected CTC Joining Time Availability for F2F Interview (Oct 22 & 23, between 9 AM 3 PM)","location":"Gurgaon","experience":"2 - 4 Years"},{"date":"23 - Oct - 2019","skills":"Manual Testing, Automation Testing, API testing, SQL Queries","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Prime Focus Technologies Limited, 5B, RMZ Eco World, Bellandur, Devarabeesanahalli, Bangalore","phone":"Not Specified","profile":"Software Testing - Trainee \nPrime Focus Technologies Limited","description":"Candidate must have good knowledge in Manual testing, Automation Testing & Open source test automation tool. Knowledge in open source web automation tools (selenium preferred) along with knowledge of commonly used Test Design patterns, externalizing configurations etc. Trained on Manual Testing, Automation Testing, API testing, SQL Queries and end to end testing. Ability to proactively identify, analyses and solve problems effectively Must have good problem solving techniques & Interpersonal skills. Key Responsibilities: Develop and apply testing processes for new and existing products to meet client needs Monitor debugging process results Reviewing quality specifications and technical design documents to provide timely and meaningful feedback Creating detailed, comprehensive and well-structured test plans and test cases Perform thorough regression testing when bugs are resolved Walk-in Date/ Time: 23 October 2019, 9 AM onwards Interview Venue: Prime Focus Technologies Limited 5B, RMZ Eco World, Bellandur, Devarabeesanahalli, Bangalore Contact Person- Sreehari RaghavanNair","location":"Bangalore","experience":"0 - 1 Years"},{"date":"23, 24, 25 - Oct - 2019","skills":"Automation Testing, Test case writing, Test Execution and tools like Selenium","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Xybion (India) Private Limited, 117, Ratha Tek Towers, 1st Floor, OMR, Okkiyam Thoripakkam, Chennai - 600 097","phone":"Not Provided","profile":"Automation Tester \nXybion (India) Private Limited","description":"Candidate should be BE/ B.Tech or MCA with 2 to 5 years of experience in Automation Testing Having experience in test case writing, authoring, execution is preferred Good knowledge in tools like Selenium is preferred Only Immediate Joiner required Walk-in Date/ Time: 22nd October - 25 October , 12 PM onwards Interview Venue: Xybion (India) Private Limited 117, Ratha Tek Towers, 1st Floor, OMR, Okkiyam Thoripakkam, Chennai - 600 097 Contact Person- SUGANYA","location":"Chennai","experience":"2 - 5 Years"},{"date":"23, 24, 25 - Oct - 2019","skills":"Software Testing, Manual Testing, Test Plan Preparation, Test Scenarios, Regression Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Wipro Olympia Technology Park, Altius Block, Guindy, Chennai, Tamil Nadu - 600 032.","phone":"044-61454000","profile":"Manual Testing Engineer \nWipro HR Services (India) Private Limited","description":"Candidate should be BE/ B.Tech (CS, IT, ECE) or MCA with 4 to 6 years of work experience in Testing-Manual, SQL Query write ups-Multiple complex Joints creation. Should able to interpret Clients requirement and provide analysis & updates (configuration) in the system. Should have experience in benefits administration preferably in Health or Insurance sector. Experience in creating test plans, identifying test cases and perform test execution. Ability to understand and build logics in a coding language.. Experience in relational databases, ability to write SQL queries. Experience in MS Office tools specifically MS Excel. Experience with project-based work structures, project lifecycle models, etc. Experience in the development and implementation of software solutions. Ability to communicate ideas in both technical and user-friendly language. Ability to conduct research into application development issues and products. Ability to translate client requirements and/or legislation into system specifications. Experience working in a team-oriented, collaborative environment. Preferred Experience: Experience in US/ CAN Health benefits domain and benefits administration (Optional) Should possess good Testing Knowledge and SQL Queries Should able to communicate on Requirement Analysis in the project involved Knowledge of Software Development Life Cycle (SDLC) principles/ concepts. Experience working with mainframes sessions. Experience in VB Scripting in MS Excel. Experience in working in a client-vendor relationship. Must have Excellent Communication Skills Walk-in Date/ Time: 21st October - 25 October , 12 PM onwards Interview Venue: Wipro Olympia Technology Park, Altius Block, Guindy, Chennai, Tamil Nadu - 600 032. Contact Person - MONICA (044-61454000)","location":"Chennai","experience":"4 - 6 Years"},{"date":"21, 22, 23, 24, 25, 26 - Oct - 2019","skills":"US based Back Office process (B2B Campaign), Documents Processing","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Info-X Software Technology Pvt. Limited, 335 Udyog Vihar Phase 2 Gurugram - 122 016","phone":"9910768257","profile":"Back Office Executive \nInfo-X Software Technology Pvt. Limited","description":"Walk-in Interview from 21st October 2019 till 8th November 2019 Timings 4:000 PM to 6:00 PM Qualification: Graduates with streams like BA, B Com, B Sc Minimum experience 1 Year to 6 Years. Candidates with experience is Voice Campaigns/ Blended Process can also apply Should be good at Typing speed with Good Accuracy. (Typing speed of less than 25 wpm is not eligible) Job Responsibility: US based Back Office process (Business to Business Campaign) Processing of Documents for US based clients. Free Meal Kindly Walk-in for Interview from 21st October 2019 till 8th November 2019 (between 4:00 PM to 6:00 PM) at below mention address. (No Interviews on Saturday and Sunday) Info-X Software Technology Pvt. Limited 335 Udyog Vihar Phase 2, Gurugram - 122 016 Contact Person: Sanjay (9910768257) Email: pramod@infoxwebware.net","location":"Gurgaon","experience":"1 - 6 Years"},{"date":"21, 22, 23, 24, 25, 26 - Oct - 2019","skills":"Non-Voice /Back Office Process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Hinduja Global Solutions Limited, International InfoTech Park, Above Vashi Railway Station, Tower No. 1, 4th floor, Vashi Navi Mumbai -400 703.","phone":"Not Provided","profile":"Back Office Associate (Non Voice) \nHinduja Global Solutions Limited","description":"Eligibility Criteria: Candidate should be Graduate (Compulsory) Any Graduates can apply (Except B.E & B.Tech) Good Communication Skills in English, Hindi Job Responsibility- Non-Voice /Back Office Process 9 working hours inclusive of 1 hrs break. 5 working days and Saturday and Sunday off Needs to be in compliance with all the operational requirements and work as per the company's norms and policies. Transport Boundaries: Wadala Byculla Panvel Dombivli Flexible to work in Shifts (24*7 Shift) (Day and Night) Transport Provided. Walk-in Date/ Time: 21st October - 30 November, 2019 (10 AM onwards) Interview Venue:- Hinduja Global Solutions Limited International InfoTech Park, Above Vashi Railway Station, Tower No. 1, 4th floor, Vashi Navi Mumbai -400 703 Contact Person- Athar","location":"Mumbai","experience":"0 - 1 Years"},{"date":"22 - Oct - 2019","skills":"HR Operations, Exit Management, Benefits Administration, Data Management","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Bajaj Housing Finance Limited (BHFL), B2 Fifth Floor, Cerebrum IT Park, Kumar City, Kalyani Nagar, Pune","phone":"Not Provided","profile":"Officer - HR Operations \nBajaj Housing Finance Limited (BHFL)","description":"Requirements: Graduate/ MBA (HR) with good knowledge of Excel is mandatory Must have good communication skills Immediate joiner (in a weeks time) Type - 3rd Party Payroll Working Days - Mon to Sat Roles & Responsibilities- Internal Job Postings Background Verification (BGV) Pre & Post Joining On-boarding Employee Exit Management: Vendor Management & Employee Benefits Administration Employee File Digitization, Audit Data Management & Analytics and Audit Walk-in Date - 22nd October 2019 Time - 9 AM to 5 PM Only Interview Venue: Bajaj Housing Finance Limited (BHFL) B2 Fifth Floor, Cerebrum IT Park, Kumar City, Kalyani Nagar, Pune","location":"Pune","experience":"0 - 3 Years"},{"date":"21, 22 - Oct - 2019","skills":"Office Administration, Front Office/ Reception Activities, Interpersonal Skills","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"SMC Global Securities Limited, Poddar Court 18, Rabindra Sarani Gate No. 4 Floor 5 Kolkata -700 001","phone":"03366127113","profile":"Front Office Executive (Female) \nSMC Global Securities Limited","description":"Any Graduate with minimum 0- 3 years experience in Front Office Basic Computer Knowledge /Professional attitude and appearance Ability to be resourceful and proactive when issues arise Fluent in English communication Excellent organizational skills Must have pleasing personality Freshers With good Communication and interpersonal skills are welcome Only Female Candidate can apply Job Responsibility- Attending calls, Handling Reception Guest & Associate calls Attending the visitors and solving their queries Maintaining Courier, Material Register & Other Records Greeting & Assisting Visitors & Guests Monitor House-keeping Internal Cleanliness Assisting office administration in miscellaneous routine works Maintaining the attendance of Sub-staff in CRM Walk-in Date/ Time: 21st - 22nd October 2019 from 11 AM onwards Interview Venue: SMC Global Securities Limited Poddar Court 18, Rabindra Sarani Gate No. 4 Floor 5 Kolkata -700 001","location":"Kolkata","experience":"0 - 3 Years"},{"date":"21, 22, 23, 24, 25, 26 - Oct - 2019","skills":"front desk, front office coordination, cash handling","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Rainbow Hospital C -16 & 17, Vikrampuri Colony Secunderabad. Landmark: Near Bata Show Room","phone":"9000234491","profile":"Front Office Executive/ Coordinator \nRainbow Childrens Medicare Pvt. Limited","description":"Rotational Shift includes Night Shifts. Cash Handling. Handling the help desk Communicating with patient and the doctors Attending to patient queries/clarifications. Maintaining the patient inflow records doctor wise. Making sure all the consultant rooms maintained as per the doctor requirements. Updating the doctor timings on day to day basis. Maintaining the total OPD patient inflow count per doctor. Any other assignment proposed by Management from time to time. Walk-in Date: 21st - 31st October 2019 Time: 10 am to 4 pm Interview Venue: Rainbow Hospital C -16 & 17, Vikrampuri Colony Secunderabad Landmark: Near Bata Show Room Contact Person- Naveen Kumar H (9000234491)","location":"Hyderabad","experience":"0 - 5 Years"},{"date":"22, 23, 24, 25 - Oct - 2019","skills":"Back Office, Data Entry Operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"3i Infotech Limited, Akruti Trade Centre, 3rd floor, Plot .10, Road No. 7, MIDC Marol, Bhim Nagar, Andheri (East), Mumbai - 400093","phone":"022 7126 9000","profile":"Back Office Executive \n3i Infotech Limited","description":"Walk In interview for banking back office In Andheri MIDC Minimum Education: HSC Pass/ Graduate Minimum Typing Speed 25 wpm Walk-in Date: 22nd - 25 October 2019 Interview Time 11 to 3 PM Interview Venue: 3i Infotech Limited Akruti Trade Centre, 3rd floor, Plot .10, Road No. 7, MIDC Marol, Bhim Nagar, Andheri (East), Mumbai - 400093 Contact Person - Ankit Mota Phone: 022 7126 9000","location":"Mumbai","experience":"1 - 4 Years"},{"date":"23 - Oct - 2019","skills":"Java, UI, PL/SQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Arrow Electronics (India) Private Limited, West Wing, 5th Floor, Shankara Narayana Building, No. 25, M.G. Road, Bangalore - 560 001.","phone":"080-41353774","profile":"Java/ UI Developer \nArrow Electronics (India) Private Limited","description":"Candidate must have 4 to 7 years of strong hands-on design/ development background as a Full Stack Developer (Java, UI, PL/SQL) Job Location: Bangalore Experience/ Skill Set: Strong skills to implement Core Java code with Java Collections Hands-on experience around n-tier Web architecture with JSP and Servlets Good in understanding basics of JavaScript for testing and troubleshooting Good understanding of web technologies like HTML, XML and CSS Experience on Unix/Linux platform, Oracle SQL & PL/SQL, Oracle as a DB is desired Experience / Exposure to Webservices is a plus Experience in Hibernate is a big plus Experience in Mobile App development is a plus Experience / Exposure to Middleware J2EE containers WebLogic / OC4J Experience / Exposure to Middleware technology like ESB-Enterprise Service Bus / SOA-Service Oriented Architecture is a big plus Experience / Exposure to Open Source tools like Solr Search Engine and KAFKA is a big plus Excellent analytical, written and verbal communication skills Roles & Responsibilities: Capable of translating requirements into design / development, with unit testing / bug fixing / tuning Provide estimate based on documentation available / discussions with relevant stakeholders and work towards the timeline Good soft skills to work as an individual and as a group with onsite counterparts is a must Walk-in interview on 23rd October 2019, Wednesday Timings: 10 am - 3:00 pm Interview Venue: Arrow Electronics (India) Private Limited West Wing, 5th Floor, Shankara Narayana Building, No. 25, M.G. Road, Bangalore - 560 001.","location":"Bangalore","experience":"4 - 7 Years"},{"date":"21, 22, 23, 24, 25 - Oct - 2019","skills":"Front desk, Front Office, Receptionist/ Front Office Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Mouser Electronics (India) Private Limited, No.9, 5th Floor, Esquire Centre, Mahatma Gandhi Road, Bangalore - 560 001.","phone":"7349371940","profile":"Front Office Executive \nMouser Electronics India Private Limited","description":"Bachelor Degree preferred and around 6 months to 1 year experience in an office administration role, or an equivalent combination of education and experience. SKILLS & CERTIFICATIONS: A proven successful track record in a previously held office administrative role. High level of interpersonal skills. Ability to work with minimum supervision and make sound independent judgements. Strong problem solving and organizational skills. Accurate, reliable, high level of confidentiality. Excellent written and verbal communication skills in local language, professional communication behaviour to internal and external contacts. Proficient working knowledge of all Microsoft Office applications and email. Strong analytical, organizational skills, and attention to detail. COMPETENCIES: Energy Multi-tasking Attention to Detail Customer Service Functional Acumen Teamwork Resilience Integrity Task Focus Acceptance of Diversity Walk-in Date: 21st - 25 October 2019 Time: 10:00 AM to 5:00 PM Interview Venue: Mouser Electronics (India) Private Limited No.9, 5th Floor, Esquire Centre, Mahatma Gandhi Road, Bangalore - 560 001. Mobile No. 7349371940 Contact - Abhilasha Kumari","location":"Bangalore","experience":"0 - 1 Years"},{"date":"21, 22, 23, 24, 25 - Oct - 2019","skills":"PSD to Responsive HTML/ HTML 5, CSS3, Bootstrap, Jquery, Java Script, GT Metrix and/or web.Dev tool","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Sparx IT Solutions Private Limited, A-2, Sector-63, Noida - 201 301","phone":"0120-2735100","profile":"Front End/ Ui Developer \nSparx IT Solutions Private Limited","description":"Candidate must have excellent knowledge of PSD to Responsive HTML, HTML 5, CSS3, Bootstrap. Should have good working knowledge of Bootstrap 4, Jquery, Java Script. Should know GT Metrix and/or web Development tool Walk-in Date/ Time: 18th October - 25 October , 10 AM onwards Interview Veue: Sparx IT Solutions Private Limited A-2, Sector-63, Noida - 201 301 Contact Person- Mr. Rishabh Jain (0120-2735100)","location":"Noida","experience":"1 - 2 Years"},{"date":"21, 22, 23, 24, 25 - Oct - 2019","skills":"Java, Android SDK, Android basics like Manifest components, Recycler View","qualification":"B.E./B.Tech, MCA/PGDCA","address":"CROSSEDGE Technologies Private Limited, 14, Pammal Main Road, Opposite to IDBI Bank, Pamal, Chennai - 600 075","phone":"Not Provided","profile":"Android Developer/ Java \nCROSSEDGE Technologies Private Limited","description":"Candidate should have 2 to 5 years of experience in Java based Android (Native) development. Must have strong knowledge on Android SDK, Android basics like Manifest components, Recycler View, Card View, List View, Broadcast receiver, Location services, Full Activity lifecycle, Handling of Dialog/ Fragment dialog, Fragment lifecycle. Should be experienced in mobile app with Firebase, MySQL, NoSQL, Realm database. Experience in developing best practices, software principles and code design concepts Ensure the performance, quality, and responsiveness of applications Experience in developing and supporting rapid iterations of software in an agile context Help maintain code quality, organisation, and automation Skills Ability to understand business requirements and translate them into technical requirements Walk-in Date/ Time: 11th October - 25 October , 9 AM onwards Interview Venue: CROSSEDGE Technologies Private Limited 14, Pammal Main Road, Opposite to IDBI Bank, Pamal, Chennai - 600 075","location":"Chennai","experience":"2 - 5 Years"},{"date":"21, 22, 23, 24, 25, 26 - Oct - 2019","skills":"Java EE (JSP, Servlets, JPA), J2EE, JVM internals, AJAX","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Marolix Technology Solutions Private Limited, 1st Floor, Three Cube Towers, Beside Watermark Building, Kondapur, Hyderabad","phone":"9154087468","profile":"Java/ Full Stack Developer \nMarolix Technology Solutions Private Limited","description":"Candidate should have 2 years' of experience in Java platform development. Practical demonstrated experience in design and development of applications with major web development frameworks, including Java EE (JSP, Servlets, JPA), J2EE, JVM internals, AJAX; must have experience designing and implementing with Struts or Spring or other MVC framework. Must have good hands on experience on Jasper reports development or Similar to Jasper Reports. Reasonably good at UI with fundamental exposure to the technologies like HTML5, JSP, Java Script, JQUERY, CSS, Bootstrap, etc. Should have hands on experience on advanced JS Frameworks like Angular 2, Must have strong web service integration skills (SOAP, WSDL protocols, REST, Axis, and UDDI). Walk-in Date/ Time: 16th October - 31st October , 9 AM onwards Interview Venue: Marolix Technology Solutions Private Limited 1st Floor, Three Cube Towers, Beside Watermark Building, Kondapur, Hyderabad Contact No. 9154087468","location":"Hyderabad","experience":"2 - 4 Years"},{"date":"23 - Oct - 2019","skills":"Java, J2EE, SQL/ MySQL, OOPS Concept","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Changepond Technologies Pvt. Limited, H-2 , SIPCOT IT PARK, OMR, Siruseri, Chennai - 603 103. Landmark: Opposite to TCS 2nd Gate","phone":"Not Provided","profile":"Java Developer/ Freshers \nChangepond Technologies Private Limited","description":"Hiring Programmer Analyst Trainee (20 nos) for Changepond Technologies Private Limited Educational Qualification: BE/ B. Tech/ MCA (2015, 2016, 2017, 2018 & 2019 Passouts only) Eligibility: Aggregate of 60% in 10th, 12th, UG & PG (if any) Candidate must have good communication skills Should have completed a course in Java from any training institute Java Certification is mandatory. Required Skills: Java, J2EE, SQL/ MySQL, OOPS Concept Interview Rounds: 1. Combined Apps (Java Technical & Logical reasoning), 2. Technical face to face 3. HR Interview. Walk-in Date & Time: 23rd October 2019 (Wednesday) from 09:00 AM till 12:00 PM Interview Venue: Changepond Technologies Pvt. Limited H-2 , SIPCOT IT PARK, OMR, Siruseri, Chennai - 603 103. Landmark: Opposite to TCS 2nd Gate","location":"Chennai","experience":"0 - 1 Years"},{"date":"22, 23, 24, 25 - Oct - 2019","skills":"Python, Test Engineering, Java, Python, Linux, Open Shift, Jenkins","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Agiliad Technologies Private Limited, Godrej Castlemaine, 1st & 8th floor, Next to Ruby Hall Clinic, 42 Sassoon Road, Pune - 411 001","phone":"020 6689 1207","profile":"Java Developer/ Python Experts \nAgiliad Technologies Private Limited","description":"Good hands on experience of Azure, AWS, Kubernetes, Openshift, Jenkins plugins usage. Must have good programming experience in Python Good hands on experience of application deployment of web server. Candidate should have good knowledge of Networking Good experience of manual flash based application testing and cli testing Devops and CI/ CD workflow understanding Walk-in Date/ Time: 22nd October - 25 October , 10 AM onwards Interview Venue: Agiliad Technologies Private Limited Godrej Castlemaine, 1st & 8th floor, Next to Ruby Hall Clinic, 42 Sassoon Road, Pune - 411 001 Phone No: 020 6689 1207 Contact - Abhishek Ranjan ( 66891207 )","location":"Pune","experience":"2 - 7 Years"},{"date":"21, 22, 23, 24, 25, 26 - Oct - 2019","skills":"HTML, CSS, Javascript, Bootstrap, Ajax, Jquery Java, Php, Android and Software Testing","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Aapjimini Techsoft Private Limited, Plot No-235, Lane No-3, In front of Idea Office, Kanan Vihar Phase-2, Chandrasekhar Pur,patia, Bhubaneswar - 751 024","phone":"Not Provided","profile":"Java/ Php Developer/ Tester \nAapjimini Techsoft Private Limited","description":"Urgent Requirement of Software Developers and Testers with good communication skill and good knowledge in HTML, CSS, Javascript, Bootstrap, Ajax, Jquery, Java, Php, Android and Software Testing. Both Freshers and Experienced can apply. Walk-in Date/ Time: 19th October - 30 November, 11 AM onwards Interview Venue: Aapjimini Techsoft Private Limited Plot No-235, Lane No-3, In front of Idea Office, Kanan Vihar Phase-2, Chandrasekhar Pur,patia, Bhubaneswar - 751 024 Contact Person- Suresh Mahunta","location":"Bhubaneshwar","experience":"0 - 1 Years"}]}