{"Walkins":[{"date":"14 - Dec - 2019","skills":"Software Testing, Automation Testing, Cucumber, Test framework","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Indium Software India Limited, No. 64, Ganesh Chambers Eldams Road, Teynampet, Chennai - 600 018.","phone":"044-66069102","profile":"Automation Test Engineer \nIndium Software (India) Limited","description":"Candidate should have 2 to 5 years of strong experience into Automation testing with Selenium Web driver and Java. Should have framework development experience and good understanding of the frameworks. Should have framework development experience and good understanding of the frameworks. Excellent Logical and Reasoning thinking must Excellent communication is a must Experience with use of Version control tools, preferably GIT. Additional Automation tool experience No. of Positions: 10 Availability: 0-15 days Walkin Date: 14th December 2019 Timing: 10:00 AM to 1:00 PM Interview Venue: Indium Software India Limited No. 64, Ganesh Chambers Eldams Road, Teynampet, Chennai - 600 018.","location":"Chennai","experience":"2 - 5 Years"},{"date":"17, 18 - Dec - 2019","skills":"Front Office Assistance, Front Desk Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Aliengena Captive Private Limited (US based) G1, Sigma House, Near Mariott Hotel Senapati Bapat Road, Shivaji Nagar, Pune - 411 016.","phone":"7620605245","profile":"Front Office Assistant \nAliengena Captive Private Limited","description":"We have a opportunity available for 'Back Office Assistant' position. Educational Qualification: Minimum 12th Pass Person should be committed towards Education & Growth English speaking is required Fresher are welcome. Walk-in Date/ Time: 17th December - 18th December , 12 PM onwards Interview Venue: Aliengena Captive Private Limited (US based) G1, Sigma House, Near Mariott Hotel Senapati Bapat Road, Shivaji Nagar Pune - 411 016. Lankmark: Next to Persistent Softwares or ICC Tech Park Contact - Rachna Kandhalkar Call on 7620605245.","location":"Pune","experience":"0 - 1 Years"},{"date":"13, 14 - Dec - 2019","skills":"Customer Service, Front Office Assistant, Customer Care, Guest Service","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"The LaLiT Hotel Mumbai","phone":"9004653630","profile":"Front Office Associate \nBharat Hotels Limited (The Lalit)","description":"Walk In Interview at The LaLiT Mumbai for the Front Office Associate/ GRE Date:10th to 14th December 2019 Time: 10 AM - 4 PM Interview Venue : The LaLiT Hotel Mumbai Contact Person: Disha Jain, HR Contact No. 9004653630 Interested candidates can directly walk In or can share their resume on mumhrexec@thelalit.com","location":"Mumbai","experience":"1 - 5 Years"},{"date":"13, 14, 16, 17, 18, 19, 20 - Dec - 2019","skills":"General Administration, Office Assistance, Statutory Compliance, Security, Cafeteria/ Facilities Management","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Conneqt Business Solutions Limited, 1st floor, Gowra Trinity Building, Chiran Fort Lane, Begumpet, Hyderabad - 500 003.","phone":"8688530678","profile":"Asst. Manager - Facilities/ Admin \nConneqt Business Solutions Limited","description":"Candidate should be Any Graduate with 2 to 5 years of experience in General Administration, Office Assistance, Statutory Compliance, Security, Cafeteria/ Facilities Management. Should have excellent communication skills. Job Responsbility- All Cafeteria vendors SLA's to be followed. All Food Vendors Agreements Tracker to be maintained. Responsible for Cafeteria operations & ensure Proper Ambiance maintained along with hygienic food. Conducting regular food festivals for All 03 Locations. Should act as a Facilities lead for location Operations Resolve all the facilities issues during the shift & get them to a closure. Managing the Security, Housekeeping, BMS, Cafeteria, Pest control, Washroom Hygiene & other soft service related works. Vendor Performance Assessment & Evaluation. Statutory Compliance. Walk-in Date/ Time: 13th December - 20th December from 9 AM onwards Interview Venue- Conneqt Business Solutions Limited 1st floor, Gowra Trinity Building, Chiran Fort Lane, Begumpet, Hyderabad - 500 003. Landmark, Begum pet Passport Office, Contact Person- Mahindra Phone No: 8688530678","location":"Hyderabad","experience":"2 - 5 Years"},{"date":"13, 14 - Dec - 2019","skills":"Banking Operations, Banking Reconciliation, Back Office/ Backend Operations","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Financial Software & Systems Pvt. Limited, 10th Floor, Flat No-1009, 1010 & 1011, Tolstoy House 17, Tolstoy Marg, New Delhi - 110 001.","phone":"Not Provided","profile":"Back Office/ Operations Executive \nFinancial Software & Systems Pvt. Limited","description":"Candidate should be Any Graduate with 1 to 3 years of experience in Banking Operations, Banking Reconciliation, Back Office/ Backend Operations, Dispute Management. Should have good communication skills Should have scored minimum 50% in graduation Work Location - Civil Lines (Delhi) Job Responsbility- Responsible for reconciliation of VISA and MasterCard transactions. Handling Reconciliation, Charge back & dispute Management processes related to online transactions Daily download of transaction files from the Bank, Interchange & FSS systems. Reconciling transactions in system available at Banks site. Reconciliation between all transactions in the Bank logs vis--vis FSS Logs. Liaising with Bank / FSS teams for resolving un-reconciled entries within specified time frame. Tracking and resolving customer disputes. Interested candidates please walk-in for the interview on Thursday & Friday, 13th & 14th December, 2019 between 10 AM to 5 PM along with below documents- Hard copy of the resume Last 3 months pay slip Current company offer letter or increment letter 2 Passport Size Photo Interview Venue: Financial Software & Systems Pvt. Limited 10th Floor, Flat No-1009, 1010 & 1011, Tolstoy House 17, Tolstoy Marg, New Delhi - 110 001 Landmark: Near Janpath Metro Station Contact Person - Suraj Singh","location":"Delhi","experience":"1 - 3 Years"},{"date":"18 - Dec - 2019","skills":"Software Testing, Functional Testing, Regression Testing, Automation Testing","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Indium Software (India) Limited, No. 64, Eldams Road, Ganesh Chambers, Teynampet, Chennai, Tamilnadu - 600 018","phone":"044-66069102","profile":"Software Tester/ Fresher \nIndium Software (India) Limited","description":"Eligibility Criteria: B.E/ B.Sc./ MCA (Only 2018 & 2019 Pass outs) Mandatory 60% and above (overall Percentage) and No standing arrears Good knowledge in any Programming Language Should have excellent communication skills Walk-in Date 18th December 2019 (Wednesday) Time: 11 AM to 1 PM Interview Venue: Indium Software (India) Limited, #64, Ganesh Chambers, Edams Road, Teynampet, Chennai","location":"Chennai","experience":"0 - 1 Years"},{"date":"14 - Dec - 2019","skills":"Software Testing, Automation Testing, Test Case Execution, Quality Assurance","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Amazon Development Centre (India) Private Limited, Ground Floor, Infinity Tower, Tata Ramanujan IT City SEZ, Rajiv Gandhi Salai, Near Tidal Park, Old Mahabalipuram Road, Taramani, Chennai - 600 113.","phone":"Not Provided","profile":"Software Testing Engineer \nAmazon Development Centre (India) Pvt. Limited","description":"Amazon Development Centre (India) Pvt. Limited is hiring Software Testing (QAT) for Chennai location. Candidate should be BE Computer Science, B.Tech, Master of Computer Applications (MCA) or MSc Information Technology (IT) with relevant experience in Software Testing with 2 to 3 years of industry experience. Well versed in SDLC and has hands on experience on STLC. Have fair scripting knowledge using Python and Java, able to own, execute and verify results of existing automated tests, manage and scale the lab infrastructure based on project needs. Have basic understanding of the automation framework to initiate, manage and maintain automation runs as per defined schedule/ SLA. Job Responsbility: Execute a set of test cases assigned to you by an SDET/ QAE/ your manager. Write and maintain black box test cases with some guidance. Drill down on ambiguous tasks requests (new features/ use cases) into clear work instructions through first pass execution or training from QA, which in turn helps team to start testing without any hiccups. Interview Date : 14th December 2019 Walk-in : 11:00 AM to 2.00 PM Building Address Amazon Development Centre (India) Private Limited Ground Floor, Infinity Tower, Tata Ramanujan IT City SEZ, Rajiv Gandhi Salai, Near Tidal Park, Old Mahabalipuram Road, Taramani, Chennai - 600 113. Documents to Carry: 2 copies of Resume (Mandatory) Pan Card (Mandatory) Photo Copies Provisional Certificate and/or Degree Certificate (Mandatory) Photo Copies Upon arrival, please ask for Kalpana/ Piyush","location":"Chennai","experience":"2 - 3 Years"},{"date":"14 - Dec - 2019","skills":"Automation Testing, Selenium & Core Java","qualification":"B.E./B.Tech, MCA/PGDCA","address":"QualityKiosk Technologies University, 4th Floor,418, Rupa Solitaire, Sector-1, Millennium Business Park, Mahape, Kopar Khairane, Navi Mumbai, Maharashtra - 400 710.","phone":"9768046298","profile":"Automation Test Engineer \nQualityKiosk Technologies Private Limited","description":"Person must be strong in Automation testing using Selenium Java. Understand user requirements or functional specifications. Perform detailed technical analysis with impacts (technical/ functionally). Need to have strong analytical & communication skills (verbal and written) Interview Process: 1. Paper Coding Test (Core Java) 2. Technical F2F Round Walk-in Date: 14th December 2019 (Saturday) Time: 10:00 AM to 1.30 PM Interview Venue: QualityKiosk Technologies University 4th Floor,418, Rupa Solitaire, Sector-1, Millennium Business Park, Mahape, Kopar Khairane, Navi Mumbai, Maharashtra - 400 710. (Lift Number 19 & 20) Contact Person: Mausimi Sardar Phone: 9768046298","location":"Mumbai","experience":"1 - 5 Years"},{"date":"14 - Dec - 2019","skills":"Software Testing, Selenium, Automation Testing, Database Testing, Automation Framework","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Xpanxion International Private Limited, Sai Radhe, Ground Floor, Behind Sheraton Hotel, Near Pune Railway Station.","phone":"Not Provided","profile":"C#/ Automation Tester \nXpanxion International Private Limited","description":"We have an exciting opportunity for all C# Automation aspirants. Walk-in on 14th December at our Pune station's office. Required Skills: C# Selenium Database Good to have: API framework Walk-in Interview on 14th December from 10 AM onwards Address: Xpanxion International Private Limited Sai Radhe, Ground Floor, Behind Sheraton Hotel, Near Pune Railway Station. Contact Person: Mugdha Lele","location":"Pune","experience":"1 - 3 Years"},{"date":"18, 19 - Dec - 2019","skills":"Software Testing, Automation Testing, Selenium, Java","qualification":"B.E./B.Tech, MCA/PGDCA","address":"ApMoSys Technologies Private Limited, A-105, Greenscape Technocity Shil Phata Mahape Road, Mahape Navi Mumbai - 400 710.","phone":"8657487488","profile":"Automation Tester/ Fresher \nApMoSys Technologies Private Limited","description":"Candidate should have knowledge of basic Java & Selenium Must have completed Software Testing course Male candidates only Open to travel anywhere in Mumbai as per project Immediate joiner Quick learner Walk-in Date: 18th - 19th December 2019 Timings: 11 AM to 3 PM Interview Venue: ApMoSys Technologies Private Limited A-105, Greenscape Technocity Shil Phata Mahape Road, Mahape Navi Mumbai - 400 710. Landmark: Next to Country Inn Hotel & Suites Contact Person - Bhairavi (8657487488)","location":"Mumbai","experience":"0 - 1 Years"},{"date":"21 - Dec - 2019","skills":"Software Testing, Database Testing, Selenium, Webdriver, HTML, CSS, XML, Core Java","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Bureau Veritas Consumer Products Services (BVCPS), B-13-14, Sector 6, Noida - 201 301","phone":"Not Provided","profile":"QA/ Testing Engineer \nBureau Veritas Consumer Products Services","description":"Candidate should have 2 to 3 years experience in hands-on testing web applications (JAVA/ J2EE) with good understanding of SDLC and STLC. Must have excellent knowledge of QA processes and tools. Excellent hands-on skills with testing activities (functional testing, system testing, integration testing etc.) Working knowledge of SQL Queries. Demonstrated ability and experience in translating product definitions (use cases, requirements etc.) in to test cases. Experience in developing test cases covering regression and integration scenarios. Flexible work style, comfortable with adapting to various work assignments. Preferred Skills: ISTQB Certification. Experience with Database testing. Experience with Selenium Webdriver. Experience with performance testing using JMeter. Knowledge of HTML, CSS, XML, Core Java. Walk-in Date/ Time: 21st December 2019, 9 AM onwards Interview Venue: Bureau Veritas Consumer Products Services (BVCPS) B-13-14, Sector 6, Noida - 201 301.","location":"Noida","experience":"2 - 3 Years"},{"date":"14 - Dec - 2019","skills":"Core Java, J2EE framework like Spring Boot, Spring MVC.","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Oodles Technologies Private Limited, Unit No. 951, 9th Floor, Tower B1 Spaze I-tech Park, Sector 49, Gurugram.","phone":"9667164488","profile":"Java Developers \nOodles Technologies Private Limited","description":"Candidate must have strong experience in Core Java, J2EE framework like Spring Boot, Spring MVC. Should have good knowledge of Relational Databases like MySQL, PostgreSQL, MS SQL Server with complex SQL Queries, Stored Procedure, Triggers. Must have knowledge of ORM like Hibernate. Must have good working knowledge of Data Structure Unit testing experience using Junit, Spock. Knowledge of versioning tools like GIT, SVN. Knowledge of build tools like Maven, Gradle, Ant. Walk-in Date/ Time: 14th December 2019, 9 AM onwards Interview Venue: Oodles Technologies Private Limited Unit No. 951, 9th Floor, Tower B1 Spaze I-tech Park, Sector 49, Gurugram. Near to Omaxe City Centre Nearest Metro: Huda City Centre Contact Person- Trapti Srivastav Tel. Number: 9667164488","location":"Gurgaon","experience":"0 - 3 Years"},{"date":"13, 14 - Dec - 2019","skills":"C#, C++, Core Java, Jquery, Spring, SQL Server","qualification":"B.E./B.Tech","address":"Meshark Software Technologies Pvt. Limited, Manjeera Trinity Corporate, 13th Floor, #12A02 A2, Plot No S2, Kukatpally, JNTU Road, Hyderabad - 500 072.","phone":"7331199974","profile":"Software Trainee Engineer \nMeshark Software Technologies Pvt. Limited","description":"Meshark Software Technologies Pvt. Limited, is having an immediate requirement for Freshers. Position: Software Trainee Engineer Eligibility Criteria: B.Tech (CS/ IT Only) Must have 60% in 10th & 12th, 65% in B.Tech Candidates should not have any year gaps. Walk-in Date/ Time: 13th - 14th December , 10 AM onwards Interview Venue: Meshark Software Technologies Pvt. Limited Manjeera Trinity Corporate, 13th Floor, #12A02 A2, Plot No S2, Kukatpally, JNTU Road, Hyderabad - 500 072. Contact Person- Devi Bandana Phone: 7331199974","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"14 - Dec - 2019","skills":"Core Java, Spring, Hibernate, Java with Angular","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"HCL Technologies Limited, Sholinganallur, New Cafeteria Chennai","phone":"Not Provided","profile":"Java Developers \nHCL Technologies Limited","description":"Qualification: BE/ B.Tech/ M.Tech/ MCA Work Experience : 3 - 10 years Job Location: Chennai Required Skills: Requirement 1: Core Java, Spring, Hibernate, Requirement 2: Java with Angular If you are available to attend F2F discussion On (14th December from 9 AM onwards), do walk-in to the mentioned venue and SPOC would be Shaik Ahmed. HCL Technologies Limited, Sholinganallur, New Cafeteria Chennai Further queries / details do send a mail to ahmed_s@hcl.com","location":"Chennai","experience":"3 - 8 Years"},{"date":"13 - Dec - 2019","skills":"PHP/ MySQL, CSS, HTML, JAVA SCRIPT, Magneto","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"HCL Technologies Limited, N5, A-22, Sector 60, Noida (Near Noida Sector 59 Metro Station)","phone":"Not Provided","profile":"Java Developer \nHCL Technologies Limited","description":"Candidate should have B.Tech/ M.Tech or BCA/ MCA Degree with 2 to 8 years of relevant experience. Proven hands-on experience in designing and developing applications using Java EE platforms. Object Oriented analysis and design using common design patterns. Must have profound insight of Java and JEE internals (Classloading, Memory Management, Transaction management. etc) Excellent knowledge of Relational Databases, SQL and ORM technologies (JPA2, Hibernate) Experience in the Spring Framework Experience as a Sun Certified Java Developer Walk-in Date : 13th December 2019 (Friday) Time : 11 AM to 3 PM Interview Venue: HCL Technologies Limited, N5, A-22, Sector 60, Noida (Near Noida Sector 59 Metro Station) Contact Person : Wasim Carry : CV & Id proof Note : Laptop or any other storage device will not be allowed @ HCL premises.","location":"Noida","experience":"2 - 8 Years"},{"date":"14 - Dec - 2019","skills":"Java, Spring, Hibernate, Junit, SAML/ Open ID Connect/ Cloud Platform","qualification":"B.E./B.Tech","address":"Agiliad Technologies Private Limited, Godrej Castlemaine, 1st floor, Next to Ruby Hall Clinic, 42 Sassoon Road, Pune - 411 001.","phone":"020 6689 1218","profile":"Java Developer \nAgiliad Technologies Private Limited","description":"Educational Qualification: BE (CS) OR Equivalent Work Experience: 2 to 5 Years Location: Agiliad Technologies, Noida Must Have Skills : Java, Spring, Hibernate, Junit Good to have : SAML/ Open ID Connect/ Cloud Platform Key Requirement : Hands on experience in design and development using Java, Spring and Hibernate and Junit Solid understanding of internet based technologies Excellent analytical and problem solving skills Excellent communication skills and client interaction experience Job-Responsibilities: Develop and maintain modules for business process and systems Responsible for mentoring junior developers with code reviews design reviews and unit tests Develop and unit test application programs as specified in Technical design Obtain Code reviews from the programming staff, while ensuring that all programming standards and policies are adhered to Owning subset of modules identified on an as need basis Walk-in Date/ Time: 14th December 2019, 10 AM onwards Interview Venue: Agiliad Technologies Private Limited Godrej Castlemaine, 1st floor, Next to Ruby Hall Clinic, 42 Sassoon Road, Pune - 411 001. Contact Person: Dolly Jangid Phone No: 020 6689 1218","location":"Pune","experience":"2 - 5 Years"},{"date":"12, 13 - Dec - 2019","skills":"Java, Advanced Java, J2EE/ Spring Core, Spring Boot, AOP, Spring MVC","qualification":"B.E./B.Tech, MCA/PGDCA","address":"3i Infotech Limited, Tower # 3, 5th Floor, ICICI Bank Towers, Nanakramguda, Hyderabad - 500 032.","phone":"Not Provided","profile":"Java Developers \n3i Infotech Limited","description":"Person should have experience in Java, Advanced Java (JSP, Servlets etc.) Strong experience in J2EE/ Spring Core, Spring Boot, AOP, Spring MVC Experience with all the following : JSon, Jquery and Angular JS Develop high quality code as per standards and creation of stored procedures as needed Knowledge on XML parsing and AJAX concepts. App servers like Web logic, Web sphere and JBoss. Walk-in Date: 12th - 13th December 2019 Timings: 11 am to 3 pm (Strictly - After 4 pm candidates are not allowed. Interview Venue: 3i Infotech Limited, Tower # 3, 5th Floor, ICICI Bank Towers, Nanakramguda, Hyderabad - 500 032. Contact Person : Sireeha NOTE: Candidate should carry Updated Resume along with Original Photo ID proof (like Aadhar or Pan Card etc).","location":"Hyderabad","experience":"2 - 4 Years"},{"date":"14 - Dec - 2019","skills":"Java, Spring, MVC, User Interface Designing, Spring Boot","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Mindtree Limited, Global village Tech Park, Mysore Road, RVCE, Bengaluru, Karnataka - 560 059","phone":"Not Provided","profile":"JAVA Developers \nMindtree Limited","description":"Candidate should have 2 to 7 years of experience in Java, Spring, MVC, User Interface Designing, Spring Boot. Must have good problem solving skills. Job Responsibility- Understand the requirements; code and unit test the functionality according to the coding standards. Write Junit tests for the functionality coded. Fix the issues in code from reviews and Sonar violations. Troubleshoot and fix defects reported by tester Walk-in Date/ Time: 14th December 2019, 9 AM onwards Interview Venue: Mindtree Limited Global village Tech Park, Mysore Road, RVCE, Bengaluru, Karnataka - 560 059","location":"Bangalore","experience":"2 - 7 Years"},{"date":"14 - Dec - 2019","skills":"C, C++, Ruby, .NET or Java","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Kiprosh, A 901/ 902, Sagar Tech Plaza Saki Naka, Andheri (East) Mumbai","phone":"022-42956209","profile":"Software Engineers (C/ C++, Ruby/ .NET/ Java) \nKiprosh","description":"For our Global Web & Mobile product development, we are inviting Software Engineers having 0 to 1 year experience. Eligibility Criteria: Education: BE-CS/ BE-IT/ B.Tech/ MSC/ MCA/ M.Tech Only 2018 & 2019 Graduates must attend the drive The overall percentage of graduation should be 60% or above Prior registration is mandatory Person must have good hands-on experience with any programming language like C, C++, Ruby, .NET or Java. Excellent knowledge of computer science fundamentals, object-oriented programming, data structures, algorithms, and software design. Knowledge of web-based programming, HTTP fundamentals, API, JSON, HTML, CSS, and Responsive Design. Walk-in Date/ Time: 14th December 2019, 10 AM onwards Interview Venue: Kiprosh, A 901/ 902, Sagar Tech Plaza Saki Naka, Andheri (East) Mumbai Contact Person- Kiprosh (Recruitment Team) Phone No. 022-42956209","location":"Mumbai","experience":"0 - 1 Years"},{"date":"13 - Dec - 2019","skills":"Java, Retrofit, Rest, XML, Html5, SQLite, Javascript, JSON, Android SDK","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Greeksoft Technologies Private Limited, 507, 5th floor Western Edge-1, Western Express Highway, Borivali East Mumbai - 400 066.","phone":"Not Provided","profile":"Android Developer \nGreeksoft Technologies Private Limited","description":"Candidate should have 1 to 3 years of experience in the Android ecosystem Kotlin, MVC, MVP, MVVM. Strong OOPs fundamentals, Java, XML, JSON, Web Services, SQLite Databases, Room, Android X, Dagger, Rx. Solid understanding of Android SDK and Android Architecture Proficient with developing optimized UI for different android versions and devices. Should have an excellent understanding of Java - OOPS, Interface, Abstract class, Collection framework. Must have a good understanding of Android basics like Manifest components, Activities, services, Intent, Fragment use, and lifecycle management. Must have at least worked on 1 app and should know SQL and database operations. Experience working with remote data via REST, JSON & XML. Experience with third-party libraries, APIs, web services and JSON, e.g Dagger, Rxjava, Retrofit, GSON etc. Candidate must be willing to sign 1 year bond with us. Walk-in Date/ Time: 13th December 2019, 11 AM onwards Interview Venue: Greeksoft Technologies Private Limited 507, 5th floor Western Edge-1, Western Express Highway, Borivali East Mumbai - 400 066. Contact Person - Maya Arekar","location":"Mumbai","experience":"1 - 3 Years"},{"date":"11, 12, 13 - Dec - 2019","skills":"Core Java, JSP/ Servlet, Maven, Spring Framework, SQL Queries & Stored Procedures","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Godrej Infotech Limited, Plant - 19A, 2nd Floor, Pirojsha Nagar, Vikhroli (West), Mumbai.","phone":"Not Provided","profile":"Core Java Developer \nGodrej Infotech Limited","description":"Educational Qualification: Full-Time Graduates (Only) Minimum 2 to 5 years of experience in similar fields Job Location: Mumbai (Vikhroli) Primary Skills: Must have strong background/ knowledge in Core Java, JSP/ Servlet, Maven, Spring Framework MS SQL Database design and writing SQL Queries & Stored Procedures Should be capable of doing Code Review and testing for team members Should have sound knowledge of Software Development Life cycle and should be able to lead a module with 3-4 team members Key Result Areas: Requirement Analysis and Design Preparation of Technical specification documents Software development as per technical specifications Good command of English Language Walk-in Date: 11th, 12th, 13th December, 2019 Timings: 9:00 am to 1:00 pm Interview Venue: Godrej Infotech Limited Plant - 19A, 2nd Floor, Pirojsha Nagar, Vikhroli (West), Mumbai. Entry from Gate 4 (Near Petrol Pump) Contact Person- Kripali Danani Candidates who can join immediately or in 15 days are preferred. Note : Enter from Gate 1 if commuting by personal vehicle Disclaimer: Those candidates who have attended the interview in past 6 months cannot apply.","location":"Mumbai","experience":"2 - 5 Years"},{"date":"14 - Dec - 2019","skills":"Java, J2EE, Server Side development, Struts, MVC framework","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"QuEST Global Engineering Services Private Limited, #GAR Laxmi Infobahn, Tower -1, 2nd Floor, ORR Service Road, Kokapet, Hyderabad - 500 075","phone":"8886977747","profile":"Sr. Java Developer/ Lead \nQuEST Global Engineering Services Pvt. Limited","description":"Seeking experienced Senior Java full stack Developers who are highly motivated and enthusiastic to join our Core Technology team and make a difference. We are looking for dynamic Java full stack Developers who can thrive in a fast paced environment. Candidate should have Bachelors or Masters degree in Computer Science or Engineering with minimum 4 years of Java development experience, preferably using Spring Experience in: Object-oriented programming (Java, J2EE, Server Side development, Struts, MVC framework), Service Oriented Architecture (SOA), ORM (Hibernate / Spring Data etc.), Web service development, Spring (Core, IOC & DI, MVC, Security, AOP, JPA, Beans), JBoss / Tomcat or any app server And-- Web UI development (HTML5/ CSS3, Javascript, JSP, JQuery, AJAX Concepts, Single page application development, JS Frameworks/ Libraries), Apache or any web server Walk-in Date/ Time: 14th December 2019, 9 AM onwards Interview Venue: QuEST Global Engineering Services Private Limited #GAR Laxmi Infobahn, Tower -1, 2nd Floor, ORR Service Road, Kokapet, Hyderabad - 500 075 Landmark: Near Financial District Contact Person- Stefan Sunny If Interested Call or Ping me ASAP @ 8886977747 Or Forward your updated resume : sunny.stefan@quest-global.com","location":"Hyderabad","experience":"4 - 9 Years"},{"date":"10, 11, 12, 13, 16, 17, 18, 19, 20 - Dec - 2019","skills":"PHP MySQL WordPress Drupal Jquery, Java Script, HTML5, CSS","qualification":"B.E./B.Tech, MCA/PGDCA","address":"GlobalData Research Center Private Limited, 3rd Floor, Jyoti Pinnacle Building, Opp. to Prestige IVY League Appt, Kondapur Road, Near to Google Office, Hyderabad - 500 081.","phone":"Not Provided","profile":"Wordpress/ PHP Developer \nGlobalData Research Center Pvt. Limited","description":"Candidate should have Bachelor's Degree (B .Tech) or MCA with minimum 3+ years' of experience in PHP Must have strong programming skills Good aptitude and problem solving skills Skill Set : Proven experience in PHP MySQL WordPress Drupal Jquery, Java Script, HTML5, CSS If interested to apply forward resume immediately to m.salim@globaldata.com Also, you may walk-in directly for personal interview :- Address : GlobalData Research Center Private Limited 3rd Floor, Jyoti Pinnacle Building, Opp. to Prestige IVY League Appt, Kondapur Road, Near to Google Office, Hyderabad - 500 081. Interview Date: 10th till 31st December (Mon-Fri) Timings : 10:00 am till 4:00 pm","location":"Hyderabad","experience":"3 - 7 Years"},{"date":"12 - Dec - 2019","skills":"Backend Operations, International Process, Back office, Claims Processing","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Optum- A UnitedHealth Group Company, Tower-A, 5th Floor, Building No-6, Phase-3, Sector 24, Gurgaon - 122 001","phone":"Not Provided","profile":"Back Office/ Claims Associate \nOptum Global Solutions (India) Pvt. Limited","description":"We are currently looking for dedicated professionals to fulfill the following job responsibilities: Responsible for the accurate processing and completion of medical claims. Process claims that route out of automatic adjudication, within current turnaround standards. Proficiency in product lines applicable to processing unit. Should be comfortable with Night Shifts (5:45 PM to 3:15 AM & 8:30 PM to 6:00 AM) (Both Side Cabs will be provided). Should be a Graduate with 20/90 - Typing Speed BE/ B.tech/ BCA/ MCA are not eligible for claims hiring Ability to understand and apply plan concepts to include: Deductible Coinsurance Co-pay Out-of-pocket State variations. Job Location: Gurgaon & Noida location Walk-in Date- 12th December' 2019 (Thursday) Timings- 11:00 am to 1:00 pm Interview Venue: Optum- A UnitedHealth Group Company Tower-A, 5th Floor, Building No-6, Phase-3, Sector 24, Gurgaon - 122 001 Nearest metro station- DLF Phase 3 metro station Note: If given interview in last 3 months please ignore this email.","location":"Gurgaon","experience":"0 - 1 Years"},{"date":"11, 12, 13 - Dec - 2019","skills":"Java, Pythom, PHP, ROR, Salesforce, AngularJS, ReactJS and NodeJS","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Ksolves India Private Limited, Office No. 301, Third Floor, Building No. B-4, B Block, Sector 63, Noida - 201 301","phone":"Not Provided","profile":"Software Developer (Java, Pythom, PHP) \nKsolves India Private Limited","description":"We are looking for experts in various technologies like Java, Pythom, PHP, ROR, Salesforce, AngularJS, ReactJS and NodeJS. Person should have good technical knowledge with excellent coding skills. Good communication skill both written and verbal. Work in a challenging enviornment in terms of quality and quantity to address ongoing client needs. Plan and implement integration between proposed development and existing systems interms of hardware and software platform. Take ownership of assumed task, provide test, implementation and support plan in a multi-tier level. Candidate who can join immediately will be preferred. Walk-in Date/ Time: 11th - 13th December 2019, 11 AM onwards Interview Venue: Ksolves India Private Limited Office No. 301, Third Floor, Building No. B-4, B Block, Sector 63, Noida - 201 301 Near Noida Sector - 62 Metro Station Contact Person - Akanksha Saini","location":"Noida","experience":"0 - 1 Years"},{"date":"11, 12 - Dec - 2019","skills":"Back End Operations, Non Voice Process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"HCL Technologies Limited, A-22, Sector 60, Noida (Near Noida sector 59 Metro Station)","phone":"Not Provided","profile":"Backend Process Associate \nHCL Technologies Limited","description":"HCL BSERV is hiring for a banking process for entry level positions for Noida location. Candidate should be Any Garduate with Basic knowledge of Banking with exposure to MS Office (word, excel etc.). Must have excellent verbal & written communication/ language skills. Work Experience:- *Fresher Typing speed - 25 wpm with 85% accuracy. Shifts:- UK Shifts Salary:- UPTO 1.8 LPA 5 Days Working(Fixed Saturday & Sunday off) Should have good analytical and interpretation skills Familiarity with Windows Operating System and desktop system. Should have keen eye for details. Walk-in Date: 11th - 12th December 2019 Time - 1:00 pm to 4:00 pm Interview Venue- HCL Technologies Limited A-22, Sector 60, Noida (Near Noida sector 59 Metro Station) Contact Person - Jyoti Gupta","location":"Noida","experience":"0 - 2 Years"},{"date":"12 - Dec - 2019","skills":"HR/ Recruitment, Sourcing, Job Posting, Talent Acquisition, Screening","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"GlobalLogic Technologies Limited, Plot No. 590A, Phase-I, Road No 31 Jubilee Hills, Hyderabad, Telangana - 500 033.","phone":"Not Provided","profile":"HR Recruiter (Male Only) \nGlobalLogic Technologies Limited","description":"We have an immediate opening for Recruitment team, preferably MALE Candidate Educational Background: MBA HR Work Experience: Fresher to 1 Year Key Skills: Domestic Recruitment (End to End) - IT & Non IT Job Location: Hyderabad Benefits: Incentives + Food + Health Insurance Weekly off: Saturday & Sunday Required Competencies: Proficiency in Microsoft Office Suite (MS Word; MS Excel; MS PowerPoint) Must have excellent communication skills (Written and Verbal) Should be able to work independently Experience of dealing with a growing team size. A self-starter that is able to demonstrate success within an -entrepreneurial company environment. Should be smart, assertive, logical and achievement oriented Walk-in Date: Thursday, 12 December 2019, Time: 9:30 AM to 12 PM Interview Venue: GlobalLogic Technologies Limited, Plot No 590 A, Road No 31, Jubilee Hills, Hyderabad, Telangana - 500 033. POC - TAG Team","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"11, 12, 13 - Dec - 2019","skills":"Technical Support, Incident Management, Root Cause Analysis","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Commdel Consulting Services Pvt. Limited, A-74, Sector-58, Noida - 201 301.","phone":"Not Provided","profile":"Application / Technical Support \nCommdel Consulting Services Pvt. Limited","description":"Candidate must have strong knowledge of MS SQL Server Database, Query compilation, execution. Proficient knowledge of SQL - Joins, Procs, DDL, DML commands, Conditional Statement, SQL Keys, Clauses, Data Types, etc. Providing a high level of service to our customers and adhering to our strict SLAs for response and restoration times Problem determination, workaround resolution, root cause analysis, major incident management Answers customer queries raised regarding the application issues. Walk-in Date/ Time: 11th - 13th December , 10 AM onwards Interview Venue: Commdel Consulting Services Pvt. Limited A-74, Sector-58, Noida - 201 301. Contact Person- Prerna","location":"Noida","experience":"1 - 2 Years"},{"date":"11, 12, 13, 14 - Dec - 2019","skills":"Technical Support, Active Directory, Email Configuration","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Incedo Technology Solutions Limited, Plot No.-248, Udyog- Vihar, Phase-4, Gurgaon, Haryana - 122 015.","phone":"8949185498","profile":"Technical Support Engineer \nIncedo Technology Solutions Limited","description":"We are looking for Technical Support Engineers with minimum 0 to 5 years of experience in related field for Gurgaon Location. It's a B2B profile (60% Voice) where TSE will be the point of contact for all technical queries related to login. TSE will be trained on handling password reset queries in Active Directory. Must have excellent communication skills 24*7 operations and most of the times shift will be in EST hours Technical bent of mind to isolate a problem quickly Basic troubleshooting of desktop/ laptop and gadgets Email configuration Customer service approach Candidate should be comfortable with US shifts timings, Tech Support (Semi-Tech) voice process. B. Tech/ BCA freshers with excellent communication are also eligible to apply. Freshers with excellent communication are also eligible for this requirement. 24*7 shift. (US Shift) Walk-in Date/ Time: 11th - 14th December from 12 PM onwards Interview Venue: Incedo Technology Solutions Limited Plot No.-248, Udyog- Vihar, Phase-4, Gurgaon, Haryana, 122 015. Contact Person: Anuj Chaturvedi Phone: 8949185498","location":"Gurgaon","experience":"0 - 5 Years"},{"date":"13, 14, 16, 17, 18, 19, 20, 21, 23, 24, 25 - Dec - 2019","skills":"Core Php, or any MVC","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Belair Travel & Cargo Private Limited, Plot No. 9 Pocket 3, Sector 11, Dwarka, New Delhi","phone":"011-43149007","profile":"Core Php Developer \nBelair Travel & Cargo Private Limited","description":"Candidate should have good knowledge of Core Php, or any MVC. Able to work on project independently with guidance from tech lead Walk-in Date/ Time: 13th - 25th December 2019, 11 AM onwards Interview Venue: Belair Travel & Cargo Private Limited Plot No. 9 Pocket 3, Sector 11, Dwarka, New Delhi For further details email your resume at hr@belair.in or call on 011-43149007 Contact Person- Himani Rawal","location":"Delhi","experience":"1 - 5 Years"},{"date":"12, 13 - Dec - 2019","skills":"IT Helpdesk or IT Service Desk - Global Support, or Desktop Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Brennan IT (India) Private Limited, Rupa Solitaire, Atrium E, Level 14, Suite 1418 Building No A - 1, Sector 1, Millennium Business Park, Mahape, Navi Mumbai","phone":"Not Provided","profile":"Technical Support Engineer \nBrennan IT (India) Private Limited","description":"Exciting Opportunity to be part of Brennan IT (Australia's No #1 MSP) is hiring IT Service Desk - Technical with 1-5 Years at Navi Mumbai Candidate should be Any Graduate/ Pursuing Graduate with 1 to 5 Years of experience in IT Helpdesk or IT Service Desk - Global Support, or Desktop Support. Must be able to learn and support new and quickly changing technologies. Ability to research solutions or information regarding technical issues. Age Limit: Between 25 to 35 ONLY. MUST have EXCELLENT ENGLISH COMMUNICATION SKILLS. (Spoken & Written). Should have experience dealing with international clients/ customers. Interview Rounds: Aptitude English Written Test Communications Skills Check round Technical round Walk-in Date/ Time: 12th - 13th December 2019, 9 AM onwards Interview Venue: Brennan IT (India) Private Limited Rupa Solitaire, Atrium E, Level 14, Suite 1418 Building No A - 1, Sector 1, Millennium Business Park, Mahape, Navi Mumbai Landmark: Next to Mastek Building. Nearest Railway St: Ghansoli Contact Person - Dilip Joshi Please carry your hardcopy of resume along with passport size photograph during the interview. If you require any further information or any query, please do not hesitate to contact me on dilip.joshi@brennanit.com.au","location":"Mumbai","experience":"1 - 5 Years"},{"date":"10, 11, 12, 13, 14, 16, 17, 18, 19, 20, 21 - Dec - 2019","skills":"Core PHP, AJAX, CSS, Javascript, API, MySQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Abchlor Investment Advisors Pvt. Limited, Laxmi Industrial Estate, 409, Laxmi Mall, New link Road, Andheri (West), Mumbai-400053","phone":"022-40713322","profile":"PHP Web Developer \nAbchlor Investment Advisors Pvt. Limited","description":"Candidates with minimum 2 years of relevant experience in API, MySQL, Core PHP, AJAX, CSS may apply. Able to write clean, well designed code. Troubleshoot, test and maintain the core product software and databases to ensure smooth functionality. Demonstrable knowledge of web technologies including HTML, CSS, Javascript, AJAX etc. Good knowledge of MySQL Experience in integrating third-party APIs Passion for best design & coding practices Desire to develop new bold ideas. Walk-in Date/ Time: 10th - 31st December 2019, 9 AM onwards Address- Abchlor Investment Advisors Pvt. Limited Laxmi Industrial Estate, 409, Laxmi Mall, New link Road, Andheri (West), Mumbai-400053 Contact Person- Kumar A Tel No. 022-40713322","location":"Mumbai","experience":"2 - 5 Years"},{"date":"11, 12, 13, 14 - Dec - 2019","skills":"Technical Support, International Voice Process, Customer Service","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Sutherland Global Services Private Limited, A1 Block, Ground Floor, Gateway Office Parks, GST Road, New Perungalathur, Chennai - 600063.","phone":"7010334051","profile":"Technical Support (Voice Process) \nSutherland Global Services Pvt. Limited","description":"We have exciting opportunities for Candidates with experience for International Voice Process (Technical Support -L1/ L2) Eligibility Cretria: Freshers with excellent communication and basic Technical knowledge are eligible for this process. Candidates with minimum 6 months of Technical support with position L1/L2 International voice experience are eligible. Candidates from a Non BPO with Technical Support Experience with good communication skills are eligible to apply. Candidate should have good knowledge on window support, OS, Networking, Connectivity issue knowledge. Looking for candidate who join immediately and 15 days of notice can apply. Candidate should be flexible to work for rotational night shift. Cab facility will be given for night shift. Roles & Responsibilities: Resolving technical issue for the customer over the phone for product like computer, laptop and mobile support. International call taking process across the globe. Provide complete technical support to the customer. Walk-in Date: 11th - 14th December 2019 Time : 10.00 Am to 12.30 Pm Interview Venue: Sutherland Global Services Private Limited A1 Block, Ground Floor, Gateway Office Parks, GST Road, New Perungalathur, Chennai - 600063. Contact Person- Preethi Phone No. 7010334051 Candidates can walk-in & Mention 'Preethi HR' on top of the resume. Carry your ID proof for security clearance and don't carry any gadgets like Laptop, pendrive, etc","location":"Chennai","experience":"0 - 5 Years"},{"date":"11, 12, 13, 14, 16, 17, 18 - Dec - 2019","skills":"HR/ Recruitment, Staffing, International Recruitment/ Hiring","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Tech Mahindra Limited, Opposite TCS, Phase 3, Hinjewadi, Pune - 411 057","phone":"020-42252879","profile":"HR Executive/ Recruiter \nTech Mahindra Limited","description":"Candidate must have good hands on experience with regards to documentation/ Offer & joining formalities. Should have good communication skills. BPO hiring experience would be an added advantage Arranging & Following up before every joining Should be able to handle work pressure Walk-in Date/ Time: 11th - 18th December, 12 PM onwards Interview Venue: Tech Mahindra Limited Opposite TCS, Phase 3, Hinjewadi, Pune - 411 057 Contact Person- Jasbeer (HR) Phone: 020-42252879","location":"Pune","experience":"1 - 2 Years"},{"date":"14 - Dec - 2019","skills":"Core PHP, Prestashop/ Wordpress/ Magento/ Laravel","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Nethues Technologies Private Limited, 110, Block-A, The Ithum, Plot No. 40, Sector-62, Noida - 201 309","phone":"011-47567714","profile":"Core PHP Developer \nNethues Technologies Private Limited","description":"We are looking for a motivated PHP Developer to come to join our fast-paced, fun and rewarding agile team of professionals. If you are passionate about technology, constantly seeking to learn and improve skill set, then you are the type of person we are looking for! Candidate should have minimum 3 years of experience in Core PHP Keen to learn other technologies like Prestashop/ Wordpress/ Magento/ Laravel Working knowledge of object oriented programming concepts and techniques. Basic understanding of front-end technologies, such as JavaScript, Jquery,HTML, and CSS Ability to solve complex problems, design and requirements documentation Excellent communication skills, self motivator, team player Must have excellent analytic and logical skills. Walk-in Date/ Time: 14th December 2019, 10 AM onwards Interview Venue: Nethues Technologies Private Limited 110, Block-A, The Ithum, Plot No. 40, Sector-62, Noida - 201 309 Contact Person - Pooja Malhotra Phone No. 011-47567714","location":"Noida","experience":"3 - 6 Years"},{"date":"11, 12, 13 - Dec - 2019","skills":"Android, Java, IOS, Paypal, JSON, XML, MySQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"StraViso India Private Limited, Teerth Technospace B-204, 2nd floor, Bengaluru Mumbai Highway, Baner, Pune, Maharashtra - 411 045.","phone":"7722075652","profile":"PHP Developer \nStraViso India Private Limited","description":"Candidate must have strong knowledge of PHP web frameworks {such as Laravel, Yii, etc depending on your technology stack}. Understanding the fully synchronous behavior of PHP, MVC design patterns. Basic understanding of front-end technologies, such as JavaScript, HTML5, and CSS3. Should have good knowledge of object oriented PHP programming. Understanding accessibility and security compliance {Depending on the specific project} Strong knowledge of the common PHP or web server exploits and their solutions User authentication and authorization between multiple systems, servers, and environments Integration of multiple data sources and databases into one system Walk-in Date: 11th - 13th December 2019 Time: 10 am - 5 pm IST Interview Venue: StraViso India Private Limited Teerth Technospace B-204, 2nd floor, Bengaluru Mumbai Highway, Baner, Pune, Maharashtra - 411 045. Landmark: Behind Mercedes Benz Showroom Front Office: 7722075652/ 7875053960","location":"Pune","experience":"2 - 6 Years"},{"date":"16, 17 - Dec - 2019","skills":"Banking/ Mortgage/ Insurance process for Non Voice/ Back end process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"SLK Global Solutions Private Limited, 6th Floor, Building No 2, Commerce Zone IT Park, Yerwada, Pune","phone":"Not Provided","profile":"Backend Process Executive \nSLK Global Solutions Private Limited","description":"SLK Global Solutions Private Limited is recruiting for freshers for Banking/ Mortgage/ Insurance process for Non Voice/ Back end Process. Qualification: Any Graduate (Except BE/ BCA/ B.Sc/ MBA) Work Experience: Fresher Job Location:-Pune Role: Permanent Shifts: Night shifts - US shifts Travel: 1 way cab drop is available (Free for Female candidates) Skill Set: The applicant must have a valid PAN and Aadhar Card Must have basic knowledge of banking terminologies Must have good English communication skills Must be open to work in rotational shifts Should have good typing skill No regional language Walkin Date: 16th - 17th December 2019 Time: 12.00 PM to 03.00 PM Interview Venue: SLK Global Solutions Private Limited 6th Floor, Building No 2, Commerce Zone IT Park, Yerwada, Pune","location":"Pune","experience":"0 - 1 Years"},{"date":"11, 12, 13, 14 - Dec - 2019","skills":"C#, Asp .Net MVC 4/5, Web API, Entity Framework, SQL Server, Angular","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Excelencia I-Tech Consulting Pvt. Limited, PDN Road, Sandeep Avenue, Chinna Neelangarai, ECR, Chennai - 600 042.","phone":"9840013240","profile":".Net Developer \nExcelencia I-Tech Consulting Pvt. Limited","description":"Required Skills: C#, Asp .Net MVC 4/5, Web API, Entity Framework, SQL Server, Angular 6, 7 Dot Net core 2.0/3.0, Dot Net framework 4.5/ 4.6/4.7 Best understanding in OOPS Concepts Must have Good Communication Skills Walk-in Date/ Time: 9th December - 14th December , 9 AM onwards Interview Venue: Excelencia I-Tech Consulting Pvt. Limited PDN Road, Sandeep Avenue, Chinna Neelangarai, ECR, Chennai - 600 042. Contact Person- Panimullai Veera Phone: 9840013240","location":"Chennai","experience":"2 - 7 Years"},{"date":"10, 11, 12, 13, 14 - Dec - 2019","skills":"C#, ADO .NET, ASP .NET, MS SQL, Windows Forms, OOPS, .NET Framework 4.0 and above","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Spider Software Private Limited, 206, Jalaram Business Center, Ganjawala Lane, Near Chamunda Circle, Borivali West, Mumbai - 400 092","phone":"022-42446400","profile":"Software Developer (.Net) \nSpider Software Private Limited","description":"Work Experience: 0 to 2 Yaers Preferred Skills: C#, ADO .NET, ASP .NET, MS SQL, Windows Forms Strong knowledge in OOPS, .NET Framework 4.0 and above Good Problem Solving, Logical and Debugging skills Design & Develop .NET based applications Developing Real-Time & Client & Server architecture based applications Designing Database data model, SQL queries & Procedures Ability to work in Team & as an Individual Team player with flexible approach Walk-in Date: 10th - 14th December 2019 Interview Time: Tue-Fri :10 am - 3:30 pm & Sat: 10 am-1:00 pm Interview Venue: Spider Software Private Limited, 206, Jalaram Business Center, Ganjawala Lane, Near Chamunda Circle, Borivali (West), Mumbai - 400 092","location":"Mumbai","experience":"0 - 2 Years"},{"date":"14 - Dec - 2019","skills":"Big Data, Java, Dot Net, Python, UI with Angular","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Knowledge Lens Private Limited, 74/A, ZED Tech Park, Keonics, Electronic City Phase 1 - Bengaluru - 560 100.","phone":"Not Provided","profile":"Software Developer (Big Data, Java, .Net) \nKnowledge Lens Private Limited","description":"Our team is now hiring for various roles in Big Data, Java, Dot Net, Python, UI with Angular, Data Scientist, Big Data Technology Lead. Work Experience: 1+ Years Location: Electronic City, Phase 1, Bengaluru Walk-in Date/ Time: 14th December 2019, 9 AM onwards Interview Venue: Knowledge Lens Private Limited 74/A, ZED Tech Park, Keonics, Electronic City Phase 1 - Bengaluru - 560 100. Contact Person - Jayashree S","location":"Bangalore","experience":"1 - 6 Years"},{"date":"14 - Dec - 2019","skills":".Net C# and/or VB Scripting, SDLC process, SQL Server 2005 onwards","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Helm Analytics Private Limited, Ground Floor, A-16, Sector - 16, Noida.","phone":"0120-4993315","profile":".Net Engineers \nHelm Analytics Private Limited","description":"Candidates must have a minimum of 1.5 to 6 years' of experience Essential skills (MUST) 1. Sound knowledge of the SDLC process 2. Excellent .Net C# and/or VB Scripting knowledge. 3. Expert SQL Server 2005 onwards development skills (T-SQL, Functions, Stored Procedures, etc.) 4. Experience of developing and reviewing requirements. 5. Strong data analysis and troubleshooting skills 6. Excellent written and oral communication skills. Desired skills (Good to have) 1. Technical documentation. 2. Ability to work independently at times and as well as a team. 3. Experience of developing Practice Management or Finance applications specific to the legal sector. Join us: 1. Day Shit - 9:00 AM - 6:00 PM IST 2. Fixed Saturday and Sunday off 3. This would be a permanent position. 4. Work from home facility Candidates who can manage to join within 30 days of notice should apply for the scheduled drive. Interview Details: Date/ Day: 14th December' 2019 (Saturday) Time: 9:00 AM - 1:00 PM IST Interview Venue: Helm Analytics Private Limited Ground Floor, A-16, Sector - 16, Noida. Please ensure to carry below mentioned documents: 1. Softcopy of the interview invitation 2. PAN card, Aadhar Card, driving license, voter's identification card/ passport number for ID Proof 3. Hardcopy of your resume.","location":"Noida","experience":"2 - 7 Years"},{"date":"10, 11, 12, 13, 14 - Dec - 2019","skills":"ASP .Net, C#, Sql, Json, Javascript, Windows platform","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Rosmerta Safety Systems Pvt. Limited, 137, Udyog Vihar, Phase - I, Gurugram, Haryana - 122 016.","phone":"0124-4990800","profile":"Software Developer (.Net) \nRosmerta Safety System Pvt. Limited","description":"Great opportunity to work with Semi Government Company. Educational Qualification - MCA, BCA and B-tech can apply Proficiency in ASP .Net, C#, Sql, Json, Javascript, Windows platform. Development of applications of Dot net & C#. Only Male Candidate required. Interested candidate can walk in directly for F2F interview with your cv. Walk-in Date/ Time: 9th - 14th December , 10 AM onwards Interview Venue: Rosmerta Safety Systems Pvt. Limited 137, Udyog Vihar, Phase - I, Gurugram, Haryana - 122 016. Contact Person:- Omprakash Singh Land Line- +91-124-4990800","location":"Gurgaon","experience":"3 - 8 Years"},{"date":"10, 11, 12, 13 - Dec - 2019","skills":"ASP .NET, C#/ .NET and Windows Forms, SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA","address":"ENuke Software Private Limited, Pavillion Building 339/2 Mehrauli Road Near Misaki Express Hotel, Anamika Enclave, Gurugram, Haryana - 122 007.","phone":"Not Provided","profile":".Net Developer/ Fresher \nENuke Software Private Limited","description":"Candidate should have relevant experience in C#/ .NET and Windows Forms. Relevant experience in SQL Server Database Development Expert with ASP .NET. Experience with Visual Studio. Good knowledge of using JavaScript, jQuery, Bootstrap, HTML5.0, CSS3, Bootstrap, Ajax Must have great aptitude and desire to learn and work in challenging environment. Must have great willingness to learn. Must have great team working skills. Should be focused and self-motivated. Looking For Immediate Joiner Walk-in Date/ Time: 10th - 13th December , 11 PM onwards Interview Venue: ENuke Software Private Limited Pavillion Building 339/2 Mehrauli Road Near Misaki Express Hotel, Anamika Enclave, Gurugram, Haryana - 122 007. Contact Person- Rachna Jha ( 4253862 )","location":"Gurgaon","experience":"0 - 1 Years"},{"date":"11, 12, 13 - Dec - 2019","skills":".Net Framework, C#/ VB .Net, ASP .Net, SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA","address":"GlobalData Research Center Pvt. Limited, 3rd Floor, Jyoti Pinnacle Building, Opposite to Prestige IVY League Appt, Kondapur Road, Hyderabad - 500 081","phone":"040-67426702","profile":".Net Developer \nGlobalData Research Center Pvt. Limited","description":"Candidate should have Bachelors Degree in Engineering /Technology / MCA with minimum 3 years of Experience in .Net Framework, C#/ VB .Net, ASP .Net, SQL Server 2005/ 2008. Well-versed with JavaScript, AJAX, Web services, Threading. Have strong concepts of OOPS and Database(T-SQL) Programming. Hands on experience in product/ project development using MVC Knowledge of Endeca ITL, NHibernate Good communication skills in English, both written and verbal and analytical skills. If interested to apply forward resume immediately @ mail id (m.salim@globaldata.com) Also, you may walkin directly for personal interview :- Walk-in Date: (Mon-Fri)-(10th til 31st December), Timings : 10:00 am till 5:00 pm Interview Venue: GlobalData Research Center Pvt. Limited 3rd Floor, Jyoti Pinnacle Building, Opposite to Prestige IVY League Appt, Kondapur Road, Hyderabad - 500 081 Contact Person- Giridhar Tel: 040-67426702","location":"Hyderabad","experience":"3 - 7 Years"},{"date":"9, 10, 11, 12, 13 - Dec - 2019","skills":"Software Testing, Automation tools (Selenium Webdriver), Performance tools (Jmeter etc)","qualification":"B.E./B.Tech, MCA/PGDCA","address":"GD Research Center Pvt. Limited (GDRC), Jyothi Pinnacle, Survey No. 11, 3rd floor, Kondapur, Hyderabad, Telangana - 500 081. Landmark: Hi tech City Road, Near google office","phone":"Not Provided","profile":"Software Testing Engineer \nGD Research Center Pvt. Limited (GDRC)","description":"Required Skills/ Qualification: Bachelor's Degree in Engineering/ Technology or MCA Bachelor's Degree with 3+ years' experience as a Software Test Engineer Experience in testing software products, writing test scripts Experience in process documentation Experience of using Automation tools (Selenium Webdriver ) Experience of using Performance tools (Jmeter etc) Roles & Responsibilities: Develop and write test scripts. Thorough testing of deliverables developed by development teams with quality and in time. Strong interpersonal and communication skills. Participate in agile development process to ensure project deliverables are met, on time and of High quality If interested to apply forward resume immediately @ mail id (salim@gdresearchcenter.com) Also, you may walk-in directly for personal interview (Mon-Fri)-(9th Dec till 13th December 2019), Walk-in Timings : 10:00 am till 5:00 pm. Interview Venue: GD Research Center Pvt. Limited (GDRC) Jyothi Pinnacle, Survey No. 11, 3rd floor, Kondapur, Hyderabad, Telangana - 500 081 Landmark: Hi tech City Road, Near google office Opp. to Prestige IVY league, Adjacently Opp. to ePark Building. Contact Person - Ms. Swathi","location":"Hyderabad","experience":"2 - 6 Years"},{"date":"9, 10, 11 - Dec - 2019","skills":"Housekeeping, General Administration, Front Desk/ Petty Cash, Receptionist Activities","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Oppo Mobiles (NR) Private Limited, Unit 704, 7th Floor, Block -B, Bestech Business Tower, Sector 66, Phase-9, Mohali, Punjab - 160 059.","phone":"0172-4903067","profile":"Front Desk Administrator \nOppo Mobiles (NR) Private Limited","description":"Candidate should be Any Garduate with 1 to 4 years of experience in Housekeeping, General Administration, Front Desk/ Petty Cash, Receptionist Activities, Ticket Booking, and Vendor Payments. Job Responsbility- Greet and welcome guests as soon as they arrive at the office Answer, screen and forward incoming phone calls Ensure reception area is tidy and presentable, with all necessary stationery and material (e.g. brochures) Provide basic and accurate information in-person and via phone/email,Responsible for the Courier Receiving/Dispatch. Renew the Visas, Ticket bookings , Hotel Booking for Staff . Order front office supplies and keep inventory of stock Walk-in Date/ Time: 7th - 11th December 2019, 10 AM onwards Venue Details- Oppo Mobiles (NR) Private Limited Unit 704, 7th Floor, Block -B, Bestech Business Tower, Sector 66, Phase-9, Mohali, Punjab - 160 059. Contact Person - Manmohan Singh Contact No. 0172-4903067","location":"Mohali","experience":"1 - 4 Years"},{"date":"12, 13 - Dec - 2019","skills":"Automation Testing, REST ASSURED/ JUnit framework for API testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"MS Technology Private Limited, 2, Community Centre, IInd Floor, Basant Lok, Vasant Vihar Opposite Hero Corporate office","phone":"Not Provided","profile":"Software Engineer - QA/ Testing \nMS Technology Private Limited","description":"Candidate should have 1 to 3 years of experience in Automation Testing with hands on experience of working with at least one of GUI based test automation tools for desktop and/or mobile automation using Selenium. Experience on other tools will be added advantage. Knowledge of Maven. Knowledge of REST ASSURED/ JUnit framework for API testing Hands on experience in any Java IDE (e.g. Eclipse) Hands on experience on GIT, JIRA, Jenkins Good understanding of OOPS concepts and strong programming skills in Java Selenium with Java (Interfaces, classes) Hands on experience on JMeter Knowledge of standard QA processes, test plans, test case design, test case management, Defect management and reporting. Walkin Date/ Time: 12th - 13th December 2019, 11 AM onwards Interview Venue: MS Technology Private Limited 2, Community Centre, IInd Floor, Basant Lok, Vasant Vihar Opposite Hero Corporate office","location":"Delhi","experience":"1 - 3 Years"},{"date":"9, 10 - Dec - 2019","skills":"Automation Testing, Manual Testing, Smoke Testing, Compatibility Testing, Regression Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Mahindra First Choice Wheels Limited, FERNS Icon, 3rd floor, Unit -4, Survey No:28 & 36/5, Doodanekundi, Outer Ring Road, Bangalore - 37.","phone":"Not Provided","profile":"Software Testing (Automation) \nMahindra First Choice Wheels Limited","description":"Person must have expertise in Automation Testing with good knowledge of Manual Testing. Experienced in Performed Smoke Testing, Integration Testing, System Testing, Regression Testing and Compatibility Testing Should be experienced in using Selenium WebDriver and TestNG Experienced on API Testing using SOAP UI, POSTMAN Knowledge in writing Xpath Expressions Understanding of Automation Life Cycle and Quality process Knowledge on Keyword and Data driven Framework Experienced should have in Executing scripts on IE, FireFox and Chrome Experienced in Integrating Git Project with Jenkins Integration tool Good in writing SQL Queries Walk-in Date/ Time: 4th - 10th December 2019, 10 AM onwards Interview Venue: Mahindra First Choice Wheels Limited, FERNS Icon, 3rd floor, Unit -4, Survey No:28 & 36/5, Doodanekundi, Outer Ring Road, Bangalore - 37. Contact Person - Archana P","location":"Bangalore","experience":"4 - 6 Years"},{"date":"9, 10, 11, 12, 13, 14, 15 - Dec - 2019","skills":"HR/ Recruitment, Travel Arrangements, Lead Generation, Report Generation","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Envale Systems Private Limited/ TDAUX, 304+305 Olive Arcade, Umashankar Joshi Marg, Near Shilp Cross Roads, Off C. G. Road, Navrangpura, Ahmedabad, Gujarat - 380 009.","phone":"9081580009","profile":"HR Cum Back Office Executive \nEnvale Systems Private Limited/ TDAUX","description":"Candidate should be Any Graduate (Female Only) with 1 to 2 years of prior administrative experience. Able to Attending customer call and resolve their problem. Manage Database & business-Sales. Must have excellent computer skills Call for Interview Check Bills, Voucher Social media handling must Language knowledge English , Hindi, Gujarati must Job Responsibilities: Handling office tasks, such as filing, generating reports and presentations, setting up for meetings, and reordering supplies. Providing real-time scheduling support by booking appointments and preventing conflicts. Making travel arrangements, such as booking flights, cars, and making hotel and restaurant reservations. Walk-in Date/ Time: 6th - 15th December , 11 AM onwards Interview Venue: Envale Systems Private Limited/ TDAUX 304+305 Olive Arcade, Umashankar Joshi Marg, Near Shilp Cross Roads, Off C. G. Road, Navrangpura, Ahmedabad, Gujarat - 380 009. Contact Person - Ms. Ruchi Maheshwari Phone No: 9081580009","location":"Ahmedabad","experience":"1 - 2 Years"},{"date":"9, 10, 11 - Dec - 2019","skills":"Backend Operations, Customer Service, Front Office Activities","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"VFS Global Services Private Limited, Srida Anushka Pride, 3rd Floor Roadd No. 12, Banjarahills, Hyderabad","phone":"8688671162","profile":"Backend Operations Officer \nVFS Global Services Private Limited","description":"Freshers with good communication skills in English can apply Excellent company to boost your career Day shift working. No Night Shifts Saturday & Sunday Weekly offs Job Responsbility- Document scrutiny and collection of applications for visa processing. Handle customer/ applicant queries personally or via email, telephone. Handle cash and bank related transactions if assigned and ensure 100% accuracy. Record & maintain all application data. Ensure accurate & timely data entry into the system with zero errors. Ensure all administration and logistics of passport delivery to consulate/ applicant / logistic company etc. Maintain compliance to the standard operating procedures, manuals etc. without deviation in process. Walk-in Date/ Time: 9th - 11th December 2019, 11 AM onwards Interview Venue: VFS Global Services Private Limited Srida Anushka Pride, 3rd Floor Roadd No. 12, Banjarahills, Hyderabad Contact Person- Bhavana Tel Number: 8688671162","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"9, 10, 11, 12, 13 - Dec - 2019","skills":"Backend, Banking Process, Back Office Services","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Konexions Back Office Services Pvt. Limited, K-23 Second floor Lajpat Nagar Part-II New Delhi","phone":"9718303903","profile":"Backend Coordinator \nKonexions Back Office Services Pvt. Limited","description":"We are Hiring Backend Coordinator, Backend Executive, Field Coordinator (Banking Process) in Konexions Back Office Services Pvt. Limited Candidates should have good typing speed Good communication skills are required Must be able to work in Excel sheet Must be smart and confidant Fresher and experience both can apply Walk-in Date/ Time: 9th - 13th December 2019, 9 AM onwards Interview Venue: Konexions Back Office Services Pvt. Limited K-23 Second floor Lajpat Nagar Part-II New Delhi Landmark: Near-Vijay Sales Contact Person - Nitin Chopra This is the directly company requirement if interested please call me at this no-9718303903","location":"Delhi","experience":"0 - 1 Years"},{"date":"9, 10, 11, 12, 13 - Dec - 2019","skills":"Automation Testing, Selenium, Core Java and Appium","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Extramarks Education India Pvt. Limited, D-180, Sector 63 Noida - 201 301","phone":"Not Provided","profile":"Automation Test Engineer \nExtramarks Education India Pvt. Limited","description":"Person must have strong experience of 3 to 5 years of Automation experience in Selenium, Core Java and Appium. Good understanding of basic testing concepts, covering user experience, APIs and business workflows. Good understanding of software test life cycles Good communication skills- able to interact directly with the dev and the BA teams. Good to Have- exposure to performance testing and working knowledge of JMeter tool Exposure to DevOps practices (CI/CD) Key Responsibilities: Automation of functional and non-functional requirements To create test cases and data (manual and automated) Scripting and executing the Selenium automation scripts Walk-in Date/ Time: 9th - 13th December 2019 from 11 AM onwards Interview Venue: Extramarks Education India Pvt. Limited D-180, Sector 63 Noida - 201 301","location":"Noida","experience":"3 - 5 Years"},{"date":"9, 10 - Dec - 2019","skills":"Back Office Processing, Business Services, Insurance Operations, Non Voice Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"AXA Business Services Private Limited, Marvel Edge, Block C & D, 2nd Floor, Survey No. 207/1A+33/2, Lohegaon, Viman-Nagar, Pune - 411 014.","phone":"Not Provided","profile":"Backend Executive (Non-Voice Process) \nAXA Business Services Private Limited","description":"AXA Business Services Private Limited, is hiring for Non-Voice Process-Life Insurance domain-Pune Qualification: Non-technical Freshers or Non-Tech/ Tech Graduate with relevant experience Graduate is a must Experience/ Skills required: Fresher or experienced professionals with up to 2 years of experience into Non voice. Excellent in conversational and comprehension skills Non technical graduates. Flexible to work with night shift. Work Location: Suzlon One Earth, Hadapsar, Opposite to Magarpatta City, Pune Interested candidates can walk in with their updated resumes to the below mentioned address- AXA Business Services Private Limited Marvel Edge, Block C & D, 2nd Floor, Survey No. 207/1A+33/2, Lohegaon, Viman-Nagar, Pune - 411 014. Land mark - Behind Hyatt Hotel Contact Person: Anusha Walk-in Date: 9th & 10th December 2019 Time: 10 am- 12.00 pm","location":"Pune","experience":"0 - 2 Years"},{"date":"9, 10, 11, 12, 13 - Dec - 2019","skills":"Software Testing, Database Testing/ Manual Testing, Writing SQL Queries","qualification":"B.E./B.Tech, MCA/PGDCA","address":"WIPRO HR Services Private Limited, Olympia Technology Park, Altius Block, Guindy, Chennai, Tamil Nadu - 600 032.","phone":"044-43905000","profile":"Manual Testing Engineer \nWIPRO HR Services Private Limited","description":"Candidate should have minimum 1.5 to 2.5 years of relevant experience in Database Testing/ Manual Testing. Additional US health care knowledge adds knowledge. Requirement Gathering Skills & Defects identification Knowledge of system testing and software quality assurance best practices and methodologies. Must have good knowledge in Manual Testing. Writing SQL Queries Knowledge of Software Development Life Cycle (SDLC) Principles/ Concepts. Understands processing associated with standard batch processing flows Reads and interprets basic programming logic Uses in-house software to build basic batch jobs Work Conditions: 11 am - 9 pm Should able to join us by immediate or 15 days less than Candidate possess good DB testing experience Walk-in Date/ Time: 9th - 13th December 2019, 9 AM onwards Interview Venue: WIPRO HR Services Private Limited Olympia Technology Park, Altius Block, Guindy, Chennai, Tamil Nadu - 600 032. Contact Person - Monica Phone No. 044-43905000","location":"Chennai","experience":"1 - 3 Years"},{"date":"9, 10, 11, 12, 13 - Dec - 2019","skills":"Software Testing, Test Engineering, Test Scenarios, Selenium, Automation Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Techbooks International Pvt. Limited, Aptara, A-37, Sector - 60, NOIDA, Uttar Pradesh - 201 301.","phone":"0120-41682424","profile":"Software Testing Engineer \nTechbooks International Pvt. Limited","description":"Person must have 2 to 5 years testing experience for web based software products with 1+ years of software testing experience in automated testing on Selenium Web Driver. Create test scenarios, test script, and test cases prior to feature delivery in order to support continuous delivery. Work on traceability matrix to trace requirements to estimate test case development and execution effort Hands on experience in Web services. Preparation of test coverage, and regression analysis reports to support high quality delivery. Desired Skills- Strong knowledge of software QA Methodologies and Processes Excellent communication skills, good sense of teamwork Knowledge of MS Office (Word, Excel, PPT, Visio) Disciplined and self-motivated in delivering high-quality software. Walk-in Date/ Time: 9th - 13th December 2019, 11 AM onwards Interview Venue: Techbooks International Pvt. Limited Aptara, A-37, Sector - 60, NOIDA, Uttar Pradesh - 201 301. Contact Person - Aishwarya Phone: 0120-41682424","location":"Noida","experience":"2 - 5 Years"},{"date":"9, 10 - Dec - 2019","skills":"Software Testing, Test Engineering, Quality Assurance, Manual Testing","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"QualityKiosk Technologies Private Limited, A Wing - 419, Rupa Solitaire, Millennium Business Park, Mahape, Navi Mumbai - 400 709.","phone":"Not Provided","profile":"Manual Tester/ Freshers \nQualityKiosk Technologies Private Limited","description":"Candidate would be responsible to participate in the entire Manual Test Lifecycle Performing of the Insurance Products Lifecycle (General and Life) Job Location : Anywhere within Mumbai Skills/ Responsibilities: Create Test Scenarios & Test cases basis of BRD / FSD documentation Creating Requirement Traceability Matrix for Tests designed. Independently drive Test pack walkthroughs along with various Stakeholders Selection of Regression Tests applicable Selection of Test cases, rightly suitable for Automation considering automation selection criteria's Create/ Update Test Data for Automation Test cases Identify Test Data inputs that can be dynamic values to be generated every time with Formulas, Database Query, Calculators Perform SIT & UAT Test Execution Report Defects & follow up with Developers / Business Analyst (IT )for defect fixation with defect ageing tracking SLA Provide Test Results walkthrough to stakeholders for Sign off Qualification/ Prerequisites: Candidate should have score 60% and above in 10th, 12th and Graduation. BE/ B.Tech/ MCA/ B.Sc/ Msc- (IT, Computer Science, Electronics & Telecommunication) 2018 & 2019 Pass outs Walk-in Date/ Time: 9th - 10th December 2019, 11 AM onwards Interview Venue: QualityKiosk Technologies Private Limited A Wing - 419, Rupa Solitaire, Millennium Business Park, Mahape, Navi Mumbai - 400 709. (Directions: Next to Mastek, take a right from the main entrance) Lift Number 24 & 25 Contact Person - Agam Bhatnagar","location":"Mumbai","experience":"0 - 1 Years"},{"date":"5, 6, 7, 9, 10, 11, 12, 13, 14, 16, 17, 18, 19, 20, 21 - Dec - 2019","skills":"Java, Android SDK, Android Studio, REST/ JSON","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Casperon Technologies Private Limited, D. 84, Block No. 3, 4th Floor, Murugesa Nayakar Complex, Greams Road, Thousand Lights, Chennai - 600 006.","phone":"9176227305","profile":"Android Developer \nCasperon Technologies Private Limited","description":"Candidate must have good working knowledge with 1+ years of experience in Android Development. Should possess extensive programming knowledge of Java, Android SDK. Must have strong working knowledge in Android Studio, REST/ JSON. Walk-in Date/ Time: 5th - 21st December 2019, 12 PM onwards Interview Venue: Casperon Technologies Private Limited D. 84, Block No. 3, 4th Floor, Murugesa Nayakar Complex, Greams Road, Thousand Lights, Chennai - 600 006. Contact Person- Aravind (9176227305)","location":"Chennai","experience":"1 - 3 Years"},{"date":"11 - Dec - 2019","skills":"Java, Spring, Spring Boot, e-Commerce, MVC, Hibernate","qualification":"B.E./B.Tech","address":"FTD India Private Limited, Block D Wing II , 5th Floor, Cyber Gateway, Building, Hitech City, Madhapur Village, Serlingampally, Hyderabad - 500 081.","phone":"040-66030303","profile":"Software Engineers - Java \nFTD India Private Limited","description":"We are seeking passionate software application developers to work with our highly talented team of young dedicated professionals who aim to give our customers a memorable shopping experience. Education: BE/ B.Tech with 70% throughout academics from premier institutions Experience Range: 1-4 Years Place of Work: Hyderabad Knowledge, Skills & Abilities: Expert level Java skills: Can write non trivial distributed applications using Java libraries. Excellent understanding of Generics, concurrency, streams, java collections Strong understanding of Microservices and Cloud Native Application architectures. Excellent in development and deployment of MicroServices by using Spring Boot, Spring Cloud and API gateway (Netflix Zuul). Strong Core Spring and the Spring ecosystem (Spring Boot, Spring Cloud, Spring Data, Spring Security) skills. Experience with Test Driven Development (TDD) and testing tools such as Junit and Mockito. Walk-in Date: December 11, 2019 (Wednesday) Time: 9:00 AM to 2:00 PM Interview Venue: FTD India Private Limited Block D - Wing II, 5th Floor, Cyber Gateway Building, HitechCity, Madhapur Village, Hyderabad - 500 081. Contact Person - Naga Kumar Phone No. 040-66030303","location":"Hyderabad","experience":"1 - 4 Years"},{"date":"9, 10, 11, 12, 13, 16, 17, 18, 19, 20, 23, 24, 25, 26, 27 - Dec - 2019","skills":"Java, J2EE, Spring MVC, Hibernate","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Paygate India Private Limited, Office No. 628, 6th floor, Lodha Supremus 2,, Road No. 22, Wagle Estate, Thane, Maharashtra - 400 604","phone":"9702380418","profile":"Java Developer \nPaygate India Private Limited","description":"Candidate should have experience in developing applications using JAVA/ J2EE programming skills. Work Experience: Fresher/ 2-3 Years Job Location: Mumbai Must have strong in DB knowledge Should be good with OOPS Concept Should be good in design and application development using object oriented programming Experience in any application framework like Spring and ORM tools like Hibernate Good understanding/ experience on software development methodology such as Agile, TDD etc. Good understanding of source control tools and its use (SVN, Git etc...) Experience in web services would be a plus but not mandatory","location":"Mumbai","experience":"0 - 3 Years"},{"date":"9, 10, 11, 12, 13 - Dec - 2019","skills":"Java/ JSP, Core Java, Collection, MySQL and SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"eClinicalWorks India Private Limited, 4th Floor, Venus Atlantis, Beside Shell Petrol Pump, Prahaladnagar, Ahmedabad - 380 015","phone":"Not Provided","profile":"Java Developers \neClinicalWorks India Private Limited","description":"Candidate should be Graduate in CS, IT or any other technical stream with minimum 1 year of Java development experience. Must have Immense understanding of object-oriented programming, data structures and algorithms and software engineering methodologies along with time complexity part. Expertise with web architecture, providing design and development recommendations and optimizing existing infrastructure. Strong knowledge and experience with Java/ JSP if appearing for Java role (Core Java, Collection) Working knowledge of Apache Tomcat. Strong background in databases including MySQL and SQL Server Experience using source control and bug tracking systems and writing technical documentation Rest API Walk-in Date/ Time: 9th - 13th December 2019, 4 PM onwards Interview Venue: eClinicalWorks India Private Limited 4th Floor, Venus Atlantis, Beside Shell Petrol Pump, Prahaladnagar, Ahmedabad - 380 015 Contact - HR Team","location":"Ahmedabad","experience":"1 - 4 Years"},{"date":"12 - Dec - 2019","skills":"Core Java, Collection framework, OOPS, Multi-threading, JDBC, JSP, Servlets & Database","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Marathwada Mitra Mandal's College of Engineering, 4th floor, 405 Seminar Hall, MMCOE, Vadar Vasti Road, Behind Vandevi Temple, Karve Nagar, Pune - 411 052.","phone":"022-61432499","profile":"Software Engineer/ Java Trainee \nNaaptol Online Shopping Private Limited","description":"Candidate must have strong knowledge on OOPS, Core Java, Collection framework, and Multi-threading, JDBC, JSP, Servlets and Database like Oracle or MySQL. Fresher's (2016/ 17/ 18/ 19 Passed outs) with good knowledge on Java Concepts are eligible. Must be self-motivated, fast learner, organized, metrics driven. Good communication skills are required. Must be familiar with HTML, CSS, JavaScript, JQuery Any Java Framework like Hibernate & Web Services will be an added advantage. Must be willing to work on Java technology and must be a fast learner, Must be able to work in dynamic and challenging environments. Job Location: Rabale, Navi Mumbai We would conduct the Aptitude & Technical Test at Drive Interview Date: 12th December, 2019 Time: 10 am to 1 pm Venue Details: Marathwada Mitra Mandal's College of Engineering 4th floor, 405 Seminar Hall, MMCOE, Vadar Vasti Road, Behind Vandevi Temple, Karve Nagar, Pune - 411 052. Interested candidates can either share their resumes on bhushan.mhatre@naaptol.com or else directly walk in for the drive along with copy of your resume. Candidates are supposed to carry copy of their resume along with passport size photograph.","location":"Pune","experience":"0 - 1 Years"},{"date":"14 - Dec - 2019","skills":"Java, RESTful APIs, Spring framework, HTML, Java Script & CSS","qualification":"B.Sc, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Bytemark Technology Solutions India Pvt. Limited, 1st floor, Plot No. 6/A, Amit Plaza, Bannerghatta Road, J.P. Nagar 3rd Phase, Bangalore - 560 076.","phone":"Not Provided","profile":"Java Developers \nBytemark Technology Solutions India Pvt. Limited","description":"Candidate should have 2 to 4 years of experience building RESTful APIs with 2+ year of hands-on Java experience using Play 1.x/ Spring framework. Knowledge of Spring or Grails frameworks is a plus. Experience with Test Driven Development (TDD) using JUnit, Selenium or a similar technology Qualification: B.E/ B.Tech, M.Tech, MCA, BCA, BSc (Computer Science) Work Experience: 3-5 years of software development experience Able to handle multiple tasks in a fast paced environment. Must have ability to write SQL. Understanding of OOP Basic knowledge of Unix Experience working with HTML, JavaScript & CSS Excellent verbal, written, and interpersonal communication skills Walk-in Date/ Time: 14th December 2019, 10 AM onwards Interview Venue: Bytemark Technology Solutions India Pvt. Limited 1st floor, Plot No. 6/A, Amit Plaza, Bannerghatta Road, J.P. Nagar 3rd Phase, Bangalore - 560 076. Landmark: NEAR Mandovi Motors (Above Axis Bank) Contact Person- Priyanka Das Carry hard copy of your resume- Interview process on 14th December 2019 1. Technical Written Test - 30mins 2. Technical Face to Face interview on the same day for the selected candidates. Note: Only candidates having experience of 3 years or more are eligible to attend the interview. The candidate should have strong experience in Core JAVA, Collections, REST Web services and SQL.","location":"Bangalore","experience":"2 - 7 Years"},{"date":"11 - Dec - 2019","skills":"Core Java/ Http/ J2EE fundamentals, JDBC, JTA, RESTful Services","qualification":"B.E./B.Tech","address":"FTD India Private Limited, Block D - Wing II, 5th Floor, Cyber Gateway Building, HitechCity, Madhapur Village, Hyderabad, Telangana - 500 081.","phone":"040-66030303","profile":"Software Engineer/ Java Lead \nFTD India Private Limited","description":"We are seeking passionate software application developers to work with our highly talented team of young dedicated professionals who aim to give our customers a memorable shopping experience. Knowledge, Skills & Abilities: Candidate must be strong in Core Java/ Http/ J2EE fundamentals. Good hands on skills in Java, JDBC, JTA, RESTful Services Good experience with frameworks like Spring core, Spring MVC and Hibernate Strong Experience with Relational databases like Oracle or MySQL Working experience in Unix/ Linux environment Good problem solving and excellent communication skills. Experience in JavaScript, JQuery, CSS, Bootstrap, HTML, Ajax. Experience in the following are definite plus Experiencing in working on Broadleaf commerce framework. Understanding of Apache Solr Understanding of Microservices and Cloud Native Application architectures. Spring ecosystem (Spring Boot, Spring Cloud, Spring Data, Spring Security) skills. Requires excellent spoken and written English skills. Interview Date/ Time: 11th December 2019, 9 AM onwards Interview Venue: FTD India Private Limited Block D - Wing II, 5th Floor, Cyber Gateway Building, HitechCity, Madhapur Village, Hyderabad, Telangana - 500 081. Contact Person- Naga Kumar Tel: 040-66030303 Interview Process: Candidates who clear Code Assessment test will be processed for further technical discussions. Note: Candidate who attended our interview process in last 6 months are not eligible for this drive.","location":"Hyderabad","experience":"6 - 9 Years"},{"date":"14 - Dec - 2019","skills":"Android SDK, REST, JSON, Third-Party Libraries and APIs","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Semcon India Private Limited, RMZ Nxt, Campus 1B, First Floor, Unit 102 Sonnenahalli Villa Mahadevapura K.R. Puram Hobli, Bangalore","phone":"9513555023","profile":"Android Developer/ Tech Lead \nSemcon India Private Limited","description":"Candidates should have 3 to 8 years experience in Android application development Android building blocks, Design and architectural patterns Good knowledge of Java, testing and reviews Experience with Android SDK Experience working with remote data via REST and JSON Experience with third-party libraries and APIs Job Responsbility- Designing and developing advanced applications for the Android platform. Unit-testing code for robustness, including edge cases, usability, and general reliability Bug fixing and improving application performance Walk-In Date: 14 December 2019 Reporting Time: 9:00 AM Interview Venue: Semcon India Private Limited RMZ Nxt, Campus 1B, First Floor, Unit 102 Sonnenahalli Villa Mahadevapura K.R. Puram Hobli, Bangalore Interested candidates can share your profiles on or before 13th December 2019. Shaheen Banu (HR) Email: Shaheen.Banu@Semcon.com Mob No: 9513555023","location":"Bangalore","experience":"3 - 8 Years"},{"date":"14 - Dec - 2019","skills":"Data Science, C#, Java, Big Data Analytics, Artificial Intelligence","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Knowledge Lens Private Limited, 74/A ,ZED Tech Park, Keonics, Electronic City Phase 1 Bengaluru - 560 100.","phone":"Not Provided","profile":"Java Developers \nKnowledge Lens Private Limited","description":"Our team is now hiring for various roles in Big Data, Java, Dot Net, Python, UI with Angular, Data Scientist, Big Data Technology Lead. Work Experience: 1+ years Walk-in Date/ Time: 14th December 2019, 9 AM onwards Interview Venue: Knowledge Lens Private Limited 74/A ,ZED Tech Park, Keonics, Electronic City Phase 1 Bengaluru - 560 100. Contact Person- Jayashree S Register your name along with full & updated resume with contact.","location":"Bangalore","experience":"1 - 6 Years"},{"date":"7, 9, 10, 11, 12 - Dec - 2019","skills":"Java, Spring, Hibernate","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Esquare (E2 Software India Private Limited), 22/1, Madeeha Square, 2nd Floor, Coles Road, Frazer Town, Bengaluru, Karnataka - 560 005.","phone":"8431755221","profile":"Java Developers \nE2 Software India Private Limited","description":"Education Qualification : BE (CSE), B.Tech (IT), MCA, M.Sc (IT) Passed Out Year : 2016, 17 & 18 Should have good command over English Must have full confidence. Good communication skills. Candidates passed out in 2016, 2017 & 2018 can apply. Freshers with some years of non it exp and 1-yr exp in Java also should be fine. Excellent Opportunity to start your career in IT Field. Hiring Process- Aptitude/ Technical test and Face-to-Face Walk-in Date/ Time: 5th - 12th December , 11 AM onwards Interview Venue: Esquare (E2 Software India Private Limited) 22/1, Madeeha Square, 2nd Floor, Coles Road, Frazer Town, Bengaluru, Karnataka - 560 005. Contact Person - Sultana Phone: 8431755221","location":"Bangalore","experience":"1 - 2 Years"},{"date":"9, 10, 11, 12, 13, 16, 17, 18, 19, 20 - Dec - 2019","skills":"JAVA/ J2EE [Servlets/ JSP/ JDBC], Spring, MySQL, RESTful, JSON","qualification":"B.E./B.Tech, MCA/PGDCA","address":"United Software Group Inc/ Stratosphere IT Services, A-154/A 2nd Floor, Sector-63, Noida - 201 301.","phone":"0120-4395750","profile":"Java Developers \nStratosphere IT Services Private Limited","description":"Work Experience: 1 to 3 Years Job Location: Noida Key Skills : JAVA/ J2EE [Servlets/ JSP/ JDBC], Spring, MySQL, RESTful, JSON Development of JAVA/ J2EE based web applications. Writing of fully optimized code for optimum performance. Must have experience in MySQL, query optimization. Hands on Experience in API integration, Development, Module Handling. Adhere to the process and coding standards and guidelines. Should be very strong in Core JAVA, J2EE [Servlets/ JSP/ JDBC] Should familiar with Eclipse environment. Should be good experience in TOMCAT deployment [In LINUX environment]. Added advantage knowing Java Script, JSON, Bootstrap and JQuery. Job Responsibilities : Integration of user-facing elements developed by front-end developers. Build efficient, testable, and reusable JAVA/ J2EE modules. Walk-in Date/ Time: 9th - 20th December 2019, 9 AM onwards Interview Venue: United Software Group Inc/ Stratosphere IT Services, A-154/A 2nd Floor, Sector-63, Noida - 201 301. Contact Person- Mithun Saini Phone No. 8360674598","location":"Noida","experience":"1 - 3 Years"},{"date":"9, 10 - Dec - 2019","skills":"Core Java, Spring boot Design Pattern, OOPS. Web Services, Database","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Wipro Limited, Building 2, Candor Tech Space, Tikri, Sector 48 Gurgaon, Haryana - 122 001. Nearest Metro Station- HUDA","phone":"Not Provided","profile":"Core Java Developers \nWipro HR Services (India) Private Limited","description":"Wipro Limited is hiring for Core Java Developers with 2 to 4 years of experience. Required Skills- Core Java with Java 6, 7 features Java 8 - Good to have, Spring boot Design Pattern, OOPS. Web Services, Database Walk-in Date: 9th - 10th December 2019 Time to report : 10: 00 -11:00 am NO ENTRY AFTER 11: 00 AM Assessment Test : 10:45 am till 12:45 pm Interview Time : 12:30 pm till 3:00 pm Total time duration : 3-5 hours Interview Venue: Wipro Limited Building 2, Candor Tech Space, Tikri, Sector 48 Gurgaon, Haryana - 122 001 Nearest Metro Station- HUDA Contact Person- Satbir Kaur Please share resume at satbir.kaur@alight.com / satbir.kaur@wipro.com","location":"Gurgaon","experience":"2 - 4 Years"},{"date":"9, 10, 11, 12, 13, 14 - Dec - 2019","skills":"Java Spring Boot , Microservices, REST API, MySQL/ MongoDB","qualification":"B.E./B.Tech, MCA/PGDCA","address":"CENIT IT Hub Private Limited, 7-1-214/ 4, Jana Arcade, 5th Floor, 501, Dharam Karam Road, Ameerpet, Hyderabad - 500 016.","phone":"040-66572424","profile":"Java Developers \nCENIT IT Hub Private Limited","description":"Candidate must have at least 2+ years of strong development experience in Java Spring Boot , Microservices, REST API, MySQL/ MongoDB or any equivalent. Must have good coding skills and shall be able to write code after logic is explained by the lead. Must solve the business logic problem through coding Should have knowledge of AWS. Walk-in Date from 9th - 14th December 2019, 1 AM onwards Interview Venue: CENIT IT Hub Private Limited 7-1-214/ 4, Jana Arcade, 5th Floor, 501, Dharam Karam Road, Ameerpet, Hyderabad - 500 016. Contact No: 9494888550","location":"Hyderabad","experience":"2 - 7 Years"},{"date":"9, 10, 11, 12, 13, 16, 17, 18, 19, 20 - Dec - 2019","skills":"Core Java, Spring MVC, Hibernate, JSP, Web Services, MySQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Gauge Data Solutions Private Limited, 2102-2013, Express Trade Tower 2 Sector 132, Noida - 201301.","phone":"0120-4190112","profile":"Core Java Developer \nGauge Data Solutions Private Limited","description":"Gauge Data invites energetic and enthusiastic candidates to join them. We are conducting walk-in interviews for the position of Java Developer. Essential Skills:- 1) Excellent knowledge of Java & J2EE technology including Core Java, Spring MVC, Hibernate, JSP, MySQL, Web Services 2) Strong analytical and coding skills 3) Good Academic record 4) Should be a self-starter and a good team player with a high sense of ownership. 5) Willingness to learn and work on new technologies. Good to have:- 1) Knowledge in multi-threaded applications 2) Exposure on Lucene-based search engines, indexing, ranking, 3) NoSQL solutions 4) Knowledge in Database, both RDBMS and NoSQL Walk-in Dates: 4th to 20th December 2019 Time : 10:00 AM - 4:00 PM Interview Venue: Gauge Data Solutions Private Limited 2102-2013, Express Trade Tower 2 Sector 132, Noida - 201301. Contact Person- Deeksha Dewal Phone No. 0120-4190112 [NO INTERVIEWS ON SATURDAY OR SUNDAY] For any query you can mail us at : deeksha.dewal@gaugeanalytics.com","location":"Noida","experience":"0 - 3 Years"},{"date":"13 - Dec - 2019","skills":"OPS, Core Java, Collection framework, Multi-threading, JDBC, JSP, Servlets and Database","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Smt. Indira Gandhi College of Engineering (SIGCE), Rajeev Gandhi College of Management Studies (RGCMS) Sector-8, Plot No. 1, Opposite to D- Mart, Ghansoli, Navi Mumbai - 400 701.","phone":"022-61432499","profile":"Software Engineer/ Java Trainee \nNaaptol Online Shopping Private Limited","description":"Candidate must have strong knowledge on OOPS, Core Java, Collection framework, Multi-threading, JDBC, JSP, Servlets and Database like Oracle or MySQL. Fresher's (2016/ 17/ 18/ 19 Passed outs) with good knowledge on Java Concepts are eligible. Must be self-motivated, fast learner, organized, metrics driven. Good communication skills are required. Must be familiar with HTML, CSS, JavaScript, JQuery Any Java Framework like Hibernate & Web Services will be an added advantage. Must be willing to work on Java technology and must be a fast learner, Must be able to work in dynamic and challenging environments. Job Location: Rabale, Navi Mumbai We would conduct the Aptitude & Technical Test at Drive Interview Date: 13th December, 2019 Time: 10 am to 1 pm Venue Details: Smt. Indira Gandhi College of Engineering (SIGCE) Rajeev Gandhi College of Management Studies (RGCMS) Sector-8, Plot No. 1, Opposite to D- Mart, Ghansoli, Navi Mumbai - 400 701. Interested candidates can either share their resumes on bhushan.mhatre@naaptol.com or else directly walk in for the drive along with copy of your resume. Candidates are supposed to carry copy of their resume along with passport size photograph.","location":"Mumbai","experience":"0 - 2 Years"},{"date":"6, 7 - Dec - 2019","skills":"HR/ Recruitment, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Soft Suave Technologies Private Limited, No-100, 3rd floor, Kundrathur Main Road, MS Nagar, Porur, Chennai - 600 116.","phone":"Not Provided","profile":"HR Executive \nSoft Suave Technologies Private Limited","description":"The expected candidate should be go getter, proactive, and with exceptional english communication skills. Freshers can also apply, at least 1 year of experience is preferred though. Recruiting skills Problem solving skills Decision making skills Inter personal Skills Leadership & Mentoring Forward planning & strategical Thinking Walk-in Date/ Time: 6th - 7th December 2019, 10 AM onwards Interview venue: Soft Suave Technologies Private Limited, No-100, 3rd floor, Kundrathur Main Road, MS Nagar, Porur, Chennai - 600 116. Contact Person- Sudhendra Devi If you wish to attend HR interview on some other day, kindly send your updated resume to teamhr@softsuave.com with choice of your date and time & work location as Chennai, we will confirm by replying to it.","location":"Chennai","experience":"0 - 3 Years"},{"date":"6, 7 - Dec - 2019","skills":"Front Office, Back Office Operations, Data Entry, Back Office Operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Rapidsoft Technologies Private Limited, Plot 63, Udyog Vihar, Phase IV, Gurgaon, Haryana - 122 001","phone":"Not Specified","profile":"Front Desk Executive (Female) \nRapidsoft Technologies Private Limited","description":"Candidate should have good knowledge of office management and basic bookkeeping Excellent knowledge of MS Office (especially Excel and Word) Strong communication and people skills Good organizational and multi-tasking abilities Maintain files and records; update when necessary Job Responsibilities- Responsible for end to end office operations Handle the walk-in as well as telephonic inquiries & maintaining record of visitors. Supervise & administer the Supervisor,keep a check on housekeeping & office staff. Must have Strong interpersonal skills Walk-in Date/ Time: 6th - 7th December 2019, 11 AM onwards Interview Venue: Rapidsoft Technologies Private Limited Plot 63, Udyog Vihar, Phase IV, Gurgaon, Haryana - 122 001","location":"Gurgaon","experience":"1 - 2 Years"},{"date":"6, 9, 10, 11, 12, 13 - Dec - 2019","skills":"BPO Operations, Backend Operations, Background Check","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Matrix Business Services India Pvt. Limited, 3rd Floor, E 14B, Sector 8, Noida - 201 301","phone":"9953404600","profile":"Back Office Executive/ Asst. Manager \nMatrix Business Services India Pvt. Limited","description":"We are currently looking for candidates for candidates for various positions for Background Verification process as mentioned below based at Noida Location. Key Requirements: Junior Executive - Fresher or having 1 Year experience with good communication skills Salary 14-15K CTC Senior Executive - Having 2 - 3 Year BGV experience with good communication skills Salary 15-17K CTC Assistant Manager - Having 4 - 5 Year BGV experience with good communication skills Field Executive - Routes Knowledge Salary up to 14K CTC If you are interested you can come and attend the interview in below address on weekdays- (4th December - 13th December , 10 AM onwards) Matrix Business Services India Pvt. Limited, 3rd Floor, E 14B, Sector 8, Noida - 201 301 Contact Person: Ms. Kamiya Tel: 9953404600","location":"Noida","experience":"0 - 5 Years"},{"date":"7 - Dec - 2019","skills":"HR/ Recruitment, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Cvent India Private Limited, 19th Floor, Tower C& D, Building No. 14, DLF Cyber City SEZ, Gurgaon - 122 002.","phone":"Not Provided","profile":"Recruitment Coordinator \nCvent India Private Limited","description":"Applicant should have 0 to 2 years of experience with at least Bachelor's degree. Knowledgeable in internet recruiting techniques and familiar working with resume management. Ability to prioritize, manage time well, stay organized, quickly address needs and adjust focus as needed Outstanding oral and written communication skills Proficiency with MS Office (Outlook, Word, Excel) Quick learner, with a positive attitude and ability to work well within a team Ability to treat sensitive/confidential information with appropriate discretion Ability to comfortably work in an intensely deadline-oriented environment Walk-in Date: Saturday, December 7th, 2019 Time: 12 PM- 3 PM Interview Venue: Cvent India Private Limited 19th Floor, Tower C& D, Building No. 14, DLF Cyber City SEZ, Gurgaon - 122 002. Contact Person- Tanupriya Saharan","location":"Gurgaon","experience":"0 - 2 Years"},{"date":"7 - Dec - 2019","skills":"Technical Support, Semi Voice Process, Application Support, Service Delivery","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"DXC Technology India Private Limited, Maruthi Concorde Tech Park Service Road, Konappana Agrahara, Electronic City Phase II, Bengaluru, Karnataka - 560 100.","phone":"Not Provided","profile":"Technical Support (Semi Voice Process) \nDXC Technology India Private Limited","description":"Candidate should have Graduation (preferably 10+2+3/ 4) with 0 to 3 years general experience, or equivalent combination of experience and college level education. Understands internal processes and tools. Knowledgeable in call routing and case management processes as well as case logging systems and obligation systems. Knowledge & Skills: Excellent skills in both written and verbal communication. Experience in customer facing role either remote or face to face. Good knowledge with application support Problem solving skills with Accuracy in data entry. Excellent fluency in language to be supported. Experience in a phone based remote role, e- support, e-chat or similar. Familiarity with computer technology. Knowledge of Knowledge Management Systems and appropriate documentation to the system. Flexible to work in rotational shifts 24x7 Interview Details : Date : 7th December '2019 (Saturday) Time : 10:00 AM to 1:00 PM Interview Venue: DXC Technology India Private Limited Maruthi Concorde Tech Park Service Road, Konappana Agrahara, Electronic City Phase II, Bengaluru, Karnataka - 560 100. (Landmark: Near to E City Buss Stand) Point of Contact : Anantha","location":"Bangalore","experience":"0 - 3 Years"},{"date":"6, 7, 9, 10, 11, 12, 13, 14, 16, 17, 18, 19, 20 - Dec - 2019","skills":"Technical Support, IT Service Desk, Customer Cupport","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Comodo Security Solutions Private Limited, 10th floor, Prestige Centre Court, Vijaya Forum Mall, 183, NSK Salai, Vadapalani, Chennai - 26","phone":"9384667852","profile":"Technical Support Engineer \nComodo Security Solutions Pvt. Limited","description":"Candidate must possess strong troubleshooting & analytical skills. Must have exceptional verbal/written communication skill in English. Knowledge on Networking, Web Servers, Web Hosting, DNS and Cryptography is preferable. Experience or relevant knowledge on Linux & Windows Servers is preferable. Certifications on RHCE / MCSE / CCNA will be an added advantage Part of a Technical Support Team, you will be responsible for providing 24/7 Technical Support to customers and partners. Must be able to work independently and offer the highest quality support for all technical issues related to Digital Certificates over Email, Live Chat & Phone. Walk-in Date/ Time: 6th - 20th December 2019, 11 AM onwards Interview Venue: Comodo Security Solutions Private Limited, 10th floor, Prestige Centre Court, Vijaya Forum Mall, 183, NSK Salai, Vadapalani, Chennai - 26 Contact Person- Krithika ( 9384667852 )","location":"Chennai","experience":"2 - 4 Years"},{"date":"7, 8, 9 - Dec - 2019","skills":"Front Desk/ Reception Activities, General Administration","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"COLSTON Bath Spa Private Limited, 65 No, Rajasthani Industrial Area Co-oprative Industrial Estate, New Delhi - 110 033.","phone":"701512413","profile":"Front Desk Officer (Female) \nCOLSTON Bath Spa Private Limited","description":"Candidate should be Any Garduate with good verbal and written communication skills. Must have professional personal presentation. Job Responsbility- Managing the Front desk and handling all calls and Greet visitors/ clients providing a friendly, courteous front office service reflecting the corporate image of the client. Should be able to maintain attendance records and registers through computer/ manually. Should be able to maintain distributing and receiving of mail/courier. Supporting HR functions such as handling the event celebration, maintain housekeeping, support staff and drivers for the smooth working. Administrative Support and Service. Walk-in Date/ Time: 7th - 9th December from 3 PM onwards Interview Venue: COLSTON Bath Spa Private Limited 65 No, Rajasthani Industrial Area Co-oprative Industrial Estate, New Delhi - 110 033. Tel/ Phone: 701512413","location":"Delhi","experience":"1 - 5 Years"},{"date":"7 - Dec - 2019","skills":"Back End Operations, Non-Voice Support","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"HCL Technologies Limited, 1st Floor, WSS Towers or Navins Building, 106 & 107, Langs Garden Road, Mount Road, Pudupet, Chennai - 600 002","phone":"Not Provided","profile":"Backend Process Associate \nHCL Technologies Limited","description":"Walk-in for Healthcare Non-Voice Support - Looking only for Fresher's Work timings will be US shift timings - Night Shifts. Only Graduates- 10+2+3 (No Backlogs) Essential Requirement: Should be flexible to work in Night shifts. Immediate joiners are preferred. Work location is at Sholinganallur. Other Benefits: Doorstep cab pick and drop - Free Transportation for women (T&C Applied). Internal opportunity within HCL BPO after 18 months. Excellent Opportunity for Fresher's to start up their Career. If Interested, you may walk-in with your updated Resume. Date of Interview- 7th December 2019' Timings : 10.30 am to 1 pm Interview Venue: HCL Technologies Limited, 1st Floor, WSS Towers or Navins Building, 106 & 107, Langs Garden Road, Mount Road, Pudupet, Chennai - 600 002 Landmark : Near Casino Theatre Contact HR : Immanuel, HR Please, mention Immanuel on top of your Resume without fail","location":"Chennai","experience":"0 - 1 Years"},{"date":"7 - Dec - 2019","skills":"Technical Support, SQL Queries","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Amazon Development Centre (India) Pvt. Limited, 40, B Block, 5th Floor, Global Infocity (SP Infocity), M G R Salai, Perungudi, Kandanchavady, Chennai - 600 096","phone":"Not Provided","profile":"Technical Support (SQL & Linux) \nAmazon Development Centre (India) Pvt. Limited","description":"Eligibility Criteria: Minimum Qualification - Any Graduation Work Experience - 0 to 3 years (Max) Notice period shouldn't be more than 15 days. Should have knowledge in SQL & Linux. Should be able to write query in SQL and use Linux Commands. Excellent problem Solving Skills. Walk-in Date/ Time: 7th December 2019, 9 AM onwards Interview Venue: Amazon Development Centre (India) Pvt. Limited, 40, B Block, 5th Floor, Global Infocity (SP Infocity), M G R Salai, Perungudi, Kandanchavady, Chennai - 600 096 Contact Person - Kakul Please carry hard copy of below documents (Mandatory): 2 copies of resume for the interview. Copy of PAN Card & Adhar Card Provisional Certificate / Degree Certificate of Highest educational qualification Last three months pay slip and Relieving letter from all previous employers Please carry of original government ID proof for security Note: The candidates who have appeared for Tech Ops / Tech Support Associate in the last 6 months are not eligible to re-apply.","location":"Chennai","experience":"0 - 3 Years"},{"date":"6, 7, 9, 10 - Dec - 2019","skills":"Technical Support, Customer Service/ Troubleshooting","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"One Point One Solutions Limited, 3rd floor, AKR Infinity Park, 46/1, 1st Main Road, Garvebhavipalya, 1st Main Road, Garvebhavipalya, Krishna Reddy Industrial Area, Hosapalaya, Muneshwara Nagar, Bengaluru - 560 068","phone":"8498896070","profile":"Technical Support/ Customer Support \nOne Point One Solutions Limited","description":"Qualification - 10+2 or Any Degree Language Skills - Good in English, Hindi and south Indian language skills Shift - Day shift (9:30am to 6:30pm) Sunday OFF Job location - Bangalore Candidate should have good communication skills Must have Good knowledge in customer service Flexible to work in day shift Required languages: English,Hindi English, Hindi, Kannada English,Tamil English,Hindi,Odiya English,Telugu Walk-In Interview on December 5th-10th@ 10am. Interview Venue: One Point One Solutions Limited 3rd floor, AKR Infinity Park, 46/1, 1st Main Road, Garvebhavipalya, 1st Main Road, Garvebhavipalya, Krishna Reddy Industrial Area, Hosapalaya, Muneshwara Nagar, Bengaluru - 560 068 If you are really interested, Kindly contact HR Satya 8498896070 Azam 9916900778","location":"Bangalore","experience":"0 - 2 Years"},{"date":"7 - Dec - 2019","skills":"C#/ .NET, Windows Forms, SQL Server Database","qualification":"B.E./B.Tech, MCA/PGDCA","address":"ENuke Software Private Limited, Pavillion Building 339/2 Mehrauli Road Near Mango Blossom Hotel, Anamika Enclave, Gurugram, Haryana - 122 007.","phone":"Not Provided","profile":".Net Developer \nENuke Software Private Limited","description":"Person should have 1 to 3 years of relevant experience in C#/ .NET and Windows Forms and SQL Server Database Development. Good knowledge of using JavaScript, jQuery, Bootstrap, HTML5.0, CSS3, Bootstrap, Ajax. Experience with Visual Studio & expert with ASP .NET Must have great aptitude and desire to learn and work in challenging environment. Candidate should be focused and self-motivated. Must have great willingness to learn. Must have great team working skills. Walk-in Date/ Time: 7th December 2019, 10 AM onwards Interview Venue: ENuke Software Private Limited Pavillion Building 339/2 Mehrauli Road Near Mango Blossom Hotel, Anamika Enclave, Gurugram, Haryana - 122 007. Contact Person- Rachna Jha","location":"Gurgaon","experience":"1 - 3 Years"},{"date":"5, 6, 9, 10, 11, 12, 13, 16, 17, 18, 19, 20 - Dec - 2019","skills":".NET web framework DotNet 4 or above including MVC","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Sitel India Private Limited, 5th Floor, B Wing Boomerang Building, Chandivali, Andheri (East) Mumbai - 400 072","phone":"Not Provided","profile":".Net Developer \nSitel India Private Limited","description":"We are seeking a .NET Developer responsible for building .NET applications using C# .Net 4 or above including MVC with focus is on front-end and back-end development. Required Skills: Strong knowledge of .NET web framework DotNet 4 or above including MVC with focus is on front-end and back-end development Proficient in C#, with a good knowledge of their ecosystems Strong understanding of object-oriented programming Skill for writing reusable libraries Familiar with various design and architectural patterns Knowledge of concurrency patterns Proficient with Microsoft SQL Server Responsibilities: Translate application storyboards and use cases into functional applications Design, build, and maintain efficient, reusable, and reliable code Integrate data storage solutions which includes databases, key-value stores, blob stores, etc. Ensure the best possible performance, quality, and responsiveness of applications Identify bottlenecks and bugs, and devise solutions to mitigate and address these issues Help maintain code quality, organization, and automatization Walk-in Date/ Time: 4th - 20th December from 4 PM onwards Interview Venue: Sitel India Private Limited 5th Floor, B Wing Boomerang Building, Chandivali, Andheri (East) Mumbai - 400 072","location":"Mumbai","experience":"1 - 5 Years"},{"date":"7 - Dec - 2019","skills":"C# .Net, ASP .Net, JavaScript, JQuery, AngularJS, MVC, JQuery, AngularJS","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Vidushi Infotech Software Solutions Pvt. Limited, Cerebrum IT Park, Unit No-3A, Building B3, 2nd floor, Kalyani Nagar, Pune - 411 014.","phone":"9665552089","profile":".Net Developer \nVidushi Infotech Software Solutions Pvt. Limited","description":"Vidushi Infotech a CMMI Level 3 company is NOW HIRING Software Developer/ Senior Software Developer having 3-4 years of experience in .NET Technology. Required Skills- Expertise and hands on experience in .NET based design, development and deployment. Strong C# .Net and ASP .Net Experience with MVC. Working experience with JavaScript, JQuery, AngularJS. Must know HTML, CSS. Strong SQL skill set is mandatory. Responsible for quality and accountability of deliverable. Strong coding and debugging skills Candidates who are available to Join Immediately will be give first preference Male candidates only Walk-in Date/ Time: 7th December 2019, 10 AM onwards Interview Venue: Vidushi Infotech Software Solutions Pvt. Limited Cerebrum IT Park, Unit No-3A, Building B3, 2nd floor, Kalyani Nagar, Pune - 411 014. Contact Person- Rohit Salvi Phone No: 9665552089","location":"Pune","experience":"3 - 4 Years"},{"date":"6 - Dec - 2019","skills":"ASP .Net, C# .Net, VB.Net with preferably Oracle Database","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"DXC Technology India Private Limited, Surya Wave, Electronics City Phase 1, Electronic City, Bengaluru - 560 100.","phone":"Not Provided","profile":".Net Developers \nDXC Technology India Private Limited","description":"Skills Required for Microsoft 1. ASP .Net, C# .Net, VB.Net with preferably Oracle Database 2. C++ knowledge/ experience is preferred General Requirements: At least 3-10 years of work experience on these generic skillsets Experience managing and supporting multiple application Experience supporting IT applications in Citrix, Win7 and Unix environments Packaging knowledge with SCCM and App-V etc. Experience with Ticketing Systems (eg. ServiceNow, Remedy etc.) General Windows Server and network knowledge Knowledge/Experience with databases, SQL queries and PL/SQL scripting with Oracle and/or SQL server Walk-in Date/ Time: 6th December 2019, 10 AM onwards Interview Venue: DXC Technology India Private Limited Surya Wave, Electronics City Phase 1, Electronic City, Bengaluru - 560 100. Contact Person - Vijay","location":"Bangalore","experience":"3 - 10 Years"},{"date":"7 - Dec - 2019","skills":".Net, Javascript framework/ Library (Angular), MS SQL Server/ MySQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Nitor Infotech Private Limited, 5th Floor (B Wing), Rhine, Block 1.5, Embassy Tech Zone, Rajiv Gandhi InfoTech Park, Hinjewadi, Pune - 411 057","phone":"Not Provided","profile":".Net Developers \nNitor Infotech Private Limited","description":"Candidate must have 1 year experience in .Net Technology with minimum 6 months experience of working with one of the Javascript framework/ Library (Angular). Must be having excellent knowledge of Object Oriented Programming concepts. Must have good knowledge of SQL. Must have good knowledge of HTML, CSS, Javascript. Experience in working with one of the database like - MS SQL Server/ MySQL Soft skills Excellent interpersonal skills. Good communication skills. Walk-in Date/ Time: 7th December 2019, 10 AM onwards Interview Venue: Nitor Infotech Private Limited 5th Floor (B Wing), Rhine, Block 1.5, Embassy Tech Zone, Rajiv Gandhi InfoTech Park, Hinjewadi, Pune - 411 057 Landmark: Same premises as IBM & ATOS, ahead of Wipro Circle Phase-2 Contact Person- Prachi Jadhav","location":"Pune","experience":"1 - 3 Years"},{"date":"7 - Dec - 2019","skills":"Dotnet, Asp .Net, Azure","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"HCL Technologies Limited, Survey No. 30, 34, 35 & 38, Avance Business Hub, Tower H01 Phoenix Infocity Pvt. Limited SEZ, Phase 2, Hyderabad, Telangana - 500 081.","phone":"Not Provided","profile":".Net Developers \nHCL Technologies Limited","description":"We are planning to conduct Scheduled Weekend Drive & the discussion would take place on Saturday 7th December 2019 @ HCL Technologies - Hyderabad location Candidate must have good experience in Dotnet, Asp .Net, Azure. Willing to learn New Technologies and willing to work as a Fullstack Developer. Must have good communication skills Kindly go through and interested candidates are requested to share profiles along with basic information to screen and schedule interviews. Interview Process : 2 Technical Rounds + HR Discussion (All the process will get completed on Same day (7th Dec-2019) If you are interested; kindly share your resume to ahmed_s@hcl.com Interview Venue: HCL Technologies Limited Survey No. 30, 34, 35 & 38, Avance Business Hub, Tower H01 Phoenix Infocity Pvt. Limited SEZ, Phase 2, Hyderabad, Telangana - 500 081. POC : Naresh Reddy","location":"Hyderabad","experience":"4 - 11 Years"},{"date":"9, 10, 11, 12, 13 - Dec - 2019","skills":"ASP .NET, C#, MVC, SQL, Web API, Angular JS, HTML, CSS, JQuery, Bootstrap","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Digital Minds Software Solutions Pvt. Limited, 2nd Floor, A-Wing, Softsol Building, #4 Infocity, Beside Mindspace,Hi-tech City, Madhapur, Hyderabad, Telangana - 500 081.","phone":"040 66885669","profile":"Software Engineer (ASP .Net) \nDigital Minds Software Solution Pvt. Limited","description":"Educatioanl Qualification: B. Tech/ MCA Work Experience: 2 to 3 Years Process: .Net Domain Shift Timings: 9:00 am to 6:00 pm. Skill Set: ASP .NET, C#, MVC, SQL, Web API, Angular JS, HTML, CSS, JQuery, Bootstrap. Experience in designing web applications using HTML, CSS, Bootstarp, JQuery, Angular JS. Experience on Developing applications using ASP.Net MVC & C#. Writing and Consuming Web services & Web API. Experience on SQL Server and dealing database using Entity Framework. Knowledge on Kentico is an added advantage. Walk-in Date/ Time: 9th - 13th December 2019, 10 AM onwards Interview Venue: Digital Minds Software Solutions Pvt. Limited 2nd Floor, A-Wing, Softsol Building, #4 Infocity, Beside Mindspace,Hi-tech City, Madhapur, Hyderabad, Telangana - 500 081. Contact No. 9063610208/ 040 66885669 Email: hr@digitalminds.solutions Note: Those who attended the interview with in Six Months, kindly ignore.","location":"Hyderabad","experience":"2 - 3 Years"},{"date":"12, 13 - Dec - 2019","skills":"Automation Testing, REST ASSURED/ JUnit framework for API testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"MS Technology Private Limited 2, Community Centre, IInd Floor, Basant Lok, Vasant Vihar, New Delhi.","phone":"Not Provided","profile":"Software Testing Engineer \nMS Technology Private Limited","description":"Candidate should have 1 to 3 years of experience in Automation Testing. Hands on experience of working with at least one of GUI based test automation tools for desktop and/or mobile automation using Selenium. Experience on other tools will be added advantage. Should have good knowledge of maven. Knowledge of REST ASSURED/ JUnit framework for API testing Hands on experience in any Java IDE (e.g. Eclipse) Hands on experience on GIT, JIRA, Jenkins Good understanding of OOPS concepts and strong programming skills in Java Selenium with Java (Interfaces, classes) Hands on experience on JMeter Knowledge of standard QA processes, test plans, test case design, test case management, Defect management and reporting. Walk-in Date/ Time: 12th & 13th December 2019, 11 AM onwards Interview Venue: MS Technology Private Limited 2, Community Centre, IInd Floor, Basant Lok, Vasant Vihar, New Delhi. Landmark: Opposite Hero Corporate office","location":"Delhi","experience":"1 - 3 Years"},{"date":"5, 6 - Dec - 2019","skills":"PHP Bootstrap, AngularJS, BackboneJS, HTML5/ CSS3, SQL Database","qualification":"B.E./B.Tech, MCA/PGDCA","address":"The Miiint Solutions, 5th Floor, Nirmal Plaza, Opp. Vanaz Engineering, Paud Road, Kothrud, Pune - 411 038.","phone":"7620921424","profile":"Software Developer (PHP) \nThe Miiint Solutions","description":"We are looking for smart, enthusiastic, hard working Web/ Mobile App developers. You are required to work on multiple technologies like hardcore PHP (on multiple frameworks), complex SQL Databases, challenging different visualization libraries with advanced HTML5/ CSS3 techniques. We use various front end libraries such as Bootstrap, AngularJS, backboneJS. We also work on Cross Platform and Native iOS/Andriod Mobile Apps. Passing Year: 2018 (if exp) & 2019 only 60% aggregate. Must Have Excellent Logical Thinking. Pune localites only need to apply Clear understanding of technical skills as mentioned in the job description. Highly energetic and self-starter. Able to multi-task the activities Walk-in Date/ Time: 3rd - 6th December , 10 AM onwards Interview Venue: The Miiint Solutions, 5th Floor, Nirmal Plaza, Opp. Vanaz Engineering, Paud Road, Kothrud, Pune - 411 038. Contact - Shamika ( 7620921424 )","location":"Pune","experience":"0 - 1 Years"},{"date":"5, 6, 7, 9, 10 - Dec - 2019","skills":"PHP web frameworks (Laravel, Symfony), October CMS","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Mahindra First Choice Wheels Limited, FERNS Icon, 3rd Floor, Unit -4, Survey No: 28 36/5, Doodanekundi, Outer Ring Road, Bangalore - 37","phone":"Not Provided","profile":"PHP Developer \nMahindra First Choice Wheels Limited","description":"Candidate should be B.Tech/ BE with strong knowledge of PHP web frameworks (Laravel, Symfony), October CMS with excellent design skills. CDAC is added Advantage Understanding the fully synchronous behaviour of PHP Understanding of MVC design patterns Thorough understanding of front-end technologies, such as JavaScript, HTML5, and CSS3 Knowledge of object oriented PHP programming Walk-in Date/ Time: 4th - 10th December 2019, 10 AM onwards Interview Venue: Mahindra First Choice Wheels Limited, FERNS Icon, 3rd Floor, Unit -4, Survey No: 28 36/5, Doodanekundi, Outer Ring Road, Bangalore - 37 Contact Person- Archana P","location":"Bangalore","experience":"4 - 8 Years"},{"date":"13 - Dec - 2019","skills":"ASP .Net C# web application, MS SQL programming and XAMARIN","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Cruxzen Technologies Private Limited, 5, Vijay Complex, S.No. 77/1/7, Near Sai Chowk, New Sangavi, Pune Maharashtra - 411 027.","phone":"8408856557","profile":".Net Developers \nCruxzen Technologies Pvt. Limited","description":"Applicant should have done C# .Net certification after Graduation. Mobile app development would be added advantages. Should not have an education gap. DOB should be after 1/1/1992. Should ready to work at the client location. Xamarin app. Experience dynamic candidates for software development. Design, Development of ASP .Net C# web application. Hands on MS SQL programming and XAMARIN must. Should have C# .Net Certificate for fresher. Mobile app programming. Walk-in Date/ Time: 13th December 2019, 10 AM onwards Interview Venue: Cruxzen Technologies Private Limited 5, Vijay Complex, S.No. 77/1/7, Near Sai Chowk, New Sangavi, Pune Maharashtra - 411 027. Contact No. 8408856557","location":"Hyderabad","experience":"0 - 4 Years"},{"date":"7 - Dec - 2019","skills":"ASP .Net, MVC core, AZURE ACS, SQL Server, Angular","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Mindteck (India) Limited, 23, A.M.R. Tech Park, Block -1, 3rd Floor, # 664, 24, Hosur Rd, Bommanahalli, Bengaluru, Karnataka - 560 068","phone":"Not Provided","profile":".Net Developer \nMindteck (India) Limited","description":"Candidate should have strong experience on ASP .Net, MVC core, AZURE ACS, SQL Server, Angular. Expertise building solutions in the Microsoft stack, Azure and cloud native application. Must have working knowledge of building Web MVC applications. Working knowledge of building .NET Core applications Experience with building Web APIs (REST) Experience using/ building applications using an Entity Framework Expertise with relational databases, especially SQL Server Building scripts using Javascript, jQuery Walk-in Date/ Time: 7th December 2019, 10 AM onwards Interview Venue: Mindteck (India) Limited 23, A.M.R. Tech Park, Block -1, 3rd Floor, # 664, 24, Hosur Rd, Bommanahalli, Bengaluru, Karnataka - 560 068. Contact Person- Ashish Mahajan","location":"Bangalore","experience":"5 - 10 Years"},{"date":"7 - Dec - 2019","skills":"Java/ PHP/ .NET","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Girikon Solutions Private Limited, B-24, Sector 65, Noida - 201 301","phone":"Not Provided","profile":"Software Developer (Java/ PHP/ .Net) \nGirikon Solutions Private Limited","description":"We are looking for talented Engineers to join us in our Noida office. You will be a talented engineer with a penchant to learn and grow yourself in the domain of cloud engineering. Person must have Ability to understand the requirements and have excellent knowledge of good coding standards. Should have 1+ year of Software development experience in developing web applications and web services using any of Java/ PHP/ .NET, Good written and oral communication skills. Good team player. Good Coding skills in any language. A positive/ open attitude for switching tech to cloud computing. Knowledge of Angular JS will be added advantage. Walk-in Date/ Time: 7th December from 11 AM onwards Interview Venue: Girikon Solutions Private Limited B-24, Sector 65, Noida - 201 301 Note: Candidate must carry a hard copy of updated CV along with 2 photos & ID Proof (any).","location":"Noida","experience":"1 - 2 Years"},{"date":"5, 6 - Dec - 2019","skills":"CorePHP, Laravel framework, MySQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Colan Infotech Private Limited, Murugesan Nayakar Complex, Unit-2, D 84, B Block, 4th Floor, Greams Road, Thousand Lights, Chennai - 600 006.","phone":"9042055701","profile":"PHP Laravel Developer \nColan Infotech Private Limited","description":"Candidate must have good work experience in CorePHP & Laravel framework Good to have knowledge with any CMS OR Frameworks (Optional) Knowledge in MySQL Should have good communication skills Positive Attitude Walk-in Date/ Time: 4th - 6th December , 10 AM onwards Interview Venue: Colan Infotech Private Limited Murugesan Nayakar Complex, Unit-2, D 84, B Block, 4th Floor, Greams Road, Thousand Lights, Chennai - 600 006. Landmark: (Opposite Road to Sea Shell Hotel) Contact person- Kalai/ Vignesh Tel Number: 9042055701 Interested candidates can forward your resumes to kalaichelvi.k@colanonline.com","location":"Chennai","experience":"4 - 8 Years"},{"date":"6 - Dec - 2019","skills":"PHP and PHP based MVC frameworks like CodeIgniter, Laravel, Symphony, YII, MySQL","qualification":"B.E./B.Tech, M.Tech","address":"HETERO Healthcare Limited, MELANGE TOWERS, 4th Floor, C Wing Patrikanagar, Madhapur, Hyderabad, Telangana - 500 081.","phone":"Not Provided","profile":"Web/ Php Developer \nHetero Healthcare Limited","description":"Candidate should have 2 to 4 years of experience in PHP and PHP based MVC frameworks like CodeIgniter, Laravel, symphony, YII etc. Proficient in MySQL, proficient with database design, optimization and tuning in MySQL. Expertise in versioning control, preferably GIT. Knowledge on Angular JS, Angular. Strong knowledge JQuery, Java Script, validations. Proficient in creating Microservices. Basic Knowledge HTML 5, CSS3, SASS, LESS, Bootstrap. Strong Knowledge of Linux required, for ex. working experience with LAMP stack setup, shell scripting etc. Walk-in Date/ Time: 6th December 2019 from 10 AM onwards Interview Venue: HETERO Healthcare Limited MELANGE TOWERS, 4th Floor, C Wing Patrikanagar, Madhapur, Hyderabad, Telangana - 500 081. Landmark: Besides Ratnadeep Supermarket","location":"Hyderabad","experience":"2 - 4 Years"}]}