{"Walkins":[{"date":"1, 2 - Nov - 2020","skills":"Non Voice Process, Backend Process","qualification":"Diploma, B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Call Now for Telephonic Interview","phone":"8530582313","profile":"Backend Process Associate \nAstreca Solutions","description":"Looking candidates for BPO Non Voice - Backend Process Must have Good Communication Skills Min 10th Pass Domestic Process Day Shift Salary 10k To 15k International Night Shift Salary 13k To 22k Interview from 26 October - 2nd November , 9.30 AM - 5.30 PM Call Now- 8530582313","location":"Pune","experience":"0 - 2 Years"},{"date":"2, 3, 4, 5, 6, 7, 8, 9 - Nov - 2020","skills":"Customer Care, Voice Process, Customer Support","qualification":"Diploma, B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Incase of venue and any other query : Contact- Sumithra.K on 9742454510","phone":"9742454510","profile":"Customer Support Executive \nTeleperformance Global Services Pvt. Limited","description":"Eligibility Criteria:- Must have good communication skills in English and Hindi Education : Any Graduate/ Min 12th passed and above Should be comfortable with 6 days working. Work Location- Electronic City, Bangalore People must be willing to work from office (ELECTRONIC CITY Location) Salary- 11k to 18k CTC Interview process: Face to Face Date: 31st October - 9th November 2020 Interview Timings-11 AM to 4PM Incase of venue and any other query : Contact- Sumithra.K Contact No.- 9742454510 Interested candidates can send your resume to below mentioned mail id: sumithra.krishnappa@teleperformancedibs.com","location":"Bangalore","experience":"0 - 1 Years"},{"date":"2 - Nov - 2020","skills":"Java, XML, Eclipse, MySQL, SQLite, Apache Server PHP, SQL Server","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"HDB Financial Services Limited, 1st Floor M K Shah Exports, D 141, TTC Industrial Area, Shiwarane Nerul, Navi Mumbai - 400 706","phone":"Not Provided","profile":"MIS Officer/ Manager \nHDB Financial Services Limited","description":"Candidate is required to have a knowledge/ prior background into Mobile-Application development for android platform and end deployment of the mobile-application to central server for data exchange. Mobile-Application will mainly be content based and integrated with Web server. Candidate will also be involved in other in development, deployment and maintenance of other in-house application. Candidate should have background and prior on job experience of atleast 2-3 years with following tools/ software- Familiar with android Studio -SDK tool/ Eclipse for mobile application designing and development. Working on Apache Server and PHP scripting for designing APIs to be used on Server. Must have strong designing and programming skill in Java and XML Knowledge of SQLite, MySQL, SQL Server and working experience in SQL Databases. Good knowledge on web services integration and development using web technologies Visual Studio 2008 and working on .asp Walk-in Date/ Time: 2nd November 2020, 11.00 AM - 2.00 PM Venue Details- HDB Financial Services Limited 1st Floor M K Shah Exports, D 141, TTC Industrial Area, Shiwarane Nerul, Navi Mumbai - 400 706 Contact Person - Annu Patil","location":"Mumbai","experience":"1 - 4 Years"},{"date":"2 - Nov - 2020","skills":"Java/ J2ee (Core Java, J2ee, JSP, Servlet, Spring/ Hibernate/ Struts)","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Ojas Softech Private Limited, Block A - 139, Sector - 63, Noida - 201 301","phone":"8447131703","profile":"JAVA Developers \nOjas Softech Private Limited","description":"Candidate should have 2 to 4 years of hands on experience on Java/ J2ee (Core Java, J2ee, JSP, Servlet, Spring/ Hibernate/ Struts). Hands on Experience on Developing Java and web Application. Must have good knowledge about the basic database development skills like MySql, Tomcat. Walk-in Date/ Time: 2nd November 2020, 9.30 AM - 5.30 PM Venue Details- Ojas Softech Private Limited Block A - 139, Sector - 63, Noida - 201 301 (U.P) Contact Person- Pooja Sinha Phone: 8447131703","location":"Noida","experience":"2 - 4 Years"},{"date":"2 - Nov - 2020","skills":"Blended process, Tele-calling and backend Support","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Creative Lipi Webtech Private Limited, D-101, Sector 63 Noida, Uttar Pradesh - 201 301. Landmark - Near Nissan Showroom","phone":"7835074143","profile":"Blended Process/ Support Associate \nCreative Lipi Webtech Private Limited","description":"We have an urgent opening for a Blended process which involves both Tele-calling and backend. Candidate is expected to be proficient in written and verbal communication skills Responsible for making calls to new & existing clients Prior Experience on E commerce platform is highly preferable. Candidate should be Hardworking, self-motivated & quick learner Should be able to apply analytical skills. Should be able to handle client complaint, Identify customer needs with quick response time. Applicant should possess strong Email handling skills. Good knowledge of the web applications and their functioning (Internet & Search Engines). Knowledge of MS Office/ Excel will be an added advantage. Good convincing skills. Candidate from BPO, KPO, Sales, Ecommerce industry can apply Walk-in Date/ Time: 2nd November 2020, 11.00 AM - 4.00 PM Venue Details:- Creative Lipi Webtech Private Limited D-101, Sector 63 Noida, Uttar Pradesh - 201 301 Landmark - Near Nissan Showroom Contact - Hemlata Bhardwaj (7835074143)","location":"Noida","experience":"0 - 1 Years"},{"date":"1, 2, 3, 4, 5, 6, 7, 8, 9 - Nov - 2020","skills":"Front Desk/ Front Office/ Receptionist Activities, Documentation, Front Office Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Sri Durga Towers, 302, Road No. 10, Banjara Hills, Hyderabad - 500034, Telangana (Land Mark City Centre Mall Opposite & UCO Bank Building)","phone":"7711 8811 53","profile":"Front Office Administrator \nGreen City Estates","description":"We at Green City Estates are hiring for Front Office Administrator (Female Only) 6 Days Working (Tuesday Week Off) Roles and Responsibilities: Visitors and Customers Management Documents Management Handling Inbound and Outbound Calls (Payments, Registrations, Documentations, Service & Sales Follow Ups) Managing Events in VENTURES (Saturday and Sunday) Other Front Office Duties Admin Related Tasks Skills & Requirements: Engaging and Charming Personality Professional Attitude and Appearance Dedicated and Focused Responsible, Active and Self Motivated Multi Tasking & Time Management Capability Desired Candidate Profile: Minimum Qualification: Graduation Preferred 2 to 3 Years of Experience in Front Office, Tele-calling & Admin Good Communication Skills (Telugu, English and Hindi) Basic Computer Skills (MS Office) Interview Dates & Timings: November 1, 2020 to November 9, 2020 (12PM to 6PM) Interview & Job Location: Sri Durga Towers, 302, Road No. 10, Banjara Hills, Hyderabad - 500034, Telangana (Land Mark City Centre Mall Opposite & UCO Bank Building) For More Details (CALL) : +91 7711 8811 53 (Venkata Ramana Varada)","location":"Hyderabad","experience":"2 - 3 Years"},{"date":"2, 3, 4, 5, 6, 7, 8 - Nov - 2020","skills":"Hardware/ Desktop Support, Networking, Remote Support, Technical Support","qualification":"Diploma, B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Contact - Bala ( 9148813839 )","phone":"9148813839","profile":"Technical Support Executive \nStartek Customer Services Private Limited","description":"Qualification: Any Graduate / 10+3 Diploma Min 6 months of work experience in any domain Should possesses computer hardware knowledge Language skill : English + Hindi Salary 17000 to 18000 (CTC) PM Shift Timing : 9 am to 6 pm Sunday fixed off Interview Date/ Time: 2nd - 8th November , 9.30 AM - 5.30 PM Bangalore Contact - Bala ( 9148813839 ) Kindly share your CV to sangana.bala@startek.com","location":"Bangalore","experience":"0 - 2 Years"},{"date":"1 - Nov - 2020","skills":"Email Support, Travel insurance Support, Inbound Voice Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Teletext India Limited, 1st floor Ces building, IT-SEZ Hill 2, Rushikonda, Vizag.","phone":"Not Provided","profile":"Travel Advisor/ Inbound Voice Process \nTeletext India Limited","description":"We are hiring for International Inbound Voice Process with Experience Job Role : Travel Advisors Work Location : Rushikonda, Vizag Shift Timings : Rotational Shift Open Position : 10 You need to be excellent in the verbal communication Call Handling Etiquette Understand to handle critical/ Irate customer. Past experience into UK/ US/ Australian Market is an advantage Negotiations and Convincing Skills are must Roles & Responsibilities- Answer calls and respond to emails/ chats. Handle customer inquiries both telephonically and by email/chats. Research required information using available resources/tools. Provide customers with product and service information. Manage and resolve customer complaints. Identify and escalate priority issues. Route calls to appropriate resource. Follow up customer calls where necessary. Document all call information according to standard operating procedures Complete call logs. Maintain the quality parameters. Achieve sales targets Benefits- Great exposure to global travel industry Friendly and Learning environment Industry experts to help and guide you to meet your goals Required training will be provided from the Domain Experts Employment : Permanent Notice Period : Immediate joiners CTC: 2.00 LPA - 2.25 LPA INR Mode of Interview : live Walk-in Date/ Time: 1st November 2020, 1.00 PM - 4.00 PM Venue Details- Teletext India Limited 1st floor Ces building, IT-SEZ Hill 2, Rushikonda, Vizag. (Please call recruiter before you plan to come in for the interview) Contact - girish@teletext.co.in","location":"Visakhapatnam","experience":"0 - 3 Years"},{"date":"1 - Nov - 2020","skills":"US Mortgage Process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Visionet Systems Private Limited, Awfis, 18th Floor, Cyber One, Sector 30, Vashi, Navi Mumbai, Maharashtra.","phone":"9845507049","profile":"Mortgage Process Associate (Fresher) \nVisionet Systems Private Limited","description":"We at Visionet Systems Private Limited are hiring Mortgage Process Associate (Fresher) for our Mumbai Office. Educational Qualification- Any Graduate Years of experience- Fresher/ 0 to 6 months No Backlogs in Academic Qualification Candidate will be trained on Underwriter for US Mortgage Process The candidate should have good communication skills Should be comfortable to work in Rotational shifted Interested candidate can walk down to office at 30th, 3Ist Oct ,1st November 2020 Timing: 10.30 AM 3.30 Pm Venue Details: Visionet Systems Private Limited Awfis, 18th Floor, Cyber One, Sector 30, Vashi, Navi Mumbai, Maharashtra, Opposite CIDCO Exhibition Centre. Contact Person- Renuka Prasad Contact No- 9845507049","location":"Mumbai","experience":"0 - 1 Years"},{"date":"2 - Nov - 2020","skills":"Outbound Sales, Telesales, Negotiation, Customer Satisfaction","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Zoom ID - 6370393166","phone":"Not Provided","profile":"Telesales Executives \nLenskart Solutions Private Limited","description":"Lenskart Solutions Private Limited is Hiring for Telesales Executives !! Responsibilities: Working on web data to call people and sale the product. Contact potential or existing customers to inform them about a product or service. Answer questions about products or the company. Ask questions to understand customer requirements and close sales. Answer questions about product. Requirements : Must Have Laptop/ Desktop and Wifi Should be comfortable to travel/ relocate to Gurgaon or Faridabad Must have good communication skills Walkin Venue : Zoom ID - 6370393166 Date: 2nd November 2020, Monday Time : 10:30AM to 10:45 AM","location":"Delhi, Noida, Gurgaon","experience":"0 - 5 Years"},{"date":"2 - Nov - 2020","skills":"Portfolio Management, Client Acquisition, Relationship Management, Business Development","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"AnandRathi Share and Stock Brokers Limited, Gee Gee Crystal, No: 91&92 \u0096 4th Floor, B- Wing Radha Krishnan Salai, Mylapore, Chennai.","phone":"9538934252","profile":"Relationship Manager \nAnand Rathi Shares Stock Brokers Limited","description":"Candidate should be Any Graduate with minimum 6 months of experience. Roles and Responsibilities- 1. Acquire quality clients through networking, database, market intelligence and references from existing clients. 2. Generate Cross Sell revenue through Financial Planning. 3. Promote Focus Product of the month. 4. Maintain records of business on internal software. 5. Induct new clients to the Central Dealing Desk for smooth interaction and services. 6. Liaison with Central Dealing Desk for revenue generation and query resolution. 7. Conduct activities for Client Acquisition and Financial Planning. 8. Ensure compliance as per various regulator and organization guidelines. 9. Maintain the brand image of the organization. 10. Products like - MF, Insurance, Broking, FD, Bonds, PMS, FD and Wealth Mgmt Services Perks and Benefits- Fixed salary + Incentivess Walk-in Date/ Time: 2nd November 2020, 10.30 AM - 4.30 PM Venue Details- AnandRathi Share and Stock Brokers Limited Gee Gee Crystal, No: 91&92 \u0096 4th Floor, B- Wing Radha Krishnan Salai, Mylapore, Chennai. Contact Person - Sangeetha S (9538934252)","location":"Chennai","experience":"1 - 6 Years"},{"date":"2 - Nov - 2020","skills":"Direct Sales, Customer Retention, Revenue Generation, Banking Products, Customer Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Kotak Mahindra Bank Limited, 9th Floor, Venus Amadeus, Jodhpur Cross Road, Ahmedabad","phone":"Not Provided","profile":"Assistant Sales Manager \nKotak Mahindra Bank Limited","description":"We at Kotak Mahindra Bank Limited have urgent openings for Assistant Acquisition Manager- CASA for Ahmedabad City Qualification Required: Minimum Graduate with appropriate experience in direct field sales Preferred candidate From banking, Insurance, Stock broking & NBFC Maximum Age Limit - 29 Years CTC to be Offered: Upto 2.5 LPA + Incentives Grade to be Offered: Assistant Manager (On roll of Kotak Mahindra Bank) No. of Positions : 40+ Job Responsibilities for AAM profile : To source customers for Current Account & Saving Account . Customers to be sourced from individuals, small businesses, trusts, associations, societies, corporates. Revenue Generation, Customer Acquisition, Customer Retention, Cost Efficiency Through Process Hardcore sales mentality. Primary motivation from achievement of targets. A hunter by orientation. Should be well groomed and presentable with ambassadorship qualities Interview Date : 2nd November 2020 Timing : 3 PM to 5 PM Interview Venue : Kotak Mahindra Bank Limited 9th Floor, Venus Amadeus, Jodhpur Cross Road, Ahmedabad Contact Person : Chirag Shah/ Nejal Kansara","location":"Ahmedabad","experience":"1 - 6 Years"},{"date":"2 - Nov - 2020","skills":"Customer Care, International Voice Process, Customer Support","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"IDP Education (India) Private Limited, Global Gateway Towers, Tower-B, 7th Floor, Sector 26, M.G. Road, Sikanderpur Ghosi, Gurgaon \u0096 122 002 (Near Guru Dronacharya Metro Station)","phone":"9625643762","profile":"Customer Service Associate \nIDP Education (India) Private Limited","description":"Candidate should be Any Graduate with minimum 1 year experience in International Voice Process Education: UG/ Graduate (Preferably Graduate) Good Communications Skills- English has to be fluent Language- English & Hindi (Mandate) Current Location: Gurgaon/ NCR Perks and Benefits- Fixed day shift Timings : 9am to 5:30pm Walk-in Date/ Time: 2nd November 2020, 10.00 AM - 4.00 PM Venue Details- IDP Education (India) Private Limited Global Gateway Towers, Tower-B, 7th Floor, Sector 26, M.G. Road, Sikanderpur Ghosi, Gurgaon \u0096 122 002 (Near Guru Dronacharya Metro Station) Contact Person- Hemant S Narang Phone No. 9625643762","location":"Gurgaon","experience":"1 - 4 Years"},{"date":"2, 3, 4, 5, 6, 7, 8, 9 - Nov - 2020","skills":"Counselling, Office Administration, Front office","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Rasheshyam Comm Centre 1st Floor, Science Pariwar House, Dattapada Road, Near Platform No. 1 Borivali (West) Mumbai - 400 092","phone":"022-65652217","profile":"Female Counsellor \nCL Educate Limited","description":"Candidate should be Any Graduate with good communication and convincing skills Convincing students to enroll student for various CL Courses (IIT- JEE/ NEET) Must have Good Communication skills. Walk-in Date/ Time: 31st October - 9th November , 11.30 AM - 5.00 PM Venue Details- Rasheshyam Comm Centre 1st Floor, Science Pariwar House, Dattapada Road, Near Platform No. 1 Borivali (West) Mumbai - 400 092 Contact Person- Priyanka Kapoor ( 7838882445 ) Phone: 91-22-65652217 65652218 8080866865","location":"Mumbai","experience":"1 - 4 Years"},{"date":"1, 2, 3, 4, 5, 6, 7, 8 - Nov - 2020","skills":"Cash billing, corporate billing, insurance billing, Hospital billing","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Krishna Institute of Medical Sciences Limited, 1-8-31/1, Minister Road,Krishna Nagar Colony, Begumpet, Secunderabad, Telangana \u0096 500 003.","phone":"7981876842","profile":"IP Cash Billing Executive \nKrishna Institute of Medical Sciences Limited","description":"Krishna Institute Of Medical Sciences Is Hiring IP- Billing Executive - Hyderabad Looking For Experience Candidates for IP- Billing Executive Qualification : Any graduates Work Experience : 1-3 Years Age Limit : Below 30 years Job location : Secunderabad, Hyderabad Vacancies : 15 Job Responsibility; Preparing Maintaining the Delivery challans in excel/ ERP Preparing Maintaining the Invoices in excel/ ERP Making entries in Tally and account management Managing store/ Inventory. Making the above reports... Handling Registration of patients, Explaining rates, charges, services, discounts (if any) and hospital policy regarding payment of bills, Compute bills of the patients collect payments and process the admission of patients to a hospital facility, medical... latest vacancy for billing and tpa While discharging the patient, cross check personally the advances received form the patients and after due confirmation, from attendant prepare final bill. Coordinate with departments for settlement of bills. Handling Billing activities as per Hospital tarrif, packages & Policies Maintaining discipline and cordial relations among patients and billing executives and will all other inter related departments. Note: Candidate must have good typing speed between 25 to 30 wpm Interested Candidates can come for Direct walk in Spot Offers can be issued Immediate joiners can be considers Walk-in Date/ Time: 31st October - 8th November , 9.30 AM - 5.30 PM Venue Details- Krishna Institute of Medical Sciences Limited, 1-8-31/1,Minister Road,Krishna Nagar Colony, Begumpet, Secunderabad, Telangana \u0096 500 003. For Further/ More Details Contact To Mohan: 7981876842 Or share your updated resume to mohan.m@kimshospitals.com","location":"Hyderabad, Secunderabad","experience":"1 - 3 Years"},{"date":"2, 3, 4, 5, 6, 7, 8, 9, 10, 11 - Nov - 2020","skills":"Core Java, Android Java SDK and NDK","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Paisabox Ecommerce Private Limited, No. 9, 1st Floor, 100ft Ring Road, BSK 3rd Stage, Bangalore - 560 085","phone":"8105678950","profile":"Java Android Developer \nPaisabox Ecommerce Private Limited","description":"Person must have solid understanding of Core Java with deep understanding of Android Java SDK and NDK Ability to take on individual ownership of milestones and projects Design and build advanced applications for the Android platform Collaborate with cross-functional teams to define, design, and ship new features Work with outside data sources and APIs Continuously discover, evaluate, and implement new technologies to maximize development efficiency Should know about Payment Gateway and API's Ability to understand business requirements and translate them into technical requirements. Strong knowledge of Android SDK, third-party integrations, Android life cycle and different versions of Android. Familiarity with RESTful APIs to connect Android applications to back-end services. Understanding of Googles Android design principles and interfaces guidelines. Strong knowledge of Android UI design principles, patterns, dealing with different screen sizes and best practices. Experience with offline storage, services, multi-threading, workmanager and performance Walk-in Date/ Time: 2nd - 11th November, 9.30 AM - 5.30 PM Venue Details- Paisabox Ecommerce Private Limited No. 9, 1st Floor, 100ft Ring Road, BSK 3rd Stage, Bangalore - 560 085 Contact Person - Atul Bhat (8105678950)","location":"Bangalore","experience":"0 - 1 Years"},{"date":"2, 3, 4, 5, 6, 7, 8 - Nov - 2020","skills":"Back Office Operations, Documentation, Tender work, Vendor Registration","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Gazon Communications India Limited, 404, 4th Floor, MSR Capital, Samrat Chowk, Morwadi, Pimpri, Pune - 411 018","phone":"8956968739","profile":"Back Office Executive \nGazon Communications India Limited","description":"Candidates should be fresher or experienced and ready to take new challenges. Good interpersonal skills, including the ability to deal with people from a wide range of backgrounds, ages and temperament excellent skills on MS Word and Excel. Typing, documentation & tender work, vendor registration Exp. Work on Computer-Excellent Knowledge of WORD/ EXCEL/ EMAIL, Databases, Data Entries. Common data/ document verification requirements. Must be fluent in Ms Office Fill in relevant forms and formats clearly and accurately Write both in English and Local language to carry out work related tasks Document and maintain the record as per company's policy Identify category of documentation, purpose of it and decide the appropriate storage facility to be used accordingly Walk-in Date/ Time: 30 October - 8th November , 11.00 AM - 4.00 PM Venue Details- Gazon Communications India Limited 404, 4th Floor, MSR Capital, Samrat Chowk, Morwadi, Pimpri, Pune - 411 018. Contact Person- Sonam Jadhao Phone: 8956968739 * Interested candidates are requested to carry 2 copies of CV along with a Photo Id Proof original copy,","location":"Pune","experience":"0 - 1 Years"},{"date":"2, 3, 4, 5, 6, 7, 8, 9 - Nov - 2020","skills":"Google Analytics, Keyword Research, Digital Marketing, Email Marketing, Social Media Optimization","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Innomatics Research Labs, #206 A, 2nd Floor, Fortune Signature, Near JNTU Metro Station, Kukatpally, Hyderabad, Telangana","phone":"8885189183","profile":"Digital Marketing Executive \nInnomatics Research Labs","description":"Looking candidate having good knowledge of digital marketing for Search Engine Optimization (SEO) and Social Media Optimization (SMO) & Marketing (SMM) knowledge. Digital Marketing Executive at Innomatics Research Labs plays a specialized, individual contributor role as part of the Digital Marketing team. Required Experience: Freshers or 0 - 1 Year Knowledge in SEO, SEM (Google Ads), SMO, SMM, EMail & SMS marketing Roles & Responsibilities: Execution of Search Engine Optimization (SEO) on a continuous basis. Brand building & management on various social media (SMO) platforms. Lead generation & Conversion through various digital platforms and services. Creation and Execution of SMS & Email marketing campaigns. End to End execution of marketing projects and campaigns. Continuous review and active management of website and other online assets. Excellent Understanding of Digital Marketing Concepts and Best Practices. Knowledge of Web Analytics Tools. Ideate and create innovative marketing strategies to facilitate sales Skills and Experience in Creative Content Writing. Excellent Communication and Interpersonal Skills. Collaborate with designers to improve user experience. Walk-in Date/ Time: 31st October - 9th November , 10.30 AM - 6.30 PM Venue Details- Innomatics Research Labs #206 A, 2nd Floor, Fortune Signature, Near JNTU Metro Station, Kukatpally, Hyderabad, Telangana Contact Person- Srinivas Ch (8885189183)","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"2, 3, 4, 5, 6, 7, 8 - Nov - 2020","skills":"Front Desk, Office Administration, Front Office/ Receptionist Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"AGR Platina, No. 32, Developed Plot NP (Near Jaya TV) SIDCO Industrial Estate Ekkaduthangal, Chennai - 600 032","phone":"7708055855","profile":"Front Desk Executive/ Freshers \nPoorvika Mobiles Private Limited","description":"Educational Qualification: Any Degree Gender: Female only (Age: Below 26 years) Work Experience: Freshers Required Skillset- Proven work experience as a Receptionist, Front Office Representative or similar role Proficiency in Microsoft Office Suite Hands-on experience with office equipment (e.g. fax machines and printers) Professional attitude and appearance Solid written and verbal communication skills Ability to be resourceful and proactive when issues arise Excellent organizational skills Multitasking and time-management skills, with the ability to prioritize tasks Customer service attitude Roles and Responsibilities- Greet and welcome guests as soon as they arrive at the office Direct visitors to the appropriate person and office Answer, screen, and forward incoming phone calls Provide basic and accurate information in-person and via phone/email Receive, sort, and distribute daily mail/deliveries Maintain office security by following safety procedures and controlling access via the reception desk (monitor logbook, issue visitor badges) Order front office supplies and keep an inventory of stock Keep updated records of office expenses and costs Perform other clerical receptionist duties such as filing, photocopying, transcribing, and faxing Walk-in Date/ Time- 30 October - 8th November , 10.30 AM - 3.00 PM Venue Details- AGR Platina, No. 32, Developed Plot NP Near Jaya TV SIDCO Industrial Estate Ekkaduthangal, Chennai - 600 032. Contact Person- Anbalagan P R (7708055855)","location":"Chennai","experience":"0 - 1 Years"},{"date":"28 - Oct - 2020","skills":"Customer Support, Customer Service, Sales, E-Mail & Chat Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Aegis Customer Support Services Pvt. Limited, 119, 1st Floor, Roopa Solitaire, MBP, Mahape, Ghansoli, Navi Mumbai.","phone":"8657416676","profile":"Virtual Relationship Manager \nAegis Customer Support Services Pvt. Limited","description":"Candidate should be Any Graduate with basic knowledge of Computers Should be having minimum 0 to 6 months of Experience in BPO/ Non BPO Must have good communication skills in English or any other Regional Language. (Tamil, Kannada, Malyalam, Telugu, Bangoli) Roles & Responsibilities- Non-Voice & Voice process (Customer Service, Sales, E-Mail & Chat Process) 9 working hours inclusive of 1hr break. 6days working and 1 week off Needs to be in compliance with all the operational requirements and work as per the companys norms and policies. Flexible to work in Rotational Shifts (Day Rotational Shift) Candidate should be able to clear Versant (3) Test Immediate joiners Preferred. Perks and Benefits- Upto 16,000 take home (depending on Interview)+ 2400 Quarterly fixed bonus. Walk-in Date/ Time: 28th October 2020, 9.30 AM - 5.30 PM Venue Details- Aegis Customer Support Services Pvt. Limited 119, 1st Floor, Roopa Solitaire, MBP, Mahape, Ghansoli, Navi Mumbai. Contact Person - Pushpa Koli (8657416676)","location":"Mumbai","experience":"0 - 1 Years"},{"date":"28 - Oct - 2020","skills":"Computer Operating, Pre Dispatch Inspection, Logistics Management, Data Entry, Dispatch Planning","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Merwans Confectioners Private Limited, C/47, TTC Industrial Area, Pawne MIDC, Beside to Rasraj Company, Navi Mumbai - 400 705","phone":"Not Provided","profile":"Dispatch & Billing Executive/ Trainees \nMerwans Confectioners Private Limited","description":"FRESHERS PREFERRED : Dispatch & Billing : Assist to control of all dispatch & billing activities in the section according to procurement, inventory control, sorting, ranking & priority, etc. Operating Knowledge of Computer Must (Excel & Word). Job Responsibility- Assist to maintain & follow planning, schedule & process and to ensure the policy & practices should be maintained. To prepare MIS & relevant records & reports. To ensure the dispatch of in time. (Male For Night Shift Only) Walk-in Date/ Time: 28 October 2020, 12.00 PM - 4.00 PM Venue Details- Merwans Confectioners Private Limited C/47, TTC Industrial Area, Pawne MIDC, Beside to Rasraj Company, Turbhe, Navi Mumbai Landmark - Galaxy Company, Near to Shalimar Bus Stop, Pawne","location":"Mumbai","experience":"1 - 3 Years"},{"date":"28 - Oct - 2020","skills":"Customer Service, Inbound Process, Customer Support","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Equiniti India Private Limited, Zed Tech Park 1st Floor, Electronic City Phase 1, Bangalore, Karnataka.","phone":"Not Provided","profile":"Customer Care Executive - US Voice Process \n3i Infotech Limited","description":"In the role of Customer Experience Executive/ Senior CEE/ SME/ TL you would need to assist shareholders in buying & selling shares, in accordance with predetermined procedures & service standards under appropriate guidance and direction. Eligible Criteria: Any Graduates/ Post Graduates. Years of Experience in International Voice Process from 1 to 7 years. The successful candidate will be responsible for: Answer inbound calls, emails from Shareholders and assist them with their queries within the agreed service standards, Contribute to the completion of the teams workload, Undertake duties at a similar level as required, Always to undertake the duties of this role in accordance with the requirements of the company's Regulators, Ensure that all work is undertaken within the quality system, Ensure that work and ethics comply with all security arrangements both physical and information. To be the successful candidate one would need to possess the below: Strong command on English language speaking & call handling Understanding of Customer Experience /BPO Prior experience of international voice process Satisfactory resolution of queries. PS: Candidate should be comfortable to work in US Shift (Night Shift). Walk-in Date/ Time: 28 October 2020, 10.30 AM - 1.30 PM Venue Details- Equiniti India Private Limited, Zed Tech Park 1st Floor, Electronic City Phase 1, Bangalore, Karnataka. Contact Person - Chandra","location":"Bangalore","experience":"1 - 6 Years"},{"date":"28 - Oct - 2020","skills":"Customer Support, Troubleshooting, Chat Process","qualification":"Diploma, B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"24/7 Customer Private Limited, Ground Floor NSL Arena Town Centre, Behind Cricket Stadium, Ramanthapur Road, Uppal, Hyderabad - 500 039","phone":"7989203906","profile":"Customer Support (Chat Process) \n24/7 Customer Private Limited","description":"Eligibility Criteria: Undergraduate/ Graduate and Postgraduate freshers and experienced can apply. Must have excellent Verbal and Written Communication skills. Should have good logical reasoning & analytical skills. Able to interact with customers via chat or voice, should be able to answer servicing questions. Able to work in rotational night shifts (US) Should have typing speed of 26 WPM, 90% accuracy Immediate Joiners Required! Benefits- Transport facility both Pick/Drop. Life Insurance. Medical Insurance Interview Rounds: Personal Introduction Round Online Test Operations Round Walk-in Date/ Time: Walk-in Interview on 28th October from 10.00 AM onwards Interview Venue- 24/7 Customer Private Limited Ground Floor NSL Arena Town Centre, Behind Cricket Stadium, Ramanthapur Road, Uppal, Hyderabad - 500 039 Contact Person: Irfan Contact Number: 7989203906","location":"Hyderabad","experience":"0 - 5 Years"},{"date":"28 - Oct - 2020","skills":"Warehousing/ Supply Chain/ Transportation","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"TSN ware House, No.- 93/IBIB, Survey No.94/3B, Mevalukuppam Village, Sriperumbudur Taluk, Kancheepuram District- Chennai","phone":"7358090434","profile":"Warehouse/ Inventory Executive \nTVS Supply Chain Solutions Limited","description":"Excellent opportunity to work with TVS Supply chain solutions, a leading conglomerate in the world of Supply Chain industry. Graduates with 1 to 6 years of experience in Warehousing/ Supply Chain/ Transportation are required. Looking for candidates preferably with GROCERY products handling experience. Candidates with immediate joining will be preferred Warehouse Executive : 3 to 5 years Experience Transport coordinator: 2 to 5 years Experience Warehouse Supervisor: 1 to 4 years Experience Inventory Supervisor: 3 to 6 years Experience These above roles would be Fixed Term Contract role for one year. Interested candidates can walk in below address: Interview date : 28th OCTOBER, 2020 (WEDNESDAY) Interview Time : 10 am to 5 PM Venue Details- TSN ware House, No.- 93/IBIB, Survey No.94/3B, Mevalukuppam Village, Sriperumbudur Taluk, Kancheepuram District- Chennai Contact Person : Mr. AMAL ANTONY (7358090434) Mr. SURESH (9791112471)","location":"Chennai","experience":"1 - 6 Years"},{"date":"29 - Oct - 2020","skills":"Desktop Support, Technical Support, Customer Handling","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"ImagineStore, #612/1, 80 Feet Road, 4th Block, Koramangala, Bengaluru Karnataka - 560095","phone":"Not Provided","profile":"Technical Support Consultant \nAmple Technologies Private Limited","description":"We at Ample Technologies Private Limited have walk-in drive for Freshers/ Experienced candidates Required Skills- Excellent language fluency, excellent verbal & written communication skills. Should be able to handle customer queries and should aim at customer delight. Should be technically sound. Knowledge on computer hardware & software is added advantage. Self driven & goal oriented and willing to work on Weekends Job Responsibility: Customer service / Front-end customer handling. Handling customer queries / issues in the store related to (Mobile, Laptop & Desktop). Troubleshooting of technical related issues and ensure to resolve the issues / queries. Escalate problems when unable to resolve customer issues. Duration: Contract Basis Your consultation period is 1 year and and this period may be extended or pre-closed as per the business needs. BE / B-Tech Freshers are not eligible to apply for this job If you are interested please attend the walk-in happening on October, between 11.00 AM - 4.30 PM Venue Details- ImagineStore, Koramangala #612/1, 80 Feet Road, 4th Block, Koramangala, Bengaluru Karnataka - 560095 Time - 10:30am to 04:30pm Contact Email- jiddu.manoharan@ample.co.in","location":"Bangalore","experience":"0 - 2 Years"},{"date":"28, 29 - Oct - 2020","skills":"SEO Analysis, Wordpress CMS, Artificial Intelligence Web Designing, Machine Learning","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Cogito, A-83, Block A Sector 2, Noida","phone":"Not Provided","profile":"SEO Support Executive \nANOLYTICS","description":"Cogito is currently working on Artificial Intelligence applications in Annotation work and is looking to engage with 'SEO Executive' to participate in ongoing projects. Please only come for interview directly if you have worked on below points: Minimum Experience Required 3 to 5 years Knowledge and Experience single domain to target for seo in multiple countries ( US & Europe etc.) Must have knowledge of on-page and off-page seo Must have knowledge WordPress with plugins and other famous CMS. Must knowledge to optimize websites to boost ranking for seo. Preferred candidate with knowledge and experience in AI & machine learning related services. Interview Dates: 28th & 29th October 2020 Time: 10:00 am to 12:00 pm & 3:00 pm to 4:00 pm Venue Details: Cogito A-83, Block A Sector 2, Noida Contact Person: Ms. Ripan/ Mr. Raj Verma","location":"Noida","experience":"3 - 5 Years"},{"date":"28, 29, 30, 31 - Oct - 2020","skills":"Java/ .Net / Software Testing","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Magneq Software, SBN Arcade 4th floor Opposite Green Park Hotel, Lot mobile shop building, Metro Pillar No. 1423, Begumpet, Hyderabad, Telangana.","phone":"9603956729","profile":"IT Freshers (Java/ .Net/ Testing) \nMagneq Software","description":"Requirement for Java Developer/ .Net Developer/ Software Testing Educational Qualification: B.Tech/ M.Tech/ MCA Pass out Batch: (2018/ 19/ 20) Job Location: Hyderabad Required Skills: Good Communication, technical & troubleshooting skills Need to be good team player and work together along with the team. Walk-in Interview from- 28th October - 6th November, Between 9.30 AM - 5.30 PM Venue: Magneq Software, SBN Arcade 4th floor Opposite Green Park Hotel, Lot mobile shop building, Metro Pillar No. 1423, Begumpet, Hyderabad, Telangana. Contact Person- Shilpa (9603956729)","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"28 - Oct - 2020","skills":"Customer Service, Voice Process, Customer Care","qualification":"Diploma, B.A., B.Com, B.B.A, B.Sc","address":"IGT Solutions Private Limited, 6th Floor, Tower D, Weikfield IT Park, Vadgaonsheri, Nagar Road, Viman Nagar, Pune - 411 014","phone":"8888993934","profile":"Customer Care Executive \nIGT Solutions Private Limited","description":"Opportunity to work with India's Leading Airline !!!! It is complete Customer care project. This project handles End to end airline operation - Customer Care related issues Eligibility Criteria: Undergraduate/ Any Graduate or 12+Travel Diploma can Apply Candidate should be ready to work in 24*7 shift 6 days working 1 week off Age: 18 to 32 Years Responsibilities- Reservations, Web site support, Bulk bookings, Notification, Re-booking Credit card verification, Queues Management, Email management for all corporate and travel agent queries. Salary -13000+Good Incentives Job Location- Vimannagar, Pune Walk-in Date/ Time: 28 October 2020, 10.30 AM - 4.00 PM Address- IGT Solutions Private Limited 6th Floor, Tower D, Weikfield IT Park, Vadgaonsheri, Nagar Road, Viman Nagar, Pune - 411 014 Contact Person : HR Fazal - 8888993934","location":"Pune","experience":"0 - 2 Years"},{"date":"26, 27, 28, 29, 30, 31 - Oct - 2020","skills":"TPA, Pre Authorisation, Hospital Insurance, Claims Processing","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"MIOT Hospitals Private Limited, 4/112, Mount Poonamalle High Road, Sathya Nagar, Manapakkam, Chennai, Tamil Nadu - 600 089.","phone":"7708068401","profile":"Insurance/ TPA Coordinator \nMIOT Hospitals Private Limited","description":"Candidate should be Any Graduate with 1 to 3 years of experience in Hospital insurance Pleasant Personality with good communication skills. Must have good knowledge about TPA. Handled Insurance Pre Authorise and final billing enhancement. Preparing daily report. * Daily patient visit. Walk-in Date: 26th October - 4th November 2020 -Interview Timing : 10 AM TO 12 PM Venue Details- MIOT Hospitals Private Limited 4/112, Mount Poonamalle High Road, Sathya Nagar, Manapakkam, Chennai, Tamil Nadu - 600 089. Contact Person- DIVYA (7708068401)","location":"Chennai","experience":"1 - 3 Years"},{"date":"26, 27, 28, 29, 30, 31 - Oct - 2020","skills":"Database Queries, Formulas, Calling, Charts/ Tables/ Pivot, Macros, MIS Reporting","qualification":"Diploma, B.A., B.Com, B.B.A, B.Sc","address":"One Point One Solutions Limited, AKR INFINITY, 3rd Floor, Plot Sy No. 113, Hosur Rd, Krishna Reddy Industrial Area, 7th Mile, Bengaluru, Karnataka - 560 068","phone":"9941334744","profile":"Backend/ MIS Executive \nOne Point One Solutions Limited","description":"Any Degree/ 2nd PUC with 1 to 2 years of experience (Should be from MIS background). Must be good in MS-Excel (Formulas/ Functions, Pivot Tables, Charts & Dashboard, Macros, Count If, Sum if). Strong knowledge in VBA programming & Macros. Able to work independently and effectively and drive things to closure. Must have good Communication and e-mail writing skills. Job Responsibility: Preparing Daily, Weekly and Monthly MIS reports Preparing graphs & Dashboard for weekly discussion Coordinate with the TL & Manager to satisfied the internal &external team requirements Must be validate the false data flow into the current data. Develop and execute database queries and configure accordingly Create visualizations and reports for requested projects. Evaluate and improve the existing systems. Collaborate with teams to integrate systems. CTC : 2.50 LPA to 3.00 LPA Job Location: Singasandra- Bangalore If you are interested kindly send me your cv to g.karthick@1point1.in or Walk in to below mentioned address for personal interview and Excel Test: Walk-in Date/ Time: 24 October - 2nd November , 9.30 AM - 5.30 PM Address: One Point One Solutions Limited AKR INFINITY, 3rd Floor, Plot Sy No. 113, Hosur Rd, Krishna Reddy Industrial Area, 7th Mile, Bengaluru, Karnataka - 560 068 Contact Person: Karthick / 9941334744 Note: Call me before coming for interview. Bpo MIS experience is mandatory","location":"Bangalore","experience":"1 - 2 Years"},{"date":"26, 27, 28, 29, 30, 31 - Oct - 2020","skills":"HR/ Recruitment, Screening, IT Staffing, IT Recruitment, Sourcing","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Whitefox, 3rd Floor, Sri Arcade, No 91, 1st Ave, D Block, Annanagar East, Chennai, Tamil Nadu - 600102","phone":"Not Provided","profile":"HR Recruiter/ Executive \nWhiteFox Recruitment","description":"Qualification: Any Graduate/ Under Graduates is fine / Work Experience: Fresher - 6 months experience as a HR Recruiter. Must have excellent verbal and written communication skills. Looking candidates around Anna Nagar Walk-in Date/ Time 26 October - 4th November , 10.30 AM - 4.00 PM Venue Details- Whitefox 3rd Floor, Sri Arcade, No 91, 1st Ave, D Block, Annanagar East, Chennai, Tamil Nadu - 600102 Contact Person- Joel Share your resume to - joel@whitefoxrecruitment.com","location":"Chennai","experience":"0 - 1 Years"},{"date":"27, 28, 29, 30, 31 - Oct - 2020","skills":"Labour Laws, PF, ESI Act","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Yashmit HRM Services Private Limited, 466/ 39, 13th Cross Rd, Lakkasandra Extension, Wilson Garden, Bengaluru, Karnataka - 560 027","phone":"9606492672","profile":"HR Compliance Executive \nYashmit HRM Services Private Limited","description":"We at Yashmit HRM Services Private Limited have immediate requirements for HR Compliance Educational Qualification : MSW Freshers to 6 months Experience required Factories at labor laws. Walk-in Date/ Time: 27 October - 5th November 2020, 9.30 AM - 5.30 PM Venue Details- Yashmit HRM Services Private Limited 466/39, 13th Cross Road, Lakkasandra Extension, Wilson Garden, Bengaluru, Karnataka - 560 027. Contact Person- Nethra S (9606492672)","location":"Bangalore","experience":"0 - 1 Years"},{"date":"26, 27, 28, 29, 30, 31 - Oct - 2020","skills":"Collection Process, Domestic BPO, Collection, Recovery","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Saarthi Management Consultants, G-10, Ground Floor, TDI Fun Republic Mall, Moti Nagar, New Delhi - 110 015.","phone":"7838092657","profile":"Collection Executive/ Tele Collection \nSaarthi Management Consultants","description":"Person should be 10th/ 12th/ Undergraduate/ Graduate (Male/ Female) with good communication skills. Should have experience in collection/ recovery or related field. Dialer/ Bucket/ Loan/ Credit Card. Freshers can also apply. Job Location: Moti Nagar Walk-in Date/ Time: 26 October - 7th November , 11 AM onwards Venue Details- Saarthi Management Consultants G-10, Ground Floor, TDI Fun Republic Mall, Moti Nagar, New Delhi - 110 015. Contact Person: Raghav: 7838092657","location":"Delhi","experience":"1 - 4 Years"},{"date":"26, 27 - Oct - 2020","skills":"Technical Support, Voice Based Process, Customer Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Zebronics India Private Limited, No. 118 Poonamallee High Road, Vepery, Chennai - 600 084. Landmark: Opposite to Hotel Sudha","phone":"Not Provided","profile":"Technical Support Engineer \nZebronics India Private Limited","description":"We at Zebronics India Private Limited are hiring Technical Support Engineer for R&D Department Role: Technical Support Engineer (Only Male) Experience: 0 to 3 Years (Freshers can apply) Job Location: Chennai Candidate should have excellent communication skills in English and Hindi Should have strong technical skills Languages: English & Hindi Speaking Must Other regional languages will be advantageous Responsibility:- Responds to customer technical problems/ issues related to hardware, software and networking via e-mail/ chat and phone. Report Preparation Walk-in Date/ Time: 26th - 27th October 2020, 10.00 AM - 6.00 PM Venue Details- Zebronics India Private Limited No. 118 Poonamallee High Road, Vepery, Chennai - 600 084. Landmark: Opposite to Hotel Sudha Contact Person- Aparna","location":"Chennai","experience":"0 - 3 Years"},{"date":"26, 27, 28, 29, 30, 31 - Oct - 2020","skills":"Customer Care, Voice Process, Customer Support","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"CorpAid Services Private Limited, 101 & 102, First Floor, Gulmohar Apartment, East Street, Above SBI Bank, Camp Pune - 411 001","phone":"9112211104","profile":"Customer Care Executive \nCorpAid Services Private Limited","description":"Qualification: HSC or Graduate (Age Eligibility: 20 to 28 Years) Skills: Good Communication Skill in English, Hindi & Marathi Basic Computer Knowledge and Good hands-on Computer Job Responsibility- Semi Voice Process Good Communication Skill in English, Hindi & Marathi Basic Computer Knowledge and Good hands-on Computer Walk-in Date/ Time: 23 October - 3rd November 2020, 9 AM onwards Venue Details- CorpAid Services Private Limited, 101 & 102, First Floor, Gulmohar Apartment, East Street, Above SBI Bank, Camp Pune - 411 001 Email: hr@corpaidcs.com Contact No: 9112211104 Sulakshana HR Manager (8669998509) Note: This opening is for Our Company. We are not a placement Consultancy & don't charge any Fees/ Registration.","location":"Pune","experience":"0 - 1 Years"},{"date":"23, 24, 25, 26 - Oct - 2020","skills":"Java, .Net, PHP","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Net Creative Mind Solutions Pvt. Limited, 133, GF, Katwaria Sarai, New Delhi - 110 016","phone":"9315174188","profile":"Software Developer (Trainee) \nNet Creative Mind Solutions Pvt. Limited","description":"Candidate Should be first Division in Graduation/ Post Graduation (B.Tech (CS), B.Tech (IT), BCA, MCA, B.Sc (IT)). Should be Pass out in 2019-20 & 2020-21. Candidate must be Regular pass out in any stream Should be interested to work in Katwaria Saria location. Walk-in Date/ Time: 23rd - 26th October 2020, 11.00 AM - 3.30 PM Venue Details- Net Creative Mind Solutions Pvt. Limited 133, GF, Katwaria Sarai, New Delhi - 110016 Contact Person- Rainu Tiwari Phone- 9315174188","location":"Delhi","experience":"0 - 1 Years"},{"date":"22, 23, 24, 25 - Oct - 2020","skills":"Customer Relationship, Sales/ Business Development Activities","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Propin Properties Private Limited, 5th Floor, Vasundhara Plaza, Vishal Nagar, Pimple Nilakh, Pune - 411 027.","phone":"8669656560","profile":"Relationship Manager \nPropin Properties Private Limited","description":"Candidate should have access to a smart phone with internet and a vehicle which they will be using to travel to office and projects Good English communication skills and fluency in Hindi and/or Kannada. Sales Executive sales officer/ executive Required Qualifications. Candidate should be minimum graduation in any stream Should have 0 to 2 years of experience in sales Must have excellent communication skills They must be able to work independently and with little supervision, and sometimes they are even required to work remotely. We are hiring energetic and enthusiastic people for our residential real estate sales team. Roles and Responsibilities- Generate Business, Meet personal and team sales target, Create awareness of your brand, Communicate the target Audience and build and develop customer relationships. Responsible for generating sales with existing customers and developing New Leads, Clients and Customers. Immediate hiring and joining at our Marketing offices as we have an urgent job opening for the position of sales representatives. This position will help the individual to increase the skills in manpower handling, negotiation on price, better understanding on sales, to handle potential territory in a supervisory roles as a Sales Executive Responsible to achieve sales target by closing deals. Job Benefits & Perks- PF & ESIC Walk-in Date/ Time: 22nd October - 25th October , 9.30 AM - 5.30 PM Venue Details- Propin Properties Private Limited 5th Floor, Vasundhara Plaza, Vishal Nagar, Pimple Nilakh, Pune - 411 027. Note: Interested candidate can send their updated resume on hr@propinn.in if you are interested call me on my number 8669656560","location":"Pune","experience":"0 - 2 Years"},{"date":"23 - Oct - 2020","skills":"ASP .NET. MVC, OOP, C#, Javascript, Jquery, Angular, SQL Server Programming","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Kotak Mahindra Bank Limited, C 330, Vivek Vihar, Phase 1, New Delhi - 110 095","phone":"Not Provided","profile":"Assistant Acquisition Manager \nKotak Mahindra Bank Limited","description":"We have Urgent openings for Assistant Acquisition Manager- CASA -Sales for Delhi-NCR location. Designation: Assistant Acquisition Manager- CASA (Sales) Grade: M1 - Assistant Manager (On a roll of Kotak Mahindra Bank) CTC Offered- Upto 2.7 LPA Candidate must be a Graduate with Fair English communication skills Must have Field Sales Exposure and willing to hunt in the open market Preferred candidate From banking, Insurance, Stockbroking & NBFC Maximum Age Limit- 27 Years Note- Candidate Must have basic knowledge of Banking products & Role which he applied for. Job profile : To source customers for Current Account & Saving Account. Customers to be sourced from individuals, small businesses, trusts, associations, societies, corporates. Revenue Generation, Customer Acquisition, Customer Retention, Cost Efficiency Through Process Hardcore sales mentality. Primary motivation from the achievement of targets. A hunter by orientation. Should be well-groomed and presentable with ambassadorship qualities Interview Date: 23rd October 2020 Timing: 11:00 AM to 3:30 pm Venue: Kotak Mahindra Bank Limited C 330, Vivek Vihar, Phase 1, New Delhi - 110 095. Contact Person: Japneet Singh Walia (Regional Sales Manager)","location":"Delhi","experience":"1 - 5 Years"},{"date":"22, 23 - Oct - 2020","skills":"Java/ .Net/ Testing Certification","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Changepond Technologies Pvt. Limited, H-2, SIPCOT IT Park, OMR, Siruseri, Chennai - 603 103.","phone":"Not Provided","profile":"IT Freshers - Java/ .Net/ Testing \nChangepond Technologies Private Limited","description":"Changepond Technologies Private Limited, is hiring Engineering Graduates - Freshers for Chennai location. Eligibility Criteria- 2017/2018 & 2019 Passed out freshers only. BE/ B Tech / MCA Graduates with an aggregate of minimum 60% in Academics Mandate: Java/ .Net/ Testing Certification from any Training Institutes Good communication Skills Drive Details: Interview Date : 22nd/ 23rd October 2020 (Thu/ Fri) Timings : 09:30 AM to 12:00 PM Venue Details: Changepond Technologies Pvt. Limited H-2, SIPCOT IT Park, OMR, Siruseri, Chennai - 603 103. Contact Person: Arvind (HR), Kalaiselvan (HR) Contact Email : arvind.r@changepond.com, kalaiselvan.r@changepond.com","location":"Chennai","experience":"0 - 1 Years"},{"date":"23 - Oct - 2020","skills":"Induction, MIS, Joining Formalities, School Administration, Email Writing","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Orchids - The International School, Ram Nagar-Survey No. 9, 1, Next to HP Petrol Pump, Tathawade- Ravet BRT Road, Tathawade, Pune - 41103.","phone":"Not Provided","profile":"Executive Assistant (HR) \nOrchids International School","description":"Candidate should be Graduate/ HR with good communication & writing skills Must have excellent interpersonal skills Female Candidates Only need to apply! Job Responsibility- Maintain Principal\u0092s Calendar Serve as a single point of contact between principal, branch, staff and parents Office Operations & MIS Payroll, Attendance Maintenance, Leave Management Walk-in Date/ Time: 23 October 2020, 10.00 AM - 1.00 PM Venue Details- Orchids - The International School, Ram Nagar-Survey No. 9, 1, Next to HP Petrol Pump, Tathawade- Ravet BRT Road, Tathawade, Pune - 41103. Contact Person - Akshay","location":"Pune","experience":"1 - 3 Years"},{"date":"22 - Oct - 2020","skills":"Java/ J2ee, (Core Java, J2ee, JSP, Servlet, Spring/ Hibernate/ Struts), MySQL or PostgreSQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Ojas Softech Private Limited, A-139, Sector-63, Noida-201301","phone":"8447131703","profile":"Java Developer/ Team Lead \nOjas Softech Private Limited","description":"Candidate must have strong hands on experience on the following technology. Java/ J2ee, (Core Java, J2ee, JSP, Servlet, Spring/ Hibernate/ Struts) Should have hands on Experience on Developing Java Application Have worked on like MySQL or PostgreSQL Experience in leading a team Candidate must have strong coding and logical skills Should be proactive & smart with strong analytical skills Open to work in a challenging environment Walk-in Date/ Time: 22nd October 2020, 9.30 AM - 5.30 PM Venue Details- Ojas Softech Private Limited A-139, Sector-63, Noida-201301 Contact Person- Pooja Sinha Phone No. 8447131703","location":"Noida","experience":"5 - 10 Years"},{"date":"22, 23 - Oct - 2020","skills":"Customer Support, Customer Service, Semi Voice, Outbound Process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Apollo Hospitals Enterprise Private Limited, 9th Floor, Krishe Sapphire Building, Near Durgam Cheruvu Metro Station, Madhapur, Hyderabad.","phone":"Not Provided","profile":"Customer Support Executive \nApollo Hospitals Enterprise Private Limited","description":"Educational Qualification : Any Graduate Knowledge of BPO Voice/ Non Voice 0 to 2 years , 2 to 4 years mix. Exposure to work in Third party set up in Voice and Semi Voice environment. Current Role should be in BPO/ KPO in MNC. Language as per business need. Skill Set: Should be proficient in English, Hindi (Mandatory) Plus and Telugu/ Kannada/ Malayalam/ Bengali/ Gujarati/ Odia (Optional - Anyone out these languages) Job Responsibility: Data uploading from Client Portal to in-house Portal and creation of Unique ID. Calling Customer and Booking Appointment for client visit/ any other requirement. Following up with location SPOC to ensure smooth Customer Experience. Closelooping back with Customer post completion of tests. Maintaining data in excel/ web application as per Client Requirement Ensuring Client requirements are met. Should be flexible to work in shifts. Should have strong communication and typing skills. Ensuring business KPIs are being met. Maintaining Quality standards as per agreed protocols. No. of Vacancies: Bengali -15 Oriya 03 Gujrati 01 Hindi 25 Kannada, Malayalam - 05 Walk-in Date/ Time: 22nd - 23rd October 2020, 12.00 PM - 3.00 PM Venue Details- Apollo Hospitals Enterprise Private Limited 9th Floor, Krishe Sapphire Building, Near Durgam Cheruvu Metro Station, Madhapur, Hyderabad. Contact Person- Nazia Devi","location":"Hyderabad","experience":"0 - 4 Years"},{"date":"22, 23 - Oct - 2020","skills":"Customer Service, Voice Process, Customer Support, Problem Resolution","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Easy Trip Planners Private Limited, 223, Patparganj Industrial Area, New Delhi - 110 092.","phone":"Not Provided","profile":"Freshers - Flight Support (Inbound Process) \nEasy Trip Planners Private Limited","description":"Candidate should be Any Graduate/ Freshers with good communication skills. Freshers from travel domain with good communication skills Experienced customer support candidates in travel domain Experience form BPO background can also be consider Ready to work in rotational shifts (No Night Shifts for females) Knowledge -international/ domestic travel voice process Knowledge of world map & geography will be required. Be enthusiastic & have zeal to perform. Be flexible to work in 24*7 rotational shifts days working environment. Candidates should be able to join ASAP. Excellent communication skills required. There is no night shift for female. Provide best-in-class customer service and problem resolution to customer queries over the voice based phone service. Support customers across Telecommunication/E- mail/Chat, Meet customer requirements through first contact resolution. Clarify customer requirements; probe for and confirm understanding of requirements or problem. Greet customers in a courteous, friendly, and professional manner using agreed upon procedures. Listen attentively to customer needs and concerns; demonstrate empathy. Confirm customer understanding of the solution and provide additional customer education as needed. Prepare complete and accurate work and update customer file. Walk-in Date/ Time: 20th October - 23 October , 11.30 AM - 3.30 PM Venue Details- Easy Trip Planners Private Limited 223, Patparganj Industrial Area, New Delhi - 110 092. Contact Person - Alisha Only interested candidates can share their CV's on hr@easemytrip.com","location":"Delhi","experience":"0 - 2 Years"},{"date":"22, 23, 24 - Oct - 2020","skills":"Good Analytical and Communication Skills","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"FedEx Express TSCS (India) Private Limited, Times of India Compound, Kankarbagh Patna","phone":"9626299979","profile":"Operations Support Executive/ Agent \nFedEX Express Transportation Supply Chain Services","description":"Urgently looking for Operations Support Executive/ Agent. We would invite you for a walk-in interview from 22nd to 24th Oct, 2020. The details of the same is mentioned below :- 22nd October, 2020 - 1100 hours to 1200 hours 23rd October, 2020 - 1100 hours to 1200 hours 24th October, 2020 - 1000 hours to 1400 hours Venue Details- FedEx Express TSCS (India) Private Limited Times of India Compound, Kankarbagh Patna You are requested to contact Mr. E. R. Pirabhu Raaj at 9626299979 only at the above mentioned scheduled time.","location":"Patna","experience":"0 - 5 Years"},{"date":"22, 23, 24 - Oct - 2020","skills":"General Administration, Bidding, Tender Preparation/ Registration, e-Tendering","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Alankit House, 4E/2 Jhandewalan Extension, New Delhi -110 055. Nearest Metro Station:- Jhandewalan Metro Station Gate No. 2","phone":"7290012325","profile":"Senior Tender Executive \nAlankit Limited","description":"Person must have minimum 3 years of experience in General Administration, Bidding, Tender Preparation/ Registration, e-Tendering. Follow up Tender Registration & Payments in various Govt. Department. Should be responsible to handle tenders published on GEM Portal. Prepare documents for e-Tendering, Studying tender documents, qualification criteria, scope of work, Floating RFQ to various vendors/ contractors, collecting quotations, preparing comparative statements, meeting deadlines for the tenders received from public sector undertaking Govt. and other organizations. Prepare Bills of All Departments Follow ups from client regarding order. Convert inquiries into order. Preparing MIS weekly/ Monthly Reports. Walk-in Date & Timing:- 19th to 24th October 2020 @ 10:00 AM to 1:00 PM Venue Details:- Alankit House, 4E/2 Jhandewalan Extension, New Delhi -110 055 Nearest Metro Station:- Jhandewalan Metro Station Gate No. 2 Landmark:- Near Post Office Contact Person:- Ms. Usha Contact details:- 7290012325 Note:- Interested candidate can share their resume on ushar@alankit.com OR call on 7290012325.","location":"Delhi","experience":"3 - 7 Years"},{"date":"22, 23 - Oct - 2020","skills":"ASP .Net MVC, C#, Entity Framework, Database Concepts, Stored Procedure, MS SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Brickwork Ratings, Bannerghatta Road, Near to Meenakshi Mall, Bangalore","phone":"080-40409940","profile":"Web/ ASP .Net Developer \nBrickwork Ratings","description":"Brickwork Ratings, a SEBI Registered and RBI accredited Credit Rating Agency is looking for a suitable candidate for the position of Web Developer. In sync with our rapid expansion phase and to keep our website updated all the time, we have an immediate requirement for a Web Developer for a position at our Corporate Office at Bannerghatta road, Bangalore. Education - B.E., B.TECH, BCA, MCA ( CS or IT ), Any Computer Science Graduate. Minimum 3 years of relevant work experience Work Experience - 2 to 5 years The job responsibilities will be as described below but not limited to:- Strong ASP .Net web form programming, ASP .Net MVC, C#, Entity Framework with good communication skills Good in Database Concepts, Stored Procedure, MS SQL Server Working experience in Jquery, Ajax, Javascript, HTML, CSS Proficiency in SDLC and Agile methodologies Good to have Angular JS knowledge Task Description: Need to maintain existing websites, Adding new functionalities, bug fixing, writing UI programming, SQL queries to generate the reports. The existing sites are is in ASP.net webforms / MVC and with MSMSQL server as back end. The ideal candidate must have - Fair understanding of JavaScript programming Deep expertise and hands-on experience with Web Applications and programming languages such as HTML, CSS, JavaScript, JQuery, and APIs.Good team player within a target-driven environment The knack for adhering to accessibility standards Walk-in Date: 22nd and 23rd October 2020 Timings - 10:30 AM to 4:30 PM Venue Details: Brickwork Ratings Bannerghatta Road, Near to Meenakshi Mall, Bangalore Note - Preference will be given to the immediate joiners. Important Note - Every Individual must wear mask always. Every Individual should have their personal hand sanitiser. Every Individual needs do the temperature screening at reception. Every Individual needs to declare their travel history and other relevant information","location":"Bangalore","experience":"2 - 5 Years"},{"date":"22, 23, 24 - Oct - 2020","skills":"Technical Support, Voice Process, Chat Process, Troubleshooting","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"[24]7.ai Customer Private Limited, Ground Floor NSL Arena Town Centre, Behind Cricket Stadium, Ramanthapur Road, Uppal, Hyderabad - 500 039","phone":"9676338009","profile":"Support Executive (Chat Process) \n24/7 Customer Private Limited","description":"Candidate should be Any Graduate with excellent Verbal and Written Communication skills. Should possess excellent knowledge in troubleshooting of computers or any electronic devices (Voice Process). Must have good logical reasoning & analytical skills. Able to interact with customers via chat or voice, should be able to answer servicing questions. Able to work in rotational night shifts (US) Should have typing speed of 26 WPM, 90% accuracy Eligibility Criteria: Undergraduate/ Graduate and Postgraduate freshers and experienced can apply. Immediate joiners Benefits- Transport facility both Pick/ Drop. Life Insurance. Medical Insurance Interview Rounds: Personal Introduction Round Online Test (Chat process) Versant Test and Technical test (Voice Process) Operations Round Walk-in Date/ Time- 20th - 24th October from 10.00 AM onwards Venue Details- [24]7.ai Customer Private Limited Ground Floor NSL Arena Town Centre, Behind Cricket Stadium, Ramanthapur Road, Uppal, Hyderabad - 500 039 Contact Person: Raaga Sudha Contact No: 9676338009 Note: * Write HR name on the resume * Carry xerox copies of all academic and experience(if applicable) certificates, resume, ID proof and wear a face mask * Request you to carry snacks as the waiting time may extend in the interview. * Candidates attended interview within 30 days are not eligible to attend.","location":"Hyderabad","experience":"0 - 5 Years"},{"date":"21, 22, 23, 24 - Oct - 2020","skills":"ASP .Net MVC SQL OOPS Concept","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Chetu (India) Private Limited, H-6, Sector 63, Noida.","phone":"8130330519","profile":".Net Developers \nChetu (India) Private Limited","description":"We at Chetu (India) Private Limited are hiring .Net Developers. Candidate should have 2 to 7 years of experience in Software Development using the following technologies- ASP .Net MVC SQL OOPS Concept 1.6 Experience + 6 Months Internship or training also Work. 2 Year Experience in .Net role. Perks and Benefits- Cab Facilities On Site Placement Opportunity (Depend On Performance) Medical Insurance 6 Months Appraisal Interview Walk-in Date/ Time: 21st October - 24th October from 3.30 PM onwards Venue Details- Chetu (India) Private Limited H-6, Sector 63, Noida. Contact Person : Pranav (8130330519)","location":"Noida","experience":"2 - 7 Years"},{"date":"22, 23 - Oct - 2020","skills":"ASP .NET framework, SQL Server, and Design/ Architectural Patterns","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Brickwork Ratings India Private Limited, 3rd Floor, Raj Alkaa Park, 29/3 & 32/2, Bannerghatta Main Rd, Kalena Agrahara, Near Meenakshi Temple and Mall, Bengaluru, Karnataka - 560 076","phone":"Not Provided","profile":".Net Developer \nBrickwork Ratings India Private Limited","description":"Candidate must have proven experience of 6 to 8 years as a .NET Developer or Application Developer. Familiarity with the ASP .NET framework, SQL Server, and Design/ Architectural Patterns (e.g. Model-View-Controller (MVC)). Knowledge and experience in written code in C# and HTML5/ CSS3. Worked on SQL Server (Handling database, Stored Procedure, Function, View, etc.) Must have excellent troubleshooting and communication skills Attention to detail Roles and Responsibilities - Participate in requirements analysis Write clean, scalable code using .NET programming languages Test and deploy applications and systems Revise, update, and debug code Improve existing software Serve as an expert on applications and provide technical support Walk-in Date/ Time: 22nd - 23rd October , 10.30 AM - 4.30 PM Venue Details- Brickwork Ratings India Private Limited 3rd Floor, Raj Alkaa Park, 29/3 & 32/2, Bannerghatta Main Rd, Kalena Agrahara, Near Meenakshi Temple and Mall, Bengaluru, Karnataka - 560 076 Contact Person - Seemab","location":"Bangalore","experience":"6 - 8 Years"},{"date":"19, 20 - Oct - 2020","skills":"Front Desk, General Administration, Front Office Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Savitri Telecom Services, 101-110 A, Somdutt Chamber -1, 1st Floor, Bhikaji Cama Place, New Delhi - 110 066.","phone":"011-26700549","profile":"Admin/ Front Office Executive \nSavitri Telecom Services","description":"Candidate should have proven experience as front desk representative, agent or relevant position. Telephone Skills, Verbal Communication, Microsoft Office skills. Must be well versed with MS Office & Excel. Perceptive and disciplined Roles & Responsibilities- Keep front desk tidy and presentable with all necessary material (pens, forms, paper etc). Supervision on office maintenance, neat and clean office environment and ensuring that the conference is ready for meetings. Planning and coordinating administrative procedures and systems and devising ways to streamline processes. Answer all incoming calls and redirect them or keep messages. Take the Customers details and direct them to the available Sales Executive. Handle and prioritize all outgoing or incoming correspondence (e-mail, letters, packages etc.). Take up other duties as assigned (travel arrangements, schedules etc.) Interview Date: 19th October - 20th October Time: 11.00 AM - 1.00 PM Interview Venue- Savitri Telecom Services 101-110 A, Somdutt Chamber -1, 1st Floor, Bhikaji Cama Place, New Delhi - 110 066. Contact Person- Neha Sharma (011-26700549) Interested candidates may send their profile to hr@savitritelecom.com","location":"Delhi","experience":"0 - 2 Years"},{"date":"19 - Oct - 2020","skills":"HR Operations, Countif, Induction, Formulas, Conditional Formatting","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Visionet Systems Private Limited, Bommanahalli, AMR Tech Park, Ground Floor, # 23 & 24, Hosur Main Road, Next to Oxford College of Engineering, Bengaluru, Karnataka - 560 068.","phone":"8707253872","profile":"HR Executive \nVisionet Systems Private Limited","description":"Candidate must proficient in advanced Excel (Vlookup, Hlookup, Pivot table, Macros, Countif, Formule) Should have good knowledge in HR Operations. Should have excellent communication skills. Must be strong in Excel. Immediate joiners would e preferred. (NOTE: LOOKING FOR ONLY MALE CANDIDATES) Walk-in Date/ Time: 19th October 2020, 10.00 AM - 4.30 PM Venue Details- Visionet Systems Private Limited Bommanahalli, AMR Tech Park, Ground Floor, # 23 & 24, Hosur Main Road, Next to Oxford College of Engineering, Bengaluru, Karnataka - 560 068. Contact Person - Neelam (8707253872)","location":"Bangalore","experience":"1 - 3 Years"},{"date":"19 - Oct - 2020","skills":"Email Support, Non Voice Process, Domestic Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Hexaware Technologies Limited, Elysium central building, 2nd floor, Near Carmal Garden School, Sungam Bus Stop, Coimbatore \u0096 641 045.","phone":"9677117759","profile":"Non-Voice Process Executive \nHexaware Technologies Limited","description":"We are looking for freshers and experienced candidates for domestic non-voice process at Coimbatore. It's a pure day shift process with attractive salary package. Expectation: He/she should know to read, write and speak Hindi mandatory Must be good in written English communication. Note: Candidates who doesn't know Hindi, please do not walk in/apply If you meet the above criterias, please directly walk-in at the mentioned venue with your basic documents (10th, 12th and Semester mark sheets - original and photocopies and also your government id proofs). It's mandatory that you mention HR Pro as reference, else you woud not get a chance for F2F interview. Please do share this post to your friends who are in need of a job. You can also send in your resumes to placements.hrpro@gmail.com for jobs like this. Walk-in Date/ Time: 19th October 2020, 10.00 AM - 4.00 PM Venue Details- Hexaware Technologies Limited, Elysium central building, 2nd floor, Near Carmal Garden School, Sungam Bus Stop, Coimbatore \u0096 641 045. Lankmark\u0096 Opposite to Indian Bank Contact Person- Maya (9677117759)","location":"Coimbatore","experience":"0 - 3 Years"},{"date":"19 - Oct - 2020","skills":"IT Helpdesk, Technical Support, Telecalling, Software Support, Troubleshooting","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Bits N Bytes Soft Private Limited, 3rd floor, Building No-113, Sector-44, Gurgaon, Haryana","phone":"Not Provided","profile":"Technical Support Engineer \nBits N Bytes Soft Private Limited","description":"Candidate should be Any Graduate with 1 to 5 years of experience in IT Helpdesk, Technical Support, Telecalling, Software Support, Troubleshooting. Must have excellent communication skills Job Responsibility- Research and identify solutions to software and hardware issues. Ask customers targeted questions to quickly understand the root of the problem. Talk clients through phone, email or chat, until they- ve solved a technical issue Walk-in Date/ Time: 19th October 2020, 9.30 AM - 3.30 PM Venue Details- Bits N Bytes Soft Private Limited 3rd floor, Building No-113, Sector-44, Gurgaon, Haryana, India Contact Person - Rakesh Ray","location":"Gurgaon","experience":"1 - 5 Years"},{"date":"22, 23 - Oct - 2020","skills":"ASP .NET framework, SQL Server, and Design/ Architectural Patterns","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Brickwork Ratings India Private Limited, 3rd Floor, Raj Alkaa Park, 29/3 & 32/2, Bannerghatta Main Rd, Kalena Agrahara, Near Meenakshi Temple and Mall, Bengaluru, Karnataka - 560 076","phone":"Not Provided","profile":".Net Developer \nBrickwork Ratings India Private Limited","description":"Candidate must have proven experience of 6 to 8 years as a .NET Developer or Application Developer. Familiarity with the ASP .NET framework, SQL Server, and Design/ Architectural Patterns (e.g. Model-View-Controller (MVC)). Knowledge and experience in written code in C# and HTML5/ CSS3. Worked on SQL Server (Handling database, Stored Procedure, Function, View, etc.) Must have excellent troubleshooting and communication skills Attention to detail Roles and Responsibilities - Participate in requirements analysis Write clean, scalable code using .NET programming languages Test and deploy applications and systems Revise, update, and debug code Improve existing software Serve as an expert on applications and provide technical support Walk-in Date/ Time: 22nd - 23rd October , 10.30 AM - 4.30 PM Venue Details- Brickwork Ratings India Private Limited 3rd Floor, Raj Alkaa Park, 29/3 & 32/2, Bannerghatta Main Rd, Kalena Agrahara, Near Meenakshi Temple and Mall, Bengaluru, Karnataka - 560 076 Contact Person - Seemab","location":"Bangalore","experience":"6 - 8 Years"},{"date":"19, 20 - Oct - 2020","skills":"Front Desk, General Administration, Front Office Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Savitri Telecom Services, 101-110 A, Somdutt Chamber -1, 1st Floor, Bhikaji Cama Place, New Delhi - 110 066.","phone":"011-26700549","profile":"Admin/ Front Office Executive \nSavitri Telecom Services","description":"Candidate should have proven experience as front desk representative, agent or relevant position. Telephone Skills, Verbal Communication, Microsoft Office skills. Must be well versed with MS Office & Excel. Perceptive and disciplined Roles & Responsibilities- Keep front desk tidy and presentable with all necessary material (pens, forms, paper etc). Supervision on office maintenance, neat and clean office environment and ensuring that the conference is ready for meetings. Planning and coordinating administrative procedures and systems and devising ways to streamline processes. Answer all incoming calls and redirect them or keep messages. Take the Customers details and direct them to the available Sales Executive. Handle and prioritize all outgoing or incoming correspondence (e-mail, letters, packages etc.). Take up other duties as assigned (travel arrangements, schedules etc.) Interview Date: 19th October - 20th October Time: 11.00 AM - 1.00 PM Interview Venue- Savitri Telecom Services 101-110 A, Somdutt Chamber -1, 1st Floor, Bhikaji Cama Place, New Delhi - 110 066. Contact Person- Neha Sharma (011-26700549) Interested candidates may send their profile to hr@savitritelecom.com","location":"Delhi","experience":"0 - 2 Years"},{"date":"19 - Oct - 2020","skills":"HR Operations, Countif, Induction, Formulas, Conditional Formatting","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Visionet Systems Private Limited, Bommanahalli, AMR Tech Park, Ground Floor, # 23 & 24, Hosur Main Road, Next to Oxford College of Engineering, Bengaluru, Karnataka - 560 068.","phone":"8707253872","profile":"HR Executive \nVisionet Systems Private Limited","description":"Candidate must proficient in advanced Excel (Vlookup, Hlookup, Pivot table, Macros, Countif, Formule) Should have good knowledge in HR Operations. Should have excellent communication skills. Must be strong in Excel. Immediate joiners would e preferred. (NOTE: LOOKING FOR ONLY MALE CANDIDATES) Walk-in Date/ Time: 19th October 2020, 10.00 AM - 4.30 PM Venue Details- Visionet Systems Private Limited Bommanahalli, AMR Tech Park, Ground Floor, # 23 & 24, Hosur Main Road, Next to Oxford College of Engineering, Bengaluru, Karnataka - 560 068. Contact Person - Neelam (8707253872)","location":"Bangalore","experience":"1 - 3 Years"},{"date":"19 - Oct - 2020","skills":"Email Support, Non Voice Process, Domestic Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Hexaware Technologies Limited, Elysium central building, 2nd floor, Near Carmal Garden School, Sungam Bus Stop, Coimbatore \u0096 641 045.","phone":"9677117759","profile":"Non-Voice Process Executive \nHexaware Technologies Limited","description":"We are looking for freshers and experienced candidates for domestic non-voice process at Coimbatore. It's a pure day shift process with attractive salary package. Expectation: He/she should know to read, write and speak Hindi mandatory Must be good in written English communication. Note: Candidates who doesn't know Hindi, please do not walk in/apply If you meet the above criterias, please directly walk-in at the mentioned venue with your basic documents (10th, 12th and Semester mark sheets - original and photocopies and also your government id proofs). It's mandatory that you mention HR Pro as reference, else you woud not get a chance for F2F interview. Please do share this post to your friends who are in need of a job. You can also send in your resumes to placements.hrpro@gmail.com for jobs like this. Walk-in Date/ Time: 19th October 2020, 10.00 AM - 4.00 PM Venue Details- Hexaware Technologies Limited, Elysium central building, 2nd floor, Near Carmal Garden School, Sungam Bus Stop, Coimbatore \u0096 641 045. Lankmark\u0096 Opposite to Indian Bank Contact Person- Maya (9677117759)","location":"Coimbatore","experience":"0 - 3 Years"},{"date":"19 - Oct - 2020","skills":"IT Helpdesk, Technical Support, Telecalling, Software Support, Troubleshooting","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Bits N Bytes Soft Private Limited, 3rd floor, Building No-113, Sector-44, Gurgaon, Haryana","phone":"Not Provided","profile":"Technical Support Engineer \nBits N Bytes Soft Private Limited","description":"Candidate should be Any Graduate with 1 to 5 years of experience in IT Helpdesk, Technical Support, Telecalling, Software Support, Troubleshooting. Must have excellent communication skills Job Responsibility- Research and identify solutions to software and hardware issues. Ask customers targeted questions to quickly understand the root of the problem. Talk clients through phone, email or chat, until they- ve solved a technical issue Walk-in Date/ Time: 19th October 2020, 9.30 AM - 3.30 PM Venue Details- Bits N Bytes Soft Private Limited 3rd floor, Building No-113, Sector-44, Gurgaon, Haryana, India Contact Person - Rakesh Ray","location":"Gurgaon","experience":"1 - 5 Years"},{"date":"22, 23 - Oct - 2020","skills":"ASP .NET framework, SQL Server, and Design/ Architectural Patterns","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Brickwork Ratings India Private Limited, 3rd Floor, Raj Alkaa Park, 29/3 & 32/2, Bannerghatta Main Rd, Kalena Agrahara, Near Meenakshi Temple and Mall, Bengaluru, Karnataka - 560 076","phone":"Not Provided","profile":".Net Developer \nBrickwork Ratings India Private Limited","description":"Candidate must have proven experience of 6 to 8 years as a .NET Developer or Application Developer. Familiarity with the ASP .NET framework, SQL Server, and Design/ Architectural Patterns (e.g. Model-View-Controller (MVC)). Knowledge and experience in written code in C# and HTML5/ CSS3. Worked on SQL Server (Handling database, Stored Procedure, Function, View, etc.) Must have excellent troubleshooting and communication skills Attention to detail Roles and Responsibilities - Participate in requirements analysis Write clean, scalable code using .NET programming languages Test and deploy applications and systems Revise, update, and debug code Improve existing software Serve as an expert on applications and provide technical support Walk-in Date/ Time: 22nd - 23rd October , 10.30 AM - 4.30 PM Venue Details- Brickwork Ratings India Private Limited 3rd Floor, Raj Alkaa Park, 29/3 & 32/2, Bannerghatta Main Rd, Kalena Agrahara, Near Meenakshi Temple and Mall, Bengaluru, Karnataka - 560 076 Contact Person - Seemab","location":"Bangalore","experience":"6 - 8 Years"},{"date":"19, 20 - Oct - 2020","skills":"Front Desk, General Administration, Front Office Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Savitri Telecom Services, 101-110 A, Somdutt Chamber -1, 1st Floor, Bhikaji Cama Place, New Delhi - 110 066.","phone":"011-26700549","profile":"Admin/ Front Office Executive \nSavitri Telecom Services","description":"Candidate should have proven experience as front desk representative, agent or relevant position. Telephone Skills, Verbal Communication, Microsoft Office skills. Must be well versed with MS Office & Excel. Perceptive and disciplined Roles & Responsibilities- Keep front desk tidy and presentable with all necessary material (pens, forms, paper etc). Supervision on office maintenance, neat and clean office environment and ensuring that the conference is ready for meetings. Planning and coordinating administrative procedures and systems and devising ways to streamline processes. Answer all incoming calls and redirect them or keep messages. Take the Customers details and direct them to the available Sales Executive. Handle and prioritize all outgoing or incoming correspondence (e-mail, letters, packages etc.). Take up other duties as assigned (travel arrangements, schedules etc.) Interview Date: 19th October - 20th October Time: 11.00 AM - 1.00 PM Interview Venue- Savitri Telecom Services 101-110 A, Somdutt Chamber -1, 1st Floor, Bhikaji Cama Place, New Delhi - 110 066. Contact Person- Neha Sharma (011-26700549) Interested candidates may send their profile to hr@savitritelecom.com","location":"Delhi","experience":"0 - 2 Years"},{"date":"19 - Oct - 2020","skills":"HR Operations, Countif, Induction, Formulas, Conditional Formatting","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Visionet Systems Private Limited, Bommanahalli, AMR Tech Park, Ground Floor, # 23 & 24, Hosur Main Road, Next to Oxford College of Engineering, Bengaluru, Karnataka - 560 068.","phone":"8707253872","profile":"HR Executive \nVisionet Systems Private Limited","description":"Candidate must proficient in advanced Excel (Vlookup, Hlookup, Pivot table, Macros, Countif, Formule) Should have good knowledge in HR Operations. Should have excellent communication skills. Must be strong in Excel. Immediate joiners would e preferred. (NOTE: LOOKING FOR ONLY MALE CANDIDATES) Walk-in Date/ Time: 19th October 2020, 10.00 AM - 4.30 PM Venue Details- Visionet Systems Private Limited Bommanahalli, AMR Tech Park, Ground Floor, # 23 & 24, Hosur Main Road, Next to Oxford College of Engineering, Bengaluru, Karnataka - 560 068. Contact Person - Neelam (8707253872)","location":"Bangalore","experience":"1 - 3 Years"},{"date":"19 - Oct - 2020","skills":"Email Support, Non Voice Process, Domestic Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Hexaware Technologies Limited, Elysium central building, 2nd floor, Near Carmal Garden School, Sungam Bus Stop, Coimbatore \u0096 641 045.","phone":"9677117759","profile":"Non-Voice Process Executive \nHexaware Technologies Limited","description":"We are looking for freshers and experienced candidates for domestic non-voice process at Coimbatore. It's a pure day shift process with attractive salary package. Expectation: He/she should know to read, write and speak Hindi mandatory Must be good in written English communication. Note: Candidates who doesn't know Hindi, please do not walk in/apply If you meet the above criterias, please directly walk-in at the mentioned venue with your basic documents (10th, 12th and Semester mark sheets - original and photocopies and also your government id proofs). It's mandatory that you mention HR Pro as reference, else you woud not get a chance for F2F interview. Please do share this post to your friends who are in need of a job. You can also send in your resumes to placements.hrpro@gmail.com for jobs like this. Walk-in Date/ Time: 19th October 2020, 10.00 AM - 4.00 PM Venue Details- Hexaware Technologies Limited, Elysium central building, 2nd floor, Near Carmal Garden School, Sungam Bus Stop, Coimbatore \u0096 641 045. Lankmark\u0096 Opposite to Indian Bank Contact Person- Maya (9677117759)","location":"Coimbatore","experience":"0 - 3 Years"},{"date":"19 - Oct - 2020","skills":"IT Helpdesk, Technical Support, Telecalling, Software Support, Troubleshooting","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Bits N Bytes Soft Private Limited, 3rd floor, Building No-113, Sector-44, Gurgaon, Haryana","phone":"Not Provided","profile":"Technical Support Engineer \nBits N Bytes Soft Private Limited","description":"Candidate should be Any Graduate with 1 to 5 years of experience in IT Helpdesk, Technical Support, Telecalling, Software Support, Troubleshooting. Must have excellent communication skills Job Responsibility- Research and identify solutions to software and hardware issues. Ask customers targeted questions to quickly understand the root of the problem. Talk clients through phone, email or chat, until they- ve solved a technical issue Walk-in Date/ Time: 19th October 2020, 9.30 AM - 3.30 PM Venue Details- Bits N Bytes Soft Private Limited 3rd floor, Building No-113, Sector-44, Gurgaon, Haryana, India Contact Person - Rakesh Ray","location":"Gurgaon","experience":"1 - 5 Years"},{"date":"22, 23 - Oct - 2020","skills":"ASP .NET framework, SQL Server, and Design/ Architectural Patterns","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Brickwork Ratings India Private Limited, 3rd Floor, Raj Alkaa Park, 29/3 & 32/2, Bannerghatta Main Rd, Kalena Agrahara, Near Meenakshi Temple and Mall, Bengaluru, Karnataka - 560 076","phone":"Not Provided","profile":".Net Developer \nBrickwork Ratings India Private Limited","description":"Candidate must have proven experience of 6 to 8 years as a .NET Developer or Application Developer. Familiarity with the ASP .NET framework, SQL Server, and Design/ Architectural Patterns (e.g. Model-View-Controller (MVC)). Knowledge and experience in written code in C# and HTML5/ CSS3. Worked on SQL Server (Handling database, Stored Procedure, Function, View, etc.) Must have excellent troubleshooting and communication skills Attention to detail Roles and Responsibilities - Participate in requirements analysis Write clean, scalable code using .NET programming languages Test and deploy applications and systems Revise, update, and debug code Improve existing software Serve as an expert on applications and provide technical support Walk-in Date/ Time: 22nd - 23rd October , 10.30 AM - 4.30 PM Venue Details- Brickwork Ratings India Private Limited 3rd Floor, Raj Alkaa Park, 29/3 & 32/2, Bannerghatta Main Rd, Kalena Agrahara, Near Meenakshi Temple and Mall, Bengaluru, Karnataka - 560 076 Contact Person - Seemab","location":"Bangalore","experience":"6 - 8 Years"},{"date":"19, 20 - Oct - 2020","skills":"Front Desk, General Administration, Front Office Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Savitri Telecom Services, 101-110 A, Somdutt Chamber -1, 1st Floor, Bhikaji Cama Place, New Delhi - 110 066.","phone":"011-26700549","profile":"Admin/ Front Office Executive \nSavitri Telecom Services","description":"Candidate should have proven experience as front desk representative, agent or relevant position. Telephone Skills, Verbal Communication, Microsoft Office skills. Must be well versed with MS Office & Excel. Perceptive and disciplined Roles & Responsibilities- Keep front desk tidy and presentable with all necessary material (pens, forms, paper etc). Supervision on office maintenance, neat and clean office environment and ensuring that the conference is ready for meetings. Planning and coordinating administrative procedures and systems and devising ways to streamline processes. Answer all incoming calls and redirect them or keep messages. Take the Customers details and direct them to the available Sales Executive. Handle and prioritize all outgoing or incoming correspondence (e-mail, letters, packages etc.). Take up other duties as assigned (travel arrangements, schedules etc.) Interview Date: 19th October - 20th October Time: 11.00 AM - 1.00 PM Interview Venue- Savitri Telecom Services 101-110 A, Somdutt Chamber -1, 1st Floor, Bhikaji Cama Place, New Delhi - 110 066. Contact Person- Neha Sharma (011-26700549) Interested candidates may send their profile to hr@savitritelecom.com","location":"Delhi","experience":"0 - 2 Years"},{"date":"19 - Oct - 2020","skills":"HR Operations, Countif, Induction, Formulas, Conditional Formatting","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Visionet Systems Private Limited, Bommanahalli, AMR Tech Park, Ground Floor, # 23 & 24, Hosur Main Road, Next to Oxford College of Engineering, Bengaluru, Karnataka - 560 068.","phone":"8707253872","profile":"HR Executive \nVisionet Systems Private Limited","description":"Candidate must proficient in advanced Excel (Vlookup, Hlookup, Pivot table, Macros, Countif, Formule) Should have good knowledge in HR Operations. Should have excellent communication skills. Must be strong in Excel. Immediate joiners would e preferred. (NOTE: LOOKING FOR ONLY MALE CANDIDATES) Walk-in Date/ Time: 19th October 2020, 10.00 AM - 4.30 PM Venue Details- Visionet Systems Private Limited Bommanahalli, AMR Tech Park, Ground Floor, # 23 & 24, Hosur Main Road, Next to Oxford College of Engineering, Bengaluru, Karnataka - 560 068. Contact Person - Neelam (8707253872)","location":"Bangalore","experience":"1 - 3 Years"},{"date":"19 - Oct - 2020","skills":"Email Support, Non Voice Process, Domestic Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Hexaware Technologies Limited, Elysium central building, 2nd floor, Near Carmal Garden School, Sungam Bus Stop, Coimbatore \u0096 641 045.","phone":"9677117759","profile":"Non-Voice Process Executive \nHexaware Technologies Limited","description":"We are looking for freshers and experienced candidates for domestic non-voice process at Coimbatore. It's a pure day shift process with attractive salary package. Expectation: He/she should know to read, write and speak Hindi mandatory Must be good in written English communication. Note: Candidates who doesn't know Hindi, please do not walk in/apply If you meet the above criterias, please directly walk-in at the mentioned venue with your basic documents (10th, 12th and Semester mark sheets - original and photocopies and also your government id proofs). It's mandatory that you mention HR Pro as reference, else you woud not get a chance for F2F interview. Please do share this post to your friends who are in need of a job. You can also send in your resumes to placements.hrpro@gmail.com for jobs like this. Walk-in Date/ Time: 19th October 2020, 10.00 AM - 4.00 PM Venue Details- Hexaware Technologies Limited, Elysium central building, 2nd floor, Near Carmal Garden School, Sungam Bus Stop, Coimbatore \u0096 641 045. Lankmark\u0096 Opposite to Indian Bank Contact Person- Maya (9677117759)","location":"Coimbatore","experience":"0 - 3 Years"},{"date":"19 - Oct - 2020","skills":"IT Helpdesk, Technical Support, Telecalling, Software Support, Troubleshooting","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Bits N Bytes Soft Private Limited, 3rd floor, Building No-113, Sector-44, Gurgaon, Haryana","phone":"Not Provided","profile":"Technical Support Engineer \nBits N Bytes Soft Private Limited","description":"Candidate should be Any Graduate with 1 to 5 years of experience in IT Helpdesk, Technical Support, Telecalling, Software Support, Troubleshooting. Must have excellent communication skills Job Responsibility- Research and identify solutions to software and hardware issues. Ask customers targeted questions to quickly understand the root of the problem. Talk clients through phone, email or chat, until they- ve solved a technical issue Walk-in Date/ Time: 19th October 2020, 9.30 AM - 3.30 PM Venue Details- Bits N Bytes Soft Private Limited 3rd floor, Building No-113, Sector-44, Gurgaon, Haryana, India Contact Person - Rakesh Ray","location":"Gurgaon","experience":"1 - 5 Years"},{"date":"22, 23 - Oct - 2020","skills":"ASP .NET framework, SQL Server, and Design/ Architectural Patterns","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Brickwork Ratings India Private Limited, 3rd Floor, Raj Alkaa Park, 29/3 & 32/2, Bannerghatta Main Rd, Kalena Agrahara, Near Meenakshi Temple and Mall, Bengaluru, Karnataka - 560 076","phone":"Not Provided","profile":".Net Developer \nBrickwork Ratings India Private Limited","description":"Candidate must have proven experience of 6 to 8 years as a .NET Developer or Application Developer. Familiarity with the ASP .NET framework, SQL Server, and Design/ Architectural Patterns (e.g. Model-View-Controller (MVC)). Knowledge and experience in written code in C# and HTML5/ CSS3. Worked on SQL Server (Handling database, Stored Procedure, Function, View, etc.) Must have excellent troubleshooting and communication skills Attention to detail Roles and Responsibilities - Participate in requirements analysis Write clean, scalable code using .NET programming languages Test and deploy applications and systems Revise, update, and debug code Improve existing software Serve as an expert on applications and provide technical support Walk-in Date/ Time: 22nd - 23rd October , 10.30 AM - 4.30 PM Venue Details- Brickwork Ratings India Private Limited 3rd Floor, Raj Alkaa Park, 29/3 & 32/2, Bannerghatta Main Rd, Kalena Agrahara, Near Meenakshi Temple and Mall, Bengaluru, Karnataka - 560 076 Contact Person - Seemab","location":"Bangalore","experience":"6 - 8 Years"},{"date":"19, 20 - Oct - 2020","skills":"Front Desk, General Administration, Front Office Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Savitri Telecom Services, 101-110 A, Somdutt Chamber -1, 1st Floor, Bhikaji Cama Place, New Delhi - 110 066.","phone":"011-26700549","profile":"Admin/ Front Office Executive \nSavitri Telecom Services","description":"Candidate should have proven experience as front desk representative, agent or relevant position. Telephone Skills, Verbal Communication, Microsoft Office skills. Must be well versed with MS Office & Excel. Perceptive and disciplined Roles & Responsibilities- Keep front desk tidy and presentable with all necessary material (pens, forms, paper etc). Supervision on office maintenance, neat and clean office environment and ensuring that the conference is ready for meetings. Planning and coordinating administrative procedures and systems and devising ways to streamline processes. Answer all incoming calls and redirect them or keep messages. Take the Customers details and direct them to the available Sales Executive. Handle and prioritize all outgoing or incoming correspondence (e-mail, letters, packages etc.). Take up other duties as assigned (travel arrangements, schedules etc.) Interview Date: 19th October - 20th October Time: 11.00 AM - 1.00 PM Interview Venue- Savitri Telecom Services 101-110 A, Somdutt Chamber -1, 1st Floor, Bhikaji Cama Place, New Delhi - 110 066. Contact Person- Neha Sharma (011-26700549) Interested candidates may send their profile to hr@savitritelecom.com","location":"Delhi","experience":"0 - 2 Years"},{"date":"19 - Oct - 2020","skills":"HR Operations, Countif, Induction, Formulas, Conditional Formatting","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Visionet Systems Private Limited, Bommanahalli, AMR Tech Park, Ground Floor, # 23 & 24, Hosur Main Road, Next to Oxford College of Engineering, Bengaluru, Karnataka - 560 068.","phone":"8707253872","profile":"HR Executive \nVisionet Systems Private Limited","description":"Candidate must proficient in advanced Excel (Vlookup, Hlookup, Pivot table, Macros, Countif, Formule) Should have good knowledge in HR Operations. Should have excellent communication skills. Must be strong in Excel. Immediate joiners would e preferred. (NOTE: LOOKING FOR ONLY MALE CANDIDATES) Walk-in Date/ Time: 19th October 2020, 10.00 AM - 4.30 PM Venue Details- Visionet Systems Private Limited Bommanahalli, AMR Tech Park, Ground Floor, # 23 & 24, Hosur Main Road, Next to Oxford College of Engineering, Bengaluru, Karnataka - 560 068. Contact Person - Neelam (8707253872)","location":"Bangalore","experience":"1 - 3 Years"},{"date":"19 - Oct - 2020","skills":"Email Support, Non Voice Process, Domestic Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Hexaware Technologies Limited, Elysium central building, 2nd floor, Near Carmal Garden School, Sungam Bus Stop, Coimbatore \u0096 641 045.","phone":"9677117759","profile":"Non-Voice Process Executive \nHexaware Technologies Limited","description":"We are looking for freshers and experienced candidates for domestic non-voice process at Coimbatore. It's a pure day shift process with attractive salary package. Expectation: He/she should know to read, write and speak Hindi mandatory Must be good in written English communication. Note: Candidates who doesn't know Hindi, please do not walk in/apply If you meet the above criterias, please directly walk-in at the mentioned venue with your basic documents (10th, 12th and Semester mark sheets - original and photocopies and also your government id proofs). It's mandatory that you mention HR Pro as reference, else you woud not get a chance for F2F interview. Please do share this post to your friends who are in need of a job. You can also send in your resumes to placements.hrpro@gmail.com for jobs like this. Walk-in Date/ Time: 19th October 2020, 10.00 AM - 4.00 PM Venue Details- Hexaware Technologies Limited, Elysium central building, 2nd floor, Near Carmal Garden School, Sungam Bus Stop, Coimbatore \u0096 641 045. Lankmark\u0096 Opposite to Indian Bank Contact Person- Maya (9677117759)","location":"Coimbatore","experience":"0 - 3 Years"},{"date":"19 - Oct - 2020","skills":"IT Helpdesk, Technical Support, Telecalling, Software Support, Troubleshooting","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Bits N Bytes Soft Private Limited, 3rd floor, Building No-113, Sector-44, Gurgaon, Haryana","phone":"Not Provided","profile":"Technical Support Engineer \nBits N Bytes Soft Private Limited","description":"Candidate should be Any Graduate with 1 to 5 years of experience in IT Helpdesk, Technical Support, Telecalling, Software Support, Troubleshooting. Must have excellent communication skills Job Responsibility- Research and identify solutions to software and hardware issues. Ask customers targeted questions to quickly understand the root of the problem. Talk clients through phone, email or chat, until they- ve solved a technical issue Walk-in Date/ Time: 19th October 2020, 9.30 AM - 3.30 PM Venue Details- Bits N Bytes Soft Private Limited 3rd floor, Building No-113, Sector-44, Gurgaon, Haryana, India Contact Person - Rakesh Ray","location":"Gurgaon","experience":"1 - 5 Years"},{"date":"22, 23 - Oct - 2020","skills":"ASP .NET framework, SQL Server, and Design/ Architectural Patterns","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Brickwork Ratings India Private Limited, 3rd Floor, Raj Alkaa Park, 29/3 & 32/2, Bannerghatta Main Rd, Kalena Agrahara, Near Meenakshi Temple and Mall, Bengaluru, Karnataka - 560 076","phone":"Not Provided","profile":".Net Developer \nBrickwork Ratings India Private Limited","description":"Candidate must have proven experience of 6 to 8 years as a .NET Developer or Application Developer. Familiarity with the ASP .NET framework, SQL Server, and Design/ Architectural Patterns (e.g. Model-View-Controller (MVC)). Knowledge and experience in written code in C# and HTML5/ CSS3. Worked on SQL Server (Handling database, Stored Procedure, Function, View, etc.) Must have excellent troubleshooting and communication skills Attention to detail Roles and Responsibilities - Participate in requirements analysis Write clean, scalable code using .NET programming languages Test and deploy applications and systems Revise, update, and debug code Improve existing software Serve as an expert on applications and provide technical support Walk-in Date/ Time: 22nd - 23rd October , 10.30 AM - 4.30 PM Venue Details- Brickwork Ratings India Private Limited 3rd Floor, Raj Alkaa Park, 29/3 & 32/2, Bannerghatta Main Rd, Kalena Agrahara, Near Meenakshi Temple and Mall, Bengaluru, Karnataka - 560 076 Contact Person - Seemab","location":"Bangalore","experience":"6 - 8 Years"},{"date":"19, 20 - Oct - 2020","skills":"Front Desk, General Administration, Front Office Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Savitri Telecom Services, 101-110 A, Somdutt Chamber -1, 1st Floor, Bhikaji Cama Place, New Delhi - 110 066.","phone":"011-26700549","profile":"Admin/ Front Office Executive \nSavitri Telecom Services","description":"Candidate should have proven experience as front desk representative, agent or relevant position. Telephone Skills, Verbal Communication, Microsoft Office skills. Must be well versed with MS Office & Excel. Perceptive and disciplined Roles & Responsibilities- Keep front desk tidy and presentable with all necessary material (pens, forms, paper etc). Supervision on office maintenance, neat and clean office environment and ensuring that the conference is ready for meetings. Planning and coordinating administrative procedures and systems and devising ways to streamline processes. Answer all incoming calls and redirect them or keep messages. Take the Customers details and direct them to the available Sales Executive. Handle and prioritize all outgoing or incoming correspondence (e-mail, letters, packages etc.). Take up other duties as assigned (travel arrangements, schedules etc.) Interview Date: 19th October - 20th October Time: 11.00 AM - 1.00 PM Interview Venue- Savitri Telecom Services 101-110 A, Somdutt Chamber -1, 1st Floor, Bhikaji Cama Place, New Delhi - 110 066. Contact Person- Neha Sharma (011-26700549) Interested candidates may send their profile to hr@savitritelecom.com","location":"Delhi","experience":"0 - 2 Years"},{"date":"19 - Oct - 2020","skills":"HR Operations, Countif, Induction, Formulas, Conditional Formatting","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Visionet Systems Private Limited, Bommanahalli, AMR Tech Park, Ground Floor, # 23 & 24, Hosur Main Road, Next to Oxford College of Engineering, Bengaluru, Karnataka - 560 068.","phone":"8707253872","profile":"HR Executive \nVisionet Systems Private Limited","description":"Candidate must proficient in advanced Excel (Vlookup, Hlookup, Pivot table, Macros, Countif, Formule) Should have good knowledge in HR Operations. Should have excellent communication skills. Must be strong in Excel. Immediate joiners would e preferred. (NOTE: LOOKING FOR ONLY MALE CANDIDATES) Walk-in Date/ Time: 19th October 2020, 10.00 AM - 4.30 PM Venue Details- Visionet Systems Private Limited Bommanahalli, AMR Tech Park, Ground Floor, # 23 & 24, Hosur Main Road, Next to Oxford College of Engineering, Bengaluru, Karnataka - 560 068. Contact Person - Neelam (8707253872)","location":"Bangalore","experience":"1 - 3 Years"},{"date":"19 - Oct - 2020","skills":"Email Support, Non Voice Process, Domestic Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Hexaware Technologies Limited, Elysium central building, 2nd floor, Near Carmal Garden School, Sungam Bus Stop, Coimbatore \u0096 641 045.","phone":"9677117759","profile":"Non-Voice Process Executive \nHexaware Technologies Limited","description":"We are looking for freshers and experienced candidates for domestic non-voice process at Coimbatore. It's a pure day shift process with attractive salary package. Expectation: He/she should know to read, write and speak Hindi mandatory Must be good in written English communication. Note: Candidates who doesn't know Hindi, please do not walk in/apply If you meet the above criterias, please directly walk-in at the mentioned venue with your basic documents (10th, 12th and Semester mark sheets - original and photocopies and also your government id proofs). It's mandatory that you mention HR Pro as reference, else you woud not get a chance for F2F interview. Please do share this post to your friends who are in need of a job. You can also send in your resumes to placements.hrpro@gmail.com for jobs like this. Walk-in Date/ Time: 19th October 2020, 10.00 AM - 4.00 PM Venue Details- Hexaware Technologies Limited, Elysium central building, 2nd floor, Near Carmal Garden School, Sungam Bus Stop, Coimbatore \u0096 641 045. Lankmark\u0096 Opposite to Indian Bank Contact Person- Maya (9677117759)","location":"Coimbatore","experience":"0 - 3 Years"},{"date":"19 - Oct - 2020","skills":"IT Helpdesk, Technical Support, Telecalling, Software Support, Troubleshooting","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Bits N Bytes Soft Private Limited, 3rd floor, Building No-113, Sector-44, Gurgaon, Haryana","phone":"Not Provided","profile":"Technical Support Engineer \nBits N Bytes Soft Private Limited","description":"Candidate should be Any Graduate with 1 to 5 years of experience in IT Helpdesk, Technical Support, Telecalling, Software Support, Troubleshooting. Must have excellent communication skills Job Responsibility- Research and identify solutions to software and hardware issues. Ask customers targeted questions to quickly understand the root of the problem. Talk clients through phone, email or chat, until they- ve solved a technical issue Walk-in Date/ Time: 19th October 2020, 9.30 AM - 3.30 PM Venue Details- Bits N Bytes Soft Private Limited 3rd floor, Building No-113, Sector-44, Gurgaon, Haryana, India Contact Person - Rakesh Ray","location":"Gurgaon","experience":"1 - 5 Years"}]}