{"Walkins":[{"date":"19 - Oct - 2019","skills":"Manual Testing, Test Case Design, Test Planning, Test Case Execution, Defect Reporting","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"QualityKiosk Technologies Private Limited, A Wing - 419, Rupa Solitaire, Millennium Business Park, Mahape, Navi Mumbai - 400 709","phone":"Not Provided","profile":"Manual Tester/ Fresher \nQualityKiosk Technologies Private Limited","description":"Mandatory : BE/ B.Tech/ MCA/ Msc/ Bsc/ BCA with Throughout academics 60% ONLY CAN APPLY. Candidates from western line and in central till Thane only (Eg no kalyan no dombivali). Should have completed or pursuing course in Manual Testing & Flexible to travel anywhere in Mumbai Job Location: Base Location Navi Mumbai (Client location can be anywhere in central or western or harbour line or Onsite or within India) B.E /B.Tech /MCA/ B.Sc/ BCA/ M.Sc/ M.Tech- Passing Year- 2017, 2018, 2019 Percentage Criteria-Mandatory Throughout academics 60% (SSC,HSC/ Diploma, Graduation) Java knowledge added advantage Desired Skills: Manual Testing Should be willing to work in Manual Testing Open to travel anywhere in Mumbai (Western, Central, Navi Mumbai) Educational gap should not be more than 1 year Should be OK for 2 years bond with the company. Candidates are requested to be prepared on manual testing before coming for the interview Good Communication Skills Good Analytical approach & Logical reasoning skills Interview Process will be as below: 1st Level - Written Test 2nd Level- 2 Technical round 3rd Level - HR discussion Interview Date: 19th October 2019(Saturday) Time: 11:00 A.M till 3:00 P.M Interview Venue: QualityKiosk Technologies Private Limited A Wing - 419, Rupa Solitaire, Millennium Business Park, Mahape, Navi Mumbai - 400 709 (Directions: next to Mastek, take a right from the main entrance) Lift Number 24 & 25 Contact Person- Ms. Mausimi Sardar","location":"Mumbai","experience":"0 - 1 Years"},{"date":"18, 19 - Oct - 2019","skills":"Automation testing, Selenium, create test data for functional and non-functional testing.","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Infosys BPM Limited, #785, Ground Floor Axis Sai Jyoti 15th Cross 100 Feet Road Sarakki, 1st Phase J P Nagar, Bangalore. Landmark - Sindhuri Convention Hall.","phone":"Not Specified","profile":"Automation Test Engineer \nInfosys BPM Limited","description":"Infosys BPM Limited, is looking for Automation testing Engineer with Selenium only. Selenium with HP ALM/ Quality center is mandatory Job Responsibility- Update existing tests/ Create new tests in the automation test suite (using Selenium). Write test planning documentation from requirements specifications. Review all testing documents and other test-related documentation. Assist in implementation of the overall testing strategy. Ensure that quality standards are adhered to during the development of products. Add new tests and expand the automation test suite. Collect and create test data for functional and non-functional testing. Run functional and non-functional tests. Liaise with developers during the Software Development Life Cycle (SDLC). Provide estimates for test activities. Walk-in Date/ Time: 18th - 19th October , 10 AM onwards Interview Venue: Infosys BPM Limited #785, Ground Floor Axis Sai Jyoti 15th Cross 100 Feet Road Sarakki, 1st Phase J P Nagar, Bangalore. Landmark - Sindhuri Convention Hall.","location":"Bangalore","experience":"1 - 5 Years"},{"date":"19 - Oct - 2019","skills":"Automation & Manual Testing, ERP Functional Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"3i Infotech Limited, 3rd Floor, Prince Infocity 2, Kandanchavadi, Chennai - 96","phone":"044-71622577","profile":"Manual Testing Engineer \n3i Infotech Limited","description":"Work Experience: 3- 7 Years Notice Period: 45 Days Max Salary: Indursty Standard Primary Skill Set : Manual Testing with ERP (Mandatory) Automation & Manual Testing or only Manual Testing ERP Functional Testing / Implementation experience Job Responsibility: 1. Customer Requirement analysis 2. Test environment preparation 3. Test case preparation 4. Test Execution 5. Release activity 6. Review & EOD update 7. Metrics collection 8. Walkthrough to Customer to get the acceptance 9. Process improvement 10. Automation Interview Date : 19th October ' 2019 (Saturday) Time : 10.30 AM to 4.00 PM Interview Venue: 3i Infotech Limited 3rd Floor, Prince Infocity 2, Kandanchavadi, Chennai - 96 Contact - Vivek - HR (044-71622577)","location":"Chennai","experience":"3 - 7 Years"},{"date":"19 - Oct - 2019","skills":"DWH/ ETL testing, Databases like Oracle, SQL Server etc.","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Xavient Digital - Powered by TELUS International, Plot No. 54, Noida Special Economic Zone (N.S.E.Z) Phase II, Noida","phone":"Not Provided","profile":"QA/ Testing Engineer \nXavient Digital - Powered by TELUS International","description":"Xavient Digital - powered by TELUS International is organizing a Walk-In Drive on coming Saturday (19th October/ 2019) for DWH Testing Engineer. We invite applicants to come and participate in the event who feel are the best fit for below role Work Experience: 2 - 6 Years Joining Time: Immediate - 45 days Skills Required: Should have hands on experience with DWH/ ETL testing Strong holdover in various databases like Oracle, SQL Server etc Proficient with all the proof concepts for DWH like Fact table, dimension table Exposure on ETL Testing tools preferably on Informatica Identifying working of Joins, Sub queries, CTEs and complex query writing skills Execute experience in creating Stored Procedures, Functions, Tables, Cursors, Hash tables and handling large data types Walk-in Date: 19th October 2019 Timings: 9:30 AM to 2:00 PM. Interview Venue: Xavient Digital - Powered by TELUS International Plot No. 54, Noida Special Economic Zone (N.S.E.Z) Phase II, Noida. Note: Candidates who can join early will be preferred. Please carry a hard copy of your resume for the Interview","location":"Noida","experience":"2 - 6 Years"},{"date":"19 - Oct - 2019","skills":"Mainframe Testing, CICS, COBOL, JCL, DB2, Database testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Capgemini Technology Services India Limited, Plot No. 1, IT Park, 115/32 & 35 Nanakramguda, Gachibowli, Hyderabad - 500 032","phone":"Not Provided","profile":"Mainframe Test Analyst \nCapgemini Technology Services India Limited","description":"Candidate should have 2 to 6 years of experience in Mainframe Testing basically in CICS, COBOL, JCL, DB2 Database testing. Should have excellent analytical and problem solving skills. Excellent collaboration/ teamwork skills. Must have excellent oral and written communications skills Primary Skills: Mainframe Testing basically in CICS, COBOL, JCL, DB2 Interview Date: 19th October 2019 (Saturday) Timing: 9:00 AM to 3.00 PM Interview Venue: Capgemini Technology Services India Limited Plot No. 1, IT Park, 115/32 & 35 Nanakramguda, Gachibowli, Hyderabad - 500 032. Please carry a Government Approved Photo ID Original & 2 Passport size photograph, without these you will not be allowed to attend the interview.","location":"Hyderabad","experience":"2 - 6 Years"},{"date":"19 - Oct - 2019","skills":"Software Testing, Test Automation (Any Tool)","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Zuci Software Solutions Private Limited, No. 11, Ground Floor, Rattha Tek Towers, OMR, Thoraipakkam, Chennai - 600 097.","phone":"Not Provided","profile":"Software Testing Engineer \nZuci Software Solutions Private Limited","description":"Educational Qualification: BE/ B.Tech/ MCA Required Experience: 1 - 3 Years Skills: Test Automation (Any Tool) Notice Period: 15 - 20 Day Walk-in Date/ Time: 19th October 2019, 10 AM onwards Interview Venue: Zuci Software Solutions Private Limited No. 11, Ground Floor, Rattha Tek Towers, OMR, Thoraipakkam, Chennai - 600 097. Landmark: Opposite to Hotel Sangeetha, OMR Contact Person- Punitha Nagarajan","location":"Chennai","experience":"1 - 3 Years"},{"date":"18 - Oct - 2019","skills":"Software Testing, Manual Testing/ Automation testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Sarla Advantech Private Limited, 1019, 10th Floor, Rupa Solitaire Sector 1, Millenium Business Park, Navi Mumbai, Maharashtra - 400 710","phone":"Not Provided","profile":"Software Tester \nSarla Advantech Private Limited","description":"Candidate should have minimum 2 years of experience in Manual + Automation testing, Programming. Hands on experience on Automation testing tools with experience in creating and maintaining frameworks. Basic knowledge of C# or other programming language. Knowledge of Object Oriented Programming is reequired Candidate who can join immediately will be preferred Walk in Date: 18th October 2019 Time: 3:00 P.M to 4:00 P.M Interview Venue: Sarla Advantech Private Limited 1019, 10th Floor, Rupa Solitaire Sector 1, Millenium Business Park, Navi Mumbai, Maharashtra - 400 710. NOTE- You are requested to take a central Lift of the complex to reach our office Reception","location":"Mumbai","experience":"2 - 4 Years"},{"date":"19 - Oct - 2019","skills":"Java, Spring, Hibernate, Web Services","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Trantor Software Private Limited, 18S G-9, Rajiv Gandhi Chd. Technology Park, Chandigarh","phone":"Not Provided","profile":"Java Developers \nTrantor Software Private Limited","description":"Work Experience: 3 to 5 Years Required Skills: Java, Spring, Hibernate, Web Services Good to Have: Liferay and Jenkins Walk-in Date/ Time: 19th October 2019, 10 AM onwards Interview Venue: Trantor Software Private Limited 18S G-9, Rajiv Gandhi Technology Park, Chandigarh","location":"Chandigarh","experience":"3 - 5 Years"},{"date":"19 - Oct - 2019","skills":"Java, J2EE, Java Script, and SQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Hurits Consulting Private Limited, No. 376/A, 1st Floor, Obeya Verve. Opposite to KLAY Play School, 5th Main, Near Rajesh Jewellery, Sector 6, HSR Layout, Bangalore - 560 102","phone":"9380322067","profile":"Java/ Backend Developer \nHurits Consulting Private Limited","description":"Candidate should have 3 to 8 years of experience in Java, J2EE, Java Script, and SQL. Design and implement extremely high-volume, fault-tolerant, scalable web-based systems solutions. Work with system analysts, engineers, programmers and others to design the online Marketplace Walk-in Date/ Time: 19th October 2019, 9 AM onwards Interview Venue: Hurits Consulting Private Limited No. 376/A, 1st Floor, Obeya Verve, Opposite to KLAY Play School, 5th Main, Near Rajesh Jewellery, Sector 6, HSR Layout, Bangalore - 560 102 Contact - HR @ 9380322067","location":"Bangalore","experience":"3 - 8 Years"},{"date":"19 - Oct - 2019","skills":"Java, J2EE, JSP, Servlet, JavaScript, AJAX, Unix/ Linux Shell Scripting, SQL, DB2, XML, JSON, DHTML, CSS","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Whitefield, Bangalore. If, interested please mail your resume at richa@techstosuit.com","phone":"7838316003","profile":"Full Stack/ Java Developer \nTechs to Suit Inc","description":"Work Experience: 4 to 6 Years Requirement Name- Java Fullstack Notice 45 days max Interview: Face to Face 19th October Client- Capgemini Person must have at least 4+ years of hands-on web application development utilizing the J2EE Java framework and Angular 2/4/5/6, Should good knowledge/ experience of Java, J2EE, JSP, Servlet, JavaScript, AJAX, Unix/ Linux Shell Scripting, SQL, DB2, XML, JSON, DHTML, CSS. Websphere, RESTful WebServices, ExtJS 5.x, Angular2/4/5/6, Dojo Toolkit, jQuery If you are interested mail at richa@techstosuit.com Or contact on 7838316003","location":"Bangalore","experience":"4 - 6 Years"},{"date":"19 - Sept - 2019","skills":"Java, J2EE, Oops, Java Script","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"PreludeSys India Limited, Old No. D-12, New No. 3/A3, 1st Cross Street, Siruseri SIPCOT IT Park, Chennai - 603 103.","phone":"Not Provided","profile":"Java Developers \nPreludeSys India Limited","description":"Technical Skills Required: Java, J2EE, Oops, Java Script Candidate Should have good Communication skills. Work Experience : 1 to 3 years Job Responsibility:- Understanding system Architecture, Analytical Skills. Analyzing and understanding business requirement Casual analysis of issues/ problems Visualizing the big picture Ability to see problem from different perspectives Root cause analysis on issues and nail down the reason of issue Walk-in Date: 19th October 2019 Time - 10.30 AM to 4 PM Only Interview Venue: PreludeSys India Limited Old No. D-12, New No. 3/A3, 1st Cross Street, Siruseri SIPCOT IT Park, Chennai - 603 103. Contact Person - Vijay R (HR Team)","location":"Chennai","experience":"1 - 3 Years"},{"date":"16, 17, 18, 19 - Oct - 2019","skills":"Java, J2EE, SQL, HTML, CSS, JavaScript, AngularJS, Spring, SpringBoot and Hibernate","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Atria Convergence Technologies Private Limited, ACT Golden Heights, 1st Floor,59th C Cross, 4th M Block, Near Sujatha,Rajaji Nagar, Bengaluru - 560 010","phone":"9513206011","profile":"Java Developer \nAtria Convergence Technologies Pvt. Limited","description":"We are looking for an Server Side Java developer responsible for the development and maintenance of applications. Your primary focus will be development of applications and their integration with other services along with constant eye of improvements through customer/user feedback. Candidate should have 1+ years of development experience Proficient with Linux, Java, J2EE, SQL Familiarity with HTML, CSS, JavaScript and AngularJS Experience with frameworks such as Spring, SpringBoot and Hibernate Experience with Eclipse IDE Familiarity with RESTful and SOAP APIs Knowledge of other web technologies and UI/UX standards Knack for benchmarking and optimization Proficient understanding of code versioning tools (such as Git, Mercurial or SVN) Experience with Agile and Waterfall SDLC models Walk-in Date/ Time: 16th - 19th October, 10 AM onwards Interview Venue: Atria Convergence Technologies Private Limited ACT Golden Heights, 1st Floor,59th C Cross, 4th M Block, Near Sujatha,Rajaji Nagar, Bengaluru - 560 010 Contact Person- Ranjit Joshi (9513206011)","location":"Bangalore","experience":"1 - 3 Years"},{"date":"16, 17, 18, 19, 21, 22, 23, 24, 25, 26 - Oct - 2019","skills":"Java EE (JSP, Servlets, JPA), J2EE, JVM internals, AJAX","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Marolix Technology Solutions Private Limited, 1st Floor, Three Cube Towers, Beside Watermark Building, Kondapur, Hyderabad","phone":"9154087468","profile":"Java/ Full Stack Developer \nMarolix Technology Solutions Pvt. Limited","description":"Candidate should have 2 years' experience in Java platform development. Must have practical demonstrated experience in design and development of applications with major web development frameworks, including Java EE (JSP, Servlets, JPA), J2EE, JVM internals, AJAX; Must have experience designing and implementing with Struts or Spring or other MVC framework. Hands on experience on Jasper reports development or Similar to Jasper Reports. Reasonably good at UI with fundamental exposure to the technologies like HTML5, JSP, Java Script, JQUERY, CSS, Bootstrap, etc. Must have hands on experience on advanced JS Frameworks like Angular 2. Strong web service integration skills (SOAP, WSDL protocols, REST, Axis, and UDDI) Walk-in Date/ Time: 16th - 31st October 2019, 9 AM onwards Interview Venue: Marolix Technology Solutions Private Limited 1st Floor, Three Cube Towers, Beside Watermark Building, Kondapur, Hyderabad Contact No. 9154087468","location":"Hyderabad","experience":"2 - 4 Years"},{"date":"18 - Oct - 2019","skills":"Java, J2ee, Spring Security, Spring MVC, Spring Data and Spring Mobile, Spring Boot","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Tata Consultancy Services Limited, SP - S3 Tikona, Plot No. 2 & 3, MIDC-SEZ, Rajiv Gandhi Infotech Park, Hinjewadi Phase III, Pune - 411 057","phone":"8208652766","profile":"Java Developers \nTata Consultancy Services Limited","description":"Candidate should have 3 to 7 years experience with Spring Framework including Spring Security, Spring MVC, Spring Data and Spring Mobile, Spring Boot. Experience with Tomcat and web containers. Experience with IDE like Eclipse as well as version control tools like Git and Sourcetree Familiarity/ Experience with bash shell and app deployment to Linux servers - Application servers such as Websphere and Tomcat. Familiarity with Internet security and Single-Sign On technologies like JWT, SAML and OAuth Roles & Responsibilities: XML technologies including DTD/XSD, XPATH, and Object XML mapping. - Unit testing (Junit), Continuous integration, and Agile methodologies. Knowledge of and experience with working on common design patterns and industry standards. Strong communication, analysis, and problem solving skills. Experience in creation of design documents on the task assigned. Quick to learn, self-motivated, and enthusiastic. Work well within a team environment and with minimal supervision. Comfortable working with clearly defined project plans and contributing estimates to the planning process. Able to meet and deliver on deadlines and work well under pressure. Unix command line and basic scripting. Experience with version control systems, preferably SVN. Experience in MAVEN. Versed in different development methodologies (Iterative, Agile, Scrum etc.) Interview Date: 18th October 2019) Time: 10:00 am to 1:00 pm Venue: Tata Consultancy Services Limited SP - S3 Tikona, Plot No. 2 & 3, MIDC-SEZ, Rajiv Gandhi Infotech Park, Hinjewadi Phase III, Pune - 411 057 (Maharashtra, India) Mandatory Registration: EPCN number is mandatory for eligibility of the interview. Follow the below steps to register and mention the EPCN number on your resume. Step 1: Go to site https:// careers.tcs.com Step 2: Select India geography & next click on Experienced Professionals tab Step 3: Click on Login and go to link Register with us (For New Users) and create your profile by filling in the details. (Please select area of interest as BPO) Step 4: You will get the EPCN number & Password to your personal e-mail ID The direct link is : https://ibegin.tcs.com/iBegin/ register In case you have any issue creating the EPCN number, you can come for the interview and contact Vinayak on 8208652766 DOCUMENTS REQUIRED - Please carry resume and ID proof at the time of interview.","location":"Pune","experience":"3 - 7 Years"},{"date":"17, 18 - Oct - 2019","skills":"General Administration, Front Office Activities/ Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Kotak Mahindra Life Insurance Company Limited, #337, 1st floor, 27th Main Road, HSR layout Sector 2, Bangalore 560102, Karnataka","phone":"022-66057050","profile":"Administration Executive \nKotak Mahindra Life Insurance Company Limited","description":"Candidate be a graduate with min 6 month work-experience. Age should not be more than 28 Knowledge of Admin role is a must Aware of Local language must Preferences -(Only Female Candidates can apply) Candidates with experience in the below profiles will not be suitable - (Tele calling or customer care profiles (Insurance, Credit card, Holiday Selling etc), Sales background, Account Assistant/Purchase Assistant, Secretaries/Receptionists, Telephone Operators and Admin profiles from educational institutions.) Walk-in Date: 17th - 18th October 2019 Interview Time : 11:00 AM - 3:00 PM Interview Address: Kotak Mahindra Life Insurance Company Limited #337, 1st floor, 27th Main Road, HSR layout Sector 2, Bangalore 560102, Karnataka Interviewer Details: Priyanka Email ID - kli.jayshree-bhati@kotak.com Contact Number - 022-66057050","location":"Bangalore","experience":"0 - 1 Years"},{"date":"17, 18 - Oct - 2019","skills":"General Administration, Front Office Activities/ Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Kotak Mahindra Life Insurance Company Limited, Neelima Nirupama, 4th Floor, Plot No- 55, Old no -22A, Vijay Raghava Road, T Nagar, Near Andhra Club, Chennai - 600 017","phone":"Not Provided","profile":"Administration Executive \nKotak Mahindra Life Insurance Company Limited","description":"Candidate be a graduate with min 6 month work-experience. Age should not be more than 28 Knowledge of Admin role is a must Aware of Local language must Preferences -(Only Female Candidates can apply) Candidates with experience in the below profiles will not be suitable - (Tele calling or customer care profiles (Insurance, Credit card, Holiday Selling etc), Sales background, Account Assistant/Purchase Assistant, Secretaries/Receptionists, Telephone Operators and Admin profiles from educational institutions.) Walk-in Date: 17th - 18th October 2019 Interview Time : 11:00 AM - 3:00 PM Interview Address: Kotak Mahindra Life Insurance Company Limited Neelima Nirupama, 4th Floor, Plot No- 55, Old no -22A, Vijay Raghava Road, T Nagar, Near Andhra Club, Chennai - 600 017 Interviewer Details: Nandhini K Email ID - kli.jayshree-bhati@kotak.com Contact Number - 022-66057050","location":"Chennai","experience":"0 - 1 Years"},{"date":"16, 17, 18, 19 - Oct - 2019","skills":"HR/ Recritment, Talent Management, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"TELEPERFORMANCE INDIA 398, UDYOG VIHAR, PHASE -III, GURGAON, Haryana - 122 016","phone":"8008804661","profile":"HR Executive \nElico Healthcare Services Limited","description":"We have an urgent Requirement in Human Resources for both Healthcare and Manufacturing Departments. Designation: HR Executive Qualification: MBA (HR) Regular Experience: 1 to 2 Years Location : Hyderabad Exclusively looking for Male candidates and Immediate Joiners. Skill Set : Should be proactive Should have good communication skills. Should have good knowledge in Recruitment Process Experience in End to End Recruitment. Should have good knowledge on Job portals Conducting Mass Drives. Bulk Hiring Campus Drives Experience in Healthcare RCM and Manufacturing firm will be an added advantage to your profile. Walk-in Date: 16th - 19th October 2019 Timings : 10 AM to 5:30 PM Interview Venue: Elico Healthcare Services Limited C-56, A.P.I.E, Gate No. 6, Sanathnagar, Hyderabad - 18 Contact Person :Prasanna / Chaitanya Contact No: 8008804661/ 8978447766 Interested candidates, Please Walk In directly for the interview or forward your resume's to prasannam@elicohcs.com and chaitanyaka@elicohcs.com with the following details. EXP: CTC: ETC: NP: Reason for Job Change: *Please carry your Current Companies Offer Letter and Last 3 months Payslips with you while coming for the Interview","location":"Hyderabad","experience":"1 - 2 Years"},{"date":"18 - Oct - 2019","skills":"HR/ Recruitment, Talent Acquisition, Screening, etc","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"RR Donnelley India Outsource Pvt. Limited. 2nd Floor, Acropolis, Radhakrishnan Salai, Mylapore, Chennai","phone":"Not Provided","profile":"HR Executive/ Recruiter \nRR Donnelley India Outsource Pvt. Limited","description":"Essential Qualifications: Graduate in any discipline Work Experience: 2 to 4 year experience Experience in volume hiring from ITES background Should have handled the entire recruitment process. Walk-in Date: 18th October 2019 Time - 11 am to 1 pm Venue: RR Donnelley India Outsource Pvt. Limited 2nd Floor, Acropolis, Radhakrishnan Salai, Mylapore, Chennai Contact Person: Karthik","location":"Chennai","experience":"2 - 4 Years"},{"date":"19 - Oct - 2019","skills":"Core Java/ J2EE, JDBC, SQL and related tools","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"TurningPoint Software Solutions Private Limited, No.31, Ground Floor, TBR Tower, 1st Cross, New Mission Road J.C.Road, Bangalore - 560027","phone":"973933661","profile":"Java Developers \nTurningPoint Global Solutions Pvt. Limited","description":"Candidate should have Bachelors degree or its equivalent in computer science, information technology, engineering, or related technical field with 1.5 to 3 years of overall programming work experience, or any equivalent combination of education and experience. One year of Core Java/ J2EE experience at the minimum. Good understanding of JDBC, SQL and related tools. Good understanding of database design and structures. Ability to understand and construct complex database designs is required. Walk-in Date/ Time: 19th October 2019, 9 AM onwards Interview Venue: TurningPoint Software Solutions Private Limited No.31, Ground Floor, TBR Tower, 1st Cross, New Mission Road J.C.Road, Bangalore - 560027 Contact Person- Deepika M (973933661)","location":"Bangalore","experience":"1 - 3 Years"},{"date":"14, 15, 16 - Oct - 2019","skills":"Recruitment team handling, Bulk hiring, End to end Recruitment, Employee Retention & Engagement","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Dealmoney Securities Private Limited, Plot No. 356/357, Wagle Industrial Estate, Road No. 26, Near Wagle Bus Depot, Thane (West) Maharashatra - 400 604","phone":"7678009271","profile":"Recruitment Manager \nDealmoney Securities Private Limited","description":"Candidate should have 3 to 5 years of experience in Recruitment team handling, Bulk hiring, End to end Recruitment, Employee Retention, Employee Engagement. Job Responsibility- Handling end to end recruitments, selection, induction & orientation programme and joining Handling employee relations and employee engagement activities. Handling Recruitment team Walk-in Date/ Time: 12th - 16th October , 12 PM onwards Interview Venue: Dealmoney Securities Private Limited Plot No. 356/357, Wagle Industrial Estate, Road No. 26, Near Wagle Bus Depot, Thane (West) Maharashatra - 400604","location":"Mumbai","experience":"3 - 5 Years"},{"date":"14, 15, 16 - Oct - 2019","skills":"Customer Care, Chat Process, Customer Support","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"[24]7 Customer Private Limited, Ground Floor NSL Arena Town Centre, Behind Cricket Stadium, Ramanthapur Road, Uppal, Hyderabad - 500 039","phone":"Not Provided","profile":"Chat Process Executive (Non Voice) \n[24]7 Customer Private Limited","description":"Eligibility Criteria: Undergraduate/ Graduate & Postgraduate Freshers are eligible to apply. Skills Required: Good Verbal and Written Communication skills. Good logical reasoning & analytical skills. Able to interact with customers via chat, should be able to answer servicing questions. Able to work in rotational night shifts (US). Benefits: Free Transport facility both ways (Home Pick and Home Drop) Interview Rounds: Personal Introduction Round Online Test Operations Round Walk-in Date/ Time: 14th - 16th October 2019, 10 AM onwards Interview Venue: [24]7 Customer Private Limited Ground Floor NSL Arena Town Centre, Behind Cricket Stadium, Ramanthapur Road, Uppal, Hyderabad - 500 039 NOTE: Kindly Carry copy of your Resume and ID proof Xerox Copy. Mention 'Sneha 010' on the top of the resume.","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"15 - Oct - 2019","skills":".Net, MVC ASP .NET C# 4.0, MS SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Aforeserve .com Limited, B-21, Sector - 8, Noida. Landmark: Near Swani Furniture.","phone":"7303898936","profile":"Software Developer (.Net) \nAforeserve .com Limited","description":"We have an urgent opening for 'Software Developer' Profile with our company Aforeserve.com Limited Educational Qualification: B.Tech/ B.E or MCA Work Experience: 2-5 Years Only for Male Candidates Must have proven experience as a .NET Developer or Application Developer Familiarity with the ASP .NET framework, SQL Server and design/architectural patterns (e.g. Model-View-Controller (MVC)) Knowledge of at least one of the .NET languages (e.g. C#, Visual Basic .NET) and HTML5/ CSS3 Familiarity with architecture styles/APIs (REST, RPC) Understanding of Agile methodologies Excellent troubleshooting and communication skills Must have ability to develop large scale web/ database applications Ability to communicate clearly with business users and project manager Ability to innovate and provide functional applications with intuitive interfaces Excellent knowledge of SQL Knowledge of Angular Js is plus point MVC ASP .NET C# 4.0, MS SQL Server 2005/2008 WCF Services Jquery / JavaScript Entity Framework Understanding of HTML, JS, and CSS Walk-in Date/ Time: 14th - 15th October 2019, 10 AM onwards Interview Venue: Aforeserve .com Limited B-21, Sector - 8, Noida. Landmark: Near Swani Furniture. Nearest Metro - Sector - 15 Noida Contacat Person: Gaurav singh Contact no. 7303898936","location":"Noida","experience":"2 - 5 Years"},{"date":"15, 16, 17, 18 - Oct - 2019","skills":".Net, C#, jQuery, ASP .Net, Javascript and MySQL","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Kotak Mahindra OM Life Insurance Limited, C-31, Community Centre, 1st and 2nd Floor, Near Janak Cinema, Janakpuri, New Delhi- 110058.","phone":"9582433492","profile":"Senior .Net Developer \nInficare Software Technologies Pvt. Limited","description":"Candidate should be BE/ B.Tech/ BCA/ MCA or MSc (Computers) with 3 to 8 years of experience in Software Development using .Net, C#, jQuery, ASP .Net, Javascript and MySQL Walk-in Date: 14th - 18th October 2019 Time - 11 am to 6 pm Interview Venue: Inficare Software Technologies Pvt. Limited 2nd floor, D-92 ,Sector 2 ,Noida (Near Noida Sector 16 Metro Station)","location":"Noida","experience":"3 - 8 Years"},{"date":"17 - Oct - 2019","skills":"C#, ASP .Net, ADO.Net, XML, SOA, Web Services, Ajax, JQuery, MVC & .NET frameworks","qualification":"B.E./B.Tech, MCA/PGDCA","address":"InterGlobe Technology Quotient Pvt. Limited, 6th Floor, Tower 6, Candor Tech Space Tikri, Sector 48, Gurgaon - 122 018 Haryana","phone":"0124-4284852","profile":".Net Developer \nInterGlobe Technology Quotient Pvt. Limited","description":"Candidate should be B.Tech/ MCA with strong experience of C#, ASP .Net, ADO.Net, XML, SOA, Web Services, Ajax, JQuery, MVC & .NET frameworks (4.0 and above). Experience in optimizing SQL scripts, stored procedures, SQL Reporting Services and SQL tools such as Profiler etc. Peer and pair with development teams as extreme programmers for code coverage, code reviews and unit testing. Strong debugging, problem resolution & application deployment skills. Interested candidates are invited for Walk-In Interview on Thursday 17th October between 10.30 am to 3 pm. Interview Venue: InterGlobe Technology Quotient Pvt. Limited 6th Floor, Tower 6, Candor Tech Space Tikri, Sector 48, Gurgaon - 122 018 Haryana Contact Person - Nikhhita/ Sabeera Tel: 0124-4284852","location":"Gurgaon","experience":"1 - 3 Years"},{"date":"15, 16, 17, 18 - Oct - 2019","skills":"C#, MVC, .Net","qualification":"B.E./B.Tech, MCA/PGDCA","address":"AGS Transact Technologies Limited, AGS House, Plot No EL 82 & 83, TTC Industrial Estate, MIDC Electronic Zone, Navi Mumbai - 400 705.","phone":"Not Provided","profile":"Junior .Net Developer \nAGS Transact Technologies Limited","description":"AGS Transact Technologies Limited is hiring for .Net Developer in Ghansoli Work Experience required - 2 to 4 years Candidate should have good knowledge in C#, MVC, .Net CTC - till 4 lakhs Day shift Walk-in Date/ Time: 14th October - 18th October , 2 PM onwards Interview Venue: AGS Transact Technologies Limited AGS House, Plot No EL 82 & 83, TTC Industrial Estate, MIDC Electronic Zone, Navi Mumbai - 400 705. Contact Person : Rasika HR team","location":"Mumbai","experience":"2 - 4 Years"},{"date":"19 - Oct - 2019","skills":"C#, CSS, VB .NET, Javascript, ASP .Net, HTML, SQL Server","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Marketplace Technologies Private Limited, 3rd floor, B-wing, Aggarwal Trade Centre, Plot 62, Sector 11, Belapur CBD, Navi Mumbai - 400 614","phone":"022-61484241","profile":"ASP .Net Developer \nMarketplace Technologies Private Limited","description":"Marketplace Technologies Private Limited looking for .NET Developer Utilize established development tools guidelines and conventions including but not limited to ASP .NET, SQL Server, HTML, CSS, Java Script & C#/ VB .NET Prepare & maintain code for various Net applications Database dev. Walk-in Date/ Time: 19th October 2019, 10 AM onwards Interview Venue: Marketplace Technologies Private Limited 3rd floor, B-wing, Aggarwal Trade Centre, Plot 62, Sector 11, Belapur CBD, Navi Mumbai - 400 614 Tel. : +91-22-61484250/ 61484241","location":"Mumbai","experience":"2 - 5 Years"},{"date":"19 - Oct - 2019","skills":".Net, ASP .NET, MVC, C#/ VB. NET, ADO .NET, Database Concepts/ SQL, Web services/ XML","qualification":"B.E./B.Tech, MCA/PGDCA","address":"In4velocity Systems Private Limited, Embassy Icon, 3rd Floor, No.3, Infantry Road, Bengaluru - 560 001","phone":"Not Provided","profile":"Senior .Net Developer \nIn4velocity System Private Limited","description":"Candidate should have 5 to 9 years of application development experience in Microsoft .NET Technologies using ASP .NET, MVC, C#/ VB. NET, ADO .NET Familiarity of at least one source control tools such as Visual Source Safe, CVS, etc. Good Understanding of Database Concepts/ SQL, Web services/ XML, Remoting. Experience working with RDBMS, preferably SQL Server. Knowledge of OOAD, UML and design patterns. Additional Skills : Experience in Build & Configuration Management is a plus. ASP, VB 6.0 & Crystal Report knowledge is a plus. Experience in ERP is considered a plus Microsoft Certified Professionals preferred Walk-in Date/ Time: 19th October 2019, 10 AM onwards Interview Venue: In4velocity Systems Private Limited Embassy Icon, 3rd Floor, No.3, Infantry Road, Bengaluru - 560 001","location":"Bangalore","experience":"5 - 9 Years"},{"date":"17, 18 - Oct - 2019","skills":"Front Office/ Receptionist Activities, Front Office Operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Ebenezer International School, Singena Agrahara Road, Via Huskur Road, A.P.M.C. Yard, Huskur P.O, Electronic City, Bengaluru, Karnataka - 560 099","phone":"9445455522","profile":"Front Office Executive \nJND Edu Management Services Pvt. Limited","description":"We are looking for a pleasant and friendly Front Desk Representative to join our team! As a Front Desk Representative, you will be responsible for receptionist and clerical duties at our office. Walk-in Date/ Time: 17th & 18th October , 8 AM onwards Interview Venue: Ebenezer International School Singena Agrahara Road, Via Huskur Road, A.P.M.C. Yard, Huskur P.O, Electronic City, Bengaluru, Karnataka - 560 099","location":"Bangalore","experience":"0 - 2 Years"},{"date":"14 - Oct - 2019","skills":"Technical Support, International Voice Process, Customer Service","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Tai Infotech Private Limited Building No. 149 4th floor Sector 44 Gurgaon. Next to Luminous Building Near Punjab and Sindh Bank Near to HUDA Metro Station","phone":"Not Provided","profile":"Backend Process Associate \nHCL Technologies Limited","description":"Educational Requirement: BBA, BA, B Com, B.SC Graduates (Only 2015/ 2016/ 2017/ 2018 Pass-outs are eligible for this opening). CS can also apply for the same. Work Experience: Freshers / Maximum 6 months experience Note: Technical graduates / Regular MBA's are not eligible for this opening. Shifts : 24*7 (Rotational) Salary: Upto 2.50 LPA Job Location: Gurgaon Skill Set Required:- Good typing speed (25 wpm with 80% Accuracy). Strong commitment to customer service and quality Excellent Keyboard Skills Demonstrates a strong customer service orientation. Takes responsibility to follow up with customers to ensure their needs and expectations are satisfied. Roles & Responsibilities:- Manage and update Insurance Member and Plan data on multiple systems. Enter new member data into excel and enrolment forms. Processes customer requests in a timely and accurate manner. Communicates with customers through written correspondence. Using PC application and functions such as Excel and Word to update and load data sets. To answer queries coming from end user customers in a polite and professional manner. Please Walk in for a face to face Interview Please write Yogendra BIsht on the top of your resume for entry. Interview Date: 14th- October-2019 (Monday) Timings - 11 AM TO 4 PM Interview Venue:- Tai Infotech Private Limited Building No. 149 4th floor Sector 44 Gurgaon Next to Luminous Building Near Punjab and Sindh Bank Near to HUDA Metro Station Please Be in Formals For the interview. Need to Carry: Updated CV, All education certificates (Original & Xerox copy) & Govt address / ID proof. Please Note: Don't carry laptop or any other storage device...!","location":"Noida","experience":"0 - 1 Years"},{"date":"18, 19 - Oct - 2019","skills":"Email Support, Customer Support, Hardware/ Networking, IT Helpdesk. Remote Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Arrow Electronics (India) Private Limited, 2nd Floor, Solitaire Building, Plot No. 1+2 S. No. 131/1+2, CTS No.1335, Above Reliance Digital, Aundh, Pune - 411 007.","phone":"Not Provided","profile":"IT Helpdesk/ Support Engineer \nArrow Electronics (India) Private Limited","description":"Candidate should be Any Graduate with good hands on experience in Active directory , windows support and office 365 support. Must have excellent communication skills. Ready to work in 24/7 shifts Had worked on Global IT voice support Preferred who can join immediately Only Male candidate are preferred Job Responsbility- Help desk analysts are on the frontline of customer support. They are focused on helping to resolve technical issues end users encounter, or connecting those users with more intensive IT support, when needed. Tier 3 analysts research and resolve the most complex issues that other help desk levels have been unable to fix. They also identify trends in issue reporting and come up with preventative solutions. Walk-in Date: 18th & 19th October 2019 Days: Friday and Saturday Time : 10 am to 4 pm Interview Venue: Arrow Electronics (India) Private Limited 2nd Floor, Solitaire Building, Plot No. 1+2 S. No. 131/1+2, CTS No.1335, Above Reliance Digital, Aundh, Pune - 411 007. Landmark: Opposite Reliance Footprint Contact Person : Shruthi","location":"Pune","experience":"3 - 7 Years"},{"date":"14, 15, 16 - Oct - 2019","skills":"Technical Support, Client Management, Customer Relationship, Life Cycle Execution, Project Management","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Techbooks International Private Limited, A-37, Sector - 60, NOIDA - 201 301","phone":"Not Provided","profile":"Tech Support Specialist (HTML/ XML) \nTechbooks International Private Limited","description":"Candidate should be Any Graduate with 2 to 6 years of experience in Technical Support, Client Management, Customer Relationship, Life Cycle Execution, Project Management. Should have excellent communication skills. Willing to work 24*7 Shift only apply. Job Responsbility- Managing the complete life cycle of the project starting from receiving the projects, sending them in a workable format to the composition team, monitoring the execution and ensuring that the end product is delivered in a timely manner with highest quality. Interacting with the Clients on a continuous basis regarding the specifications of the projects, handling their queries, keeping them updated about the status of the current projects through live chats, e-mails and phones. (Customer Relations) Walk-in Date: 14th - 16th October 2019 Time: 9 AM to 2 PM Interview Venue: Techbooks International Private Limited A-37, Sector - 60, NOIDA - 201 301","location":"Noida","experience":"2 - 6 Years"},{"date":"14, 15 - Oct - 2019","skills":"Technical Support, US Process, Customer Support/ Service, Networking","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Tech Mahindra Limited, RMG Area, Tech Boulevard, Sector-127, Noida - 201 304","phone":"8826741514","profile":"Technical Support (Semi-Networking) \nTech Mahindra Limited","description":"Tech Mahindra is hiring fresher's and experienced candidates for Technical/ Network Support for Tech Voice Process. Company: Tech Mahindra Job Type: Permanent Job Location: Sector-127, Noida Experience Range:Any experience eligible. Freshers can also apply Role: Technical/ Customer Support Associate Skills Required:- Excellent logical reasoning with good communication skills. Candidate should be aware of good technical knowledge. Troubleshooting of technical related issues and ensure to resolve the issues or queries over the call. Candidate should be flexible to work in 24*7 environments, comfortable to work in night shifts. Result awaited candidates can also apply. Both side Transport facility available (Pick & Drop). 5 Days Working. Walk-in Details : 14 & 15 October 2019 Timing: 11:00 AM- 4 PM Venue: Tech Mahindra Limited, RMG Area, Tech Boulevard, Sector-127, Noida - 201 304 Landmark: Tech Boulevard, Tower C For any Further Queries Call Japleen : 8826741514 Keshav : 7838941910 1. SSC (Mark sheet & Certificate) 2. HSC (Mark sheet & Certificate) 3. Graduation CMM or PC 4. Offer, Relieving Letter and last 3 months of Salary Slips(If any) 5. Pan Card 6. Aadhar Card (Mandatory)","location":"Noida","experience":"0 - 5 Years"},{"date":"14, 15 - Oct - 2019","skills":"Recruitment, HR, IT Recruitment, Hiring, Interviewing/ Recruitment, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Million Minds Management Services Limited, C 124, 2nd floor, Sector 2m Noida - 201 301. Nearest Metro Station 15","phone":"Not Provided","profile":"HR Executive/ Talent Acquisition \nMillion Minds Management Services Limited","description":"Candidate should have 6 month to 2 year experience in Recruitment, HR, IT Recruitment, Hiring, Interviewing/ Recruitment, Talent Acquisition. Expert in Naukri.com portal and other sources Job Responsibilities- Responsible for end to end hiring and bulk hiring Screen incoming resumes and application forms Arrange telephonic and face to face interview Screen incoming resumes and application forms Walk-in Date/ Time: 14th - 15th October 2019, 11 AM onwards Interview Venue: Million Minds Management Services Limited C 124, 2nd floor, Sector 2m Noida - 201 301 Nearest Metro Station 15 Interested candidate mail update CV on hr.ddugky@million-minds.com or call on 7217896036.","location":"Noida","experience":"0 - 2 Years"},{"date":"14, 15, 16, 17, 18 - Oct - 2019","skills":"Customer Support, Social Media, Inbound/ Outbound Calling, Customer Service","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Unimoni Global Business Services Pvt. Limited, New Indian Express Building, Second Floor, Kaloor, Kochi - 682 017, Kerala","phone":"Not Provided","profile":"Customer Support Associate/ Trainee \nUnimoni Global Business Services Pvt. Limited","description":"Candidate should have 0 to 5 years of experience in Customer Support, Social Media, Inbound/ Outbound Calling, Customer Complaints, Customer Service Management. Should have good communication skills Roles & Responsibilities: Resolve product or service problems by clarifying the customer's complaint; determining the cause of the problem; selecting and explaining the best solution to solve the problem; Recommend potential products or services to management by collecting customer information and analyzing customer needs Prepare product or service reports by collecting and analyzing customer information Contribute to team effort by accomplishing related results as needed Walk-in Date/ Time: 14th October - 18th October , 10 AM onwards Interview Venue: Unimoni Global Business Services Pvt. Limited New Indian Express Building, Second Floor, Kaloor, Kochi - 682 017, Kerala","location":"Kochi","experience":"0 - 5 Years"},{"date":"14 - Oct - 2019","skills":"Technical Support, Installation, Configuration & Troubleshooting Skills","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Computer Generated Solutions (India) Private Limited, 4th Floor, Plot No. 5 & 6, Image Garden, Silicon Valley Road, Madhapur, Hyderabad - 500 081","phone":"7981111058","profile":"Technical Support Associate \nComputer Generated Solutions India (P) Ltd.","description":"Educational Qualification:-10+2/ Any Graduate Must have good communication in Hindi & English Immediate Joiners Required Job on boarding Date:- 16-10-2019 (Wednesday) Required good knowledge of OS (XP, Win 8, Win 10) & Standard Application - Installation, configuration & Troubleshooting. Good knowledge on hardware troubleshooting, installation, configuration. Good knowledge of desktop operating systems and Microsoft office products(MS office 2007, 2010, 2013). Knowledge of Installation and troubleshooting Network Printers, Scanners, Antivirus and VPN clients. And required basic knowledge in networking. Interview Date: 14th October 2019 Timings: 10 AM Onwards Interview Venue: Computer Generated Solutions (India) Private Limited 4th Floor, Plot No. 5 & 6, Image Garden, Silicon Valley Road, Madhapur, Hyderabad - 500 081 For further information call to 7981111058 (Vamsi)","location":"Hyderabad","experience":"0 - 5 Years"},{"date":"14, 15, 16, 17, 18 - Oct - 2019","skills":"Automation (Selenium), Core Java, Create Test Cases, OOPS Concept","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"GSR Business Services (Pvt.) Limited, 2nd Floor, West Wing, Khivraj Building, Above Maruti Suzuki Showroom, Perungudi, Chennai - 600 096.","phone":"8870476197","profile":"Automation Test Engineer \nGSR Business Services Private Limited","description":"Must have minimum 2+ years work experience in Automation (Selenium) Must have strong experience in Core Java Ability to create Test Cases Should be strong in OOPS Concept Core Java programming experience is an added advantage Should have done complete end to end testing & Debugging Walk-in Date: 14th - 18th October 2019 Timings - 10:00 AM to 4:00 PM Interview Venue: GSR Business Services (Pvt.) Limited 2nd Floor, West Wing, Khivraj Building, Above Maruti Suzuki Showroom, Perungudi, Chennai - 600 096. Near Perungudi Toll Plaza, OMR Road (Rajiv Gandhi Salai)","location":"Chennai","experience":"2 - 7 Years"},{"date":"14, 15, 16, 17, 18 - Oct - 2019","skills":"Software Testing, Test Plan/ Cases & Bug Reports, Selenium WebDriver, Writing Test cases","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Knovos (India) Private Limited, A-501, APPL, IT-SEZ, K RAHEJA ROAD, KOBA, GANDHINAGAR - 382 009","phone":"Not Provided","profile":"QA/ Testing Engineer \nKnovos India Private Limited","description":"Candidate must have good knowledge of Stlc, Automation Test Life Cycle). Ability to learn new Software Using Manuals Within a Short Period of Time. Should have knowledge of Sql, MySql , TFS. Pressure handling, Team player, Go Getter, Self-starter. Excellent in client communication. Quality Checking & Delivery of Firms Products. Test Plan/ Cases & Bug Reports. Handling Elements in Selenium WebDriver. Writing Test cases using Element locators, WebDriver Methods, Python Programming. Walk-in Date/ Time: 14th - 18th October , 10 AM onwards Interview Venue: Knovos (India) Private Limited A-501, APPL, IT-SEZ, K RAHEJA ROAD, KOBA, GANDHINAGAR - 382 009","location":"Gandhinagar","experience":"1 - 5 Years"},{"date":"7, 8, 9, 10, 11, 14, 15 - Oct - 2019","skills":"TESTING/ JAVA/ PHP Programming, OOPS Concept","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"SECRET TECHNOLOGIES INDIA (VMS Group) Office No. 302, Amit Samruddhi, Opposite Balgandharva Rang Mandir, Behind Arrow Showroom, J. M. Road, Pune - 411 004","phone":"Not Provided","profile":"IT Freshers (Testing/ Java/ PHP) \nSecret Technologies India (VMS Group)","description":"Secret Technologies India (VMS Group) Private Limited is hiring IT Freshers (Testing/ Java/ PH Qualification:BE, ME, MCA, BCA, BSC, any graduate Joining: Immediate Strong knowledge of TESTING/ JAVA/ PHP programming required. Should have knowledge of basic Programming languages like C, Java and any database Strong knowledge of OOPS Concept. Required Experience, Required Skills: Should have knowledge of basic Programming languages like C, Java and any database Strong knowledge of OOPS Concept. Should have a fair knowledge of entire SDLC, STLC. Good analytical and problem solving ability. Detail orientated with excellent written and verbal communication skills. Direct Walk-in for the Interview on weekdays (Monday to Friday) Date - 1st to 15th October 2019 Timing 10.00 Am to 4 .30 PM Venue Details SECRET TECHNOLOGIES INDIA (VMS Group) Office No. 302, Amit Samruddhi, Opposite Balgandharva Rang Mandir, Behind Arrow Showroom, J. M. Road, Pune - 411 004 You will meet HR Pritee. & Mr. Rahul Sir (Director) The interview will last about 15 minutes and you'll have the chance to discuss the Software Developer and Software Testing, Industrial Technical or Non Technical Jobs position and learn more about our company","location":"Pune","experience":"0 - 1 Years"},{"date":"19 - Oct - 2019","skills":"Liasion, Security, Vendor Development, Housekeeping, Facility Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Jones Lang LaSalle Property Consultants (India) Pvt. Limited, Level 6, Amar Avinash Corporate Plaza, Near Inox, Bund Garden Road, Pune - 411 001","phone":"Not Provided","profile":"Front Office Executive \nJones Lang LaSalle Property Consultants (India) Pvt. Limited","description":"Candidate should be Any Graduate with 3 to 6 years experience in Client Servicing, Front Office Operations, Time Office, Reception/ Guest Relations, Daily Operations, Workforce Planning, Site Inspection. Must have effective communication skills. Experience in Facility & Hotel Industry would be preferred. Duties and Responsibilities: Ensure giving a warm welcome to clients there by creating a delightful experience. Maintain effective communication and working relationships with all other departments (HK, Duty Engineer, Duty Manager, Builder, Wellness room, Time Office, Security, Reception). The GRE Should have up to date knowledge of the following Floor structure/Plan. Projects on each floor. Project Leads and SPOCS Site inspection Tool Be aware of floor capacity/Bay nos and floor strength. Ensure that no photography/Videography is done inside the premises without prior approval, share the photography form to employs and ensure the required process is followed. Conduct daily briefings with housekeeping and security team, ensure all staffs are aware of all important visits on the floor. Scope of work, amenities & services, policies & procedure along with in depth knowledge of all Accenture premises (Pan India) & local area. Ensure maintaining close communication with the client (Floor Leads/ Project Leads/ Industry Leads and CSO team. Ensure nominations for Floor wardens are taken and updated on regular basis. Check cleanliness of lobby, work caf/ Pantry/Meeting/ Tele Booth/ rooms/Design thinking areas/ Work Pods/Restricted Access Bays/Wash Room etc. Walk In Drive on 19th Oct 2019 from 10 am to 1 pm Interview Venue: Jones Lang LaSalle Property Consultants (India) Pvt. Limited Level 6, Amar Avinash Corporate Plaza, Near Inox, Bund Garden Road, Pune - 411 001","location":"Pune","experience":"3 - 6 Years"},{"date":"12 - Oct - 2019","skills":"General Administration, Back Office Activities, Customer Relationship","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"RNDMFG, No. 10/ 15, 3rd Floor, MMH Complex Natesan Street Above Hotel Kumara Bhavan, T. Nagar, Chennai, Tamil Nadu - 600 017","phone":"9962977000","profile":"Admin Executive \nRNDMFG","description":"Education: Higher Secondary (12th Pass)/ Graduates Key Skills- Good communication skills Job Type/ Experience: Full-time, Fresher, Walk-In Job Responsbility- Managing online enquires from customers Maintaining customer relationship with retail customers Maintaining digital presence and online sales Salary: INR 8,000.00 to 10,000.00 /Month Walk-in Date:12-10-2019 Timing :11 am to 2 pm Venue Details RNDMFG, No. 10/ 15, 3rd Floor, MMH Complex Natesan Street Above Hotel Kumara Bhavan, T. Nagar, Chennai, Tamil Nadu - 600 017 Contact: Lalitha -9962977000","location":"Chennai","experience":"2 - 5 Years"},{"date":"10, 11, 12 - Oct - 2019","skills":"Core PHP, HTML/ CSS/ Javascript/ Jquery & MySQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Aavaz Contact Center Solutions, 128 B, Second Floor, Shahpur Jat, New Delhi - 110 049. Landmark- Slice of Italy, Next to UCO Bank","phone":"8287854151","profile":"PHP Developer \nAavaz Contact Center Solutions","description":"Candidate should have good knowledge/ experience in Core PHP. Knowledge of Wordpress / Cake PHP is an advantage. Excellent knowledge of HTML/ CSS/ Javascript/ Jquery & MySQL Preference will be given for command over Database skills. Experience in PHP, CMS / Framework. Object oriented programming. Experience in moodle & magento will be a plus. Walk-in Date/ Time: 9th October - 12th October , 11 AM onwards Interview Venue: Aavaz Contact Center Solutions 128 B, Second Floor, Shahpur Jat, New Delhi - 110 049 Landmark- Slice of Italy, Next to UCO Bank Nearest Metro- Greenpark/ Hauzkhas/ Panchsheel Park","location":"Delhi","experience":"1 - 3 Years"},{"date":"11, 12, 14, 15 - Oct - 2019","skills":"PHP, MVC Frameworks, Code igniter, Magento, Laravel Open cart or any CMS","qualification":"B.E./B.Tech, MCA/PGDCA","address":"RisingRoot Technologies Private Limited, #35, Fourth Floor, Narras House, Arunodaya Colony, Image Garden Road, Madhapur, Hi-tech City, Hyderabad","phone":"040-42305959","profile":"PHP Developers \nRisingRoot Technologies Pvt. Limited","description":"We are looking for a PHP Developer with a wide range of experience in web development. Hands-on experience in server-side web application logic and Third Party APIs/ CSS/ GitHub/ JQuery. Expertise in PHP, MVC Frameworks and good technology exposure of Code igniter, Magento, Laravel Open cart or any CMS. Candidate should have Bachelors Degree and/or 2+ years of software development experience or equivalent, including Object Oriented design and PHP Development. Roles & Responsibilities: Work with PHP and MySQL to design, develop and debug web applications Integrate back-end services with PHP/Javascript based front end needs. Work with the team to manage, optimize and customize multiple web applications. Create and maintain technical documentation. Walk-in Date/ Time: 10th - 15th October , 11 AM onwards Interview Venue: RisingRoot Technologies Private Limited #35, Fourth Floor, Narras House, Arunodaya Colony, Image Garden Road, Madhapur, Hi-tech City, Hyderabad Tel No: 040-4230 5959 Mob: 6300952607","location":"Hyderabad","experience":"2 - 5 Years"},{"date":"11, 12, 14, 15, 16, 17, 18, 19, 21, 22, 23, 24, 25 - Oct - 2019","skills":"Java based Android (Native), Android SDK, Recycler View, Card View, List View","qualification":"B.E./B.Tech, MCA/PGDCA","address":"CROSSEDGE Technologies Private Limited, 14, Pammal Main Road, Opposite to IDBI Bank, Pamal, Chennai - 600 075","phone":"Not Specified","profile":"Android Developer \nCROSSEDGE Technologies Pvt. Limited","description":"Candidate must have 2 to 5 years experience in Java based Android (Native) development. Must have strong knowledge on Android SDK, Android basics like Manifest components, Recycler View, Card View, List View, Broadcast receiver, Location services, Full Activity lifecycle, Handling of Dialog/Fragment dialog, Fragment lifecycle. Experience in developing best practices, software principles and code design concepts Ensure the performance, quality, and responsiveness of applications Experience in developing and supporting rapid iterations of software in an agile context Help maintain code quality, organisation, and automation Skills Walk-in Date/ Time: 11th - 25th October , 9 AM onwards Interview Venue: CROSSEDGE Technologies Private Limited 14, Pammal Main Road, Opposite to IDBI Bank, Pamal, Chennai - 600 075","location":"Chennai","experience":"2 - 5 Years"},{"date":"11, 12, 14, 15, 16, 17, 18, 19, 21, 22, 23, 24, 25 - Oct - 2019","skills":"Core PHP, HTML5, CSS3, Codeigniter, JQuery, and ReactJs","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Official Gates Technologies Pvt. Limited, 106, 1st Floor, D Block, 1st Main Road, Annanagar East, Chennai - 600 102","phone":"9841299222","profile":"PHP Developer \nOfficial Gates Technologies Pvt. Limited","description":"The candidate must be creative, problem-solver and willing to work with the team. Must have good understanding of front-end technologies including Core PHP, HTML5, CSS3, Codeigniter, JQuery, and ReactJs Walk-in Date/ Time: 11th October - 31st October , 11 AM onwards Interview Venue: Official Gates Technologies Pvt. Limited 106, 1st Floor, D Block, 1st Main Road, Annanagar East, Chennai - 600 102","location":"Chennai","experience":"0 - 5 Years"},{"date":"12 - Oct - 2019","skills":"PHP, Javascript, ReactJS or VueJS or AngularJS","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Netedge Computing Solutions Pvt. Limited, C-56/39 NetEdge Tower Sector-62, Noida - 201301","phone":"70427-94831","profile":"Software Engineer - PHP \nNetedge Computing Solutions Pvt. Limited","description":"The person must have : Experience in Development using PHP, Javascript, ReactJS or VueJS or AngularJS Experience in MySQL & other open source technologies. He/She must have orientation towards quality & customer satisfaction. The Person Will be Responsible for: Coding & development of programs / modules Timely delivery of programs & projects to customers Ability to work in a team environment Must meet tight deadlines & work on several projects simultaneously Walk-in Date/ Time: 12th October , 11 AM onwards Interview Venue: Netedge Computing Solutions Pvt. Limited C-56/39 NetEdge Tower Sector-62, Noida - 201301","location":"Noida","experience":"2 - 3 Years"},{"date":"10, 11, 12, 14, 15, 16, 17, 18, 19, 21 - Oct - 2019","skills":"PHP5, MySQL, Ajax, jQuery, Javascript, HTML5, CSS3, XML, Scripting and Database Administration","qualification":"B.E./B.Tech, MCA/PGDCA","address":"XS Infosol Private Limited, C-34 Sector-2 Noida, Near Nirula Hotel, Near Sector-15 Metro Station, Noida - 201 301","phone":"9953007925","profile":"PHP Developer \nXS Infosol Private Limited","description":"Candidate must have expertise in PHP Frameworks and good technology exposure of Codeigniter / Core Php. Excellent knowledge of PHP5, MySQL, Ajax, jQuery, Javascript, HTML5, CSS3, XML, Scripting and Database Administration Must have sound understanding of OOPs Strong Cross-Browser HTML5/ CSS3 Skills Walk-in Date/ Time: 10th - 21st October , 11 AM onwards Interview Venue: XS Infosol Private Limited C-34 Sector-2 Noida, Near Nirula Hotel, Near Sector-15 Metro Station, Noida - 201 301","location":"Noida","experience":"0 - 5 Years"},{"date":"9, 10, 11, 12 - Oct - 2019","skills":"C++ XML Web Technologies Data Structures MySQL PHP Perl","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Greet Technologies Private Limited, L327-328 6th Main, Service Road, 6th Sector, HSR Layout, Bangalore - 560 102. Landmark: Near Fitjee Pu College","phone":"Not Provided","profile":"PHP Developer \nGreet Technologies Private Limited","description":"Candidate should have deep knowledge and in using Perl for web development. Knowledge in working with regular expressions and complex data structures in Perl. Knowhow of processing XML in Perl Strong background in SQL Working experience with My-SQL Servers Walk-in Date/ Time: 9th October - 12th October , 10 AM onwards Interview Venue: Greet Technologies Private Limited L327-328 6th Main, Service Road, 6th Sector, HSR Layout, Bangalore - 560 102 Landmark: Near Fitjee Pu College","location":"Bangalore","experience":"0 - 1 Years"},{"date":"13 - Oct - 2019","skills":"Core PHP (OOPS), YII(Mandatory), Open Cart, SUIT CRM, MySQL","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"3i Infotech Limited, Prince infocity 2, 3rd Floor, Kandanchavadi, Chennai - 96","phone":"044-71622577","profile":"PHP Developer \n3i Infotech Limited","description":"Primary Skill Set: Core PHP (OOPS), YII (Mandatory), Open Cart, SUIT CRM, MySQL Added Advantage: ORACLE, Jquery, JAVA Script, HTML, CSS & Version Control Tool Work Experience: 3- 6 Years Notice Period: Immediate (15 Days Max) Salary: Industry Standard Interested candidates can walk-in to below mentioned address: Interview Date : 13th October 2019 (Sunday) Time : 10.30 AM to 12PM 3i Infotech Limited, Prince infocity 2, 3rd Floor, Kandanchavadi, Chennai - 96 Contact Person : Vivek","location":"Chennai","experience":"3 - 6 Years"},{"date":"11, 12, 14, 15, 16, 17, 18, 19, 21, 22, 23, 24, 25 - Oct - 2019","skills":"PHP, Javascript, Ajax, jQuery, XML, XHTML, Web Services & RESTful APIs","qualification":"B.E./B.Tech, MCA/PGDCA","address":"CROSSEDGE Technologies Private Limited, 14, Pammal Main Road, Opposite to IDBI Bank, Pamal, Chennai - 600 075","phone":"Not Provided","profile":"PHP Developer \nCROSSEDGE Technologies Pvt. Limited","description":"Candidate must have strong knowledge of PHP, Javascript, Ajax, jQuery, XML, XHTML, third party web services & RESTful APIs. Should have knowledge in Payment Gatway. Knowledge in PHP 7 web frameworks such as CodeIgniter 3.1.1, Laravel, CakePHP will be added advantage Responsibilities and Duties: Participate in various phases of SDLC including design, coding, reviews, testing, and documentation. Design, develop, test, debug and maintain web application/REST web service-based solutions in PHP Participates in all phases of the software development life-cycle - requirements, architecture/design, implementation, testing, release, maintenance of our software applications. Walk-in Date/ Time: 11th - 25th October , 9 AM onwards Interview Venue: CROSSEDGE Technologies Private Limited 14, Pammal Main Road, Opposite to IDBI Bank, Pamal, Chennai - 600 075","location":"Chennai","experience":"2 - 5 Years"},{"date":"14, 15, 16, 17, 18 - Oct - 2019","skills":"General Administration, Front Office/ Receptionist Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"GGS Information Services (India) Private Limited, Trifecta Adatto Techpark, No 66/2. 67/1, 10th Floor Whitefield Main Road, Garudacharpalya, Mahadevpura Post, Bangalore - 560 048","phone":"Not Mentioned","profile":"Front Office Executive (Male) \nGGS Information Services (India) Pvt. Limited","description":"Candidate should be Any Graduate with Basic Computer Knowledge Must have strong communication and people skills Good organizational and multi-tasking abilities Jobs Duties & Responsibilities Greeting and attending to inquires HR Activities Admin Activities Organise and maintain files and records; update when necessary Walk IN with your CV/ Resume between 10:30 AM to 5 PM (Monday to Friday) Interview Venue: GGS Information Services (India) Private Limited Trifecta Adatto Techpark, No 66/2. 67/1, 10th Floor Whitefield Main Road, Garudacharpalya, Mahadevpura Post, Bangalore - 560 048 Landmark: Next to Phoenix Mall (Near Decathlon)","location":"Bangalore","experience":"0 - 2 Years"},{"date":"19 - Oct - 2019","skills":"PHP and Angular 2/4/5/6/7 & Bootstrap 3 / 4, Node JS","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Matrimony.com, Arihant E Park, 6th Floor, LB Road, Adyar, Landmark - Opp Adyar Ananda Bhavan, Chennai, Tamilnadu - 600020","phone":"Not Provided","profile":"PHP/ Angular Developer \nMatrimony.com Limited","description":"Walk In Interview for PHP/ Angular JS - Matrimony.com - 19th Oct - Coimbatore Location Candidate should have experience in working PHP and Angular 2/4/5/6/7 & Bootstrap 3/ 4 Node JS experience is an added advantage Very good knowledge of HTML and CSS Strong knowledge of JavaScript Experience with git Comfortable working across the full stack from development to deployment Knowledge of NPM Knowledge of gulp/grunt Knowledge of Agile React or any JS framework is an advantage Server-side knowledge is an advantage Interested candidates shall share with us your profile on or before 14th October 2019 to gracy.mary@matrimony.com We will reach out to suitable candidates only.","location":"Chennai, Coimbatore","experience":"3 - 5 Years"},{"date":"13 - Oct - 2019","skills":"Hospital Administration, Healthcare","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Popular Medicare Limited, DLW, Kakarmatta, Near Flyover Bridge Varanasi, Uttar Pradesh","phone":"Not Specified","profile":"Hospital Administrator \nPopular Medicare Limited","description":"Popular Medicare Limited is looking for MHA candidate for Varanasi & Mirzapur Location Job Responsibility- Organizing & overseeing health services & daily activities of hospital. Manage staff & budgets, communicate between departments & ensure adequate patient care amongst other duties. Walk-in Date/ Time: 13th October 2019, 10 AM onwards Interview Venue: Popular Medicare Limited DLW, Kakarmatta, Near Flyover Bridge Varanasi, Uttar Pradesh","location":"Varanasi","experience":"1 - 2 Years"},{"date":"12 - Oct - 2019","skills":"JAVA/ UI /UX/ PHP/ Testing/ Business Analyst","qualification":"B.E./B.Tech, MCA/PGDCA","address":"PennyWise Solutions Private Limited, 1st Floor Solitaire Building, Plot No. 14 & 15, Software Units Layout, Survey No.64, Madhapur, Hyderabad - 500 081","phone":"Not Mentioned","profile":"Trainee Engineer (Java/ UI/ Php/ Testing) \nPennyWise Solutions Private Limited","description":"The Incumbent would be trained on specific technologies for six months and would work on one of the technologies: JAVA/ UI /UX/ PHP/ Testing/ Business Analyst (MBA Preferred). Educational Qualifications: B.Tech/ BE/ MCA (2018 & 2019 Pass out Only) Percentage - Above 70% (In all Academics 10th, Intermediate & Engineering) Essential Requirements: Strong collaboration and communication skills, both verbal and written. Excellent Analytical, Problem-solving skills and a creative approach for new ideas. The ability to work under pressure & adapt in a fast-paced environment Desire to learn new technologies and systems Salary - INR 325000 CTC Interested candidates may walk-in at the venue for a written Test (Aptitude) along with updated CV & 2 PASSPORT SIZE PHOTOGRAPH. Date 12 October 2019 (Saturday) Time: 10.00 AM to 12.00 Noon Interview Venue: PennyWise Solutions Private Limited 1st Floor Solitaire Building, Plot No. 14 & 15, Software Units Layout, Survey No.64, Madhapur, Hyderabad - 500 081 Landmark: Opposite to Novartis Inorbit Mall Road","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"12 - Oct - 2019","skills":"General Administration, Travel Arrangements, Office Management, Vendor Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Pacific BPO Private Limited, B-11, Sector -63, Noida. Landmark: Near Fortis Hospital","phone":"9540058222","profile":"Admin Executive (Male Only) \nPacific BPO Private Limited","description":"Candidate should be Any Graduate with excellent knowledge of MS Office Must have exemplary planning and time management skills Up-to-date with advancements in office gadgets and applications Ability to multitask and prioritize daily workload Vendor Management Rotational Shift Relevant Experience -2 years as an Admin Executive Job Responsibility- Act as the point of contact between the executives and internal/external clients Undertake the tasks of receiving calls, take messages and routing correspondence Handle requests and queries appropriately Make travel arrangements Monitor office supplies and research advantageous deals or suppliers Full comprehension of office management systems and procedures Walk-in Date/ Time: 12th October 2019, 1 PM onwards Interview Venue: Pacific BPO Private Limited B-11, Sector -63, Noida Landmark: Near Fortis Hospital","location":"Noida","experience":"2 - 3 Years"},{"date":"11, 12 - Oct - 2019","skills":"HR Administration","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"HN Web Marketing Private Limited, 406-CITY CENTRE, Behind Persistent, Hinjewadi - Phase 1, Pune - 411 058","phone":"7744865675","profile":"HR Executive & Administrator \nHN Web Marketing Private Limited","description":"HN Web Marketing Private Limited is looking for an HR Executive & Administrator with good communication skills, problem solving, well organized in documentation. Would be responsible for recruiting, screening, interviewing and placing employees. Also handle employee relations, payroll, benefits, and training. Walk-in Date/ Time: 10th - 12th October , 10 AM onwards Interview Venue: HN Web Marketing Private Limited 406-CITY CENTRE, Behind Persistent, Hinjewadi - Phase 1, Pune - 411 058 Contact Person- Chetana J Contact No- 7744865675","location":"Pune","experience":"0 - 2 Years"},{"date":"14, 15, 16, 17, 18 - Oct - 2019","skills":"General Administration, Facility/ Hospitality Management, Record Keeping","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Provana India Private Limited, A-32, Sector-2, Noida","phone":"Not Provided","profile":"Administration Executive \nProvana India Private Limited","description":"Candidate should be Any Graduate with 1 to 3 years of experience in General Administration, Facility Management, Hospitality Management, Record Keeping. Must have excellent communication skills. Open for rotational shift Responsibilities- Airline ticket booking Hotels booking, Reservation and needs to prepare Itinerary Cab ordering for employees and record keeping. Seating plan check Managing office requirement on working Saturday Walk-in Date/ Time: 14th - 18th October 2019, 11 AM onwards Interview Venue: Provana India Private Limited A-32, Sector-2, Noida Contact Person: Gopal Sharma","location":"Noida","experience":"1 - 3 Years"},{"date":"11, 12, 13, 14, 15, 16 - Oct - 2019","skills":"Domestic Bpo, Back Office Operations","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Reliable Spaces Private Limited, No. 51, Rajiv Gandhi Salai (OMR), Rattha TEK MEADOWS, C Block, 1st floor, Sholinganallur, Chennai - 600 119","phone":"022 3375 0037","profile":"Banking Associate (Non-Voice Process) \nReliable Spaces Private Limited","description":"We have Immediate job openings for Banking Associate (Non-Voice Process) Key Requirements: 1. Should know English and Tamil. 2. Freshers 3. Any qualification is accepted. 4. Immediate joiners preferred. Job Responsibility: 1. The candidate will be involved in Banking Non-Voice process. 2. Complete Day Shift. 3. Attractive and Best in market Salary Packages. * Spot Offer on Selection. Walk-in Date/ Time: 11th - 16th October 2019, 10 AM onwards Interview Venue: Reliable Spaces Private Limited No. 51, Rajiv Gandhi Salai (OMR), Rattha TEK MEADOWS, C Block, 1st floor, Sholinganallur, Chennai - 600 119 Phone No. 022 3375 0037| Ext: 50037| Mob: 7904356739 Email: indra.kumar@reliablebss.com","location":"Chennai","experience":"0 - 1 Years"},{"date":"16 - Oct - 2019","skills":"Java, Thymleaf, JavaScript, J2EE, Spring, JUnit and Mockito.","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"FTD India Private Limited, Block D - Wing II, 5th Floor, Cyber Gateway Building, HitechCity, Madhapur Village Hyderabad - 500 081","phone":"040-66030303","profile":"Java Developers \nFTD India Private Limited","description":"We are seeking passionate software application developers to work with our highly talented team of young dedicated professionals who aim to give our customers a memorable shopping experience. Education: BE/B.Tech in circuitry branches with 70% throughout academics from premier institutions Experience Range: 3 - 5 years in software development Knowledge, Skills and Abilities: Strong in core Java/ Http/ J2EE fundamentals. Good hands on skills in Java, JDBC, JTA, RESTful Services Good experience with frameworks like Spring core, Spring MVC and Hibernate Strong Experience with Relational databases like Oracle or MySQL Working experience in Unix/ Linux environment Good problem solving and excellent communication skills. Experience in JavaScript, JQuery, CSS, Bootstrap, HTML, Ajax. Duties & Responsibilities: Write solid, well tested code using Java, Thymleaf, JavaScript, J2EE, Spring, JUnit and Mockito. Build, deploy and release software using tools like GIT, Maven, Jenkins and SonarQube Troubleshoot and support production operations Work in small cross-functional teams to roll out features at aggressive pace Review design and code of peers Contribute to Technical design/ Architecture Walk-in Date/ Time: 16th October 2019, 9 AM onwards Interview Venue: FTD India Private Limited Block D - Wing II, 5th Floor, Cyber Gateway Building, HitechCity, Madhapur Village Hyderabad - 500 081 Interview Process: Candidates who clear Code Assessment test will be processed for further technical discussions. Note: Candidate who attended our interview process in last 6 months are not eligible for this drive.","location":"Hyderabad","experience":"3 - 5 Years"},{"date":"14, 15, 16 - Oct - 2019","skills":"Core Java, Advance Java, Servlets, JSP, JavaScript, HTML5, Hibernate","qualification":"B.E./B.Tech, MCA/PGDCA","address":"MS Technology Private Limited, 2, Community Centre, IInd Floor, Basant Lok, Opposite Hero Corporate office, Vasant Vihar","phone":"Not Provided","profile":"Java Developer \nMS Technology Private Limited","description":"Candidate must have expertise in Core Java, Advance Java, Servlets, JSP, JavaScript, HTML5 Hibernate, Webservices, REST API,Apple IOS,Google Android, Angular5 or above Have experience in IDE like Eclipse, NetBeans etc. Good exposure to object oriented design patterns. Good Database concepts. Walk-in Date/ Time: 14th October - 16th October , 11 AM onwards Interview Venue: MS Technology Private Limited 2, Community Centre, IInd Floor, Basant Lok, Opposite Hero Corporate office, Vasant Vihar","location":"Delhi","experience":"1 - 2 Years"},{"date":"12 - Oct - 2019","skills":"Android Development, Kotlin, Java, OOPS Concepts, SQLite database","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Capgemini Technology Services India Limited, No.14, Phase III, Rajiv Gandhi Infotech Park, Village Man, Taluka, Mulshi, Haveli, Hinjewadi, Pune - 411 057.","phone":"Not Provided","profile":"Android Developer/ Lead \nCapgemini Technology Services India Limited","description":"Candidate should have very strong technical hands on experience in Android Development. Must have strong knowledge on Android SDK, Android Studio and Gradle. Good understanding on Core Java + Android and have experience on Kotlin. Good understanding on Android development Tools, Architecture Good understanding on networking libraries like Volley, Retrofit. Data handing using SQLite database, Preferences Strong knowledge on OOPS Concepts Strong experience working with Unit testing and BDD Should have good understanding of design patterns Familiarity with Git, GitHub and SVN Strong Agile development principles is necessary Good to have experience on Hybrid mobile application development Cordova, Angular 2, Type Script HTML5 and CSS3 Primary Skills: Android Development, Kotlin, Java Work Experience: 2 to 9 years Interview Date: 12th October 2019 (Saturday) Timing: 09.00 AM to 3.00 PM Interview Venue: Capgemini Technology Services India Limited No.14, Phase III, Rajiv Gandhi Infotech Park, Village Man, Taluka, Mulshi, Haveli, Hinjewadi, Pune, Maharashtra - 411 057. Contact Person: Archana Landge Documents to carry: Updated copy of resume Identity Proof 2 Passport size photographs PS.: Please ignore, If youve already been interviewed by Capgemini in past 2 months","location":"Pune","experience":"3 - 8 Years"},{"date":"19 - Oct - 2019","skills":"Java/ J2EE platforms, .Net Platforms with RDBMS platforms","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"CIEL HR Services Private Limited, No. 2802 (Broadway Building), 2nd & 3rd Floor, 27th Main Road,HSR Layout, Sector 1, Bengaluru - 560 102","phone":"078160 00111","profile":"Java/ .Net Developers \nCIEL HR Services Private Limited","description":"Ideal Candidate should have 2 to 5 years of experience in development of enterprise level web applications using an object oriented technology stack. Must have at least 1 to 2 years of experience in designing web applications. Experience in developing on J2EE platforms, .Net platforms with RDBMS platforms (Oracle, MySQL, SQL Server) Someone with a solid consulting mindset, who has the ability to lead from the front. Flexibility to travel onsite as required Job Responsibilities: Requirement gathering and analysis in the absence of a Business Analyst. Design solutions based on the requirements gathered. Design integration requirements with other third party platforms. Designing data models. Preparing high level & low level design for the solutions. Daily task allocation & management of development team. Performing frequent code reviews & ensuring quality of the overall delivery. Walk-in Date/ Time: 19th October from 9 AM onwards Interview Venue: CIEL HR Services Private Limited No. 2802 (Broadway Building), 2nd & 3rd Floor, 27th Main Road,HSR Layout, Sector 1, Bengaluru - 560 102","location":"Bangalore","experience":"2 - 5 Years"},{"date":"12 - Oct - 2019","skills":"JavaScript (ECMA Script 6), Typescript, Java or Python","qualification":"B.E./B.Tech, MCA/PGDCA","address":"QuEST Global Engineering Services Pvt. Limited, QuEST Towers, Technopark Campus, Trivandrum, Kerala","phone":"Not Provided","profile":"Java/ Full Stack Developer \nQuEST Global Engineering Services Pvt. Limited","description":"Must have Skills: Strong expertise in JavaScript (ECMA Script 6), Typescript, Java or Python. Good knowledge of Object Oriented Programming, familiarity with functional programming concepts. Experience in Developing and containerizing microservices using Docker. Frameworks and API paradigm such as SpringBoot, REST, GO or Python. Expertise in Unit Testing of the application code. Job Responsibilities: Software development with strong knowledge of Javascript (ECMA Script 6), Typescript, Java or Python. Unit and system testing of application code as well as execution of implementation activities. Excellent problem solving/troubleshooting skills on microservices. Should be proactive and have the intellect to explore and come up with solution to complex technical issues. Walk-in Date/ Time: 12th October 2019, 10 AM onwards Interview Venue: QuEST Global Engineering Services Pvt. Limited QuEST Towers, Technopark Campus, Trivandrum, Kerala","location":"Trivandrum","experience":"3 - 8 Years"},{"date":"12, 19 - Oct - 2019","skills":"Android, iOS, .NET, LAMP (PHP/ Python), Java, Angular, Node. JS","qualification":"B.E./B.Tech","address":"Finoit Technologies (India) Private Limited, 9th Floor, Tower B, B-8, Noida One Building, Block- B, Sector 62, Noida - 201 309. Nearest Metro Station-Sec 62 Noida-Blue Line or Electronic City","phone":"0120-4112386","profile":"Trainee Engineer (Android/ .NET/ Java) \nFinoit Technologies (India) Private Limited","description":"Finoit (Web & Mobile App software Development Company) is looking to recruit software graduates (2019 Batch) with the qualification of BE/ B.Tech. (CS/ IT/ ECE) for Trainee-Software Engineer position for Android, iOS, .NET, LAMP (PHP/ Python), Java, Angular, Node. JS and other Open Source Technologies etc. Qualification: Undergraduate BE / B.Tech (Computer Science, Electronics and Communication, Information Technology) -2019 Batch. Marks Criteria - 60% and above - B.E./B.Tech. - 60% and above - Class 12th - 60% and above - Class 10th Salary and Training Information - Training Period: 6 Months - Designation: Trainee - Software Engineer - CTC during first six months of training period: Rs. 2.4 Lacs per annum - CTC from 7th month onwards: Rs. 3 Lacs per annum - Role: Trainee - Software Developer Service Agreement Duration - 2.5 years - Other terms will be explained in the final round. Interview Process - First Round: 120 minutes (Aptitude and Programming Round) - Second Round: Technical Interview - Third Round: HR Interview All the interested candidates need to apply on the following link in order to appear for the walk-in interviews. Please copy and past this link in the browser and apply bit.ly/FinoitHirings19 Walk-in Dates and Time of Interview (Reporting time) 12th October 2019 (Saturday) -- 9:30 AM 19th October 2019 (Saturday) -- 9:30 AM Interview Venue Finoit Technologies (India) Private Limited 9th Floor, Tower B, B-8, Noida One Building, Block- B, Sector 62, Noida - 201 309 Nearest Metro Station-Sec 62 Noida-Blue Line or Electronic City Important Note: Candidate must have 60% of aggregate throughout their academics i.e. 10th class, 12th class, Graduation. Candidate who have already appeared in past 6 months are not allowed to re-appear. Candidate should have a UG qualification. The candidate must apply via FINOIT: Fresher's Hiring 2019, as the interview process will be conducted via their online assessment platform only. Candidate should carry their updated resume and one Photograph.","location":"Noida","experience":"0 - 1 Years"},{"date":"11 - Oct - 2019","skills":"Technical Support, IT Helpdesk/ Service Desk, Hadware Support/ Troubleshooting","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Wipro Limited, 2nd floor Premier IT Park, Road No.11, Marol MIDC Industry Estate, Andheri East, Mumbai - 400 069","phone":"9967559377","profile":"Desktop Support Engineer \nWIPRO Limited","description":"Role - Desktop Support Engineer (Trainee & Full time both) Job Locations - All over Mumbai (Multiple location in Mumbai) Male candidates only can apply Experience Required:- 6 months to 5 years (with all the valid educational and experience document) Qualifications - Minimum full time Graduation Required (IT field) Note ;- No Gap in education and work experience Interested candidates mail your resume on amruta.kulkarni@varaunited.in/ aditya.powale@varaunited.in / chirag.vyas@varaunited.in OR Walk In on below address only on Friday, 11th October 2019 from 10.00 am to 02.00 pm Wipro Limited 2nd floor Premier IT Park, Road No.11, Marol MIDC Industry Estate, Andheri East, Mumbai - 400 069 Landmark - Above Subway & Saraswat Bank Contact Person:- Amruta Kulkarni- 9967559377","location":"Mumbai","experience":"0 - 5 Years"},{"date":"9, 10 - Oct - 2019","skills":"HR Generalist, Statutory Compliance, Payroll Processing, Leave Management, Exit formalities","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Iron Mountain (India) Private Limited, B-302, Timesquare Building, Opposite Mittal Industrial Estate Marol Andheri (East) Mumbai","phone":"09324166671","profile":"HR Executive \nIron Mountain (India) Private Limited","description":"Education- Any Graduate ( Under graduate with relevant experience can be considered) Minimum 2 to 3 years of experience in HR generalist is required Must have excellent communication & Excel skills Payroll and recruitment expertise required Job Type -on Contract for 1 year Location - Marol, Andheri (Mumbai) Salary- 18k to 22k CTC PM (as per the experience) Immediate joining is preferred. Job Responsibility:- 1. Recruitment 3. Time Office Management/ PMS management 4. Payroll Processing 5. Full & Final Settlement/ Exit Formalities 6. Leave Management 7. Statutory Compliance PF, PT, ESIC 8. Branch Co-ordination 9. MIS Reports - Salary & Manpower 10. Outsourcing Attendance & payroll co-ordination. Interested candidates kindly apply on Email id sushma.patil@ironmountain.com Or walk in on 09th & 10th October 2019 from 11:00 am to 4 pm on below address- Iron Mountain (India) Private Limited B-302, Timesquare Building, Opposite Mittal Industrial Estate Marol Andheri (East) Mumbai","location":"Mumbai","experience":"2 - 3 Years"},{"date":"9, 10, 11, 12 - Oct - 2019","skills":"HR/ Recruitment, Sourcing, Talent Acquisition, Interviewing, Time Management","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Dr. Mehta's Hospital, No. 2, Mc Nichols Road, 3rd Lane, Chetpet, Chennai - 600 031.","phone":"9500145616","profile":"HR Recruiter \nMehta Multispecialty Hospitals India Pvt. Limited","description":"Candidate should be Graduate/ MBA (HR) with 2 to 6 years of experience in HR/ Recruitment, Sourcing, Talent Acquisition, Interviewing, Time Management. Must have judgmental ability with good interpersonal skills Job Responsibility: 1. To stabilize recruiting requirements by studying organization objectives. 2. Update on Recent Recruitment Trends 3. To attract applicants by placing job advertisements, job portal, Employee referral, Social networks and Job Fair Walk-in Date/ Time: 9th - 12th October , 9 AM onwards Interview Venue: Dr. Mehta's Hospital, No. 2, Mc Nichols Road, 3rd Lane, Chetpet, Chennai - 600 031. Landmark Near: Chetpet Police Station","location":"Chennai","experience":"2 - 6 Years"},{"date":"10 - Oct - 2019","skills":"Technical Support, IT Helpdesk/ Service Desk, Customer Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Artech Infosystem Private Limited, Cyber Park, 1st floor, Block B, Plot No. 76-77, Electronic City Phase 1, Bangalore","phone":"Not Provided","profile":"Technical Support Executive \nArtech Infosystem Private Limited","description":"We are conducting a Walk In for an Executive IT Infrastructure on Thursday 10th October 2019 in between 1:00 PM - 6:00 PM IST in our office premises in Bangalore. Required Skill set: Minimum 1 Year experience in Desktop Support (Including Windows 7/Windows 10/Outlook/IP Phones/Skype/VPN Clients) Should have Excellent Communication Skills Soft personality Good Attitude Stability Job Location - Electronic City, Bangalore Work Timing will be Night Shift Only (PST Shift). Working Days - Monday to Friday Walk-in Interview on 10th October from 1 PM onwards Interview Venue: Artech Infosystem Private Limited Cyber Park, 1st floor, Block B, Plot No. 76-77, Electronic City Phase 1, Bangalore","location":"Bangalore","experience":"1 - 4 Years"},{"date":"10, 11, 12 - Oct - 2019","skills":"Technical Support, Customer Support, Networking/ Server Monitoring","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"HCL Technologies Limited, Surya Sapphire, Plot No. 3, Electronic City, Phase-1 Bangalore - 560 100","phone":"Not Provided","profile":"Data Center/ IT Support Engineer \nHCL Technologies Limited","description":"Candidate should be Any Technical Graduate with 1 to 3 years of experience in Technical Support, Customer Support, Networking/ Server Monitoring. Able to handling Global Customers. Must have strong verbal and written communication skills. Should be ready to work in 24X7 environments. rotating shifts & rotating weekly Offs. Will have to work in the current role for at least 18 months before any internal movement- Candidates from Data Center Monitoring background will be preferred Or trainable resource. Must have good event monitoring and co-relation skills. Good knowledge of IM/PM/CM etc-.(Preferred) Basic knowledge Of Unix/ Windows/ Backup will help for first level Support in few projects. ft is not mandatory that you will be troubleshooting each and every role. In most of the projects we have Catch and Dispatch SPOC for each and every business critical issue. Walk-in Details: Date: 10th to 12th October 2019 Time: 10:00 AM to 1:30 PM Interrview Venue: HCL Technologies Limited, Surya Sapphire, Plot No. 3, Electronic City, Phase-1 Bangalore - 560 100 Spoc : Shobana/ Shemona Documents to Carry (Mandatory)* Hard Copy of your updated Resume. Printout/ Screenshot of this walk-in One Government ID proof Xerox copy One Passport size photograph","location":"Bangalore","experience":"1 - 3 Years"},{"date":"9, 10 - Oct - 2019","skills":"Technical Support, International Voice Process, Customer Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Allsec Technologies Limited, 46 C, Velachery Main Road, Velachery, Chennai - 42 (Next to Velachery EB Office)","phone":"8124284995","profile":"Technical Support Associate \nAllsec Technologies Limited","description":"Educational Qualification: Any Graduation/ Diploma holder Age criteria: 18 - 27 Years Immediate Joining Must have good communication in English Fluent in Hindi /Kannada /Malayalam Technical / Non Technical Process Day Shift Interview Date: 9th and 10th October 2019. Timing: 10.00 AM to 5.00 PM Interview Venue: Allsec Technologies Limited, 46 C, Velachery Main Road, Velachery, Chennai - 42 (Next to Velachery EB Office)","location":"Chennai","experience":"0 - 1 Years"},{"date":"9, 10, 11 - Oct - 2019","skills":"Technical Support, Travel Process, Service Desk, Customer Support","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"SpiceJet Limited, Plot No. 319, Udyog Vihar, Phase-4 Gurugram, Haryana - 122 016","phone":"Not Provided","profile":"Customer Support Associate \nSpiceJet Limited","description":"We at SpiceJet Limited are conducting walk-in interviews for the position of Executive / Senior Executive in our Customer Experience Department on 9th to 11th October 2019 from 10:00 am till 12:00 noon (Wednesday - Friday) Educational Qualification: Graduate (Any Stream) Work Experience : 1- 5 Years Age Criteria - 23 - 30 Years Candidate must have excellent communication skills (verbal & written) Good working knowledge of Ms. Office (excel, PowerPoint, word) Strong decision making and problem solving ability Ability to work under pressure Qualities of being -Organized, Disciplined and Result Oriented Courtesy and professionalism to resolve customer issues with one call resolution Ability to be a change agent and bring about improvement in processes and procedures Comfortable with rotational shift Prior experience in customer service Benefits - Pick-Up/ Drop Facility Job Location: Gurugram Kindly report at the below mentioned address and do carry a copy of below listed documents: 1) PAN CARD 2) ADHAAR CARD/ PASSPORT/ VOTERS ID CARD 3) 10th, 12th & Graduation (Mark sheet/ Certificate) Dress Code - Formals Walk-in Date: 9th - 11th October 2019 (Wednesday - Friday) Timing- 10 am to 12 Noon Interview Venue- SpiceJet Limited Plot No. 319, Udyog Vihar, Phase-4 Gurugram, Haryana - 122 016","location":"Gurgaon","experience":"1 - 5 Years"},{"date":"9, 10 - Oct - 2019","skills":"IT Recruitment, Screening, Induction, Selection, Hiring, Mass Mailing","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Real Time Data Services Pvt. Limited, Plot No. 445, 4th Floor AIHP Horizon, Phase 5, Udyog Vihar, Sector 19, Gurugram - 122 015","phone":"0124-4507813","profile":"HR/ Recruitment Executive \nReal Time Data Services Pvt. Limited","description":"Candidate should have 0 to 3 years of experience in IT Recruitment, Screening, Induction, Selection, Hiring, Mass Mailing. Should have good working knowledge of job portals like: Naukri.com, IIMjobs and linkedin. Handling the complete Recruitment Life Cycle - Sourcing/Screening, Short-listing Profiles, Candidates Tracking and Follow-up, processing CV's, Updating / maintaining Internal Database Responsible to hire senior level for online marketing, sales department, server support, system administrator, VoIP Engineer, etc. Identifying potential candidates through various sources like Internal data-bank, Linked In, Job portals, Mass Mailing, Referencing, etc. to fill the vacancies and convincing them to apply for the jobs Profile sourcing according to departmental requirements Recruiting through job portals combined with various other sourcing technique Conduct first level interview (Telephonic) to check communication skills, domain skills, interest level, availability, salary, etc. Gathering pre-close information (candidate's present/ expected compensation, relocation issues, etc.) Following up with the candidates till he/she is on board Maintaining good Pipeline for the open positions Release offer letters to candidates post final selection approval from the recruitment manager Preparing weekly and monthly reports on End to End recruitment process. Impart Induction to the new joiners Maintaining files of all employees Walk-in Date/ Time: 9th October - 10th October , 10 AM onwards Interview Venue: Real Time Data Services Pvt. Limited Plot No. 445, 4th Floor AIHP Horizon, Phase 5, Udyog Vihar, Sector 19, Gurugram - 122 015","location":"Gurgaon","experience":"0 - 3 Years"},{"date":"12 - Oct - 2019","skills":"Sharepoint, C#, CSOM, HTML5, Jquery, JSOM, Javascript","qualification":"B.E./B.Tech, MCA/PGDCA","address":"HCL Technologies Limited, A-11, Sector-16, Noida. Landmark- Behind Mcdonalds/ Post office","phone":"Not Provided","profile":"Sharepoint/ .Net Developer \nHCL Technologies Limited","description":"We are looking for Sharepoint Developer responsible for the development and maintenance of applications aimed. Resource will be working alongside other engineers and developers working on different layers of the infrastructure. Therefore, a commitment to collaborative problem solving, sophisticated design, and the creation of quality products is essential. Required Skills: o SharePoint features, SharePoint Object Modal, SharePoint Rest API o C#, CSOM o HTML5 o Jquery, JSOM , Javascript o Sharepoint designer Walk-in Date - 12th October 2019 (Saturday) Time: 10 Am - 1 Pm Interview Venue- HCL Technologies Limited A-11, Sector-16, Noida Landmark- Behind Mcdonalds/ Post office Contact Person - Hrishikesh Singh Please carry your updated resume and one Govt. ID proof In case of any query please write me on hrishikeshsin@hcl.com","location":"Noida","experience":"3 - 7 Years"},{"date":"12 - Oct - 2019","skills":"ADO .NET, ASP .NET, C#, VB .NET, SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Exela Technologies, 4th floor, Rayala Techno Park, OMR Kandanchavadi, Chennai - 96. Land mark: Behind Turyaa Hotel","phone":"9384047478","profile":".Net Developers \nExela Technologies","description":"We at Exela Technologies are hiring Dot Net Developers & Senior Dot Net Developers Candidate should have good hands-on expertise in Programming Concepts. Ability to think logically and solve basic problems. Expertise in .NET Framework with any of the following: ADO .NET, ASP .NET, C#, VB .NET (Windows/ Web Applications) with strong exposure to SQL Server Good coding techniques. Proven experience in working on a large-scale Web/Data Applications. Ability to work on multiple projects with strict deadlines. Good experience in Front-End UI Design required. Exposure in MVC Architecture an added advantage. You can walk-in for an interview @ our office on 12th October 2019 (Saturday) between 10.00 am & 5.00 pm in below address- Venue Details: Exela Technologies 4th floor, Rayala Techno Park, OMR Kandanchavadi, Chennai 96. Land mark: Behind Turyaa Hotel | Next to IGP Bus stop (Kandanchavadi) If interested In-box your profile to vaishnavi.mohan@exelaonline.com Or reach me 9384047478 for a discussion","location":"Chennai","experience":"2 - 6 Years"},{"date":"12 - Oct - 2019","skills":".Net, JS Frameworks (Angular/ React) SCRUM/ Agile Framework MVC","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Synergy Technology Services Pvt. Limited, 504 Acropolis, Military Road, Marol, Andheri (East), Mumbai - 400 059","phone":"Not Provided","profile":"Full Stack .Net Developer \nSynergy Technology Services Pvt. Limited","description":"Candidate should have 5 to 9 years of hands on experience with relational databases JS Frameworks (Angular/ React) SCRUM/ Agile Framework MVC Application integration via Web services/ APIs Job Location: Andheri (Sahar Road) Walk-in Date/ Time: 12th October 2019, 9 AM onwards Interview Venue: Synergy Technology Services Pvt. Limited 504 Acropolis, Military Road, Marol, Andheri (East), Mumbai - 400 059","location":"Mumbai","experience":"5 - 9 Years"},{"date":"10, 11 - Oct - 2019","skills":"C#, ASP .NET, JQuery, MS - SQL Server","qualification":"B.E./B.Tech","address":"MPS Limited, HMG Ambassador 137, Residency Road Bangalore - 560 025. Landmark: Opp. Bangalore Club, Before Mahesh Lunch Home","phone":"080 4178 4000","profile":"ASP .Net Developer \nMPS Limited","description":"Candidate should have 1 to 3 years of experience in C#, ASP .NET, JQuery, MS - SQL Server. Solid knowledge of user interface design, usability methodology, information architecture, industry standards and trends, platform and browser capabilities. Analyzing and gathering requirements for the framework and creating a design for the final software output. Walk-in Date : 10th & 11th October 2019 Timings: 10.00 am to 3.00 pm Venue: MPS Limited HMG Ambassador 137, Residency Road Bangalore - 560 025 Landmark: Opp. Bangalore Club, Before Mahesh Lunch Home Boardline No. : 080 4178 4000/ 4013","location":"Bangalore","experience":"1 - 3 Years"},{"date":"12 - Oct - 2019","skills":"ASP. NET, MVC, Web Services using C# .Net","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Trantor Software Private Limited, Plot G-9, Rajiv Gandhi Technology Park, Phase - I, Chandigarh","phone":"Not Provided","profile":".Net Developer \nTrantor Software Private Limited","description":"Candidate should have 3 to 8 years of experience with ASP. NET web-based applications (preferably some MVC) and web services using C# .Net with good understanding of Object-Oriented Design and Design Patterns. Must have good problem solving, debugging & troubleshooting skills. Walk-in Date/ Time: 12th October 2019, 10 AM onwards Interview Venue: Trantor Software Private Limited Plot G-9, Rajiv Gandhi Technology Park, Phase - I, Chandigarh","location":"Chandigarh","experience":"3 - 8 Years"},{"date":"18, 19 - Oct - 2019","skills":"ASP .Net, C#, Web Application, MS SQL Programming and XAMARIN","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Cruxzen Technologies Private Limited, 5, Vijay Complex, S.No. 77/1/7, Near Sai Chowk, New Sangavi, Pune Maharashtra - 411 027","phone":"8408856557","profile":"Software Developer (.Net) \nCruxzen Technologies Private Limited","description":"Looking for Fresh to experience dynamic candidates for software development. Design, Development of ASP .Net C# web application. Candidate should have done C# .Net Certification after graduation. Mobile app development would be added advantages. Should not have an education gap. DOB should be after 1/1/1994 Should ready to work at the client location Handson MS SQL programming and XAMARIN must Should have C# .Net certificate for fresher Mobile app programming Xamarin App. Walk-in Date/ Time: 18th - 19th October 2019, 11 AM onwards Interview Venue: Cruxzen Technologies Private Limited 5, Vijay Complex, S.No. 77/1/7, Near Sai Chowk, New Sangavi, Pune Maharashtra - 411 027","location":"Pune","experience":"0 - 3 Years"},{"date":"14 - Oct - 2019","skills":"Java, .Net, C#, Angular Js, Node.js, React Js, C++","qualification":"B.E./B.Tech, B.Sc, BCA/BCS","address":"DevCool Technologies Private Limited, #C 607A, Teerth Technospace, Behind Mercedes showroom, Bangalore - Mumbai Highway, Baner, Pune - 411 045.","phone":"Not Provided","profile":"Developer Fresher (JAVA & .Net) \nDevCool Technologies Private Limited","description":"QUALIFICATION: Degree in BE/ B.Tech/ BCA Passout Year: 2017 & 2018 Experience - FRESHER JOB RESPONSIBILITY: Work with developers to design algorithms and flowcharts Develop specification-based codes Integrate software components and third-party programs Ability to write programs on one or more technologies (Java, .Net, C#, Angular Js, Node.js, React Js, C++) Basic knowledge of Cloud. Verification and deployment of Systems and Programs Troubleshoot, debug and upgrade existing software Gather and evaluate user feedback Recommend and execute improvements Create technical documentation for reference and reporting Process: Aptitude Test & F2F Interview Job/ Interview Location: PUNE Walk-in Date/ Time: 14th October 2019, 9 AM onwards Interview Venue: Devcool Technologies Private Limited #C 607A, Teerth Technospace, Behind Mercedes showroom, Bangalore - Mumbai Highway, Baner, Pune - 4110 45.","location":"Pune","experience":"0 - 1 Years"},{"date":"10, 11 - Oct - 2019","skills":"C#, ASP .Net MVC, Javascript, JQuery, MS SQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Fintellix Solutions Private Limited, #5-10, 17H Main Road. KHB Colony, Koramangala, 5th Block, Bangalore - 560 095","phone":"080-40589404","profile":".Net Developer \nFintellix Solutions Private Limited","description":"We are conducting Walk in interviews for .Net Developer position for the below skills. Interested candidates can directly walk in for interview on the below mentioned dates. 1) Software Developer Good knowledge of C#, ASP .Net MVC, Javascript, JQuery and Dependency Injection Good knowledge of MS SQL Good knowledge of designing REST based API and deployment thereof under Docker environment. Good knowledge of GIT/ TFS 2) Full Stack Developer Good knowledge of C#, .Net Core, Angular 2+, SOLID Principles, NODEJS Good knowledge of MS SQL Good knowledge of designing REST based API and deployment thereof under Docker environment. Good knowledge of GIT/ TFS 3) Sr. Software Developer Good knowledge of C#, ASP .Net, HTML and Javascript Good knowledge of MS SQL Good knowledge of designing REST based API Good knowledge of GIT/ TFS Walk-i Date/ Time: 10th October - 11th October, 11 AM onwards Interview Venue: Fintellix Solutions Private Limited #5-10, 17H Main Road. KHB Colony, Koramangala, 5th Block, Bangalore - 560 095 Landmark: Next to Indian Overseas Bank/ Krishna Temple","location":"Bangalore","experience":"2 - 6 Years"},{"date":"11 - Oct - 2019","skills":"Asp .Net, C# .Net, Java Script, HTML, CSS and MySQL/ MS SQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"eMudhra Limited, 3rd Floor, Sai Arcade, Above passport office , Outer Ring Road, Devarabeesanahalli, BANGALORE, Karnataka - 560 103. Landmark : Opposite to Intel","phone":"080-42275316","profile":".Net Developer \neMudhra Limited","description":"Immediate opportunity for .Net developers with eMudhra Limited @ Bangalore location Work Experience: 2 to 4 Years Key Skills: Asp .Net, C# .Net, Java Script, HTML, CSS and MySQL/ MS SQL Notice Period: Immediate/ 15-30 days Interested candidates who are willing to attend the interview can drop the resume to ramya.c@emudhra.com or can reach on 080-42275316 Walk-in Date/ Time: 11th October 2019, 9 AM onwards Interview Venue: eMudhra Limited 3rd Floor, Sai Arcade, Above passport office , Outer Ring Road, Devarabeesanahalli, BANGALORE, Karnataka - 560 103 Landmark : Opposite to Intel","location":"Bangalore","experience":"2 - 4 Years"},{"date":"11 - Oct - 2019","skills":"C, C++, JAVA Programming skills","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Koenig Solutions Private Limited, A-55,2nd Floor, KLJ Complex-II, Plot No. 70, Opp. Police Station, Moti Nagar, New Delhi - 110 015","phone":"8826655199","profile":".Net Developer \nKoenig Solutions Private Limited","description":"Candidate should have atleast 6 months of experience in ASP .Net 3.5, 4.0, 4.5 with C# SQL Server, Javascript, jQuery, Reporting Services, Web Services, WCF, HTML Maximum experience upto 7 years. Responsible for developing web based internal systems of the organization using ASP .Net A challenging position to prove and learn a lot since company is working on automation of all departments Walk-in Date/ Time: 10th October 2019, 10 AM onwards Interview Venue: Koenig Solutions Private Limited A-55,2nd Floor, KLJ Complex-II, Plot No. 70, Opp. Police Station, Moti Nagar, New Delhi - 110 015","location":"Delhi","experience":"0 - 7 Years"},{"date":"9, 10, 11, 12, 14, 15, 16, 17, 18 - Oct - 2019","skills":"ASP .Net, C# / VB .Net, MVC architecture, SQL Server and LINQ","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Northern Lights Technology Development Pvt. Limited, 334 OMR, Futura Tech Park Block B, 1st Floor, Sholinganallur, Chennai","phone":"9384080470","profile":".Net Developer \nNorthern Lights Technology Development Pvt. Limited","description":"Person must have 2 to 7 years of experience in web application development. Experience of ASP .Net, C#/ VB .Net, MVC architecture, SQL Server and LINQ Entity Framework will be a plus. Good communication skills (written and verbal) Should be able to join in short notice of max 30 days Walk-in from 9th to 18th October (Weekdays only) between 10:00 AM - 5:00 PM Interview Venue: Northern Lights Technology Development Pvt. Limited 334 OMR, Futura Tech Park Block B, 1st Floor, Sholinganallur, Chennai Phone No: 9384080470","location":"Chennai","experience":"2 - 7 Years"},{"date":"12 - Oct - 2019","skills":"Automation testing - Selenium, Java & JavaScript","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Hexaware Technologies Limited, SEZ, Plot No. 19, Rajiv Gandhi Infotech Park Phase III, MIDC, Hinjewadi, Pune - 411 057","phone":"Not Provided","profile":"Automation/ Selenium Tester \nHexaware Technologies Limited","description":"Hexaware Technologies Limited is looking for Automation testing - Selenium Java professionals with 4 to 10 years of experience. Required Skills- Good Selenium resource with Java Should have minimum 4 year of experience in Java & JavaScript Should have hands on experience in BDD/ Behavior-Driven Development framework like Cucumber, JBehave. Should have experience in Agile Methodologies Experience in Junit are highly preferred. Expertise in debugging code and exception handling Good knowledge in API calls through jar and capture response Fair understanding of Automation Test plan/ Strategy Knowledge in SQL is added advantage Preferred Immediate Joiners Open to work in 2nd shifts (1 pm -10 pm) Should have good English communication skills Walk-in Date: 12th October 2019, 9 AM onwards Time: 9.00 am - 1.00 pm Interview Venue: Hexaware Technologies Limited, SEZ, Plot No. 19, Rajiv Gandhi Infotech Park Phase III, MIDC, Hinjewadi, Pune - 411 057 Contact Person: M. Dhamodaran Please forward your resumes to DhamodaranM@hexaware.com","location":"Pune","experience":"4 - 10 Years"},{"date":"12 - Oct - 2019","skills":"Software Testing, Automation Testing, Selenium","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Hinduja Tech Limited, SKCL Triton Squaer Unit C3 to C7, TVK industrial Estate, Guindy, Chennai - 600 032","phone":"66691051","profile":"Automation Testing Engineer \nHinduja Tech Limited","description":"Candidate should have good working experience in Selenium, Protractor to automate Java & Angular JS Applications. Should possess strong working experience in Agile SCRUM. Should have knowledge on API Automation. Should be well versed in understanding complex SQL queries. Hands on experience in JIRA Tool. Exposure to AWS & GCP Cloud. Knowledge on Test Automation Solution Integration in CI/CD Pipeline Responsible for defining the testing strategy for the project while working on continuous quality improvements. Should have working knowledge on building automation framework, reusable assets. Ability to analyse the given requirement and propose test design solution. Should be flexible and support in different shifts. Walk-in Date/ Time: 12th October from 9 AM onwards Interview Venue: Hinduja Tech Limited SKCL Triton Squaer Unit C3 to C7, TVK industrial Estate, Guindy, Chennai - 600 032","location":"Chennai","experience":"4 - 6 Years"},{"date":"9, 10, 11 - Oct - 2019","skills":"Automation (Selenium), Core Java, Create Test Cases","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"GSR Business Services Private Limited, 2nd Floor, West Wing, Khivraj Building, Plot No.6, Electrical & Electronic Industrial Estate, Perungudi, Chennai - 600 096","phone":"8870476197","profile":"Automation Test Engineers \nGSR Business Services Private Limited","description":"Candidate must have minimum 2+ years work experience in Automation (Selenium) Must have strong experience in Core Java Ability to create Test Cases Should be strong in OOPS Concept Core Java programming experience is an added advantage Should have done complete end to end testing & Debugging Walk-in Date: 9th - 11th October 2019 Timings - 10:00 AM to 4:00 PM Interview Venue- GSR Business Services Private Limited 2nd Floor, West Wing, Khivraj Building, Plot No.6, Electrical & Electronic Industrial Estate, Perungudi, Chennai - 600 096 Contact Email - muthukrishnan@gsr-inc.com Mobile No - 8870476197","location":"Chennai","experience":"2 - 7 Years"},{"date":"10 - Oct - 2019","skills":"Selenium/ Software Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Infosys SEZ Campus, Building- 7, Hyderabad Pocharam - 50 008","phone":"Not Provided","profile":"Selenium/ Testing Engineer \nInfosys BPM Limited","description":"Infosys BPM Limited is hiring for Multiple Technology Skills - Hyderabad on 10-October 2019 (Thursday) Experience : Minimum 2 to 3 years of relevant experience Qualification : Any graduate with full-time education Shifts: Should be flexible for 24*7 Shifts Skills/ Technologies: AS400/ Mainframe Application Support, SAP ABAP, Peoplesoft, UFT, TOSCA, Selenium, .Net , Angular Js, react JS, ADA testing Job Responsibilities: Update existing tests/ Create new tests in the automation test suite (using Selenium). Write test planning documentation from requirements specifications. Review all testing documents and other test-related documentation. Run functional and non-functional tests. Liaise with developers during the Software Development Life Cycle (SDLC). Provide estimates for test activities. Selenium with HP ALM/Quality center is mandatory Interview Date: 10th October 2019 (Thursday) Time: 10:30 AM To 12:30 PM Interview Venue: Infosys SEZ Campus, Building- 7, Hyderabad Pocharam - 50 008 Point of Contact: Sunith Ashray Note: Reference DS-Mahadev Vamsi (mention on top of your CV before submit your candidature) Please ask your friends /Colleagues also to walk for the drive if their profile matches the requirement.","location":"Hyderabad","experience":"2 - 3 Years"},{"date":"11 - Oct - 2019","skills":".Net or Automation Testing","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Tata Consultancy Services Limited, TCS Centre Info park Campus, Kakkanad, Kochi- 682042","phone":"Not Provided","profile":".Net and Testing Professionals \nTata Consultancy Services Limited","description":"1. Graduate (or) Post Graduate with (2 to 5 years) experience in .Net or Automation Testing can apply. 2. Minimum 15 years of regular education (10th + 12th + 3 years Graduation) 3. Graduates through Open Universities / Correspondence graduates need not apply 4. Not more than 2 years of gap in Graduation or Employment. 5. Relieving letters from all the previous companies are mandatory. 6. Candidates who have attended the selection process in the last 6 months will not be eligible to apply again. Interview Date: Friday (11th-Oct-2019) Time: 9:00 AM to 11.00 AM Interview Venue: Tata Consultancy Services Limited TCS Centre Info park Campus, Kakkanad, Kochi- 682042 Contact Person: Nithya/ Dayanithi Mandatory Requirements (How to generate your EPCN) EPCN number is mandatory for eligibility of the interview. Follow the below steps to register and mention the EPCN number on your resume Step 1: Go to link www.careers.tcs.com Step 2: Select India geography & next click on Experienced Professionals link Step 3: Go to Create your profile (For New Users) link & fill the details. (Please select area of interest as BPS) Step 4: You will get the EPCN number & Password to your personal e-mail ID. Please carry any GOVT original ID (voters ID/ PAN CARD/ driving license) for your identity purpose & Invite mail. TCS does not charge any fee at any stage of the recruitment & selection process. TCS has not authorized any person/agency/partner to collect any fee for recruitment from candidates. If at all you notice the above please bring it to our attention immediately","location":"Kochi","experience":"2 - 5 Years"},{"date":"9 - Oct - 2019","skills":"HR Administration/ HR Functions, Office Administration","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Kotak Mahindra Life Insurance Company Limited, Ground Floor Chintamani Plaza Andheri Kurla Road Chakala, Andheri (East) Mumbai - 400 099","phone":"Not Provided","profile":"HR Executive \nKotak Mahindra Life Insurance Company Limited","description":"Work Experience: 0 - 2 Years Skills in MS Excel is an added advantage Work Location: Chakala, Andheri (East) Coordination & Processing the details in system (Final Selection - Documentation -Offer Generation- Joining E code generation) Helping in online boarding of New Joinee Co-ordination with stakeholders & business managers Handling routine queries Post-Joining co-ordination Generating Employee Referral from New Joiners Maintaining data & Publishing reports Walk-in Date/ Time: 9th October 2019, 9 AM onwards Interview Venue: Kotak Mahindra Life Insurance Company Limited Ground Floor Chintamani Plaza Andheri Kurla Road Chakala, Andheri (East) Mumbai - 400 099","location":"Mumbai","experience":"0 - 2 Years"},{"date":"7, 8, 9, 10, 11, 12, 14 - Oct - 2019","skills":"HR/ hiring, Recruitment, Mass hiring, Bulk hiring/ Volume hiring","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Tech Mahindra Limited, Ground Floor Acropolis Mall Thaltej, Ahmadabad","phone":"7984995697","profile":"Assistant Manager - Recruitment \nTech Mahindra Limited","description":"Candidate must be a Graduate (Any) Should have 8 years of total experience and 4+ bulk hiring experience in BPO Must have excellent communication skills Vendor Management Work on Job portals Documentation & Offer Closure Must be comfortable to work for 6 days a week Walk-in Date/ Time: 7th October - 14th October , 10 AM onwards Interview Venue: Tech Mahindra Limited Ground Floor Acropolis Mall Thaltej, Ahmadabad Contact Peron: Ashish Gupta - Email- AG00587827@TechMahindra.com Note:- Please carry Original Govt. ID proof (Aadhar) for the interview","location":"Ahmedabad","experience":"4 - 9 Years"},{"date":"8, 9, 10, 11 - Oct - 2019","skills":"Agent Recruitment, HR, Agent Sourcing","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Voltech HR Services Private Limited, Voltech Eco Tower, #2/429, Mount Poonamallee Road, Ayyappanthangal, Chennai - 600 056","phone":"7824066620","profile":"HR Executive/ Recruiter \nVoltech HR Services Private Limited","description":"Good communication and leadership quality End to end recruitment Willing to join immediately Should be confident. Hindi speaking will be added advantage Preferred Immediate Joinee Walk-in Date/ Time: 8th October - 11th October , 10 AM onwards Interview Venue: Voltech HR Services Private Limited Voltech Eco Tower, #2/429, Mount Poonamallee Road, Ayyappanthangal, Chennai - 600 056. Contact No. 7824066620/ 7824066606 Email: divya.s@voltechgroup.com","location":"Chennai","experience":"0 - 3 Years"},{"date":"7, 8 - Oct - 2019","skills":"Non Voice Process, Back end Operations","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Cognizant Technology Solutions (I) Limited, 4th floor, ISH Building, Hinjewadi Phase 1 Pune - 411 014","phone":"Not Provided","profile":"Process Executive (Non Voice) \nCognizant Technology Solutions India Ltd.","description":"Designation: Process Executive / Senior Process Executive - Non Voice Educational Qualification: Any graduate (Experience in Property & Casualty) Freshers-Graduation: B.com/ BBA/ BMS/ M.com/ MMS (2017, 2018, 2019 pass outs only) Work Experience: 0-4 Years Package: Will be discussed during the Interview Process Industry: ITES / BPO Eligibility: Candidate should have excellent communication skills Should be Interested to work in Insurance Domain. Should be interested to work in any of the night shifts Must have minimum 15 years of education Drive Date: 7th & 8th October 2019 Drive Time: 11 AM - 1 PM Venue Details: Cognizant Technology Solutions (I) Limited 4th floor, ISH Building, Hinjewadi Phase 1 Pune - 411 014 POC: Poppy/ Jash","location":"Pune","experience":"0 - 4 Years"},{"date":"9, 10, 11 - Oct - 2019","skills":"Front Office/ Front Desk Operations, Office/ Administration, Insurance Claims Processing","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Saritha Dental Clinic LLP, Plot No-1, Netaji Nagar, Kapra, Sainikpuri, Hyderabad","phone":"Not Provided","profile":"Front Office Executive \nSaritha Dental Clinic LLP","description":"Candidate should be Any Graduate with 1 to 4 years of experience in Front Office/ Front Desk Operations, Office/ Administration, Insurance Claims Processing. Must have excellent communication skills Job Responsibility- Attend to patients on the phone and in person.Coordinate and organize appointments and administration to facilitate the efficient running of the dental office. greet patients register new patients according to established office protocols assist patients to complete all necessary forms and documentation verify and update patient information inform patients of dental office procedures and policy Walk-in Date/ Time: 9th October - 11th October , 11 AM onwards Interview Venue: Saritha Dental Clinic LLP Plot no-1, Netaji Nagar, Kapra, Sainikpuri, Hyderabad","location":"Hyderabad","experience":"1 - 4 Years"},{"date":"9 - Oct - 2019","skills":"Java, UI framework like Angular or React JS","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Extramarks Education India Pvt. Limited, D-180, Sector 63 Noida - 201 301","phone":"Not Mentioned","profile":"Java Developer \nExtramarks Education India Pvt. Limited","description":"Candidate should have Bachelors/ Masters Degree in Computer Science or related field with 3+ years of experience in Java. Knowledge of at least one UI framework like Angular or React JS. Solid knowledge of Computer Science fundamentals (object-oriented design, data structures and algorithm design) Knowledge of professional software engineering best practices for the full software development life cycle Strong analytical skills, with excellent problem solving abilities Experience building and operating scalable infrastructure software or distributed systems Understanding of performance challenges and their solutions Knowledge and hands-on experience with Unit testing through testing frameworks like JUnit, Mockito. Experience with search engines like ElasticSearch or SOLR Strong verbal and written communication skills Experience and knowledge of cloud services like AWS Walk-in Date/ Time: 9th October 2019, 11 AM onwards Interview Venue: Extramarks Education India Pvt. Limited D-180, Sector 63 Noida - 201 301","location":"Noida","experience":"3 - 6 Years"},{"date":"9, 10, 11, 12, 14, 15, 16 - Oct - 2019","skills":"Dispatch, Logistics, Supply Chain, Warehouse Management, Outward/ Inward Clearing","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"FabAlley High Street Essentials Pvt. Limited, C-11 Sector 7 Noida - 201 301","phone":"Not Provided","profile":"Warehouse Executive (Male Only) \nFabAlley High Street Essentials Pvt. Limited","description":"Educational Qualification: Graduate or above (Any specialization) Experience: Minimum 2 years experience as a warehouse/ Logistics executive. Good knowledge of excel and other software and systems Driven and capable of handling the entire supply chain function AGE LIMIT TILL 30 YEARS. should have both Warehouse & Logistics experience Job Responsibilities- Will handle SCM end-to-end starting from inward of products in the warehouse to delivery to returns, Take stock of items and prepare Inventory sheets Generate daily pick lists from the system and coordinate with packers to get all orders ready Coordinate daily pickup with courier companies including preparation of manifest and despatch sheet Handle a team of packers to ensure all products are QC cleared, packed properly and despatched to the right customer. Walk-in Date/ 9th October - 16th October 2019 Time: 11 AM-5 PM (Sunday Off) Interview Venue: FabAlley High Street Essentials Pvt. Limited C-11 Sector 7 Noida - 201 301","location":"Noida","experience":"2 - 5 Years"},{"date":"9, 10, 11, 12 - Oct - 2019","skills":"HR Administration/ HR Functions, Joining Formalities Documentation","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Life Force Homeopathy India Pvt. Limited, 411, Krushal Commercial Complex, Above Shoppers Stop, G. M. Road, Chembur, Mumbai, Maharashtra - 400 089","phone":"022-66888888","profile":"HR Assistant (Female) \nInogic Tech (India) Private Limited","description":"We have an urgent opening for an HR Assistant for Healthcare Company Qualification - Graduate with Experience Fresher MBA - Specialised in HR Must have excellent communication skills Preferable Female Candidate Job Responsibilities: 1. Recruitment : Sourcing Shortlisting Scheduling 2. On- Boarding : Joining Formalities Documentation 3. Assisting Senior for Employee Engagement Activities Shift timings - 10.00 am to 7.00 pm Job Location - Chembur/ Ghatkopar Salary - 15 to 18k gross Walk-in Date/ Time: 9th October - 12th October , 11 AM onwards Interview Venue; Life Force Homeopathy India Pvt. Limited 411, Krushal Commercial Complex, Above Shoppers Stop, G. M. Road, Chembur, Mumbai, Maharashtra - 400 089","location":"Mumbai","experience":"0 - 2 Years"},{"date":"12 - Oct - 2019","skills":"JAVA/ J2EE, Servlet, JSP, HTML5, CSS, JQuery, JavaScript and AJAX","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Concerto Software & Systems Pvt. Limited, Building No. 305, 2nd Floor, A-Wing, Sector 2, Millennium Business Park, Mahape, Navi Mumbai - 400 710","phone":"Not Provided","profile":"Java Developer \nConcerto Software & Systems Pvt. Limited","description":"Candidate should have 1.5 to 7 year experience on JAVA/ J2EE projects. Should have experience working on Spring MVC & Spring Core. Should have worked on complex applications with performance considerations Candidate must have expertise in Core Java Should have worked on Servlet, JSP, HTML5, CSS, JQuery, JavaScript and AJAX Should have worked on Hibernate. Should have worked in n-Tier applications Should have worked on MS SQL / Oracle and should have experience in writing queries. Candidate must have payment domain exposure. Good requirement understanding skills Walk-in Date: 12th October 2019 Time: 10 AM to 3 PM Interview Venue- Concerto Software & Systems Pvt. Limited Building No. 305, 2nd Floor, A-Wing, Sector 2, Millennium Business Park, Mahape, Navi Mumbai - 400 710","location":"Mumbai","experience":"1 - 7 Years"}]}