{"Walkins":[{"date":"2 - Feb - 2021","skills":"MIS Preparation, Excel, MIS, VLOOKUP, MS Office","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"IndusInd Bank Limited, 3rd Floor, Tower-C, Sewa Tower, Udyog Vihar-IV, Gurugram, Haryana","phone":"Not Provided","profile":" MIS Executive \nIndusInd Bank Limited","description":"Candidate should be Any Graduate with 1 to 5 years of experience into MIS preparation Must have good communication skills. Roles and Responsibilities- Responsible for updating, retrieving, and maintaining information & data in a systematic manner Use MS office & other software to input data, including data that are related to Company Reports, Past Updating, retrieving, and maintaining information & Data in a systematic manner Use MS office & other software to input data, including data that are related to Company Reports, Past Sales etc. Master and own the monthly deliverables in the form of reports & presentations and send quality output in a timely manner. Maintain an accurate, complete, up-to-date and insightful Data to be shared with senior management Stakeholder Management: Engage with the stakeholders to understand the requirement, and present final output as per the requirement Be directly accountable for work conducted and perform quality checks on all reports for alignment to request, accuracy and correctness. Display a high sense of accountability and presence of mind when completing requests with high visibility or tight turnaround times and communicate effectively Walk-in Date/ Time: 2nd February 2021, 10.30 AM - 3.30 PM Venue Details- IndusInd Bank Limited, 3rd Floor, Tower-C, Sewa Tower, Udyog Vihar-IV, Gurugram, Haryana Contact - Talha Asif  ","location":"Gurgaon","experience":"1-5Years"},{"date":"1 - Feb - 2021","skills":"HR/ Recruitment, Talent Acquisition, Payroll, Statutory/ Legal Compliance","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Bandhan KOnnagar, DN- 34, Saltlake Sector- V, Near College More, Kolkata- 700 091.","phone":"9749312276","profile":" HR Executive (Male Only) \nBandhan KOnnagar","description":"Candidate should be MBA with minimum 2 years experience in Human Resources specially in compliance and payroll. Male candidate only apply Walk-in Date/ Time: 1st February 2021, 9.30 AM - 5.30 PM Venue Details- Bandhan KOnnagar DN- 34, Saltlake Sector- V, Near College More, Kolkata- 700 091. Contact - Aniket Mukherjee ( 9749312276 )  ","location":"Kolkata","experience":"2-5Years"},{"date":"1 - Feb - 2021","skills":"Front desk/ Receptionist Activities, Front Office Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Marine Electricals (India) Limited, B-1, Udyog Sadan-3, M I D C, Marol Industrial Area, Andheri East, Andheri East, Mumbai - 400 093.","phone":"022-40334355","profile":" Front Office Executive/ Receptionist \nMarine Electricals (India) Limited","description":"Candidate should be presentable & have good communication skills, MS Office. Qualification: Any Graduate Work Experience: 1 to 4 Years Job Location: Mumbai Job Responsibilities- Handling Receptionist profile, Provide basic and accurate information in-person and via phone/ email Greet and welcome guests as soon as they arrive at the office. Walk-in Date/ Time: 1st February 2021, 11.30 AM - 4.00 PM Venue Details- Marine Electricals (India) Limited B-1, Udyog Sadan-3, M I D C, Marol Industrial Area, Andheri East, Andheri East, Mumbai - 400 093. Landmark: Opposite SEEPZ gate number 1/ SEEPZ bus depot / Domino's Pizza Bldg. Bus from Andheri stat Contact - Snehal ( 022-40334355 )  ","location":"Mumbai","experience":"1-4Years"},{"date":"1 - Feb - 2021","skills":"Invoice Processing, Non Voice Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"AnnexMed Private Limited, Sree Narayana Complex, No. 29, Sarathy Nagar, Velachery, Chennai, Tamil Nadu - 600 042.","phone":"8056564376","profile":" Invoice Process Executive/ Fresher \nAnnexMed Private Limited","description":"AnnexMed Private Limited, is looking for Invoice Process Executive/ Freshers Immediate joiners freshers are apply now. Desperately looking for Corporate job Willing to work in Rotational shifts and Night shift Immediate joiners expected Walk-in Date/ Time- 1st February 2021, 9.30 AM - 5.30 PM Venue Details: AnnexMed Private Limited Sree Narayana Complex, No. 29, Sarathy Nagar, Velachery, Chennai, Tamil Nadu - 600 042. https://goo.gl/maps/be5KMqmrZerHH4mN6 Please bring a copy of your resume along with your Degree Xerox copies. Please send an Acknowledgement email for a confirmation. We look ahead to seeing you. Note: If the date & time of the interview is not convenient, please contact me by phone (Saranya-8056564376) to assemble another appointment.  ","location":"Chennai","experience":"0-1Years"},{"date":"1 - Feb - 2021","skills":"Non Voice Process, Back Office Operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"International InfoTech Park, Above Vashi Railway Station, Tower No 1, 4th floor, Vashi Navi Mumbai - 400 703","phone":"022-67841000","profile":" Non-Voice/ Back Office Executive \nHinduja Global Solutions Limited","description":"It's our privilege in notifying that we have immediate openings for Back office Executive at Hinduja Global Solutions, Mumbai Eligibility Criteria:- 1) Candidates should be Graduate (Compulsory) 2) Any Graduates No BE/ B.Tech Transport Boundaries- Wadala Byculla Panvel Dombivli Salary Offered: 1,94,000 L.P.A Take home 11,451 After 6 months: 6000 Bonus / No of working Day is 5 Job Responsivity:- 1) Non-Voice/ Back Office Process 2) Good Communication Skills in English, Hindi. 3) 9 working hours inclusive of 1hrs break. 5 working days and Saturday and Sunday off Needs to be in compliance with all the operational requirements and work as per the company's norms and policies. 4) Flexible to work in Shifts (24*7 Shift) (Day and Night) Transport Provided. 5) Candidates with Passport will be given high priority. Office Location:- International InfoTech Park, Above Vashi Railway Station, Tower No 1, 4th floor, Vashi Navi Mumbai - 400 703 NOTE - Write 'Supriya' on resume if you have read this posting & attending the Interview.  ","location":"Mumbai","experience":"0-1Years"},{"date":"1, 2, 3, 4, 5, 6, 8, 9, 10, 11, 12, 13, 15, 16, 17, 18, 19, 20, 22, 23, 24, 25, 26 - Feb - 2021","skills":".Net framework, C#, ASP .Net, MVC & MS SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA","address":"ICREA Infotech Private Limited, First Floor, Lumbini Rockdale Beside Eenadu Office, Opposite to Kshetra Restaurant Khairtabad","phone":"9985036368","profile":" Software Engineer/ .Net Fresher \nICREA Infotech Private Limited","description":"The ideal candidate must have knowledge on .Net framework, C#, ASP .Net, MVC & MS SQL Server. Strong knowledge in OOPS. Angular native will be an added advantage. Required Skill set: Trained fresher in .Net framework, C#, ASP .Net, MVC & MS SQL Server Fair knowledge in software engineering - Software development life cycle HTML, Java Script, JQuery, Angular and Ajax will be an added advantage Good attitude and aptitude. Quick learning and listening abilities. Good verbal and written communication. Machine Learning The ideal candidate will have Knwoledge in the latest techniques in Artificial Intelligence, Machine Learning (including Deep Learning approaches) Knowledge with Deep Learning frameworks would be a big plus Job Responsibilities: Programming experience in Python or R Design and develop machine learning algorithms Background in machine learning frameworks such as TensorFlow or Keras Deep understanding of ML techniques such as classification, clustering, deep learning, and optimization methods, supervised and unsupervised techniques- Research-minded, ability to run experiments independently. Design and develop Deep Learning/ Image Processing Walk-in Date/ Time: 1st - 10th February 2021, 12.00 PM - 5.00 PM Venue Details: ICREA Infotech Private Limited, First Floor, Lumbini Rockdale Beside Eenadu Office, Opposite to Kshetra Restaurant Khairtabad. While attending the interview the candidate needs to come along with the following Documents: 1. Updated Resume Interview Process: 1st Round: Aptitude Test /Coding Test 2nd round: Managarial Round 3rd Round: HR Please drop resume to sangeetha@docassistant.net or contact 9985036368.  ","location":"Hyderabad","experience":"0-1Years"},{"date":"5, 6 - Feb - 2021","skills":"Employee Orientation, Grievance Handling, Joining Formalities, Human Resource Management","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Soft Suave Technologies Private Limited, Gayatri Tech Park, 4th floor Plot No. 183, EPIP, Near iGate, KIADB Industrial Area, Road, 1B, EPIP Zone Whitefield Road, Kundalahalli, Whitefield, Bengaluru, Karnataka - 560 066","phone":"Not Provided","profile":" HR Executive/ Female \nSoft Suave Technologies Private Limited","description":"Soft Suave is looking for Extraordinary people to join their team . . . ! Are you one of those ?? Find out yourselves by walk-in to our work space What'll you do - HR Executive Reviewing resumes and applications Conducting recruitment interviews and providing the necessary inputs during the hiring process Maintaining HR records, such as those related to compensation, Incentives, health and medical insurance Managing workplace safety issues Communicating and explaining the organization's HR policies to the employee Preparation of Payroll Administration of all Employee and company docs Conducting various games & celebration activities, engagement activities, employee recognition acts Preparing and processing timely distribution of salary, bonus, increment salary slip, leave encashment and full and final settlements Recording, maintaining and monitoring attendance to ensure employee punctuality Conducting employee orientation and facilitating newcomers joining formalities Maintaining and regularly updating master database (personal file, personal database, etc.) of each employee in HR module of ERP software Resolving grievances or queries that any of the employees have Escalating to the right level depending on the nature of the grievance or issue Conducting exit interviews for employees and recording them accordingly Engaging with employees on a regular basis to understand the motivation levels of people in the organization What You'll Bring: Exceptional English communication and writing skills Recruiting skills Problem solving skills Decision making skills Inter personal Skills Leadership & Mentoring Forward planning & strategical Thinking Why Soft Suave? We believe that work is one of the most important parts of our lives, & also we believe in a winning culture and great benefits: Competitive compensation Paid Training and exposure to all gamut of Human Resource activities with Client interactions Great multi-culture & team spirit Team outings (Sports leagues, Movie nights, Gym membership, Team Lunch, Employee awards etc.) Accommodating Leaves Promotion and Compensation based on individual's performance Required Candidate profile The expected candidate should be go better, proactive, and with exceptional english communication skills. Perks and Benefits Best in the Industry and good appraisal system with transparency Walk-in Date/ Time: 5th February - 6th February , 10.00 AM - 1.30 PM Venue Details- Soft Suave Technologies Private Limited Gayatri Tech Park, 4th floor Plot No. 183, EPIP, Near iGate, KIADB Industrial Area, Road, 1B, EPIP Zone Whitefield Road, Kundalahalli, Whitefield, Bengaluru, Karnataka - 560 066  ","location":"Bangalore","experience":"0-3Years"},{"date":"1, 2, 3, 4, 5, 6 - Feb - 2021","skills":"Back Office Operations, Non Voice Process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Globe Placement Service, 3/238 Vikas Khand Gomti Nagar Behind SBI Patrkarpuram Branch, Lucknow","phone":"9696807071","profile":" Back Office Executive \nGlobe Consultants Engineers","description":"WE ARE IN URGENT NEED OF SMART BOY'S & GIRL'S For MY CLIENT'S Office's- M I S Executive-9 ADMIN OFFICERS-9 Back Office Exe-36 OPERATION EXE-45 COUNSELLOR'S-99 TELECALLER-99 ANY MBA / PGDBA / GRADUATES CAN APPLY. MUST HAVE GOOD COMMUNICATION SKILLS . Required Candidate profile SMART WITH GOOD COMMUNICATION SKILLS ANY MBA / PGDBA / GRADUATE CAN APPLY ALL JOB'S AVAILABLE AT GLOBE CONSULTANT ON FIX SALARY. CONTACT WITH CONFIDENCE FOR SUITABLE OFFICE JOB AT LUCKNOW CITY. Walk-in Date/ Time: 1st - 6th February 2021, 12.30 PM - 5.30 PM Venue Details- Globe Placement Service 3/238 Vikas Khand Gomti Nagar Behind SBI Patrkarpuram Branch, Lucknow Contact - S P Dwivedi (9696807071)  ","location":"Lucknow","experience":"0-3Years"},{"date":"6 - Feb - 2021","skills":"Warehouse, Supply Chain Solutions","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"TVS Supply Chain Solutions Limited, Gurunathar Complex No. 813, 2nd Floor, Banglore Main Road, Sunguvachatram, Near Bus stand, Chennai.","phone":"8667492134","profile":" Warehouse Executive \nTVS Supply Chain Solutions Limited","description":"Candidate should be Any Graduate with 2 Years experience in Warehousing Must have Good Communication in terms of oral and write. Should be good in analytics macros & PPT. Good in customer interactions. Roles and Responsibilities- GRN Preparation, Perpetual inventory, stock control, dispatch documentation. SAP (ERP) Warehouse module understanding. Capacity to handle 10-member team size Generation of shift report, Self-audit and two bin system. Perks and Benefits- Transportation available (Pick up and drop). Meals Provided. Esi PF Bonus Walk-in Date/ Time: 6th February 2021, 9.30 AM - 4.30 PM Venue Details- TVS Supply Chain Solutions Limited Gurunathar Complex No. 813, 2nd Floor, Banglore Main Road, Sunguvachatram, Near Bus stand, Chennai. Contact Person:- Satheesh Rahul: 8667492134  ","location":"Chennai","experience":"2-4Years"},{"date":"29 - Jan - 2021","skills":"Blended Process, Email Support, Customer Service, Email/ Non Voice Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"TECH MAHINDRA LIMITED, SHARDA CENTREOFF KARVE ROAD, ERANDWANE, ANNEX, PUNE","phone":"9168637999","profile":" Back Office Associates \nTech Mahindra BPS Limited","description":"Tech Mahindra BPS Limited- Pune is hiring for Premium Telecom Domain for Backend/ Email Process Key skills required: Proven customer support experience or experience as a client service representative Excellent English communications skills Ability to listen and active problem solving skills Good interpersonal skills Ability to handle pressure Ability to multi-task, prioritize, and manage time effectively Qualification Required : Any Graduate Experience Required : 1 Year BPO Experience (Email & Chat Process) Minimum 1 Year - Email / Chat Process Experience is Mandatory The primary responsibilities of a Customer Service specialist would be: Handling escalations and complex queries. Manage large amounts of emails & chats Identify and assess customers needs to achieve satisfaction. Answer calls professionally to provide information about products and services, take/ or obtain details of complaints. Build sustainable relationships and trust with customer accounts through open and interactive communication Shift: 8 Am to 8 Pm Rotational Shift (One Week off-rotational) Salary: 180000-220000 LPA Work Location- Viman Nagar Giga Space IT Park Interview Process- Telephonic/ Walk-in (Kothrud/ Viman Nagar) Date/ Time: 29th January 2021, 10.30 AM - 4.00 PM Contact Mayuresh J - +91 9168637999 ( Call/ WhatsApp) Email ID- mj00642401@techmahindra.com Walk-in Date/ Time: 29th January 2021, 10.30 AM - 4.00 PM Venue Details- TECH MAHINDRA LIMITED SHARDA CENTREOFF KARVE ROAD, ERANDWANE, ANNEX, PUNE, Maharashtra Contact Person- Mayuresh J (9168637999)  ","location":"Pune","experience":"1-5Years"},{"date":"29 - Jan - 2021","skills":"Back Office Operations, Banking Process, Non Voice, Backend Operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Genpact Building, DLF City, Phase V, Sector Road,, Sector 53, Gurgaon","phone":"Not Provided","profile":" Backend Process Executive \nGenpact India Private Limited","description":"In this role, you will be responsible for the function of the position, which is to transcribe inventories into Excel sheets while researching the Like, Kind, Quality of replacements and the understanding of product categories in a time-sensitive manner. This position is responsible for accuracy, efficiency and retrieval of processed data. Minimum Qualifications: B.com Graduate except technical Freshers are eligible. Preferred Qualifications- Good analytical and problem-solving skills. Prior experience in Banking and/or Insurance industry Ability to communicate verbally and through emails with businesses. Job Responsibilities- Transcribe contents inventories into the proprietary evaluating platform Research and resolve Like Kind Quality replacements Input appropriate categories, depreciation and pricing sources Insurance/ banking exposure Walk-in Interview on 29th January from 10.30 AM onwards Venue- https://genpact.zoom.us/j/95713172999;  ","location":"Noida, Gurgaon","experience":"0-3Years"},{"date":"29 - Jan - 2021","skills":"Customer Service, Voice Process, Customer Support","qualification":"Diploma, B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"IDP Education India) Private Limited, Global Gateway Towers, Tower-B, 7th Floor, Sector 26, M.G. Road, Sikanderpur Ghosi, Gurgaon \u0096 122 002. Landmark: Near Guru Dronacharya Metro Station","phone":"9625643762","profile":" Customer Service Associate \nIDP Education (India) Private Limited","description":"Educational Qualification: Any Under Graduate/ Graduate (Prefer Graduate) Experience: Minimum 1 year in International Voice Process Language- English & Hindi (Mandate) Good Communications Skills- English has to be fluent Current Location: Gurgaon/ NCR Fixed day shift Timings : 9am to 5:30pm Walk-in Date/ Time: 29th January 2021, 10.00 AM - 4.00 PM Venue Details- IDP Education (India) Private Limited Global Gateway Towers, Tower-B, 7th Floor, Sector 26, M.G. Road, Sikanderpur Ghosi, Gurgaon \u0096 122 002. Landmark: Near Guru Dronacharya Metro Station Contact - Hemant S Narang (9625643762)  ","location":"Gurgaon","experience":"1-4Years"},{"date":"27 - Jan - 2021","skills":"Air Freight, Custom Clearance, Logistics Operations, Freight Forwarding, Document Verification","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Pon Pure Logistics, No. 1420 floor, 2nd, 13th Main Rd, Bharathi Colony, Tirumaniamman Nagar, Anna Nagar, Chennai - 600 040.","phone":"Not Provided","profile":" Logistics Operations Executive \nPon Pure Logistics","description":"Candidate should be MBA freshers & Experienced, dynamic Hardworking & Punctual in Nature Excellent interpersonal Skills People Ready to relocate Developing Skills Management Ability to Influence and Negotiate Interpersonal and Communication Skills. Able to make quick Planning & Organising Skills Should be Process Orientation. Should have highly Interpersonal Relationship Skills Roles & Responsibilities- To Increase the Topline Growth of Respective Divisions to set a Bench Mark in terms of Growth and Relationship with Principal, Customer & Trade by Becoming Precedent in Expanding Across all the Areas Assigned. Follow-Ups and Checking of Import Documents and Bill of Entry Check Lists (CONTAINER & AIR SHIPMENT) Filing Advance or Prior B/E's Advance Information on Container Damage & Survey to be done Should be skill with Co-ordination & Documents Preparation Regular Reports, Documents Submission & Information to Customers Need to Driving for Results. Job Benefits & Perks- On Direct Payroll Provident fund & Gratuity Paid Leave Medical Benefits Walk-in Date/ Time: 27 January 2021, 3.00 PM - 5.00 PM Venue Details- Pon Pure Logistics. No. 1420 floor, 2nd, 13th Main Rd, Bharathi Colony, Tirumaniamman Nagar, Anna Nagar, Chennai - 600 040. Contact Person- Joshua  ","location":"Chennai","experience":"0-2Years"},{"date":"26, 27 - Jan - 2021","skills":"HR/ Recruitment, Screening, Head Hunting","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"TALCHEMIST, 6th Floor, Gamma Block, Sigma Soft Tech Park, Whitefield, Bengaluru-560066","phone":"9448979860","profile":" HR Executive/ Recruiter \nTalchemist Solutions LLP","description":"Candidate should have 1 to 5 years of experience in HR/ Recruitment, Screening, Head Hunting. Must have excellent communication skills 6 days working (Freshers with good communication may apply) Walk-in Date/ Time: 26 January - 27 January , 10.00 AM - 6.00 PM Venue Details- TALCHEMIST, 6th Floor, Gamma Block, Sigma Soft Tech Park, Whitefield, Bengaluru - 560 066. Contact - Arun (9448979860)  ","location":"Bangalore","experience":"1-5Years"},{"date":"27 - Jan - 2021","skills":"Front Desk/ Front Office, Hospitality Management","qualification":"Diploma, B.A., B.Com, B.B.A, B.Sc","address":"Visionet Systems Private Limited, AMR Tech Park, Ground Floor, # 23 & 24, Hosur Main Road, Next to Oxford College of Engineering, Bengaluru, Karnataka - 560 068.","phone":"Not Provided","profile":" Front Desk Executive/ Manager \nVisionet Systems Private Limited","description":"Education/ Experience Requirements: Any Graduate/ Postgraduate or Diploma (Airlines, Hospitality) Should have experience of Front Office/ Hospitality for at least 1 year. Must have familiarity with phone systems Skills Required: Verbal and written Communication Professionalism Organization Presentable Flexible Job Responsibilities- Serves visitors by greeting, welcoming, and directing them appropriately. Notifies company personnel of visitor arrival. Informs visitors by answering or referring inquiries. Directs visitors by maintaining employee and department directories. Maintains security by following procedures, monitoring logbook, and issuing visitor badges. Operates telecommunication system by following manufacturers instructions for house phone and console operation. Keeps a safe and clean reception area by complying with procedures, rules, and regulations. Supports continuity among work teams by documenting and communicating actions, irregularities, and continuing needs. Contributes to team effort by accomplishing related results as needed. Completely day shift. 5 days working Coordination with CEO. Walk-in Date/ Time: 27th January 2021, 10.30 AM - 5.30 PM Venue Details- Visionet Systems Private Limited AMR Tech Park, Ground Floor, # 23 & 24, Hosur Main Road, Next to Oxford College of Engineering, Bengaluru, Karnataka - 560 068.  ","location":"Bangalore","experience":"1-3Years"},{"date":"24 - Jan - 2021","skills":"IT Recruitment, Head Hunting, End to End Recruitment","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Talchemist Solutions, 6th Floor, Gamma Block, Sigma Soft Tech Park, Whitefield, Bengaluru - 560 066","phone":"9448979860","profile":" HR Executive/ Recruiter \nTalchemist Solutions","description":"Candidate should have 0 to 5 years of experience in IT Recruitment, Head Hunting, End to End Recruitment Must Have excellent communication skills. 6 days working (Freshers may apply) Walk-in Date/ Time: 24th January, 2021 (10:00 am to 6 pm) Address: Talchemist Solutions 6th Floor, Gamma Block, Sigma Soft Tech Park, Whitefield, Bengaluru - 560 066 Contact number - Arun (9448979860)  ","location":"Bangalore","experience":"0-5Years"},{"date":"23 - Jan - 2021","skills":"Customer Service, Customer Support","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Avery Dennison (India) Private Limited, # 6B, 1st Main Road, KIADB Layout, Peenya 1st Phase, Peenya, Bangalore - 560 058","phone":"Not Provided","profile":" Customer Service Executive \nAvery Dennison (India) Private Limited","description":"Candidate must be a Graduate Typing speed of minimum 30-35 words per minute. Preferably having experience in the customer service field. Should have good Customer Service Orientation Skills Excellent Telephone/ written/ verbal Communication skills Excellent Listening Skills Team Player Time management and organizational skills Ability to work under pressure Attention to Detail Ability to learn technical aspects of the Retail Information Service Industry. Well versed with Microsoft office applications such as Word, Excel, PowerPoint etc Walk-in Date/ Time: 23rdJanuary 2021, 10 AM onwards Venue Details- Avery Dennison (India) Private Limited # 6B, 1st Main Road, KIADB Layout, Peenya 1st Phase, Peenya, Bangalore - 560 058 Landmark: next to VOLVO / New Basaveshwara Bus Stand Contact - Reception *Candidates are requested to adhere to all government safety norms related to Covid19 while coming for the interview.  ","location":"Bangalore","experience":"1-4Years"},{"date":"23 - Jan - 2021","skills":"IT Staffing, Recruitment, Technical Recruitment","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Arccaa Analytics and IT Solutions, Harsha Towers, 3rd Floor Plot. No. 25, Sy. No. 66/7, ROCK TOWN L.B NAGAR, R. R. DIST, HYDERABAD, TELANGANA \u0096 500 068.","phone":"6309333995","profile":" IT Recruiter/ HR Executive \nArccaa Analytics and IT Solutions","description":"Candidate should have good experience in IT Recruitment, Staffing, Technical Recruitment, end to end recruitment. Must have excellent verbal & written communication skills, Energetic & willing to learn new things. Work Experience: 6 Months to 2 Years Walk-in Date/ Time: 23rd January 2021, 9.30 AM - 5.30 PM Venue Details- Arccaa Analytics and IT Solutions Harsha Towers, 3rd Floor Plot. No. 25, Sy. No. 66/7, ROCK TOWN L.B NAGAR, R. R. DIST, HYDERABAD, TELANGANA \u0096 500 068. Contact - Mahesh (6309333995)  ","location":"Hyderabad","experience":"0-2Years"},{"date":"23 - Jan - 2021","skills":"IT Recruitment, C2H staffing","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Survik Software Private Limited, Tech Summit Building, Lane No. 4 Veerbhadra Nagar, Baner, Pune - 411 057.","phone":"8956975110","profile":" Sr. HR Executive/ IT Recruiter \nSurvik Software Private Limited","description":"We are hiring Sr. IT recruiter (work from office) for Survik Software. If interested kindly email on sonal.sukhwal@survik.com or call 8956975110, to confirm your time slot for 23rd January 2021. Key Requirements: Staffing Industry/ Consultancy experience is must. Should have experience on C2H staffing. A good understanding of technology and technical skills. Good interpersonal and decision-making skills. Job Responsibilities: Communicating with hiring managers to identify technical requirements for those jobs. Screening applicants for competency with the job requirements. Arranging telephone, video, or in-person interviews. Performing background and reference checks. Presenting the resumes of the most suitable candidates to the hiring manager. Offering job positions and completing the relevant paperwork. Keeping track of all applicants as well as keeping applicants informed on the application process. A Sr. IT Recruiter is responsible for all aspects of the sourcing and hiring of IT professionals to fill technical positions. He/she will work to identify and fill job openings, interview candidates, and keep records of applications. Walk-in Date/ Time: 23rd January 2021, 10:00 AM - 11:30 PM Venue Details- Survik Software Private Limited Tech Summit Building, Lane No. 4 Veerbhadra Nagar, Baner, Pune - 411 057. Contact - Sonal (8956975110)  ","location":"Pune","experience":"1-4Years"},{"date":"25 - Jan - 2021","skills":"Core Java/ Advanced Java, JavaScript, Jquery, MVC","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Join Zoom Meeting at https://us02web.zoom.us/j/82596143514?pwd=bXVwV2ZEWENNcVllTnd5M09uMmNQUT09","phone":"Not Provided","profile":" Java (Trained) Developer \nIndium Software (India) Limited","description":"Exciting opportunity for Freshers Trained in JAVA, Attend the Virtual Walk-In event and grab this golden opportunity. Walk-in date & time 25th January 2021 between 10 AM to 12 Noon Years of experience \u0096 0 to 6 months Job Location \u0096 Chennai Candidate must have Degree in Computer Science. Proficient in Core Java and Advanced Java, with a good knowledge of their ecosystems. Should have a sound knowledge in Java framework. Proficient understanding of JavaScript, Jquery, MVC is an advantage. Familiar with various design and architectural patterns. Familiarity with Database SQL operations. Excellent verbal communication skills. Good problem solving skills. Attention to detail. Link for 25th Jan 2021 (Monday). Join Zoom Meeting at https://us02web.zoom.us/j/82596143514?pwd=bXVwV2ZEWENNcVllTnd5M09uMmNQUT09 Meeting ID: 825 9614 3514 Passcode: 073148  ","location":"Chennai","experience":"0-1Years"},{"date":"21, 22, 23, 25, 27, 28 - Jan - 2021","skills":"HR/ Recruitment, Interviewing Candidates, Screening, Sourcing","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"3rd Floor, Sri Arcade, No 91, 1st Ave, D Block, Annanagar East, Chennai, Tamil Nadu - 600102.","phone":"9500632264","profile":" HR Executive/ Intern \nWhiteFox Recruitment","description":"We are looking for an HR Intern to perform recruitment activities. The candidate should possess excellent English communication skills This is not a paid job Internship certificate will be provided Walk-in Date/ Time: 19th January - 28 January , 9.30 AM - 5.30 PM Venue Details- 3rd Floor, Sri Arcade, No 91, 1st Ave, D Block, Annanagar East, Chennai, Tamil Nadu - 600102. Contact - Joel Call 9500632264 immediately to confirm the slot  ","location":"Chennai","experience":"0-1Years"},{"date":"21, 22, 23, 25, 27, 28 - Jan - 2021","skills":"HR Generalist Activities, Training, Non IT Recruitment, HR Consulting","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Tricolour Manpower Solutions, Zindatilismath Lane, Opposite Vip Furniture, Above Balaji Sweet Shop 2nd Floor, Amberpet, Chennai","phone":"7993490530","profile":" HR Recruiter \nTricolour Manpower Solutions","description":"Educational Qualification: Any Graduates Work Experience: 0-1 year Experience in sourcing Must have excellent in Communication skills. Good Knowledge in Recruitment Work Location : Amberpet Walk-in Date/ Time: 19th January - 28 January , 9.30 AM - 5.30 PM Venue Details- Tricolour Manpower Solutions, Zindatilismath Lane, Opposite Vip Furniture, Above Balaji Sweet Shop 2nd Floor, Amberpet, Chennai Contact - Mubeen (7993490530) NOTE: IMMEDIATE JOINERS REQUIRED  ","location":"Hyderabad","experience":"0-1Years"},{"date":"21, 22, 23, 25, 27, 28 - Jan - 2021","skills":"Admission Counsellingm, B2C Sales, Inside Sales","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Techavera Solutions Private Limited, Sector 2 C-Block, C-18, Noida Near by Sector 15 Metro","phone":"9821702484","profile":" Education Counsellor \nTechavera Solutions Private Limited","description":"Identification & understanding of the Students need & Counsel students to select appropriate study programs as per their interest. Overall counselling of all walk-ins and effective follow up with prospects. Immediate joiner required Walk-in Date/ Time- 19th January - 28 January , 9.30 AM - 5.30 PM Venue Details- Techavera Solutions Private Limited Sector 2 C-Block, C-18, Noida Near by Sector 15 Metro Contact - Shiv Kumar ( 9821702484 )  ","location":"Noida","experience":"1-3Years"},{"date":"21, 22, 23, 25, 27, 28 - Jan - 2021","skills":"HR/ Recruitment, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"HireWroks No. 3, Premalaya Building, 17th Street, Jai Nagar, Arumbakkam, Chennai - 600 106.","phone":"7550101091","profile":" HR Recruiter/ Freshers \nSquare One Infosolutions Private Limited","description":"We are only looking for an enthusiastic and aspirant candidates who intend to build their career in Recruitment industry. Eligibility Criteria: Any Graduates can apply (2018-2020) MBA Preferable Candidates with Backlogs can also apply Should have a positive attitude and Analytical thinking Must have good communication skills. Job Responsibility: Sourcing candidates through Job portals, social platforms and other relevant resources End To End recruitment cycle Posting the job requirements on different portals Coordinating with the management on Profile feedbacks. Following up with the candidate till joining. Walk-in Date/ Time: 19th January - 28th January , 11.00 AM - 4.30 PM Venue Details- HireWroks No. 3, Premalaya Building, 17th Street, Jai Nagar, Arumbakkam, Chennai - 600 106. Interested candidates immediately walk in Below mentioned venue for the interview or call Venil : 7550101091  ","location":"Chennai","experience":"0-1Years"},{"date":"21, 22, 23, 25, 27, 28 - Jan - 2021","skills":"Talent Acquisition, Campus Hiring, Ites Recruitment","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Global Healthcare Billing Partners Pvt. Limited, No. 70, Rhitherdon Road, Vepery, Chennai - 600 007","phone":"9952075752","profile":" HR Executive - Recruitment \nGlobal Healthcare Billing Partners Pvt. Limited","description":"Currently We are Hiring HR Executive / HR Senior Executive - Talent Acquisition for our Internal Recruitment. Basic Requirements : Qualification: MBA (HR) or MHRM or equivalent masters degree Experience required: 0.6 Months to 4 yrs in Recruitment Shift: General Shift. Job Locations - Vepery & Velachery Immediate joiners preferred Note: ONLY MALE CANDIDATES CAN APPLY. Responsibilities : Design and update job description. Source potential candidates from various online channels (e.g. social media and professional platforms like Naukri, Indeed and Monster etc..) Craft recruiting emails to attract passive candidates. Screen incoming resumes and application forms. Advertise job openings on company's careers page, social media, job boards and internally Provide shortlists of qualified candidates to hiring managers. Bulk Hiring / Campus Hiring/Salary Negotiations Monitor key HR metrics, including time-to-fill, time-to-hire and source of hire. Collaborate with managers to identify future hiring needs. Act as a consultant to new hires and help them on board. Candidate must have: Experience in US Healthcare / Medical Billing Hiring is added advantage. Possess good communication and interpersonal skills. Have a passion for recruitment. Extend support during weekends as and when required. Healthcare ITES Recruitment Experience will be an added advantage. Walk-in Date/ Time: 19th - 28th January 2021, 12.00 PM - 5.30 PM Venue Details- Global Healthcare Billing Partners Pvt. Limited No. 70, Rhitherdon Road, Vepery, Chennai - 600 007 Road connecting from Egmore Railway Station (YWCA bus stop) to Pursaiwakkam Landmark: Next to Dhina Color Lab Studio, Near to Niligris Super Market Contact - POOJA ( 9952075752 )  ","location":"Chennai","experience":"1-4Years"},{"date":"27, 28, 29, 30 - Jan - 2021","skills":"JavaScript, JQuery, Php, Opencart, MySQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Recenturesoft Infotech Private Limited, A-125, 1st Floor, Sector 63, Noida, Uttar Pradesh - 201 301","phone":"9654880668","profile":" PHP Developers/ Lead \nRecenturesoft Infotech Private Limited","description":"PHP DEVELOPERS - 2-4 years experience - 3 positions LEAD PHP DEVELOPERS - 5-8 years experience - 2 positions Candidate must have strong experience in PHP web development Strong knowledge of Core PHP, Any framework. Understanding the fully synchronous behaviour of PHP. Knowledge on REST API Development. Working on Product based Development. Good understanding and knowledge on various database: 1) JavaScript 2) JQuery 3) Php 4) Opencart 5) Mysql 6) LAMP Environment Team Management experience for lead position Work from office only preferred immediate joiners Interview will take place at office only Desired Candidate Profile Must have Good Communication Skills Should be logically sharp and have great problem solving skills Walk-in Date/ Time: 27th - 30th January 2021, 11.00 AM - 5.00 PM Venue Details- Recenturesoft Infotech Private Limited A-125, 1st Floor, Sector 63, Noida, Uttar Pradesh - 201 301 Contact - ( 9654880668 )  ","location":"Noida","experience":"2-7Years"},{"date":"25 - Jan - 2021","skills":".Net framework, C#, ASP .Net & MS SQL Server, PHP and MySQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Infomaze Elite Private Limited, # 286-A, Hebbal Industrial Area, Mysuru, Karnataka - 570 018 Land Mark: Opposite Oasis Hotel, Behind L&T Technology","phone":"Not Provided","profile":" .Net/ PHP Developers \nInfomaze Elite Private Limited","description":"1) Dotnet Developer/ Fresher: Qualification: Graduate/ Post Graduate in (CS/ IS/ IT) Added Advantage = Dot net Certified Fresher with .Net framework, C#, ASP .Net & MS SQL Server Strong knowledge of OOPS Concepts. Knowledge of Software development life cycle. Java Script, JQuery, and Ajax will be added advantage. Good communication skills, attitude and Logical thinking 2) PHP Developer/ Fresher: Qualification: Graduate / Post Graduate in (CS/ IS/ IT) Work Experience: 0 - 5 Years Added Advantage: Relevant certification Candidate must have good knowledge of PHP and MySQL Basic understanding of technologies such as HTML, CSS, PHP, Laravel, CodeIgniter, Familiarity with SQL databases. Walk-in Date/ Time: 25th January 2021, 9.30 AM - 1.00 PM Venue Details- Infomaze Elite Private Limited # 286-A, Hebbal Industrial Area, Mysuru, Karnataka - 570 018 Land Mark: Opposite Oasis Hotel, Behind L&T Technology Contact - Bhagyavathi Interested candidate can share your resume to jobs@infomazeapps.com  ","location":"Mysore","experience":"0-5Years"},{"date":"20 - Jan - 2021","skills":"Customer Support, Mall Management, Product Demonstration, Retail Sales, Payment Collection","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Ample Technologies Private Limited, N-1, Connaught Place, New Delhi - 110 001.","phone":"8056279641","profile":" Demonstration Specialist \nAmple Technologies Private Limited","description":"We have vacancies for Demonstration Specialist for Delhi location : N-1, Connaught Place, New Delhi - 110001 Desired Profile- Adaptability Communication Contributes to Team Success Customer Orientation Presentation of Self Please Note- Only candidates with fluent English speaking skills will be eligible. Candidates from Hotel industry can also apply. Job Responsibility- * Maximize the sale of Audio/ Video Products at the store, ensuring optimum customer satisfaction. * Achieve sales goals relative to store target. * Evaluating the customer's requirement by following the Bose customer engagement standards to provide best solutions. * Model excellence in theater show presentation/product demonstration to walk-in customers as per predefined script. * Ensuring store hygiene and presentability/ functioning of products on display. * Coordinating activities at the back office, managing inventory and managing payment reconciliation with bank. * Responsible for executing post sales activities like payment collection, invoicing, product delivery and installation * Managing external vendors like Mall management team or SIS partners, logistics and stationary vendors on a daily basis. * Handling pre/post sales customer escalations and queries. *Respond to customer e-mails within 24 hours from receipt as per guidance provided by supervisor. * Interaction with cross-functional departments for operational support. Walk-in Date/ Time: 20th January 2021, 11.00 AM - 4.00 PM Venue Details- Ample Technologies Private Limited N-1, Connaught Place, New Delhi - 110 001. Contact - Archana (8056279641) Interested candidates can send in your updated resume to archana.melchoir@ample.co.in Or watsapp to 8056279641  ","location":"Delhi","experience":"0-4Years"},{"date":"20 - Jan - 2021","skills":"Lead Generation, Admissions, Business Development, Revenue Generation","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"VLCC Institute Of Beauty & Nutrition, 101, City Pride, Building B/H Nalanda Hotel, Mithakhali Six Road, Navrangpura, Ahmedabad, Gujarat - 380 006.","phone":"7302467497","profile":" Academic Counsellor (Female Only) \nVLCC Health Care","description":"Roles and Responsibilities To promote the institute and its courses & ensure proper handling of walk-ins, counselling prospective students and Converting enquiries to registrations Tie-up with local Colleges, Schools, Tuition houses To provide relevant information to clients or refer them to appropriate departments within the centre To reconfirm appointments or make reminder calls to clients who have specifically requested for a particular service. To attend all staff meetings as and when directed by the Center Head and to attend Trainings as and when nominated by the Corporate Office / Centre Head. To perform outdoor duties whenever Company organizes event beyond the centre premises. Desired Candidate Profile- Under the guidance of the Head of Institute and in co-ordination with Sales Team and within the limits of established Company policies advise and monitor the clients for achieving the desired object. Walk-in Date/ Time: 20th January 2021, 10.30 AM - 5.30 PM Venue Details- VLCC Institute Of Beauty & Nutrition 101, City Pride, Building B/H Nalanda Hotel, Mithakhali Six Road, Navrangpura, Ahmedabad, Gujarat - 380 006. Contact - Shilpa ( 7302467497 )  ","location":"Ahmedabad","experience":"1-6Years"},{"date":"20 - Jan - 2021","skills":"Customer Care, International Voice Process, Customer Support","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Global Gateway Towers, Tower-B, 7th Floor, Sector 26, M.G. Road, Sikanderpur Ghosi, Gurgaon \u0096 122002 (Near Guru Dronacharya Metro Station)","phone":"9625643762","profile":" Customer Service Executive \nIDP Education (India) Private Limited","description":"Educational Qualification: Under Graduate/ Graduate (Prefer Graduates) Work Experience: Minimum 1 year in International Voice Process Good Communications Skills- English has to be fluent Language- English & Hindi (Mandate) Current Location: Gurgaon/ NCR Perks and Benefits- Fixed day shift Timings : 9am to 5:30pm Walk-in Date/ Time: 20th January 2021, 10.00 AM - 4.00 PM Venue Details- IDP Education (India) Private Limited Global Gateway Towers, Tower-B, 7th Floor, Sector 26, M.G. Road, Sikanderpur Ghosi, Gurgaon \u0096 122 002. (Near Guru Dronacharya Metro Station) Contact - Hemant S Narang ( 9625643762 )  ","location":"Gurgaon","experience":"1-4Years"},{"date":"20 - Jan - 2021","skills":"IT Recruitment, Product Hiring, Technical Hiring","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Anzy Careers Private Limited, 315 Work Avenue, 2nd Floor, 16th Cross, 5th Main Road, 6th Sector, HSR Layout, Bengaluru, Karnataka - 560 102.","phone":"9513921761","profile":" IT/ Technical Recruiter \nAnzy Careers Private Limited","description":"Currently we are having openings for #Freshers with MBA background for the role of IT/ Technical Recruiters. We are conducting a drive on 20th January 2021 i.e. on Wednesday. Interested can walk in to our office also you can share your CV to chandana@anzycareers.com Walk-in Date/ Time: 20th January 2021, 10.30 AM - 5.30 PM Venue Details- Anzy Careers Private Limited, 315 Work Avenue, 2nd Floor, 16th Cross, 5th Main Road, 6th Sector, HSR Layout, Bengaluru, Karnataka - 560 102. Contact - Chandana (9513921761) Note: Only MBA and Work from office only.  ","location":"Bangalore","experience":"0-1Years"},{"date":"20 - Jan - 2021","skills":"Customer Service, Customer Support, Inbound Process, BPO","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Walkin Venue : Zoom ID - 6370393166","phone":"Not Provided","profile":" Customer Service Executive \nLenskart Solutions Private Limited","description":"Lenskart Solutions Private Limited is Hiring Customer Support Executive/ Freshers Key Requirements- Must Have Laptop/ Desktop and Wifi . Should be comfortable to travel/ relocate to Gurgaon Must have good communication skills Job Responsibilities- Manage large amounts of inbound and outbound calls and live chats in a timely manner Follow communication scripts when handling different topics. Identify customers needs, clarify information, research every issue and provide solutions and/or alternatives. Build sustainable relationships and engage customers by taking the extra mile. Keep records of all conversations in our call center database in a comprehensible way. Meet personal/team qualitative and quantitative targets Virtual Walk-in Drive on 20th January 2021, Timing: 11.00 AM - 11.30 AM Walkin Venue : Zoom ID - 6370393166 Contact - Jayati Mahajan  ","location":"Delhi, Noida, Gurgaon","experience":"0-5Years"},{"date":"20 - Jan - 2021","skills":"HR/ Recruitment, End to End Recruitment, Volume/ Bulk hiring","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Allsec Technologies Limited, 46 C, Velachery Main Road, Velachery, Chennai- 42. Landmark: Next to Velachery EB Office","phone":"Not Provided","profile":" HR Executive/ Recruiter \nAllsec Technologies Limited","description":"We are hiring for HR Executive (Malayalam) - Recruitment - Male Candidate Preferable Eligibility Criteria: Should possess Excellent communication skills in English and Malayalam (Must) Experience: 1 - 2 Years Immediate joiners preferred. Candidate should have end to end recruitment experience in volume/ bulk hiring. Should have International Voice hiring experience (must) Sourcing candidates through various portals, resume database, referrals, networking sites etc. Screening the resumes and scheduling for interviews. Experience in handling both International and Domestic requirements. Negotiating job offers with candidates. On time closure of open positions. Walk-in Date/ Time: 20th January, 2021 from 10 AM onwards Venue Details- Allsec Technologies Limited, 46 C, Velachery Main Road, Velachery, Chennai- 42. Landmark: Next to Velachery EB Office Note: Candidate from Consultancy background with Domestic voice Hiring experience will be preferable.  ","location":"Chennai","experience":"1-2Years"},{"date":"23 - Jan - 2021","skills":"Project Management, Excel, IT Operations, Office Administration, MS Office","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Clarity Travel Solutions Private Limited, No. 27A, 2nd Floor, 163/ 18, 2nd Street, River View Residency, OMR, Karapakkam, Chennai \u0096 600 097","phone":"9949591245","profile":" PHP Developers \nClarity Travel Solutions Private Limited","description":"Candidate need to have strong knowledge in PHP with any one framework. Good to have Travel domain knowledge (Not Mandatory) Good to have React JS/ Node JS/ Vue JS knowledge Immediate Joiners preferred Experience 2 - 3 Years - 10 Openings Experience 4 - 6 Years - 10 Openings Experience 7 - 10 Years - 10 Openings Walk-in Date/ Time: 23rd January 2021, 9.30 AM - 5.30 PM Venue Details- Clarity Travel Solutions Private Limited No. 27A, 2nd Floor, 163/ 18, 2nd Street, River View Residency, OMR, Karapakkam, Chennai \u0096 600 097 Please contact Vignesh - 9949591245  ","location":"Chennai","experience":"2-7Years"},{"date":"20, 21, 22, 23, 25, 26, 27, 28, 29, 30 - Jan - 2021","skills":"Java Dotnet Mobile Application (Android, iOS) SQL","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Appsource Services Private Limited, No 12, Ramanuja Plaza 1st Floor Malleshwaram 5th Cross, Bangalore - 560 003.","phone":"9663863321","profile":" Software Engineer (Java/ .Net/ Android, iOS) \nAppsource Services Private Limited","description":"Appsource Services Private Limited, is looking for Software Engineers. Candidates with the below mentioned skills can apply : Java Dotnet Mobile Application (Android, iOS) SQL Walk-in Date/ Time: 20th - 30th January 2021, 10 AM onwards Venue Details- Appsource Services Private Limited No 12, Ramanuja Plaza 1st Floor Malleshwaram 5th Cross, Bangalore - 560 003. Contact - Shwetha ( 9663863321 )  ","location":"Bangalore","experience":"0-4Years"},{"date":"20, 21, 22 - Jan - 2021","skills":"C#, ASP .Net, MVC, MVVM","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Colan Infotech Private Limited, Unit-2, Block-1, 4th Floor, No. 84, Murugesa Naicker Complex, Greams Road, Thousand Lights, Chennai, Tamil Nadu - 600006","phone":"Not Provided","profile":" .Net Developer/ Fresher \nColan Infotech Private Limited","description":"Candidate must have completed Course Certification in Dotnet Should have good analytical and logical skills Must have basic coding and problem-solving skills Should have good communication skills Passed outs only from 2018, 2019 & 2020 Walk-in Date/ Time: 20th January - 22nd January , 10.30 AM - 5.30 PM Venue Details- Colan Infotech Private Limited, Unit-2, Block-1, 4th Floor, No. 84, Murugesa Naicker Complex, Greams Road, Thousand Lights, Chennai, Tamil Nadu - 600006 Landmark: Opposite Road to Sea shell Hotel  ","location":"Chennai","experience":"0-1Years"}]}