{"Walkins":[{"date":"11, 12, 13 - Mar - 2020","skills":"Manual Testing, Writing Test Cases with Multiple Test Case Scenarios","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Teknip Staffing Solutions, 2nd Floor 80, Manickam Lane, Mount Road, Guindy, Chennai - 600 032","phone":"9566753654","profile":"Junior QA/ Software Tester \nTEKNIP Manpower Recruitment Services","description":"Candidate should have minimum of 3 years of experience as a QA tester Basic Experience with Manual Software testing (Smoke Test, Unit Test, Sanity Regression) Strong Knowledge in Writing Test Cases with Multiple Test Case Scenarios Walk-in Date/ Time: 11th March - 13th March 2020, 10 AM onwards Interview Venue: Teknip Staffing Solutions 2nd Floor 80, Manickam Lane, Mount Road, Guindy, Chennai - 600 032 Landmark: Near Klase Hotel Tel: 9566753654","location":"Chennai","experience":"3 - 6 Years"},{"date":"11 - Mar - 2020","skills":"General Administration, Front office/ Receptionist Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Sharp Menthol India Limited, Sharp House, Plot No. 9 LSC, Gujranwala Town, New Delhi - 110 009","phone":"011-42290758","profile":"Office Assistant & Receptionist \nSharp Menthol India Limited","description":"We are urgently hiring on the post of 'Front Desk Executive' for our our company Should have good communication skill with fluency in both English & Hindi. Candidate must be from nearest location FEMALE CANDIDATE ONLY Walk-in Date/ Time: 11th March 2020, 9 AM onwards Interview Venue: Sharp Menthol India Limited Sharp House, Plot No. 9 LSC, Gujranwala Town, New Delhi - 110 009 Contact Person- Henika Phone No: 011-42290758","location":"Delhi","experience":"1 - 5 Years"},{"date":"11, 12, 13, 14, 15, 16 - Mar - 2020","skills":"HR/ Recruitment, Interviewing, Talent Acquisition, Hiring","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Reliance Jio, 4th Floor, Kalpataru Prime Road No. 16, Wagle Estate, Thane (West) - 400 604.","phone":"7045252359","profile":"HR Recruiter \nReliance Industries Limited","description":"Candidate should have good communication skills. People with consultancy's experience will be preferred. Job Responsibility- Handling end to end recruitment process Sourcing candidates through different channels of Recruitment like Job Portals. Determining applicant requirements by studying job description. Conducting Pre and post interview follow-up with the candidate. Walk-in Date: 11th to 16th March 2020 Timing : 10 am - 1 pm Interview Venue: Reliance Jio, 4th Floor, Kalpataru Prime Road No. 16, Wagle Estate, Thane (West) - 400 604. Landmark: near Ashar I.T Park, Contact Person - Sonam Gussar (7045252359)","location":"Mumbai","experience":"0 - 4 Years"},{"date":"16, 17 - Mar - 2020","skills":"Front Office Management, HR Administration, General Administration","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Vinove Software & Services India Pvt. Limited, 101, Infinity Business Park, Plot H-221, Sector 63, Noida - 201 307.","phone":"Not Provided","profile":"Front Office Executive \nVinove Software & Services India Pvt. Limited","description":"Vinove Software & Services India Pvt. Limited, is looking for Front Office Executive. - Greet and welcome guests as soon as they arrive at the office - Answer, screen and forward incoming phone calls - Ensure reception area is tidy and presentable, with all necessary stationery and material (e.g. pens, forms and brochures) - Provide basic and accurate information in-person and via phone/ email Administer compensation and benefit plans. - Receive, sort and distribute daily mail/ deliveries - Manage and monitor the Admin Activities. General Administration, Office Coordination. Handling Admin related activities Interested candidates can come directly for interview on Monday and Tuesday 16th & 17th March 2020 (between 10:00 AM - 2:00 PM) Address: Vinove Software & Services India Pvt. Limited 101, Infinity Business Park, Plot H-221, Sector 63, Noida - 201 307.","location":"Noida","experience":"1 - 4 Years"},{"date":"14 - Mar - 2020","skills":"Manual/ Automation Testing and SQL Queries, SDLC Model","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Eclinicalworks (India) Private Limited, 409-414, Venus Atlantis, Fourth Floor, 100 ft Road, Prahlad nagar, Ahmedabad - 380 015","phone":"Not Provided","profile":"QA/ Software Tester \nEclinicalworks (India) Private Limited","description":"Candidate must be proficient with Manual Testing and SQL Queries, SDLC Model. Having knowledge of functional, regression and ad-hoc testing. Prepare test case for Unit, Functional, Integration and system level. Responsible for creating and reviewing test strategy, test plan and interaction with development team and business analysts Implementation of QA process (Define bug life cycle, release notes, sign off for UAT, and uploading it to production). Quick learner and having ability to meet tight deadlines and work under pressure and be productive with new technologies. Other duties as assigned Essential Criteria: Proficient with relational databases (SQL Queries) Excellent knowledge on Manual Testing Prior testing experience shall be an advantage Prompt, responsive, responsible and friendly approach to customer situations Benefits: Pick & Drop facility for all employees based in Ahmedabad & Gandhinagar Transport Allowance if cab is not availed 5 Days working Walk-in Date/ Time: 14th March 2020, 10 AM onwards Interview Venue: Eclinicalworks (India) Private Limited 409-414, Venus Atlantis, Fourth Floor, 100 ft Road, Prahlad nagar, Ahmedabad - 380 015 Contact Person- Pankaj Jivnani","location":"Ahmedabad","experience":"1 - 5 Years"},{"date":"12, 13 - Mar - 2020","skills":"Manual testing, Security testing, Write, execute, and Maintain test cases","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Inlogic Technologies Private Limited, Admin Block, Ground Floor, Elnet Software City, Rajiv Gandhi Road, Taramani, Chennai - 600 113","phone":"Not Provided","profile":"Software Testing Engineer \nInlogic Technologies Private Limited","description":"Person must be strong in Manual testing and security testing. Write, execute, and maintain test cases. Perform manual testing, which may include exploratory, system, regression, compatibility, or integration testing for client facing products or back-end systems. Exceptional organizational skills and initiative. Demonstrated ability to complete assigned tasks and objectives, meet timelines, and provide updates. Work closely with developers and product owners to understand the systems being tested. Develop and follow test plans for product releases. Ability to effectively communicate with various departments at multiple levels. SQL knowledge for testing backend data. Experience with Agile, Scrum, or another iterative development methodology. Experience developing test scripts and test cases Experience configuring and using testing tools and systems. Ability to understand technical specifications. Note: Immediate joiners are preferred Walk-in Date/ Time: 12th March - 13th March 2020, 10 AM onwards Interview Venue: Inlogic Technologies Private Limited Admin Block, Ground Floor, Elnet Software City, Rajiv Gandhi Road, Taramani, Chennai - 600 113 Contact Person- Banu Priya","location":"Chennai","experience":"2 - 4 Years"},{"date":"13 - Mar - 2020","skills":"Core JAVA, Spring , Hibernate , J2EE","qualification":"B.E./B.Tech, MCA/PGDCA","address":"3i Infotech Limited, Prince infocity 2, 3rd Floor, Kandanchavadi, Chennai - 96","phone":"044-71622577","profile":"Core Java Developer \n3i Infotech Limited","description":"Primary Skill set : JAVA Developer / JAVA Programmer Frameworks required : Core JAVA, Spring, Hibernate, J2EE Work Experience - 2- 8 Years Notice Period : (30 Days Max) Salary : Industry Standard Interested candidates can walk-in to below mentioned address: 3i Infotech Limited, Prince infocity 2, 3rd Floor, Kandanchavadi, Chennai - 96 Interview Date : 13th March '2020 Time : 10.30 AM to 4 PM Contact Person: Vivek S","location":"Chennai","experience":"2 - 8 Years"},{"date":"12, 13, 14 - Mar - 2020","skills":"Asp .Net, MVC, Javascript, Jquery and MS SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Sohung Infotech Private Limited, E - 38, E Block, Sector 63 Noida, Uttar Pradesh - 201 301","phone":"9911886563","profile":".Net Developer (MVC) Fresher \nSohung Infotech Private Limited","description":"Candidate should have good knowledge of Asp .Net, MVC, Javascript, Jquery and MS SQL Server, Software Development. Must have completed 6 months of Institutional training in Dot Net & MVC. FRESHER REQUIRED ASAP. ONLY STIPEND WILL BE PROVIDED. Interview Process: General and Technical Aptitude test, HR Round. Technical Round Walk-in Date/ Time: 12th March - 30 April 2020, 11 AM onwards Interview Venue: Sohung Infotech Private Limited E - 38, E Block, Sector 63 Noida, Uttar Pradesh - 201 301 Contact Person- Gagandeep Singh Phone: 9911886563","location":"Noida","experience":"0 - 1 Years"},{"date":"14 - Mar - 2020","skills":"C#, Angular JS, Angular2, HTML5, Javascript, Agile C#7.0, .Net","qualification":"B.E./B.Tech, MCA/PGDCA","address":"G-Cube Webwide Software Pvt. Limited, A-154A, 2nd Floor, Sector-63, Noida","phone":"Not Provided","profile":"Software Developer (Agile, C#, .Net) \nG-Cube Webwide Software Pvt. Limited","description":"Candidate should have 1 to 5 years of experience on C# based API and business logic implementation. Contribution as a developer on different stages of Agile based development process. Development based on technical design (HLD, LLD) & functional design Must have Ability to learn and adapt new technologies C# 7.0 and above, MS SQL, JavaScript, HTML5 Object Oriented Programming Good Aptitude skills Good communication skills Walk-in Date: 14th March' 2020 (Saturday) Time- 9:30 AM to 2.00 PM Interview Venue: G-Cube Webwide Software Pvt. Limited A-154A, 2nd Floor, Sector-63, Noida Contact Person- Shruti Kapoor (HR)","location":"Noida","experience":"1 - 5 Years"},{"date":"14 - Mar - 2020","skills":"ASP .NET, C#, SQL Server, Java script, AJAX, Angular","qualification":"B.E./B.Tech, MCA/PGDCA","address":"ProPhoenix Technologies Private Limited, Campus Tek Meadows, C Block First Floor, No: 51 Rajiv Gandhi Salai, Sholinganallur, Chennai - 119","phone":"9952555272","profile":".NET Developers \nProPhoenix Technologies Private Limited","description":"Applicant should have 0 to 3 years of experience in ASP .NET, C#, SQL Server, Java script, AJAX, Angular. Excellent in Design, Programming, Analyzing, Debugging and implementing new features. Should be able to do peers code review. Should have SDLC Process. Must have good communication skills. Training will be provided. Fresher's Eligibility: .NET Certification mandatory Willing to work for 3 years Passed out year between 2017 to 2019 If interested, please directly Walk-in to the below mention address: Interview Date: 14th March 2020 (Saturday) Time: 10:00 AM to 1:00 PM Interview Venue: ProPhoenix Technologies Private Limited, Campus Tek Meadows, C Block First Floor, No: 51 Rajiv Gandhi Salai, Sholinganallur, Chennai - 119 Land mark: Opposite to Accenture Bus Stop: Dollar Bus stop (next to Karapakkam) Contact Person: Vignesh Contact Details: 9952555272 NOTE : Please ignore if this email not suitable to you/ already attended.","location":"Chennai","experience":"0 - 3 Years"},{"date":"12, 13 - Mar - 2020","skills":"General Administration, Office Coordination and Customer Handling","qualification":"B.E./B.Tech, MCA/PGDCA","address":"ApMoSys Technologies Private Limited, A-105, Greenscape Technocity Shil Phata Mahape Road, Next to Country Inn & Suites Mahape, Navi Mumbai - 400 701","phone":"9321975713","profile":".Net Developer \nApMoSys Technologies Private Limited","description":"Person should able write clean, scalable code using .NET core programming languages Develop technical interfaces, specifications & architecture Can able develop client displays & user interfaces. Good practical experience in MVC Open to travel anywhere in Mumbai as per project requirement Strong problem-solving and analytical skills. Good in Communication skills Immediate Joiner Walk-in Date: 12th - 13th March 2020 Time : 10 :00 AM - 4 PM Interview Venue: ApMoSys Technologies Private Limited A-105, Greenscape Technocity Shil Phata Mahape Road Next to Country Inn & Suites Mahape, Navi Mumbai - 400 701 Contact - Pallavi (9321975713) Interested candidates can share their profile on hrd@apmosys.in","location":"Mumbai","experience":"2 - 4 Years"},{"date":"12, 13 - Mar - 2020","skills":"ASP .NET, VB .NET, C# .Net, ADO .NET, Web Applications, Web Services","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"MWebWare Software Services Pvt. Limited, H.No. 1-98/7/42, Jai Hind Enclave, Madhapur, Hyderabad, Telangana - 500 081","phone":"Not Provided","profile":".Net Developer/ Fresher \nMWebWare Software Services Pvt. Limited","description":"Candidate should be B. Tech (CSE, IT and ECE only) M.Tech or MCA 2017/ 2018 and 2019 Passed outs. Should have scored 60% throughout their academics Must have trained on DotNet (Minimum of two months) Should possess good communication skills. Knowledge of ASP .NET, VB .NET, C# .Net, ADO .NET, Web Applications, Web Services, Javascript, Ajax, XML. Knowledge of SQL Server programming is a must. JQuery, WCF, WPF, MVC, knowledge would be Add-on. Understanding on OOPS concepts. Walk-in Date/ Time: 12th - 13th March 2020, 11 AM onwards Interview Venue: MWebWare Software Services Pvt. Limited H.No. 1-98/7/42, Jai Hind Enclave, Madhapur, Hyderabad, Telangana - 500 081 Landmark: Opposite to Season Swimming Pool Contact Person- Purna R Interview Process: 1. Technical written test 2. System test 3. Technical Face to Face 4. One week evaluation (based on which job confirmation will be given) NOTE: Candidates matching the above criteria can directly walk-in between 11 AM TO 3 PM.","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"12 - Mar - 2020","skills":"HR Generalist Activities, Exit Management, Attendance/ Leave Management, HR Operations","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"IDC Technologies Solutions Pvt. Limited, C 18, UNICOS, Sector 67, Noida","phone":"Not Provided","profile":"Executive - HR Operations \nIDC Technologies Solutions Pvt. Limited","description":"Candidate should have 2 to 7 years of experience on HR Generalist Activities, Exit Management, Attendance/ Leave Management, HR Operations, Interviewing, Master Data, On boarding. Experience in managing Complete Exit ProcessMaintain Faculties / SEMs Master Data and Documentation.Managed Attendance and Leave on different check Male candidate is only preferred Job Responsibilities Exit Management HR Generalist Maintain employees personal File. Handled onboarding management. Support in FNF settlement activities, exit interview form filing. Interested candidates can directly walk-in on 12th March 2020 Thursday (between 12 pm - 2 pm) at the given address- IDC Technologies Solutions Pvt. Limited C 18, UNICOS, Sector 67, Noida","location":"Noida","experience":"2 - 7 Years"},{"date":"12, 13, 16, 17, 18, 19, 20 - Mar - 2020","skills":"interviewing vendor management Office Administration hiring recruitment","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Quintessence Business Solutions and Services, Module 21 & 23, Second Floor. Elnet Software City, TS-140, Block2&9, Rajiv Gandhi Salai, Taramani, Chennai - 600113","phone":"8870428777","profile":"HR & Admin Executive \nQuintessence Business Solutions & Services Pvt. Limited","description":"Quintessence Business Solutions & Services Pvt. Limited, is looking for MBA/ BBA (HR) with 0 months to 1 year experience Candidate must have good communication skills Handling the vendor management Flexible to work in night shift Responsible of on-boarding the new joinees and handing over to the operations. Updating internal databases with new hire information. Gather payroll data like bank accounts and working days Interested candidates can directly walk in for interview from 10th March - 20th March (Monday to Friday) 11 am onwards at the below venue- Quintessence Business Solutions & Services Pvt. Limited Module 21 & 23, Second Floor, Elnet Software City, TS-140, Block2&9, Rajiv Gandhi Salai, Taramani, Chennai - 600 113 Or forward your CV to mail yogender.sharma@qbssmail.com Contact Person : Yogender Sharma Contact No: 8870428777/ 7338853331","location":"Chennai","experience":"0 - 1 Years"},{"date":"13, 14 - Mar - 2020","skills":"Back Office, Data Entry, Customer Service","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"KMI Business Technologies Pvt. Limited, 1008, Dalamal House, Nariman Point, Mumbai - 400 021","phone":"022 22023021","profile":"Back Office/ Data Entry Assistant \nKMI Business Technologies Pvt. Limited","description":"Candidate should be Any Graduate with 5 - 8 years of experience in Back Office, Data Entry. Good written & verbal communication, customer service. Able to communicate complex issues with good presentation skills. Excellent problem solving skills. Self-motivated and adaptable, to be able to work with minimal supervision. Must have good interpersonal skills. Secretarial Responsibilities - Assisting the Director in his day to day work. Drafting letters & other correspondence. Handling day to day admin activities Preparation of contracts and agreements and filing the same. Handling International Calls, Clients Coordination and Team. Attending calls on various complaints, request and forwarding the same to the concerned departments. Ensure smooth operations at all times. Walk-in Date: 13th March - 14th March 2020 Interview timing: 10.30 am to 5:30 pm Interview Venue: KMI Business Technologies Pvt. Limited 1008, Dalamal House, Nariman Point, Mumbai - 400 021 Contact Person- Gita Shah Tel No. 022 22023021 E-mail ID- hrd@kmi.co.in","location":"Mumbai","experience":"5 - 8 Years"},{"date":"12, 13 - Mar - 2020","skills":"Automation Testing, Test Engineering, Eggplant","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Laminaar Aviation Infotech Pvt. Limited, Software Lab & Technical Support Center, Anjaneya Techno Park, Ground & 1st Floor 147, HAL Airport Road, Kodihalli, Bengaluru - 560 017","phone":"Not Provided","profile":"Automation Test Engineer \nLaminaar Aviation Infotech Pvt. Limited","description":"Educational Qualification: BE/ B.Tech/ MCA candidates only Work Experience 2 to 5 Years Automation Testers with Eggplant tool is mandatory Preferably Immediate to 15 days notice Job Location: Bangalore Walk-in Date/ Time: 12th March - 13th March 2020, 10 AM onwards Interview Venue: Laminaar Aviation Infotech Pvt. Limited, Software Lab & Technical Support Center, Anjaneya Techno Park, Ground & 1st Floor 147, HAL Airport Road, Kodihalli, Bengaluru - 560 017 Contact Person- Preethi S Note: Please carry updated resume, photo / any Government ID proof","location":"Bangalore","experience":"2 - 5 Years"},{"date":"11, 12 - Mar - 2020","skills":"Technical Support, Desktop Support, Installation/ Hardware Networking","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Corporate Infotech Private Limited, Block - E, E-81, sector-6, Noida (Nearest metro Station - Noida Sector 15)","phone":"7290082952","profile":"Desktop Support Engineer \nCorporate Infotech Private Limited","description":"Candidate should be Any Technical Graduate with 1 to 3 years of experience in Technical Support, Desktop Support, Installation/ Hardware Networking. Must have excellent communication skills Job Responsibility- Handled customer complaints & Installation for desktop support. Should have expertise to trouble-shoot all peripherals of Computers, Printers, Scanners, CD-writers and network components and responsible for maintenance of Computers, Printers and Scanners etc. Walk-in Date/ Time: 11th - 12th March 2020, 11 AM onwards Interview Venue: Corporate Infotech Private Limited Block - E, E-81, sector-6, Noida (Nearest metro Station - Noida Sector 15) Contact - Team HR (7290082952)","location":"Noida","experience":"1 - 3 Years"},{"date":"11 - Mar - 2020","skills":"technical support, voice process, service desk","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"DXC Technology India Private Limited, Maruti Concorde Business Park, Service Road, Konappana Agrahara, Electronics City, Bengaluru, Karnataka - 560010.","phone":"Not Provided","profile":"Technical Support Engineer \nDXC Technology India Private Limited","description":"Global Service Centers are made up of teams that provide remote (offsite) service; customer access and service delivery. Technical teams focus is to solve various business systems and applications problems for customers, onsite engineering personnel and Authorized Service Providers on standard, specialized or complex systems. Skills and Qualifications: Only Graduates with 0 to 3 years of experience can apply Should have good infrastructure domain knowledge Must be good communication in English Flexible to work in night shift. Responsibilities & Duties: The primary responsibility is to attend inbound calls for customer support from the existing customers. Resolve the quires of the Customers, in case there are any issues, escalate the same to the higher officials in the team/ company. Create reports on the work done and submit it to the team lead/ manager Benefits Two Way Cabs provided from us 5 Days Working 2 Days Off Additional shift allowance will be provided. Interview Date: 11th March' 2020, Wednesday Time : 11:00 AM to 1:00 PM Interview Venue : DXC Technology India Private Limited Maruti Concorde Business Park, Service Road, Konappana Agrahara, Electronics City, Bengaluru, Karnataka - 560 010. Near Electronic Bus stand. Point of Contact : Gopala BR/ Naveen Note:- List Of Mandatory Documents to carry for interview 1 Pan Card 2 Aadhar card 3 10th Marks card 4 12th Marks card 5 Degree Certificate & Last sem marks card 6 If Experience (Relieving Letter/ Full and Final Settlement /Service Certificate/ Offer Letter) Interview Rounds : Group Discussion/ Written Test/ Operations round","location":"Bangalore","experience":"0 - 3 Years"},{"date":"9, 10, 11, 12, 13 - Mar - 2020","skills":"QA, Manual testing, Web application testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Casperon Technologies Private Limited, D. 84, Block No.3, 4th Floor, Murugesa Nayakar Complex, Greams Road, Thousand Lights, Chennai - 600 006.","phone":"9176227305","profile":"QA/ Manual Tester \nCasperon Technologies Private Limited","description":"Looking for Fresher to 2 years of experience (2018 & 2019 Passed Out Only) Required Skills- QA, Manual testing, Web application testing Immediate Joiners Only. Job Responsibility- Responsible for developing and executing manual test scripts. Responsible for tracking and logging defects during execution. Generating reports such as defect analysis reports, project status reports Candidates must submit anyone of their originals for 2 years for fresher. First 5 months training for freshers with 6.5k stipend after they'll consider into on roll with 15K CTC. Walk-in Date/ Time: 9th - 13th March 2020, 3 PM onwards Interview Venue Casperon Technologies Private Limited D. 84, Block No.3, 4th Floor, Murugesa Nayakar Complex, Greams Road, Thousand Lights, Chennai - 600 006. Contact Person- Aravind (9176227305)","location":"Chennai","experience":"0 - 1 Years"},{"date":"10, 11, 12, 13, 16, 17, 18, 19, 20 - Mar - 2020","skills":"Software testing, Regression testing, Automation testing, Unit testing, Manual testing","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Infiniti Research Marketing Solutions India Private Limited, 1st Floor - Left Wing, Embassy Signet, Cessna Business Park, Kadubeesanahalli Outer Ring Road, Bengaluru - 560 103.","phone":"Not Provided","profile":"Software Testing Engineer \nInfiniti Research Solutions India Pvt. Limited","description":"Candidate should have Bachelor's Degree in Computer Science or a related field Proficiency in programming languages such as C# and Java 3+ years of hands-on experience in automation of web-based and mobile applications Hands on experience in Selenium/ UFT/ SoapUI Experience with modern testing tools like Katalon/mabl preferred but not mandatory Excellent mathematical and problem-solving skills Individual contributor with ability to produce results under minimum guidance Previous experience in Black Box testing preferred but not mandatory Highly accurate and detail oriented Strong understanding of Software testing concepts Key Responsibilities: Designing and developing automation test scripts Work closely with QA Analysts to continuously build regression test suites for each release and develop automated test scripts Work with Development team to capture and re-use automated unit test cases Ensure proper version control and configuration management of all test objects developed and test environments used Research and Document bug reports by following agreed-upon process immediately upon discovery of a quality problem Walk-in Date/ Time: 10th March - 20th March , 10 AM onwards Interview Venue: Infiniti Research Marketing Solutions India Private Limited 1st Floor - Left Wing, Embassy Signet, Cessna Business Park, Kadubeesanahalli Outer Ring Road, Bengaluru - 560 103. Contact Person- Indu","location":"Bangalore","experience":"3 - 6 Years"},{"date":"6, 7, 9, 10, 11, 12, 13, 14 - Mar - 2020","skills":"PHP, Laravel, Codeigniter, JavaScript, HTML5, and CSS3","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Bitibe Technologies Private Limited, No. 11 Sai Kuberan Mansion 2nd floor 7th Main Road Ksrtc layout chikklasandra Uttarahalli main Road Bangalore - 560061 Next to Bangalore","phone":"9845028292","profile":"Senior Php Developer \nBitibe Technologies Private Limited","description":"We are looking for a PHP Developer responsible for managing back-end services and the interchange of data between the server and the users. Your primary focus will be the development of all server-side logic, definition and maintenance of the central database, and ensuring high performance and responsiveness to requests from the front-end. You will also be responsible for integrating the front-end elements built by your co-workers into the application. Therefore, a basic understanding of front-end technologies is necessary as well. Job Responsibilities: Integration of user-facing elements developed by front-end developers Build efficient, testable, and reusable PHP modules Solve complex performance problems and architectural challenges Integration of data storage solutions MySql, Oracle etc. Skills & Qualifications: Strong knowledge of PHP web frameworks such as Laravel, Codeigniter Understanding the fully synchronous behavior of PHP Understanding of MVC design patterns Basic understanding of front-end technologies, such as JavaScript, HTML5, and CSS3 Knowledge of object oriented PHP programming Understanding accessibility and security compliance Strong knowledge of the common PHP or web server exploits and their solutions Walk-in Date/ Time: 6th March - 15th March 2020, 11 AM onwards Interview Venue: Bitibe Technologies Private Limited No. 11 Sai Kuberan Mansion 2nd floor 7th Main Road Ksrtc layout chikklasandra Uttarahalli main Road Bangalore - 560061 Next to Bangalore Landmark: International Public school Mobile- 9845028292","location":"Bangalore","experience":"1 - 3 Years"},{"date":"11 - Mar - 2020","skills":"Technical Support, Application Support, Software Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Opportune Technologies Private Limited, Gemstar Commercial Complex, 411, Ramchandra Lane, Opposite Religare Office, Kanchpada, Malad West, Mumbai, Maharashtra - 400 064.","phone":"Not Provided","profile":"Technical Support Engineer \nOpportune Technologies Pvt. Limited","description":"Candidate should be Any Technical Graduate with good knowledge of SQL & Excel HRMS domain knowledge would be an add advantage Must have good communication skills Application support needs to ensure that software user is able to use application effectively and customer satisfaction. Walk-in Date/ Time: 10th March - 11th March , 11 AM onwards Interview Venue: Opportune Technologies Private Limited Gemstar Commercial Complex, 411, Ramchandra Lane, Opposite Religare Office, Kanchpada, Malad West, Mumbai, Maharashtra - 400 064. Contact Person- Dhwani Mehta","location":"Mumbai","experience":"0 - 5 Years"},{"date":"11, 12 - Mar - 2020","skills":"Core PHP, Laravel framework, MySQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Colan Infotech Private Limited, Murugesan Nayakar Complex, Unit-2, D 84, B Block, 4th Floor, Greams Road, Thousand Lights, Chennai - 600 006","phone":"90420 55 706","profile":"PHP - Laravel Developer \nColan Infotech Private Limited","description":"Candidate must have experience in Core PHP & Laravel framework Good communication and Positive Attitude Should have knowledge in MySQL Walk-in Date: 10th - 12th March 2020 (Tuesday - Thursday) Time: 11:00 AM to 5:00 PM Interview Venue: Colan Infotech Private Limited, Murugesan Nayakar Complex, Unit-2, D 84, B Block, 4th Floor, Greams Road, Thousand Lights, Chennai - 600 006 Landmark: (Opposite road to Sea shell Hotel) Contact person -Kalai OR Mail ID: vignesh.n@colanonline.com/ kalaichelvi.k@colanonline.com Contact No: 90420 55 706 / 701","location":"Chennai","experience":"1 - 3 Years"},{"date":"11 - Mar - 2020","skills":"Technical Support, Blended Process, Customer service","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Tech Mahindra Limited, B-19, Sector-62, Noida (Opposite of DME)","phone":"9717192250","profile":"Technical Support (Chat/ Email Process) \nTech Mahindra Limited","description":"Qualification Required :Any Graduate or Post Graduate Can apply Experience Required : Any Fresher or Experienced with minimum 1 Year of International or Domestic premium experience with banking, finance or fintech background can apply. Skills Required : Good Communication skills + Basic Computer knowledge Salary Offered : 2.5 LPA - 3.5 LPA Job Roles & Responsibilities : 1) Answering premium customer queries via Voice 2) Establish relationship and trust with customer by ensuring qualitative service. Walk-in Date:- 11th March, 2020 Time : 10 AM - 4 PM Interview Location - Tech Mahindra Limited, B-19, Sector-62, Noida (Opposite of DME) Contact Person : Manpreet Sachdeva Contact Number: 9717192250","location":"Noida","experience":"0 - 5 Years"},{"date":"11, 12, 13 - Mar - 2020","skills":"PHP, WordPress, Javascript, Ajax, jQuery, XML, XHTML, HTML5, CSS","qualification":"B.E./B.Tech, MCA/PGDCA","address":"GlobalData Research Center Private Limited, 3rd Floor, Jyoti Pinnacle Building, Opp to Prestige IVY League Appt, Kondapur Road, Hyderabad, Telangana - 500 081.","phone":"Not Provided","profile":"PHP (Wordpress) Developer \nGlobalData Research Center Private Limited","description":"Urgent job opening for PHP (WordPress) Developer @ GlobalData (Hyderabad - Kondapur Office) for below positions:- Senior Software Engineer Module Lead Team Lead Required Skill Set: Expert in PHP, WordPress & other open source tools. Strong knowledge in Javascript, Ajax, jQuery, XML, XHTML, HTML5, CSS & knowledge of working with third party web services. Knowledge on Ecommerce (Payment Gateways, Shopping Carts, SEO Friendliness Coding, etc) Qualification: Bachelor's/ Master's degree (B Tech)/ MCA Minimum 3 to 8 years' of experience in PHP Good aptitude and problem solving skills Strong programming skills The job requires the candidate to work on Wordpress multisites and PHP - Design and implement applications/sites in WordPress/ Drupal Lead and Mentor technical team for all maintenance and new site tasks To pro-actively address all technical issues and coordinate with India and UK teams Participate in agile development process to ensure project deliverables are met, on time and of high quality Managing and delivery of projects from conceptualization, visualization to technology mapping and final execution of projects Monitoring development activities and reporting project progress Understand specification document and perform coding as per the requirements and standards Walk-in Date/ Time: 11th - 13th March 2020, 11 AM onwards Interview Venue: GlobalData Research Center Private Limited 3rd Floor, Jyoti Pinnacle Building, Opp to Prestige IVY League Appt, Kondapur Road, Hyderabad, Telangana - 500 081. Contact Person- Salim - HR","location":"Hyderabad","experience":"3 - 8 Years"},{"date":"11, 12 - Mar - 2020","skills":"Desktop Support, Product Support, Hardware Support, Hardware Troubleshooting","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"HCL Technologies Limited, Sector 60 A- 22, Noida Nearest Metro Station Noida Sector 59.","phone":"9971154226","profile":"Technical Support Engineer \nHCL Technologies Limited","description":"The Candidate should be a Technical Graduate with 12 Months of experience in Hardware Trouble shooting and Desktop Support. Must posses excellent communication skills. Should be Comfortable to work in 24/7 environment. Max Salary Upto : 4.75 LPA Interested people can Reach at this address in Interview Date: 11th & 12th March 2020. Timings: Between 11 am to 6 pm Interview Venue - HCL Technologies Limited Sector 60 A- 22, Noida Nearest Metro Station Noida Sector 59. Contact Person - Vikas Kapoor Email id - vikas.kapoor2@hcl.com Contact No - 9971154226 Please Carry a Hardcopy of your resume and mention Vikas Kapoor on the Top of Your Resume. Carry and Government Id along with you. Please do not carry and Pen Drive, Laptop, etc. With you.","location":"Noida","experience":"1 - 6 Years"},{"date":"11 - Mar - 2020","skills":"Technical Support, Voice Process, Customer Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Dell International Services India Pvt. Limited, Vipul Tech Square, Sector - 43, Gurgaon - 122002 Near Sector 42-43 Rapid Metro Station","phone":"Not Provided","profile":"Technical Support Engineer \nDell International Services India Pvt. Limited","description":"Role Overview Responsible for providing telephone/ email/ chat, online, social media and remote diagnostic technical support of desktops, portables, peripherals (e.g., printers, projectors, etc.) and software Role Responsibilities: Responsible for providing telephone support for customers on operation or maintenance of Dell products. Assist phone customers by diagnosing problems, and providing resolutions for technical and service issues. Responsible for Out of warranty and In warranty solution sales. Performs work in accordance to standardized policies and procedures. Applies diagnostic techniques to identify problems, investigate causes and recommend solutions to correct failures. Documents problems in the support solution database for diagnostics and solution implementation. Ensure proper escalation procedures are followed. Responsible for customer satisfaction through effective handling of customer problems. Work requires strong analytical ability to resolve complex technical issues in addition to effective phone communication skills. Requirements: 0 to 1 years of relevant work experience required. Undergrad with 1 year of International Call Center Voice experience Should be willing to work in shifts in a 24 x7 work environment Should be residing within Transport Boundaries Excellent telephone soft skills & thorough telephone functional skills Ability to handle stressful situations. Ability to deal professionally with irate customers. Preferences: Good Knowledge of PC Hardware/ Software for desktop & portable systems Any relevant Certification/Technical Qualification Interview Date : 11th March 2020 Timings : 12:00 pm to 3:00 pm Interview Venue : Dell International Services India Pvt. Limited, Vipul Tech Square, Sector - 43, Gurgaon - 122002 Near Sector 42-43 Rapid Metro Station *Note - Please carry a resume & valid Govt. ID proof","location":"Gurgaon","experience":"0 - 1 Years"},{"date":"11, 12, 13, 14 - Mar - 2020","skills":"Php, Larvel, Codeigniter Framework","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Ajax Media Tech Private Limited, 180, Capital Towers, Kodambakkam Chennai","phone":"Not Provided","profile":"PHP Developer \nAjax Media Tech Private Limited","description":"We are hiring for Php with Larvel with minimum 2 years of experience. Walk-in Date/ Time: 10th March - 14th March 2020, 9 AM onwards Interview Venue: Ajax Media Tech Private Limited 180, Capital Towers, Kodambakkam Chennai Contact Person- SILAN Interested candidates can share your cv to muthulakshmi@ajaxmediatech.com","location":"Chennai","experience":"2 - 5 Years"},{"date":"11 - Mar - 2020","skills":"Technical Support, Production Support/ Application Support","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Wipro, Building 2 | Candor Tech Space | Tikri | Sector 48 Gurgaon - 122 001","phone":"Not Provided","profile":"Application Support (Unix, SQL) \nWipro HR Services (India) Private Limited","description":"Wipro HR Services India Pvt Limited is looking for a Production Support/ Application Support Engineer Any ideal candidate will possess following skills: Candidate should have good knowledge on UNIX Environment. Good database skill (DB2/ SQL/ Oracle) Need exp. In production support/ Application support Shift : 11 am - 9 pm and 5 pm-3 am Looking for only immediate joiners. (30 days above notice period would not be entertained) Education: B.E/ B.Tech/ MCA/ M.Tech Experience: 1 to 2 years Job Location: Gurgaon You bring knowledge & expertise Defined career roadmap which offers growth opportunities Performance based incentive program** Investment in talent development and skills enhancement Work life balance with 5 day work week Collaborative environment with best in class professionals Focus on colleague engagement and fun@work Depends on Process/ Client alignment Interview Date: 11th March 2020, Thursday Timing: 11:00 am- 4:00 pm Venue Details: Wipro, Building 2 | Candor Tech Space | Tikri | Sector 48 Gurgaon - 122 001 Mode of Interview: F2F followed by online assessment (Post assessment 2 rounds of interview) Entry Timing Is 10:30 AM- 11:30 AM NOTE: NO ENTRY AFTER 11:30AM !! Every round is an elimination round Entire interview process can take","location":"Gurgaon","experience":"1 - 2 Years"},{"date":"14 - Mar - 2020","skills":"PHP, MySQL, Postgresql, OOPS, Process Management, JQuery","qualification":"B.E./B.Tech, MCA/PGDCA","address":"DBXento Systems Private Limited, 4th Floor, Tower 9, SEZ, Magarpatta City, Pune - 411 013, Maharashtra.","phone":"7774033591","profile":"PHP Developers \nDBXento Systems Private Limited","description":"Candidate should be very good with PHP arrays (multi dimensional), sessions, optimization techniques. Should be good and effective while communicating in International language. Good enough to understand OOPs (object oriented programming) code and implement it in your programming solutions. Understanding the requirements and proactive enough get clarification on requirements. Good with using joins, sub-queries, indexing and writing optimize SQL for the given requirements. Should have strong logical ability and reasoning. Good to have: Knowledge and practical usage of Smarty template engine. Knowledge and practical usage of PostgreSQL. Should be able to write simple, clean and readable code. Have worked in an agile software development team. Working knowledge of JQuery Walk-in Date: 14th March 2020 Time: 9:30 AM - 3:00 PM Interview Venue: DBXento Systems Private Limited 4th Floor, Tower 9, SEZ, Magarpatta City, Pune - 411 013, Maharashtra. Contact Person- Swapnil (7774033591)","location":"Pune","experience":"2 - 7 Years"},{"date":"10, 11 - Mar - 2020","skills":"HR/ Recruitment, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Convate Consultancy Services Pvt. Limited, #41, 2nd Floor Next to HDFC ATM Opp. to Kemp Fort Mall Old Airport Road Murugeshpalya - Bangalore - 560 017","phone":"Not Provided","profile":"IT Recruiter/ Lead Recruiter \nConvate Consultancy Services Pvt. Limited","description":"Urgent Requirement for IT Recruiter/ Senior Recruiter/ Lead Recruiter's at Convate. (MBA / Under Graduate / Freshers with above 60 % academic aggregate can apply). We are looking for self-driven, high performance-driven and passionate Recruiters. Candidate should have good listening skills, thinking skills, communication skills and analytical skills. Job Responsibility: As a Recruiter in Convate, you will have an end-to-end recruitment responsibility, right from sourcing, screening and shortlisting of candidates; scheduling interviews for them based on the feedback received from the clients and tracking all the way to offer; following up with offered candidates till they join. Walk-in Date/ Time: 10th March - 11th March , 9 AM onwards Interview Venue: Convate Consultancy Services Pvt. Limited #41, 2nd Floor Next to HDFC ATM Opp to Kemp Fort Mall Old Airport Road Murugeshpalya - Bangalore - 560 017 Note: We are looking for candidates who can join immediately. Interested Candidate can forward the resumes to mary@convate.com","location":"Bangalore","experience":"2 - 7 Years"},{"date":"12 - Mar - 2020","skills":"General Administration, Front Desk/ Front Office Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Wiggles India, 5th Floor, Baner Biz Bay, Near Hotel Norvana, Baner, Pune - 411 045","phone":"Not Provided","profile":"Front Office Executive \nSixth Sense Retail Private Limited","description":"Educational Qualification: Any Graduate Work Experience: 1 to 3 Years Job Location: Pune Required Skills- Should have pleasant personality and excellent verbal communication skills Must Be fluent with Hindi, English, Marathi Language Should handle front desk responsibilities and admin work Walk-in Date/ Time: 12th March 2020, 11 AM onwards Interview Venue: Wiggles India 5th Floor, Baner Biz Bay, Near Hotel Norvana, Baner, Pune - 411 045","location":"Pune","experience":"1 - 3 Years"},{"date":"10, 11 - Mar - 2020","skills":"General Administration, Vendor Development/ Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Coffee Day Global Limited, Plot No-5, Ground Floor of Building, Beside Rainbow Hospital, Banjara Hills Road No 10, Hyderabad - 500 034.","phone":"8919877065","profile":"Administration Executive \nCoffee Day Global Limited","description":"Educational Qualification: Any Degree/ Post Graduate Work Experience : 1 to 3 Years, Location : Hyderabad Age : 22 - 27 Years Gender : Male Required Skills : Good Communication skills Should be good at operating system, MS Office. Job Responsibility- Answering incoming calls; taking messages and re-directing calls as required Dealing with email enquiries Taking minutes Diary management and arranging appointments, booking meeting rooms and conference facilities Data entry (sales figures, property listings etc.) General office management such as ordering stationary Organising travel and accommodation for staff and customers Arranging both internal and external events Possibly maintaining the company social media accounts Providing administration support to Sales Reps, Property Managers and Senior Management. Walk-in Date/ Time: 10th March - 11th March , 10 AM onwards Interview Venue: Coffee Day Global Limited Plot No-5, Ground Floor of Building, Beside Rainbow Hospital, Banjara Hills Road No 10, Hyderabad - 500 034. Contact Person- Syed (8919877065) Please carry your updated resume, Adhaar card and be on time @ 10 AM","location":"Hyderabad","experience":"1 - 3 Years"},{"date":"9 - Mar - 2020","skills":"Revenue generation, business banking, current account, B2B Sales, banking products","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Kotak Mahindra Bank Limited, 22, Ground Floor Ing Vysya House, MG Road, Bengaluru, Karnataka - 560 001.","phone":"Not Provided","profile":"Business Banking Executive \nKotak Mahindra Bank Limited","description":"We have Urgent openings for Business Banking Executive - Current Account for entire Bangalore location. Qualification: Minimum Graduate with appropriate experience in direct field sales Candidate Must have basic knowledge of Banking products & Role which he applied for. Preferred candidate From banking, Insurance, Stock broking & NBFC Maximum Age Limit - 28 Years Job Responsibility: To source customers for Current Account. Customers to be sourced from individuals, small businesses, trusts, associations, societies, corporates. Revenue Generation, Customer Acquisition, Customer Retention, Cost Efficiency Through Process Hardcore sales mentality. Primary motivation from achievement of targets. A hunter by orientation. Should be well groomed and presentable with ambassadorship qualities Walk-in Date: 9th March 2020 Timing : 10 AM to 01 pm Interview Venue: Kotak Mahindra Bank Limited, 22, Ground Floor Ing Vysya House, MG Road, Bengaluru, Karnataka - 560 001. Contact Person- Lohetha","location":"Bangalore","experience":"2 - 7 Years"},{"date":"9, 11, 12, 13, 14 - Mar - 2020","skills":"MIS Reporting, Back Office, Document Management, Data entry","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Alankit Limited, 1-8/54/1/1, Ist Floor, Prenderghast Road (P.G.Road) Secundrabad - 500 003","phone":"040-40300820","profile":"Back Office Executive \nAlankit Limited","description":"Candidate should be Any Graduate with good communication skills Must have good working knowledge of MS-Excel Typing speed should be min. 30-40 wpm. Job Responsibility:- Prepare, compile and sort documents for data entry Combine and rearrange data from source documents where required. Enter data from source documents into prescribed computer database, files and forms. Scan documents into document management systems or databases. To maintain MIS on Daily/ Weekly/ Monthly basis. Eligibility:- 1-2 years of experience in data entry. Freshers can also apply. Interested candidates can directly visit for Face to Face interview on below-mentioned venue:- Interview Date:- 9th, 11th to 14th March 2020 Timing:- 10:00 AM to 3:00 PM. Venue:- Alankit Limited, 1-8/54/1/1, Ist Floor, Prenderghast Road (P.G.Road) Secundrabad - 500 003 Contact Person:- Mr. Imran Contact Details:- 040-40300820/ 7290067031 Note:- Interested candidates can share their resume on ushar@alankit.com OR call on 7290012325.","location":"Hyderabad","experience":"0 - 2 Years"},{"date":"9 - Mar - 2020","skills":"mis preparation, mis reporting, customer communication","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Hexaware BPS Limited, Building No.3, A Block, Sector II, Opposite Indrayani Hotel, Millennium Business Park, Mahape, Ghansoli - 400710","phone":"Not Specified","profile":"MIS Executive \nHexaware Technologies Limited","description":"Hexaware Technologies Limited is currently hiring for an MIS Executive - Mahape. Eligibility: Any Graduate/ Undergraduates with Excellent English communication. Shift: General Shift with Sunday week off. Job Responsibility- HR & Operations MIS report for outstanding claims and settled claims. Maintaining daily, Weekly & Monthly MIS Reports. Maintaining TAT Adheres To Process. Client & Customer Communication Via Mail Handling Outlook & Preparing MIS Report as Per Process Requirement. Walk-In Date: 9th March 2020. Time: 12 pm to 5 pm Interview Venue: Hexaware BPS Limited, Building No.3, A Block, Sector II, Opposite Indrayani Hotel, Millennium Business Park, Mahape, Ghansoli - 400710 Contact Person- Apeksha Carry updated CV and any govt ID - Pan card/ Aadhar card","location":"Mumbai","experience":"1 - 3 Years"},{"date":"9, 10, 11, 12, 13, 14 - Mar - 2020","skills":"Office Administration, Housekeeping, Pest Control, Travel Arrangements, Back Office Operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Mohan Mutha Exports Private Limited, No : 961 Siyat house, Poonamallee high road, Chennai - 600 084","phone":"Not Provided","profile":"Administration Executive \nMohan Mutha Exports Private Limited","description":"Candidate should be Any Graduate with 3 to 5 years of experience in Office Administration, Housekeeping, Pest Control, Travel Arrangements, Back Office Operations, Vendor Management and Stationery Facilities Job Responsibility- Adept At Managing Administrative Activities Involving Purchase Of Equipments, Maintenance Of Procurement, Housekeeping, Safety, Security, Employee Induction Etc. Planning And Preparing Monthly Reports Pertaining To Finance Required For Maintaining Office Infrastructure And Facilities. Contracts Management. Managing Repair, Maintenance & Replacement of Office Equipments, Appliances, Furniture, Furnishings, Vehicles, Building, Etc. Purchasing, Implementation and Operations of Security and Surveillance. Vendor Management- Oversee Acquisition, Installation and Commissioning Of equipments that are required For the Facility - IT Systems, Air Conditioning Etc. Walk-in Date/ Time: 7th March - 14th March 2020, 11 AM onwards Interview Venue: Mohan Mutha Exports Private Limited No : 961 Siyat house, Poonamallee high road, Chennai - 600 084 Landmark : Mohan Rau hospital Contact Person- Sai Senthil","location":"Chennai","experience":"3 - 5 Years"},{"date":"9, 10, 11, 12, 13 - Mar - 2020","skills":"HR/ Recruitment, Talent Acquisition, IT staffing","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Affluent Global Service Pvt. Limited, Patton House-2, 3rd Floor, 4th B Cross Road, 5th Block, Kormangala, Behind Empire Hotel-Bangalore - 560 034","phone":"9606279001","profile":"IT Recruiter/ Talent Acquisition \nAffluent Global Service Private Limited","description":"We are looking for an HR Recruiter to manage our full cycle recruitment, from identifying potential hires to interviewing and evaluating candidates. Requirements:: Proven work experience as an HR Recruiter or similar role Familiarity with Applicant Tracking Systems and resume databases Experience with sourcing techniques Understanding of referral programs Solid verbal and written communication skills Sound judgement HR Recruiter responsibilities include sourcing candidates online, updating job ads and conducting background checks. If you have experience with various job interview formats, including phone screenings and group interviews, and can help us recruit faster and more effectively, wed like to meet you. Ultimately, you will play an important part in building a strong employer brand for our company to ensure we attract, hire and retain the most qualified employees. Job Responsibilities: Source potential candidates from various online channels (e.g. social media and professional platforms like Naukri and Monster) Craft recruiting emails to attract passive candidates Screen incoming resumes and application forms Interview candidates (via phone, video and in-person) Provide shortlists of qualified candidates to hiring managers Send job offer emails and answer queries about compensation and benefits Collaborate with managers to identify future hiring needs Act as a consultant to new hires and help them onboard. Walk-in Date/ Time: 9th March - 13th March 2020, 10 AM onwards Interview Venue: Affluent Global Service Pvt. Limited Patton House-2, 3rd Floor, 4th B Cross Road, 5th Block, Kormangala, Behind Empire Hotel-Bangalore -560034 Contact Person- Yashaswini if your interested please send your resume to yashaswinis@affluentgs.com Or Contact me on 9606279001","location":"Bangalore","experience":"1 - 5 Years"},{"date":"9, 10, 11, 12, 13 - Mar - 2020","skills":"Core Java, Servlets, SQL/ PostgreSQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Bombay Stock Exchange Limited, 23rd Floor, P.J. Tower Dalal Street, Fort, Mumbai - 400 001","phone":"022-22728928","profile":"Core Java Developer \nMarketplace Technologies Private Limited","description":"Candidate should have 1 to 2 years of experience on Software Development in Java Server component for front-office online trading system product. Online Trading systems knowledge will be an added advantage. Walk-in Date/ Time: 9th March - 13th March 2020, 11 AM onwards Interview Venue: Bombay Stock Exchange Limited 23rd Floor, P.J. Tower Dalal Street, Fort, Mumbai - 400 001 Contact Person:- Avinash Shelar Tel Number - 022-22728928","location":"Mumbai","experience":"1 - 2 Years"},{"date":"7, 9, 10, 11, 12, 13 - Mar - 2020","skills":"Core Java, J2Ee, Struts, SQL Queries, Spring, Hibernate","qualification":"B.E./B.Tech, MCA/PGDCA","address":"IN-SOLUTIONS GLOBAL LIMITED, 601/618, 6TH FLOOR, PALM SPRING, ABOVE CROMA, LINK ROAD, MALAD (W), MUMBAI - 400 064","phone":"Not Provided","profile":"Java Professionals \nIn Solutions Global Limited","description":"Candidate should have experience in developing J2EE application with extensive knowledge on Core Java. Good knowledge of Struts or spring or Hibernate Framework, Angular framework. Must have good knowledge of writing complex SQL Queries. Working experience in core java, Banking domain experience would be an added advantage Walk-in Date/ Time: 6th March - 13th March , 11 AM onwards VENUE IN-SOLUTIONS GLOBAL LIMITED 601/618, 6TH FLOOR, PALM SPRING, ABOVE CROMA, LINK ROAD, MALAD (W), MUMBAI - 400 064 Contact Person - Ankita Agrawal","location":"Mumbai","experience":"2 - 4 Years"},{"date":"9, 10, 11, 12, 13 - Mar - 2020","skills":"Java, Spring, Hibernate, Web Services","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Galaxe Solutions (India) Private Limited, 1st Floor, Voyager Building, ITPL Bangalore","phone":"080-41429739","profile":"Java Developer \nGalaxE Solutions (India) Private Limited","description":"We are looking Shorter notice period candidates who can join within 30 days Educational Qualification: BE/ B.Tech/ MCA Relevant experience in Java 2 to 3 Years Required Skills: Java, Spring, Hibernate, Web Services Interview Process: Technical test followed by In person Interview Time and Venue 9th March - 13th March 2020, 11 AM onwards Interview Venue: Galaxe Solutions (India) Private Limited 1st Floor, Voyager Building, ITPL Bangalore Contact Person- Sudipa (080-41429739)","location":"Bangalore","experience":"2 - 4 Years"},{"date":"14 - Mar - 2020","skills":"Java, Multi-threading, Concurrency, Hibernate/ JPA, Springboot, Microservices","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Xavient Digital - powered by TELUS International, E-54, NSEZ Phase 2 Noida","phone":"Not Provided","profile":"Java Professionals \nXavient Digital - Powered by Telus International","description":"We are conducting an Interview drive where we are looking forward to have a seasoned backend Java Professional with Below mentioned are the details for your reference. Candidate must have strong knowledge of OOP's Concept and Design Patterns. Good knowledge of SOLID & DRY design principal ,with java version 8 and above. Experience in Java, Multi-threading, Concurrency and Hibernate/ JPA, Springboot, Microservices. Should be proficient in Java 8 features like lambda , Streams ,API and Functional Interface. Should have working experience on SQL/ NO SQL Database Should have experience in TDD. Development experience of web services is Must with REST or SOAP UI. Strong hands on experience in micro-services development using Spring Boot. Adequate experience in project building tools like Jenkins ,MAVEN or Gradle. Good to have Containerization Experience. Good to have a knowledge of Kafka or any JMS tool. Good to have Agile/ Scrum Knowledge. Good to have Health Domain Experience. Should Possess strong Communication Skills. Able to execute assigned tasks independently without constant supervision. Walk-in Date: 14th March 2020 Time: 10:00 AM to 2:00 PM Interview Venue: Xavient Digital - powered by TELUS International E-54, NSEZ Phase 2 Noida POC: Vibhav Shukla/ Shadman Tauheed","location":"Noida","experience":"3 - 7 Years"},{"date":"9 - Mar - 2020","skills":"Core JAVA, J2EE, Spring, JDBC, GWT, Multi-threading, SQL/ Database Concepts","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Estel Technologies Private Limited, #126, Sector 44, Institutional Area Gurgaon, Haryana","phone":"0124-2578204","profile":"Core Java Developer \nEstel Technologies Private Limited","description":"Candidate must have strong Core JAVA development experience Good understanding Architectural Design Patterns Experience in refactoring and working with existing code Solid database experience Should have 3 to 8 years of Core JAVA in an application development environment Well versed in Core Java. Which includes Springs, Hibernate, Webservices and Multi-threading. Knowledge of Java related technologies such as J2EE, Spring, JDBC, GWT, Multithreading - Proficient in: SQL/ Database Concepts/ LINUX/ UNIX/ ORACLE Development, deployment and testing Agile Methodology Review currently running architecture Identify bottlenecks and loopholes for performance, memory management, code reusability, applications modules, etc. Propose industry best practices and upgraded architecture Ticket management experience: Jira Experience with source control systems such as Git, SVN, etc. Walk-in Date: 9th March 2020, Timing - 11:00 am to 4:00 pm Interview Venue: Estel Technologies Private Limited #126, Sector 44, Institutional Area Gurgaon, Haryana Contact Person- Nitanjali/ Saif Phone No. 0124-2578204","location":"Gurgaon","experience":"3 - 8 Years"},{"date":"9, 10, 11 - Mar - 2020","skills":"Core/ Advanced Java, Servlets, JSP, Spring framework, Spring boot and Spring MVC","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Vajra IOT Private Limited (Formerly Known as GreenArkEnersol) #2-56/2/19, 4th Floor, Vijaya Towers, 100 Feet Road, Madhapur, Hi-Techcity, Hyderabad, Telangana - 500081","phone":"040 42206219","profile":"Software Engineer (Java) \nVajra IOT Private Limited","description":"Person must have strong knowledge of Core & Advanced Java, Servlets, JSP, Spring framework, Spring boot and Spring MVC, Spring Security, Struts and Spring Data, Angular JS5+, Hibernate, JDBC, JPA, HTML, CSS, JavaScript and JQuery. Singleton, DAO, DTO, VO,Rest APIs Candidate should be good knowledge in software development. Walk-in Date/ Time: 9th March - 11th March 2020, 10 AM onwards Interview Venue: Vajra IoT Private Limited (Formerly Known as GreenArkEnersol) #2-56/2/19, 4th Floor, Vijaya Towers, 100 Feet Road, Madhapur, Hi-Techcity, Hyderabad, Telangana - 500081 Phone No: 040 42206219, Ext: 102 Email: hr@vajraiot.com","location":"Hyderabad","experience":"2 - 5 Years"},{"date":"10 - Mar - 2020","skills":".Net/ C# and SQL","qualification":"B.E./B.Tech","address":"UNIFY Technologies Private Limited, 4th Floor, Pioneer Towers, Plot No-16, Software Units Layout, Madhapur, Hyderabad, Telangana - 500 081.","phone":"Not Provided","profile":"Software Engineer (.Net/ C# and SQL) \nUnify Technologies Private Limited","description":"Education: Any full time BE/ B.Tech graduate is eligible to apply for these role Work Experience (In Years): 3 to 6 Years Job Location: Hyderabad Candidate must have strong experience in C# and SQL Able to write complex queries & good in OOPS concepts Must have strong written and verbal communication skills Should have strong C# programming skills Walk-in Date/ Time: 10th March 2020, 10 AM onwards Interview Venue: UNIFY Technologies Private Limited 4th Floor, Pioneer Towers, Plot No-16, Software Units Layout, Madhapur, Hyderabad, Telangana - 500 081. Landmark: Opposite to Novartis, In Orbit Mall Road Contact Person- Mounika If you are interested, please share your updated profile with highlighting all key skills to mounika@unifytech.com with below details: - Updated Resume Total Year Experience: Current CTC: - Expected CTC: - Notice Period: - Current Location:- Reason for Job Change Availability date and time for F2F Interview :","location":"Hyderabad","experience":"3 - 6 Years"},{"date":"7 - Mar - 2020","skills":".NET (C#, ASP .Net), Angular JS, and HTML5/ CSS3, WCF","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Genus Power Infrastructures Limited, D-116, Okhla Industrial Area Phase 1, New Delhi - 110 020.","phone":"828044223","profile":".Net Developer \nGenus Power Infrastructures Limited","description":"Candidate must have good programming Skills in C, C++, ASP, HTML5, .Net, Solid understanding of relational database design and querying concepts and OOPS Concept Should have knowledge of client/ server application development Must have good exposure of SDLC Familiarity with the web app and mobile app frameworks, SQL Server and design patterns (e.g. Model-View-Controller (MVC)). Working knowledge of .NET (C#, ASP .Net), Angular JS, and HTML5/ CSS3, WCF. Familiarity with architecture styles/ APIs Walk-in Date/ Time: 7th March 2020, 8 AM onwards Interview Venue: Genus Power Infrastructures Limited D-116, Okhla Industrial Area Phase 1, New Delhi - 110 020. Contact Person- Neha Chouhan Phone: 828044223","location":"Delhi","experience":"2 - 6 Years"},{"date":"7 - Mar - 2020","skills":"C#.NET, ASP .NET, WCF, HTML5, CSS3, JavaScript & JQuery MySQL/ MS SQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Prime Focus Technologies Limited, 5B, RMZ Eco World,Bellandur, Devarabeesanahalli, Bangalore","phone":"9606200973","profile":".Net Developer \nPrime Focus Technologies Limited","description":"Candidate should have 2 to 6 years' of industry experience with basic to intermediate knowledge of following technologies- C#.NET, ASP .NET, WCF, HTML5, CSS3, JavaScript & JQuery MySQL/ MS SQL Job Responsibilities: Development of Web Frameworks, Pages, Components and JavaScript Development of SQLs, Stored Procedures, Jobs Development of Web Services using WCF, Rest Walk-in Date/ Time: 7th March 2020, 10 AM onwards Interview Venue: Prime Focus Technologies Limited, 5B, RMZ Eco World,Bellandur, Devarabeesanahalli, Bangalore Contact Person- Mownika Reddy A Phone No: 9606200973 Note : This drive is Only for the candidates with Immediate - 30 Days notice Period","location":"Bangalore","experience":"2 - 6 Years"},{"date":"7 - Mar - 2020","skills":".Net Framework, C#/ VB .Net, ASP .Net, SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA","address":"GlobalData Research Center Private Limited, 3rd Floor, Jyoti Pinnacle Building, Opposite to Prestige IVY League Appt, Kondapur Road, Hyderabad, Telangana - 500 081","phone":"Not Mentioned","profile":".Net Developers \nGlobalData Research Center Private Limited","description":"Candidate should have Bachelors Degree in Engineering /Technology / MCA with minimum 3 years plus of experience in .Net Framework, C#/ VB .Net, ASP .Net, SQL Server 2005/ 2008. Well-versed with JavaScript, AJAX, Web services, Threading Have strong concepts of OOPS. Hands on experience in product/ project development using MVC. Exposure of Endeca Configuration, NHibernate, JQuery etc., Strong database programming skills(T-SQL) Good communication skills in English, both written and verbal and analytical skills. Understanding of web usability issues and information architecture. Strong interpersonal and communication skills. Able to work and thrive in a fast-paced team environment and flexible to accommodate demanding Project schedules. Ability to express technical concepts clearly to people with no technical background Roles and Responsibilities: Design ,Develop and maintain simple to complex .net applications Participate in agile development process to ensure project deliverables are met, on time and of high quality The quality and completeness of assignments, including initial design, development, bug fixing, quality engineering, documentation, and general product maintenance. To understand specification document and perform coding as per the design and standards & guidelines which are defined by Immediate Lead/Manager. Able to provide technical/solution guidance to Software Engineers/Junior Programmers Should be able to review the code/ work done by Software Engineers/Junior Programmers Doing impact analysis and resolving in-process problems independently, or with minor input from the technical lead. Interfacing with support and other teams for testing, delivery and product dependencies. Coordinating with test team members for system testing for specialized scripts. Walk-in Date: 7th March 2020 (Saturday), Timings : 10:00 am till 2:00 pm Interview Venue: GlobalData Research Center Private Limited 3rd Floor, Jyoti Pinnacle Building, Opposite to Prestige IVY League Appt, Kondapur Road, Hyderabad, Telangana - 500 081 Contact Person- Salim","location":"Hyderabad","experience":"3 - 9 Years"},{"date":"7 - Mar - 2020","skills":"Angular, JavaScript, C# .Net, RESTful Web services","qualification":"B.E./B.Tech, MCA/PGDCA","address":"QuEST Global Engineering Services Private Limited, QuEST Towers, Technopark Campus, Trivandrum.","phone":"Not Provided","profile":"Full Stack Developers (C# .Net) \nQuEST Global Engineering Services Pvt. Limited","description":"Candidate should have 3 + years of strong programming experience in Angular/.Net and other related libraries with Object Oriented Programming design patterns. Experience in development of applications using Angular 8, JavaScript, C# .Net Experience in developing RESTful web services. Experience in Protractor for UI testing. Experience in BDD implementation. Experience in working with AGILE methodology and complete product development cycles. Walk-in Date: 7th March 2020 Timings: 9.30 AM - 12.30 PM Interview Venue: QuEST Global Engineering Services Private Limited QuEST Towers, Technopark Campus, Trivandrum. Contact Person- Bobby","location":"Trivandrum","experience":"3 - 8 Years"},{"date":"7 - Mar - 2020","skills":"Core Java, Selenium, Webdriver, Automation Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Aspire Systems (India) Private Limited, 1/D-1,Sipcot IT Park, First Main Road, Siruseri, Tamil Nadu - 603 103","phone":"044-40186400","profile":"Automation Testers \nAspire Systems (India) Private Limited","description":"Candidate should have 3 to 6 years of experience in designing and implementing Automation Testing Strategies and Framework for large scale systems. Proficiency in Core Java (Programming & Logical) or Ruby, TDD/ BDD and test automation frameworks. Must have worked extensively on Selenium Webdriver, Appium. Should have good hands-on experience in REST/ SOAP services automation Expertise in build & CI tools like Jenkins, Ant, Maven and Gradle Working knowledge in version control tools, such as Git, Github, Stash etc. Good understanding of database concepts; Able to write SQL queries Walk-in Date: 7th March 2020 Time: 8:30 AM to 12.30 PM Interview Venue: Aspire Systems (India) Private Limited 1/D-1,Sipcot IT Park, First Main Road, Siruseri, Tamil Nadu - 603 103 Contact Person- Maheswari Saminathan Phonr No. 044-40186400","location":"Chennai","experience":"3 - 6 Years"},{"date":"7 - Mar - 2020","skills":"QA/ Automation Testing, C#, Java programming skill","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Motivity Labs Private Limited, 10th floor, Water Mark Building, Kondapur, Hitech City, Hyderabad, Telangana - 500 084","phone":"Not Provided","profile":"QA/ Automation Tester \nMotivity Labs Private Limited","description":"We are currently inviting potential team members with below experience : Experience in Selenium Web driver + Java Knowledge on C#, Java programming skills will be preferred Proven experience in developing Automation scripts for Desktop, Web, Mobile etc., applications Should have designed and developed automation frameworks using various Automation tools Must excel in planning, prioritization of skills while demonstrating flexibility and the ability to multi-task and work under minimal supervision Good work exposure to Agile Methodology Walk-in Date/ Time: 7th March 2020, 10 AM onwards Interview Venue: Motivity Labs Private Limited 10th floor, Water Mark Building, Kondapur, Hitech City, Hyderabad, Telangana - 500 084 Landmark: Opposite building of TechMahindra Infocity Gate Contact Person- Satya/ Prashanth","location":"Hyderabad","experience":"3 - 8 Years"},{"date":"7 - Mar - 2020","skills":"Software testing, Performance testing, Automation testing, Manual testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Ivy Mobility Solutions Limited, Prince Infocity Phase 1, 3rd Floor, 286/1, Rajiv Gandhi Salai, OMR Perungudi, Chennai - 600 096.","phone":"Not Provided","profile":"Software Testing Engineer \nIvy Mobility Solutions Limited","description":"Job Opportunity for Manual, Automation and Performance Test Engineers. Immediate Joiners are preferred. Please find the below Job Description for your reference. Manual Test Engineer Job Location : Chennai Experience: 3-5 years Job description: 1. Software Testing Experience 2. Web based application testing 3. Well versed in writing test cases 4. Work experience with Mobile Testing 5. Knowledge in Web API testing 6. Experience in writing SQL Queries 7. Working knowledge in any test management / defect management tools 8. Good Attitude and able to handle pressure situation 9. Experience in Salesforce testing is an added advantage Automation Test Engineer Job Location : Chennai Experience: 3-5 years Job description: 1. Should have Katalon/Selenium hands on experience of 3 years 2. Should have BDD/Cucumber experience 3. Should be able to create a data driven framework for E2E testing 4. Should be able to lead independently and coordinate with developers and other stakeholders onshore/offshore 5. Should be able to create and understand Automation Test Strategy and Test Plan 6. FMCG experience preferable 7. Should have good communication skills Performance Test Engineer- Job Location : Chennai Experience: 3-5 years Job description: 1. Should have minimum 3 years of Experience in Performance Testing 2. Good understanding of overall performance test cycle 3. Detailed knowledge of Performance testing tool JMeter/LoadRunner 4. Understanding Performance Test Strategy 5. Understanding of End to End performance testing and should interact with Stakeholders for Requirement Gathering and planning performance tests. 6. Good understanding of NFRs and workload model creation. 7. Understanding of performance monitoring experience on DynaTrace Reports 8. Should be good team player, self-driven, proactive and quick learner. 9. Knowledge of FMCG Domain is an advantage Interested candidates can walk-in on 7th March 2020 Saturday any time between 10 AM till 3 PM. Venue Details: Ivy Mobility Solutions Limited, Prince Infocity Phase I, 3rd Floor, 286/1 Rajiv Gandhi Salai, OMR Perungudi, Chennai - 600 096 Contact Person- Abirami","location":"Chennai","experience":"3 - 5 Years"},{"date":"7 - Mar - 2020","skills":"Site management, administration, soft services, facility management, housekeeping","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Knight Frank (India) Private Limited, 1505-1508, Knight Frank Signature Tower South City-1, Tower-B Gurgaon - 122 001.","phone":"Not Provided","profile":"Facility Executive - Soft Services \nKnight Frank (India) Private Limited","description":"Candidate should have 2 to 4 years of relevant experience in administration and hospitality. Particular Aptitudes/ Skills - People skills, patience and perseverance, Excellent verbal and written Communication Lay down housekeeping standards for all sites. Conduct regular site visits to ensure that these standards are met. Selection and training of Housekeeping personnel at the sites. Responsible for Monitoring of daily energy consumption and take necessary steps to minimize the same Drive & ensure to follow the HSW norms & policy Advise the Site Manager on implementing various cost effective measures. Co-ordinate with vendors Ensure receipt and analysis of site reports to identify loopholes and avert crisis. Ensure adherence to policies and procedures applicable to the FM function. Walk-in Date/ Time: 7th March 2020, 11 AM onwards Interview Venue:: Knight Frank (India) Private Limited 1505-1508, Knight Frank Signature Tower South City-1, Tower-B Gurgaon - 122 001. Contact Person- Nitish","location":"Gurgaon","experience":"2 - 4 Years"},{"date":"7 - Mar - 2020","skills":"HR/ Recruitment, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Kotak Mahindra Bank Limited, 22, Ground Floor Ing Vysya House, MG Road, Bengaluru, Karnataka - 560 001","phone":"Not Provided","profile":"HR Executive - Internship \nKotak Mahindra Bank Limited","description":"We have Urgent openings for HR Internship (Full time) for Bangalore location. Job Role: Sourcing Screening On-boarding Recruitment processing Only those candidates can apply who : are available for full time Internship have relevant skills and interests Women willing to start / restart their career can also apply. Fresher's looking for jobs may also apply Other perks: Certificate, Letter of recommendation and hands of experience in HR domain. Walk-in Date: 7th March 2020 Interview Timing : 10 AM to 12 PM Interview Venue: Kotak Mahindra Bank Limited 22, Ground Floor Ing Vysya House, MG Road, Bengaluru, Karnataka - 560 001 Contact Person- Lohetha Please note : Interview timing is 10.30 am to 12:30 pm only Candidates coming after 12:30 pm won't be entertain","location":"Bangalore","experience":"0 - 1 Years"},{"date":"11 - Mar - 2020","skills":"Automation Testing, Test Framework, Selenium, Katalon","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Wipro HR Services (India) Private Limited, Tech Boulevard, Plot No. 6, Tower, Sector 127, Noida Expressway, Noida.","phone":"Not Provided","profile":"Automation Testing Engineer \nWipro HR Services (India) Private Limited","description":"Wipro HR Services (India) Private Limited is looking for Automation Testing Engineers for Noida Location Any ideal candidate will possess following skills: Candidate should have minimum 2 year relevant experience in Automation Testing At least 2 years of experience in Selenium/ Katalon is must. Good Exposure of testing in Agile. Sound knowledge of Core Java is must. Framework development experience is good to have. Robotics and Data warehousing experience is good to have Educational Qualification: B.E/ B.Tech/ MCA/ M.Tech Work Experience: 2 to 4 years Job Location: Noida Interview Date: 11th March 2020. Entry Timing Is 9:30 AM- 11:30 AM Interview Venue: Wipro HR Services (India) Private Limited Tech Boulevard, Plot No. 6, Tower, Sector 127, Noida Expressway, Noida. Point of Contact- Yashika Maan IMPORTANT NOTE: NO ENTRY AFTER 11:30 AM ONLY Immediate to 15 days joiners are allowed. Every round is an elimination round Entire interview process can take 3 hours","location":"Noida","experience":"2 - 4 Years"},{"date":"7 - Mar - 2020","skills":"statutory compliance, advanced excel, salary processing, attendance management","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Inlead Electronic Private Limited (Formerly known as OPPO Mobiles MU Private Limited) 201, AJ House, Marol Maroshi Road, Near Silver Inn Hotel, Andheri - East, Mumbai","phone":"Not Provided","profile":"Senior HR Executive - Male \nInlead Electronic Private Limited","description":"We have an urgent opening for the position of Sr. HR Executive at Inlead Electronics Pvt Limited (Formerly known as OPPO Mobiles MU Pvt Limited) Any Graduate/ Diploma/ MBA- HR Work Experience: 4 to 8 Years ONLY MALE CANDIDATES CAN APPLY Salary upto 28K Gross Location: Marol Naka (Near Marol Metro Station) Required Skills: 1. Well versed with payroll knowledge 2. Should be well versed with advance excel and formulas 3. Should have good command on communication skills. Role & Responsibility: 1. End to end salary processing 2. ON Boarding/ Exit formalities 3. Taking care of attendance management 4. Statutory compliance 5. Employee Engagement activities 6. Other HR Activities If your profile is relevant please do walk-in for the interview on 7th March' 2020 Address: INLEAD ELECTRONIC PRIVATE LIMITED (Formerly known as OPPO Mobiles MU Private Limited) 201, AJ House, Marol Maroshi Road, Near Silver Inn Hotel, Andheri - East, Mumbai Time: 10:00 am to 3pm Contact - Kishan","location":"Mumbai","experience":"4 - 8 Years"},{"date":"7 - Mar - 2020","skills":"Software Testing, Manual Testing, QA Concepts, Web-application testing, SQL queries","qualification":"B.E./B.Tech, MCA/PGDCA","address":"ENTrust Software & Services Private Limited, Level II, Block - 6, DLF IT Park, Mount - Poonamalle Road, Ramapuram, Chennai - 600 089.","phone":"040-48681841","profile":"Manual Testers \nNTrust Infotech Private Limited","description":"Currently we are hiring Manual Testers with 2 to 3 years of experience for ongoing projects. 2 to 3 Years of solid experience in Manual Testing with strong knowledge in QA concepts. Proven hands-on in Software Testing experience. Strong knowledge in web-application testing Basic knowledge in SQL queries Experienced in doing test estimation, tests planning and designing. Experience with different testing types like Functional, Regression, Integration, Smoke, Database etc. Expert in identifying & writing Test Scenarios, Test Cases Sound knowledge of Defect Management Cycle and logging defects. Good in analytical and communication skills. Maximum Salary : Rs. 3 L/ Annum Job Location : Chennai DLF, Porur (Immediate joiners are highly preferred) Interested candidates, can drop into our office, for Interview Process on Saturday (7th March, 2020) between 10.00 AM and 2.00 PM Interview Venue : ENTrust Software & Services Private Limited Level II, Block - 6, DLF IT Park, Mount - Poonamalle Road, Ramapuram, Chennai - 600 089. Phone No: 040-48681841 Extn : 3113 Contact Person : Suresh Narayansamy - HR","location":"Chennai","experience":"2 - 3 Years"},{"date":"7 - Mar - 2020","skills":"HR/ Recruitment, Interview Coordination, Screening, Placement, Selection Process","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Tringapps Research Labs Pvt. Limited, Unit 2-5, Zenith block, Ascendas IT Park Taramani","phone":"Not Provided","profile":"HR Executive \nTringapps Research Labs Pvt. Limited","description":"Candidate should have 2 to 4 years of hands-on experience in sourcing for IT skills in a fast-paced recruiting environment, either in-house or in an agency/ consultancy environment. Strong interpersonal and communication skills (both written and oral), organized, presentable & well-spoken with convincing skills. Should have excellent experience in working on job portals &social sites like LinkedIn, Facebook, Twitter etc. Must have basic understanding of technologies like Java, iOS, Android, etc. Must have the ability to handle pressure and work as per assigned target. Must be having the capability to work with a team or contribute individually. A flexible team player with a proven ability to work successfully with diverse teams. Keen to make a career working in the recruitment industry. An MBA with Specialization in HR is an added advantage. Walk-in Date/ Time: 7th March 2020, 10 AM onwards Interview Venue: Tringapps Research Labs Pvt. Limited Unit 2-5, Zenith block, Ascendas IT Park Taramani Contact Person- Eswari","location":"Chennai","experience":"2 - 4 Years"},{"date":"7 - Mar - 2020","skills":"General Administration, Front Office/ Receptionist Activities, Office Coordination","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Nocle Systems & Controls Pvt. Limited, A-46 Sector-67 Noida - 201 301.","phone":"9953212668","profile":"Front Office Coordinator \nNocle Systems & Controls Pvt. Limited","description":"Looking for experienced lady officer/coordinator with good communication and managerial skills for a well established organisation in Industrial Automation. No bar on Qualification and Salary. We believe in result oriented candidate for this profile Walk-in Date/ Time: 7th March , 11 AM onwards Interview Venue: Nocle Systems & Controls Pvt. Limited A-46 Sector-67 Noida - 201 301. Contact Person- Richa Kohli Phone No. 9953212668","location":"Noida","experience":"1 - 3 Years"},{"date":"7 - Mar - 2020","skills":"Payroll, Statutory Compliance, Taxation","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Opportune Technologies Private Limited, Gemstar Commercial Complex, 411, Ramchandra Lane, Opp. Religare Office, Kanchpada, Malad West, Mumbai, Maharashtra - 400 064.","phone":"Not Provided","profile":"Payroll Executive \nOpportune Technologies Private Limited","description":"Urgent Opening for Payroll Executive at Malad Handling End to End payroll activities through HRMS software. Should have good knowledge of employee Taxation & statutory compliance like PF, ESIC, PT etc. Job role require 60% travelling Walk-in Date/ Time: 7th March 2020, 11 AM onwards Interview Venue: Opportune Technologies Private Limited Gemstar Commercial Complex, 411, Ramchandra Lane, Opp. Religare Office, Kanchpada, Malad West, Mumbai, Maharashtra - 400 064.","location":"Mumbai","experience":"1 - 6 Years"},{"date":"7 - Mar - 2020","skills":"HR/ Recritment, Talent Management, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Maze Net Solution Private Limited, Padhmalaya towers, 12E, 1st Floor, 10th St, Gandhipuram, Coimbatore, Tamil Nadu - 641012.","phone":"7397765015","profile":"Talent Acquisition Executive \nMaze Net Solution Private Limited","description":"Qualification: Any degree with 60% and above in academics. Experience: 1 to 2 years of experience in TA / Similar roles Extraordinary hiring skills- Master communication skill with a great network in corporate and IT talent market Team player, critical thinker with problem solving Walk-in Daate/ Time: 7th March 2020, 10 AM onwards Interview Venue: Maze Net Solution Private Limited Padhmalaya towers, 12E, 1st Floor, 10th St, Gandhipuram, Coimbatore, Tamil Nadu - 641012. Contact Person- Prabhakar ( 7397765015 )","location":"Coimbatore","experience":"1 - 2 Years"},{"date":"7 - Mar - 2020","skills":"Android, Web Technologies, ReactJS, Python Django, PostgreSQL Mobile Technologies","qualification":"B.E./B.Tech, MCA/PGDCA","address":"K12 Techno Services Private Limited, #41 Trinetra Building, New BEL Road Mayuri Signal, Behind Punjab National Bank, AG's Layout, Mathikere, Bengaluru - 560 054.","phone":"9513917307","profile":"Software Developer (Android/ Fullstack) \nK12 Techno Services Private Limited","description":"K12 Techno Services Private Limited is hiring Software Developers for below mentioned positions: Front End Developer- (0-3 Years) Back End Developer- (0-3 Years) Full Stack Developer- (2-5 Years) Android Developer- (0.6-Years) Web Technologies - ReactJS, Python Django, PostgreSQL Mobile Technologies - Java, Kotlin, Firebase Walk-in Date/ Time: 7th March 2020, 10 AM onwards Interview Location: K12 Techno Services Private Limited #41 Trinetra Building, New BEL Road Mayuri Signal, Behind Punjab National Bank, AG's Layout, Mathikere, Bengaluru, Karnataka - 560 054. Contact Person- Sunitha Kumari Phone: 9513917307","location":"Bangalore","experience":"0 - 2 Years"},{"date":"9, 10, 11, 12, 13 - Mar - 2020","skills":"HR Recruitment, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Amadeus India Private Limited, Plot No. 7, Pocket No. 6&7, Sector-C, Vasant Kunj, New Delhi- 110 070","phone":"011-41336647","profile":"Senior HR Recruiter \nResBird Technologies Private Limited","description":"Candidate should have 3 to 7 years of proven work experience as an HR Recruiter Must have solid verbal and written communication skills Experience with sourcing techniques are preferred Good MS Office ( Especially Excel ) Roles and Responsibilities- Design and update job descriptions Source potential candidates from various online channels, Portals, Reference, Social Media, Head hunting etc Craft recruiting emails to attract passive candidates Screen incoming resumes and application forms Interview candidates (via phone, video and in-person) Prepare and distribute assignments and numerical, language and logical reasoning tests Advertise job openings on companies careers page, social media, job boards and internally Provide shortlists of qualified candidates to hiring managers Send job offer emails and answer queries about compensation and benefits Monitor key HR metrics, including time-to-fill, time-to-hire and source of hire Collaborate with managers to identify future hiring needs Act as a consultant to new hires and help them onboard The above role is 80% recruitment+20% generalist Walk-in Date/ Time: 9th March - 13th March 2020, 9 AM onwards Interview Venue: Amadeus India Private Limited Plot No. 7, Pocket No. 6&7, Sector-C, Vasant Kunj, New Delhi- 110 070 (Opposite-DPS School Land mark-Mini Cooper/ Bird Automotive showroom) Contact - Sneha (011-41336647) Contact Person: Ms. Sneha Candidates who apply have to be available for Face2Face interview. Please ensure to arrange the following documents (Mandatory) : Updated Resume passport size photograph. 10th proof (Either Mark sheet or Certificate any one). Highest Education Proof (Either Mark sheet or Certificate or Degree- any one). Pan Card Copy. Adhaar Card. Passport copy and Voter ID-card. Last 3 months salary slip. Appointment Letter for the current company. Relieving letters of all earlier companies.","location":"Delhi","experience":"3 - 7 Years"},{"date":"6 - Mar - 2020","skills":"Production Support, Application Support, Unix, SQL, Websphere","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"FIS Global Business Solutions India Private Limited, SJR I Park, 2nd Floor, Tower 3, Block Warp, EPIP Zone, Whitefield Road, Bangalore - 560 066.","phone":"Not Provided","profile":"Application Support Engineer \nFIS Global Business Solutions India Pvt. Limited","description":"FIS Global Business Solutions India Pvt. Limited is hiring for Application Support Engineer at Bangalore location Required Skills: Production Support, Application Support, Unix, SQL, Websphere knowledge Work Experience: 3 to 5 Years Walk-in Interview on 6th March 2020 Timings: from 11 AM onwards Venue Details- FIS Global Business Solutions India Private Limited SJR I Park, 2nd Floor, Tower 3, Block Warp, EPIP Zone, Whitefield Road, Bangalore - 560 066. Landmark: Opposite to Satya Sai Baba Hospital and INORBIT Mall","location":"Bangalore","experience":"3 - 5 Years"},{"date":"5, 6 - Mar - 2020","skills":"Functional, System testing, Writing test cases, Preparing Test Plans, etc.","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Adecco India Private Limited, Montieth Place, No. 47, 2nd Floor, Montieth Road, Egmore, Chennai - 600 008.","phone":"8778553657","profile":"Front Office/ Admin Executive \nAdecco India Private Limited","description":"Educational Qualification: Any Graduate/ Post Graduate Work Experience: Fresher or 0 to 5 Years Male And Female Both Apply Job Location: Chennai Role & Responsibility: Manages and increases the sales in coordination with Area Retail Operations Manager Closely and daily monitoring the staff from the vendor and make sure of the smooth Lounge operations Closely manages the Vendor and quality Coordinates and will be responsible to upkeep of store for all repairs and maintenance of the store. Will coordinates for all the vendors (Equipment, Printer, etc) related issues Interested candidates can directly walk-in for interview on 5th & 6th March 2020 at the below mentioned address- Adecco India Private Limited Montieth Place, No. 47, 2nd Floor, Montieth Road, Egmore, Chennai - 600 008. Landmark: Opposite to Central Bank Near Rajarathinam Stadium And Alsa Mall","location":"Chennai","experience":"0 - 5 Years"},{"date":"5, 6, 7, 9, 10, 11, 12, 13, 14 - Mar - 2020","skills":"General Administration, Front Desk, Vendor Management, Stationery, EPABX","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"SDP & Associates, 3A, Rammohan Mullick Garden Lane, RAIKVA (E.M.Bypass- Beliaghata Crossing), 3rd Floor, 10B, Kolkata - 700 010.","phone":"7044473444","profile":"Front Desk & Admin Executive \nSDP & Associates","description":"Candidate should be Any Graduate with 2 to 4 years of experience in General Administration, Front Desk, Vendor Management, Stationery, EPABX. Must have excellent communication skills Job Responsibility- Courier Handling - in and out/ updating register/ letters of outgoing. Printing documents- Daily/ Monthly printing. Handling phone calls (incoming/ outgoing). Daily Attendance of employees, Monthly attendance of employees for salary for Kolkata/ Mumbai. Vendor Management- CCTV, Courier, AC, Bio Metric, Telephone service. Noting messages/ making general correspondences. Stock of Stationery, Cartridge, Coffee Machine Stuffs, MIS. Ensure timely opening and closure of office on a daily basis. Walk-in Date/ Time: 5th March - 14th March 2020, 10 AM onwards Interview Venue: SDP & Associates 3A, Rammohan Mullick Garden Lane, RAIKVA (E.M.Bypass- Beliaghata Crossing), 3rd Floor, 10B, Kolkata - 700 010. Contact Person- Ria Ghosh (7044473444)","location":"Kolkata","experience":"2 - 4 Years"},{"date":"5, 6, 7, 9, 10, 11, 12, 13, 14 - Mar - 2020","skills":"Front office, Business Administration, Office Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Sohung Infotech Private Limited, E - 38, E Block, Sector 63 Noida, Uttar Pradesh - 201 301","phone":"9911886563","profile":"Front Office Executive \nSohung Infotech Private Limited","description":"Candidate should be Any Graduate with good communication skills Should be Presentable, Computer proficiency Managing front desk, All administrative works ONLY FEMALES PREFERRED Job Responsibility- Incoming & Outgoing Calls. Provide proper information to the queries via phone/ emails. Maintenance of important documents, files and records in an Organized manner. Responsible for helping the heads in the administration department. Walk-in Date/ Time: 4th March - 31st March 2020, 1 PM onwards Interview Venue: Sohung Infotech Private Limited E - 38, E Block, Sector 63 Noida, Uttar Pradesh - 201 301 Contact Person- Gagandeep Singh Phone No. 9911886563","location":"Noida","experience":"1 - 3 Years"},{"date":"7 - Mar - 2020","skills":"Java, J2Ee, Python","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Tech Mahindra Limited, No. 602/ 3, ELCOT SEZ, Shollinganallur Chennai - 600 119","phone":"Not Provided","profile":"JAVA/ J2EE Developer \nTech Mahindra Limited","description":"Candidate must have worked on Java/ J2EE (Minimum 6 Months). Selected candidates would be given training on the new/ emerging technologies like Java full stack Developer/ Python Developer and many more. Walk-in Date: 7th March 2020 Time: Drive Starts @ 10 AM, Candidate to report before 9:30 AM Walk-in Venue: Tech Mahindra Limited, No. 602/ 3, ELCOT SEZ, Shollinganallur Chennai - 600 119 Landmark: Near Medavakkam Toll HR SPOCS: Jothi Prathis, Prasanna, Muthusamy Arun","location":"Chennai","experience":"0 - 1 Years"},{"date":"6 - Mar - 2020","skills":"Application Support, Desktop Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Anunta Technology Management Services Limited, API Bhavan, 16/F, 2nd floor, Miller's Tank Bed Area, Kaverappa Layout, Near- Jain hospital Vasanth Nagar, Bangalore - 560 051","phone":"Not Provided","profile":"Application/ Desktop Support Engineer \nAnunta Technology Management Services Limited","description":"We are conducting a walk in for Application support/ Desktop support Engineer. Work Location : Bangalore Salary : 2 - 3 l pa * Good Communication (There will be a versant test). * Good Knowledge in Application Support or Desktop Support. * Flexible to work in 24/7 shifts or Rotational shifts. Interested can walk in directly to the venue mentioned below- Anunta Technology Management Services Limited API Bhavan, 16/F, 2nd floor, Miller's Tank Bed Area, Kaverappa Layout, Near- Jain hospital Vasanth Nagar, Bangalore - 560 051 Interview Date: 6th March , 11 AM onwards","location":"Bangalore","experience":"1 - 3 Years"},{"date":"5 - Mar - 2020","skills":"General Administration, Front Desk/ Front Office, Inventory Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Ascent HR Maruthi Chambers, Main Building, 3rd Floor, Survey No.17/ 4B, 9B, Hosur Rd, Roopena Agrahara, Bommanahalli, Bengaluru, Karnataka - 560 068.","phone":"7338299114","profile":"Front Office Executive \nAscent Consulting Services Pvt. Limited","description":"We have openings for Front Office Executive or with Ascent-HR, Bangalore. Candidate should be Any Graduate with good communication skills Must know (English, Kannada & Hindi) Note- Female candidates only. Job Responsibility: Responsible to handle visitor management tool. Greet and welcome client/ guests. Keep front desk tidy and presentable with all necessary material. Answer questions and address complaints. Answer all incoming calls and redirect them as per requirement. To handle Incoming and outgoing courier. Prepare outgoing mail by drafting correspondence, securing parcels etc. Check, sort and forward emails Monitor office supplies and place orders when necessary Inventory management. Keep updated records and files. Monitor office expenses and costs. Take up other duties as assigned (admin responsibilities, schedules, spice work tickets etc.) Walk-in Date/ Time: 5th March 2020, 9 AM onwards Interview Venue: Ascent HR Maruthi Chambers, Main Building, 3rd Floor, Survey No.17/ 4B, 9B, Hosur Rd, Roopena Agrahara, Bommanahalli, Bengaluru, Karnataka - 560 068. Interested candidates can contact: Nanda M-7338299114","location":"Bangalore","experience":"1 - 3 Years"},{"date":"6 - Mar - 2020","skills":"Technical Support, LAN, Network Engineering, Installation, Network Troubleshooting","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Allied Digital Services Limited, 9th Floor, Office No. 92, Sakhar Bhavan, Ramnath Goenka Marg, Nariman Point, Mumbai","phone":"7506660823","profile":"Desktop Support Engineer \nAllied Digital Services Limited","description":"Opening For Desktop Engineer & Network Engineer with Allied Digital Services Limited Network Engineer:- Monitoring of network Troubleshooting LAN / WAN related issues Troubleshooting of cabling related issue Maintenance of active and passive components Knowledge of Leased Line & ISDN Troubleshooting connectivity issues Following-up with respective service provider for link issue Desktop Engineer:- User support & troubleshooting all hardware / LAN related issues Installation of standard software required by client Installing applications software developed by client Installation of necessary updates / upgrades / patches Knowledge of email configuration & troubleshooting Knowledge of troubleshooting basic printer related issues Knowledge of taking backup of user data prior formatting & OS re-installation Walk-in Date/ Time: 6th March 2020, 9 AM onwards Interview Venue: Allied Digital Services Limited 9th Floor, Office No. 92, Sakhar Bhavan, Ramnath Goenka Marg, Nariman Point, Mumbai Landmark: Behind Oberoi Trident Hotel Contact Person : Vaishali Kava Contact No. 7506660823","location":"Mumbai","experience":"1 - 6 Years"},{"date":"6, 7, 9 - Mar - 2020","skills":"Java, PHP, or Python, JavaScript, Quirks, Workarounds, Web markup, HTML5, CSS3","qualification":"B.E./B.Tech, MCA/PGDCA","address":"BroAddCast Digital Marketing, 4th floor, Saboo Towers, Besides Yashoda Hospital, Rajbhavan, Somajiguda, Hyderabad","phone":"9505562000","profile":"Backend Web Developer \nBroAddCast Digital Marketing","description":"Candidate should have at least 2 to 3 years of experience in Java, PHP, or Python, JavaScript, quirks, Workarounds, Web markup, HTML5, CSS3, Web Application Development, Web Technologies, Web Designing, UI Development, Responsive Designs Immediate joiners Required Walk-in Date/ Time: 6th March - 9th March 2020, 10 AM onwards Interview Venue: BroAddCast Digital Marketing 4th floor, Saboo Towers, Besides Yashoda Hospital, Rajbhavan, Somajiguda, Hyderabad Contact Person- Mr. Ravi Gadam (9505562000)","location":"Hyderabad","experience":"2 - 3 Years"},{"date":"7 - Mar - 2020","skills":"PHP, Bootstrap, MySQL, HTML, MySQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Benchmark IT Solutions (India) Private Limited, 2nd Floor, Shinde Complex, NDA Pashan Road, Bavdhan Khurd, Pune - 411 021.","phone":"020-22951951","profile":"PHP Developer \nBenchmark IT Solutions (India) Private Limited","description":"Person must have basic understanding of PHP, Bootstrap, MySQL, HTML Should have basic knowledge of PHP / OOPs / DB / SQL. MySQL (Complex database designing experience/ knowledge) Basic understanding of JavaScript, jQuery. Good command over written and verbal English communication. Ability to work in a team as well as an individual. BE (Computer), MCA (Computer), MCS & MSc ,B.Tech (2019/20 Passouts) Certification in PHP is must. Walk-in Date/ Time: 7th March 2020, 9 AM onwards Interview Venue: Benchmark IT Solutions (India) Private Limited 2nd Floor, Shinde Complex, NDA Pashan Road, Bavdhan Khurd, Pune - 411 021. Phone No: 020 -22951951/2","location":"Pune","experience":"0 - 1 Years"},{"date":"6 - Mar - 2020","skills":"Technical Support, Handling & maintaining desktop, Laptop","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Sysnet Global Technologies Private Limited, 105/6/7, Damji Shamji Trade Centre, Near Railway Station, Vidyavihar (West), Mumbai - 400 086","phone":"9619605367","profile":"Desktop Support Engineer \nSysnet Global Technologies Pvt. Limited","description":"Education Qualification - Any Undergraduate/ Graduate (Hardware / Networking certified) Candidate should have good knowledge of handling & maintaining desktop, Laptop Basic knowledge of MS-outlook, networking and antivirus solutions Walk-i Date/ Time: 5th March - 6th March 2020, 9 AM onwards Interview Venue: Sysnet Global Technologies Private Limited 105/6/7, Damji Shamji Trade Centre, Near Railway Station, Vidyavihar (West), Mumbai - 400 086 Contact Person - Kirti (9619605367)","location":"Mumbai","experience":"0 - 1 Years"},{"date":"6 - Mar - 2020","skills":"Core PHP, Laravel framework, MySQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Colan Infotech Private Limited, Murugesan Nayakar Complex, Unit-2, D 84, B Block, 4th Floor, Greams Road, Thousand Lights, Chennai - 600 006","phone":"9042055706","profile":"PHP - Laravel Developer \nColan Infotech Private Limited","description":"Candidate must have experience in Core PHP & Laravel framework Should have good knowledge in MySQL Good communication and Positive Attitude Walk-in Date/ Time: 6th March 2020, 11 AM onwards Interview Venue: Colan Infotech Private Limited Murugesan Nayakar Complex, Unit-2, D 84, B Block, 4th Floor, Greams Road, Thousand Lights, Chennai - 600 006 Landmark: (Opposite road to Sea shell Hotel) Contact - HR ( 9042055706 )","location":"Chennai","experience":"1 - 3 Years"},{"date":"7 - Mar - 2020","skills":"C# / VB .Net / ASP .Net / ASP, HTML, AJAX","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Benchmark IT Solutions (India) Private Limited, 2nd Floor, Shinde Complex, NDA Pashan Road, Bavdhan Khurd, Pune - 411 021.","phone":"020-22951951","profile":".Net Developer/ Fresher \nBenchmark IT Solutions (India) Private Limited","description":"Candidate should have good knowledge of C# / VB .Net / ASP .Net / ASP, HTML, AJAX. Candidate should have knowledge of SQL, DBMS. OOPS concepts and Basic programming skills. Strong knowledge of HTML, CSS, Javascript, Jquery. Good in logical & analytical thinking. Good command over written and verbal English communication. Ability to work in a team as well as an individual. BE, B.Tech, BCA, MCA with passing year 2019/20 would be preferred. Certification in Dot Net is must. Walk-in Date/ Time: 7th March 2020, 9 AM onwards Interview Venue: Benchmark IT Solutions (India) Private Limited 2nd Floor, Shinde Complex, NDA Pashan Road, Bavdhan Khurd, Pune - 411 021. Phone No: 020-22951951/2","location":"Pune","experience":"0 - 1 Years"},{"date":"6 - Mar - 2020","skills":"Wordpress, Drupal & Magento, PHP, Mysql, Javascript etc.","qualification":"B.E./B.Tech, MCA/PGDCA","address":"NetEdge Computing Solutions Pvt. Limited, NetEdge Tower C - 56/ 39, Sector - 62, Block C, Noida - 201 301","phone":"7042794831","profile":"Php/ Wordpress Programmer \nNetEdge Computing Solutions Pvt. Limited","description":"The right candidate for the position should have experience & Delivered of Website and eCommerce Projects based on Wordpress, woo commerce, Shopify, Drupal & Magento. Should have Developed applications in PHP, Mysql, Javascript etc. The person will be responsible for: Handling Delivery of Website and eCommerce Projects based on 1. Wordpress, Woo commerce, Shopify, Drupal, Magento 2. Development in PHP, MySql, Javascript, CSS3 Walk-in Date/ Time: 6th March 2020, 11 AM onwards Interview Venue: NetEdge Computing Solutions Pvt. Limited NetEdge Tower C - 56/ 39, Sector - 62, Block C, Noida - 201 301 Contact - Manisha Singh ( 7042794831 )","location":"Noida","experience":"2 - 4 Years"},{"date":"5, 6 - Mar - 2020","skills":"Administrative Support, Travel Arrangements, Data Entry","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"WNS (Holdings) Limited, 11th FL Block A2 & A3 Building, DLF IT SEZ, Sector 30 NH8 Gurgaon (Near Star Mall)","phone":"Not Provided","profile":"Backend Assistant - Admin Support \nWNS (Holdings) Limited","description":"WNS (Holdings) Limited is Looking for Backend Assistant - Admin Support Educational Qualification - Any Graduate Years of experience - 1+ Year Freshers can also apply Skill Required- Ability to multi-task and to work within a framework of standard processes Good communication skills (both written and verbal) Ability to grasp requirement and deliver as per understanding Proactive team oriented, flexible approach. Candidate should be flexible with the shift timings. Joining on Immediate basis. Job Responsibility: The role involves B2B interaction, providing Administrative support (arranging, travel, filing expenses, data entry) using the client tools remotely. Walk-in Date - 4th to 6th March 2020 Timings: 1:00 PM to 4:00 PM Venue Details: WNS (Holdings) Limited 11th FL Block A2 & A3 Building, DLF IT SEZ, Sector 30 NH8 Gurgaon (Near Star Mall) Contact Person: Esha","location":"Gurgaon","experience":"0 - 5 Years"},{"date":"7 - Mar - 2020","skills":"C# .Net, ASP .NET MVC,Web API 2.0, Framework - JQuery, AngularJS","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Concourse Solutions Private Limited, 502, Suratwala Mark Plazzo, Wakad - Hinjewadi Road, Hinjewadi Pune - 411 057","phone":"9766916660","profile":".Net Developer \nConcourse Solutions Private Limited","description":"Candidate should have good & hands on experience on C# .Net, ASP .NET MVC,Web API 2.0, Framework - JQuery, AngularJS, Entity Framework, Dependency Injection Frameworks, Oracle Educational Qualification: Any Graduate Experience: 2 to 8 years of experience in .Net development If you are interested in the above positions Please be available for interview on 7th March 20 between 12:00 PM and 5:00 PM, also share your updated profile with the below information to pramod@concoursesols.com to avoid inconvenience Total Experience: Relevant Experience: Current CTC: Expected CTC: Notice Period: Scheduled Walk-in is on 7th March 2020 Timings: 12:00 PM to 5:00 PM Interview Venue: Concourse Solutions Private Limited 502, Suratwala Mark Plazzo, Wakad - Hinjewadi Road, Hinjewadi Pune - 411 057 SPOC: Deepak Singh We are looking for immediate joiners Please feel free to reach out for any queries on 9766916660","location":"Pune","experience":"2 - 8 Years"},{"date":"7 - Mar - 2020","skills":"Java, Spring, Hibernate , Junit, JSP, AngularJS, struts, MySQL, Oracle","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Concourse Solutions Private Limited, 502, Suratwala Mark, PUNE, Maharashtra - 410 504","phone":"9766916660","profile":"Java Developer \nConcourse Solutions Private Limited","description":"Candidate should have good & hands on experience on Java, Spring, Hibernate , Junit, JSP, AngularJS, struts, MySQL, Oracle Educational Qualification: Any Graduate Experience: 2-4 years of experience in Java development If you are interested in the above positions Please be available for interview on 7th March 20 between 12:00 PM and 5:00 PM, also share your updated profile with the below information to pramod@concoursesols.com to avoid inconvenience Total Experience: Relevant Experience: Current CTC: Expected CTC: Notice Period: Scheduled Walk-in is on 7th March 2020 Timings: 12:00 PM to 5:00 PM Interview Venue: Concourse Solutions Private Limited 502, Suratwala Mark Plazzo, Wakad - Hinjewadi Road, Hinjewadi Pune - 411 057 SPOC: Deepak Singh We are looking for immediate joiners Please feel free to reach out for any queries on 9766916660 Office Number.","location":"Pune","experience":"2 - 4 Years"},{"date":"5, 6, 7, 9, 10, 11, 12, 13, 14 - Mar - 2020","skills":"Asp .Net, MVC, Javascript, jquery and MS SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Sohung Infotech Private Limited, E-38, E Block, Sector 63 Noida - 201 301","phone":"9911886563","profile":".Net/ MVC Developer (Fresher) \nSohung Infotech Private Limited","description":"Candidate should have good knowledge of Asp .Net, MVC, Javascript, jquery and MS SQL Server, Software Development. Must have completed 6 months of Institutional training in Dot Net & MVC. FRESHER REQUIRED ASAP ONLY STIPEND WILL BE PROVIDED Interview Process: General and technical Aptitude test, HR round. Technical round Walk-in Date/ Time: 5th March - 30 April 2020, 11 AM onwards Interview Venue: Sohung Infotech Private Limited E-38, E Block, Sector 63 Noida - 201 301 Contact Person- Gagandeep Singh Phone No: 9911886563","location":"Noida","experience":"0 - 1 Years"},{"date":"5 - Mar - 2020","skills":"Java, Spring boot, AWS","qualification":"B.E./B.Tech, MCA/PGDCA","address":"AIT Global (India) Private Limited, E-Space A-2 - Condominium situated at S. No. 46/1, Nagar Road, Wadgaon Sheri, Pune - 411 014","phone":"Not Mentioned","profile":"Senior Java Developer \nAIT Global (India) Private Limited","description":"Required Required :- Java 8. Expert Level with Spring boot. AWS. Additional Skills: Restful API Strong understanding of Object-Oriented concepts. Demonstrated experience in design and development using Java-based technologies. Microservices. - (Big Plus) Other details :- Design, implement and maintain java application phases To take part in software and architectural development activities Conduct software analysis, programming, testing and debugging Identifying production and non-production application issues Transforming requirements into stipulations Recommend changes to improve established java application processes Develop technical designs for application development Walk-in Date/ Time: 5th March 2020, 12 PM onwards Interview Venue: AIT Global (India) Private Limited E-Space A-2 - Condominium situated at S. No. 46/1, Nagar Road, Wadgaon Sheri, Pune - 411 014 Contact Person- Darshit Shah","location":"Pune","experience":"5 - 9 Years"},{"date":"5 - Mar - 2020","skills":"PHP -Javascript -JQuery-OOPS -AJAX, HTML5, CSS, Bootstrap -MS SQL /MySQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Textronics Design Systems (I) Private Limited, Plot. No. EL-109, 2nd Floor, TTC Electronic Zone, MIDC Mahape, Navi Mumbai - 400 710.","phone":"9561076006","profile":"PHP Developers \nTextronics Design Systems (I) Private Limited","description":"Skills Required -PHP -Javascript -JQuery Strong Knowledge in -OOPS -AJAX, HTML5, CSS, Bootstrap -MS SQL /MySQL database -JSON / XML service integration -MVC Design patterns Proven Experience in: 1. Laravel 2. Codeigniter 3. Magento 4. Opencart Interview Date/ Time: 5th March 2020, 11 AM onwards Venue Details- Textronics Design Systems (I) Private Limited Plot. No. EL-109, 2nd Floor, TTC Electronic Zone, MIDC Mahape, Navi Mumbai - 400 710. Directions: Get down at Ghansoli Station and Take auto ( share basis) for EL-109. Email : info2@textronic.net Contact - Surbhi Gupta ( 9561076006 )","location":"Mumbai","experience":"0 - 3 Years"},{"date":"4 - Mar - 2020","skills":"Core Java, J2EE, SQL","qualification":"B.E./B.Tech","address":"Wipro HR Services (India) Private Limited, Building 2, Candor Techspace, IT/ITES, SEZ, Tikri, Sector - 48, Gurugram - 122 018","phone":"Not Provided","profile":"Java Developer \nWipro HR Services (India) Private Limited","description":"Wipro HR Services (India) Private Limited is looking for Graduate Engineer Trainee. Any ideal candidate will possess following skills: 6 months experience or Java training is Mandatory Candidate should have good knowledge of Core Java and J2EE- Mandatory Good knowledge on SQL. Education & Certification B.E/ B.Tech can only apply. (Need 60% throughout education- Mandatory) Only 2018/ 2019 pass out can apply Candidate with good communication are proffered Interview Location : Gurgaon (1st round) Noida (2nd round) Job location : Noida Interview Schedule: 4th March 2020, Wednesday Entry Time: 10:30 AM- 11:30 AM (No Entry after 11:30 AM) Address: Wipro HR Services (India) Private Limited Building 2, Candor Techspace, IT/ITES, SEZ, Tikri, Sector - 48, Gurugram - 122 018 Interviewer Mode : Online Assessment (Once through to that test there would be 2 rounds of F2F interview next day) Every round is an elimination round Entire interview process can take 5-6 hour","location":"Gurgaon","experience":"0 - 1 Years"},{"date":"3, 4, 5 - Mar - 2020","skills":"Software Testing, Test Engineering, Load testing, Performance Testing, Automation Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Agnity Communications Private Limited C-42, Sector-58 Noida - 201 303","phone":"9899085367","profile":"QA/ Testing Engineer \nAgnity Communications Private Limited","description":"Candidate must have good knowledge of software testing & Linux platform + basic knowledge of N/W concepts. Test Planning, Test specifications, executing test specs, writing test report, Shell scripting etc. Must have scored 60% and above marks throughout academics. Walk-in Date/ Time: 2nd March - 5th March , 10 AM onwards Interview Venue: Agnity Communications Private Limited C-42, Sector-58 Noida - 201 303 Landmark: Next to Punjab National Bank and Opposite to Hyundai Showroom Contact - Ms. Nivedan Singh (9899085367)","location":"Noida","experience":"0 - 1 Years"},{"date":"4, 5 - Mar - 2020","skills":"Java, Sprint, Spring boot, JSP, Servlet (Java stacks)","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Nucsoft Limited, 602 A-Wing, Times Square Building, Marol Naka, Andheri - Kurla Road, Andheri (East), Mumbai - 400 059 Contact - Snehal Makasare","phone":"Not Provided","profile":"Java Fullstack Developer \nNucsoft Limited","description":"We are looking for a Java Full Stack Developer for one of our reputed client. Work Experience : 2+ years Full stack developer - those who know the UI part like Angular.JS and backend part like Node.JS Knowledge on server side components like Sprint, Spring boot, JSP, Servlet (Java stacks) Should know how to consume APIs in Java code Good knowledge of servers like Tomcat and JBoss Good verbal and written communication skills Walk-in Date/ Time: 4th March - 5th March 2020, 9 AM onwards Interview Venue: Nucsoft Limited 602 A-Wing, Times Square Building, Marol Naka, Andheri - Kurla Road, Andheri (East), Mumbai - 400 059. Contact Person- Snehal Makasare","location":"Mumbai","experience":"2 - 5 Years"},{"date":"4, 5, 6 - Mar - 2020","skills":"JavaScript/ jQuery/ Core Java/ SQL/ HTML5","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Datazoic Machines Private Limited, 141, TVH Agnitio Park, 2nd Floor, OMR, Kandanchavadi, Chennai - 96.","phone":"Not Mentioned","profile":"Java Developer \nDatazoic Machines Private Limited","description":"Candidate should have 1 to 5 years of solid hands-on experience in JavaScript/ jQuery/ Core Java/ SQL/ HTML5. Must have strong fundamentals in any J2EE Application Server / Web Server. Strong fundamentals in object-oriented concepts and hands-on experience in design and development of object-oriented applications Must have good hands-on experience in JIRA Strong knowledge and hands-on experience in SQL Strong desire to learn new functional areas and technologies. Excellent written and verbal communication skills Walk-in Date/ Time: 3rd March - 6th March 2020, 11 AM onwards Interview Venue: Datazoic Machines Private Limited 141, TVH Agnitio Park, 2nd Floor, OMR, Kandanchavadi, Chennai - 96. Contact Person- Naveen Kumar","location":"Chennai","experience":"1 - 5 Years"},{"date":"4, 5, 6 - Mar - 2020","skills":"Core Java, Multi Threading, Spring/ Struts, Hibernate and MySQL/ Oracle","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Corent Technology Private Limited, 3rd Floor, MCM Towers, Super-B-3, Thiru Vi Ka Industrial Estate, Guindy, Chennai - 600 032.","phone":"Not Mentioned","profile":"Software Developer (Java) \nCorent Technology Private Limited","description":"We have an exciting opportunity for Java Developer in Chennai location. Candidate should have Minimum of 2+ years of experience with Core Java, Multi Threading, Spring/ Struts, Hibernate and MySQL/ Oracle. Experience of working in an agile environment. Hands on experience in coding. Ability to learn new technologies. Required Skills : Core Java Work Experience : 2 to 4 Years Notice period : Immediate / Less than 30 days only Position : Permanent Location : Guindy Walk--in Date: 3rd to 6th March 2020 (Tuesday to Friday) Time : 10 AM - 4:30 PM Interview Venue: Corent Technology Private Limited 3rd Floor, MCM Towers, Super-B-3, Thiru Vi Ka Industrial Estate, Guindy, Chennai - 600 032. Contact Person- KR Preethi \\ A Gomathi","location":"Chennai","experience":"2 - 4 Years"},{"date":"7 - Mar - 2020","skills":"Core Java, OOPS Concepts","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Sensiple Software Solutions Private Limited, Plot No. 9/A15, SIPCOT IT Park, Padur, Siruseri, Chennai, Tamil Nadu - 603 103.","phone":"044-47419027","profile":"Java Developer \nSensiple Software Solutions Pvt. Limited","description":"Candidate should have 1 to 2 years of good experience in Java Development. Strong in OOPS Concepts. Good problem solving approach Good verbal and written communication Good team skills; working collaboratively with team members Walk-in Date/ Time: 7th March 2020, 9 AM onwards Interview Venue: Sensiple Software Solutions Private Limited Plot No. 9/A15, SIPCOT IT Park, Padur, Siruseri, Chennai, Tamil Nadu - 603 103. Contact Person- Hari Prasad Phone No. 044-47419027 If you are a person who is looking for product based company come and join in our team. Shoot your updated profile to hariprasad.k@Sensiple.com","location":"Chennai","experience":"1 - 2 Years"},{"date":"3, 4 - Mar - 2020","skills":"Core Java, J2EE, Spring, JDBC, GWT, Multithreading, SQL/ Database Concepts","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Estel Technologies Private Limited, #126, Sector 44, Institutional Area Gurgaon, Haryana","phone":"0124-2578204","profile":"Java Professionals \nEstel Technologies Private Limited","description":"Candidate should have 3 to 8 years of experience in Core JAVA in an application development environment Well versed in core Java. Which includes Springs, Hibernate, Webservices and Multi-threading. Knowledge of Java related technologies such as J2EE, Spring, JDBC, GWT, Multithreading - Proficient in: SQL/ Database Concepts / LINUX / UNIX / ORACLE Development, deployment and testing Walk-in Date: 3rd - 4th March 2020, 11 AM onwards Timing - Between 11:00 am to 4:00 pm Interview Venue: Estel Technologies Private Limited #126, Sector 44, Institutional Area Gurgaon, Haryana Contact Person- Nitanjali/ Saif Phone No. 0124-2578204","location":"Gurgaon","experience":"3 - 8 Years"},{"date":"3, 4 - Mar - 2020","skills":"Software Testing, Mobile Application Testing, API Testing, Test Scenarios","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Matrimony.com Limited, Arihant e Park, Lattice Bridge Road, 2nd Floor, Baktavatsalm Nagar, Adyar, Chennai - 600 020","phone":"Not Mentioned","profile":"Automation Testing Engineer \nMatrimony.com Limited","description":"Candidate should have 2 to 3 Years of experience with Mobile Applications testing (iOS/ Android platforms) Should have good exposure with testing Standalone (Native) & Browser Based applications Should have good knowledge in Mobile Apps testing techniques & concepts Good understanding in checking/validating API response. Good understanding in mobile apps usability concepts Identifying Test Scenarios, edge cases and suggesting improvements. Ability to work in a fast-paced Agile environment. Good knowledge in working with tools like Minimal ADB, ARC & Postman Walk-in Date: 3rd March - 4th March 2020 Timing - 10:00 AM to 2:00 PM Interview Venue: Matrimony.com Limited Arihant e Park, Lattice Bridge Road, 2nd Floor, Baktavatsalm Nagar, Adyar, Chennai - 600 020 Contact Person- Ms. Gracy","location":"Chennai","experience":"2 - 3 Years"},{"date":"7 - Mar - 2020","skills":"Core Java/ J2EE, JDBC, SQL, Stored Procedures and Related tools","qualification":"B.E./B.Tech, MCA/PGDCA","address":"TurningPoint Software Solutions Private Limited, No. 31, 1st Floor, TBR Tower, 1st Cross, New Mission Road J. C. Road, Bangalore - 560 027.","phone":"973933662","profile":"Senior Java Developer \nTurningPoint Software Solutions Pvt. Limited","description":"Candidate should have Bachelor's degree or its equivalent in Computer Science, Information Technology, Engineering, or related technical field with 2 to 8 years of overall programming work experience, or any equivalent combination of education and experience. Should have minimum 2 years of experience in Core Java/ J2EE Good understanding of JDBC, SQL, stored procedures and related tools. Must have strong understanding of database design and structures. Ability to understand and construct complex database designs is required. Experience on industry standard frameworks like Spring (or similar frameworks) and Hibernate Good analytical ability to breakdown problem statements into solutions Walk-in Date/ Time: 7th March 2020, 10 AM onwards Interview Vene: TurningPoint Software Solutions Private Limited No. 31, 1st Floor, TBR Tower, 1st Cross, New Mission Road J. C. Road, Bangalore - 560 027. Landmark: Mahaveer Jain College (JC Road/ Town Hall) Contact Person- Mamatha R (973933662)","location":"Bangalore","experience":"2 - 8 Years"},{"date":"4 - Mar - 2020","skills":"Inventory Management, Order Management, Procurement","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Wipro Limited, CDC 3, Right Wing, Mezzanine Floor, 105 Anna Salai, Guindy, Chennai - 600 032","phone":"Not Provided","profile":"Back Office (Order Management Process) \nWipro Limited","description":"Wipro Limited hiring for Order management in process with 1 to 3 years of relevant experience. Educational Qualification: Any Graduate Experience: 1 to 3 yrs (Relevant experience in Procurement) Work Location: Chennai (Sholinganallur) Skills Required: Good PC and database knowledge and project/process management skills. Regular Graduate in any discipline with 60% and above marks Initiative and independent; Customer focused. Flexible and adaptable to business requirements and multiple shifts Excellent written & spoken communication skills in English. Notice Period: Immediate Joiners only Walk-in Interview on 4th March 2020 Time : 9:30 am-10:30 am Venue: Wipro Limited, CDC 3, Right Wing, Mezzanine Floor, 105 Anna Salai, Guindy, Chennai - 600 032 Contact Person: Gayathri A Documents to be carried: 3 copies of resume 1 passport size photo Govt. ID proof","location":"Chennai","experience":"1 - 3 Years"},{"date":"3, 4 - Mar - 2020","skills":"Customer Service Compensation Hiring Benefits","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Amazon Development Center India Pvt. Limited, B-2/62, Tower #3, 5th Floor, Block B, Industrial Area, Sector 62, Noida, Uttar Pradesh - 201 309","phone":"9818176604","profile":"Customer Service Associate \nAmazon Development Centre (India) Pvt. Limited","description":"Once in a Lifetime Opportunity at the beginning of the year. We are hiring for Customer Service Associate profile. Compensation: Customer Service Associate (International Voice): INR 2.81 LPA to 3.37 LPA Customer Service Associate (Chat): INR 2.17 LPA to 2.61 LPA Job Location: NOIDA The candidates must need to bring the following documents for the interview: Updated Resume Original Govt. ID proof Passport Size photograph Walk-in Date: 3rd March - 4th March 2020 Interview time: 11:00 AM to 3:00 PM Interview Venue: Amazon Development Center India Pvt. Limited B-2/62, Tower #3, 5th Floor, Block B, Industrial Area, Sector 62, Noida, Uttar Pradesh - 201 309. Contact Person: Pramod Kathyat/ Neha Manocha Please mention 'HR Abhay' as your Source on top of your Resume Special Note -: Candidates who have applied in last 3 months and are pursuing a Regular Course are not applicable. Night Shift is mandatory as the team works 24x7.","location":"Noida","experience":"0 - 5 Years"},{"date":"3, 4 - Mar - 2020","skills":"Acquiring Clients, Field Sales Generating Revenues","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Dealmoney Securities Private Limited, Plot No. A 356, 357, Road No. 26, CP Talav, Wagle Industrial Estate, Thane West, Maharashtra - 400 604.","phone":"7678009271","profile":"Relationship Manager \nDealmoney Securities Private Limited","description":"MBA fresher's or Graduate can apply... Acquiring Clients - Mutual fund, Demat & Trading Account Sales) Serving Existing Clients Field Sales Generating Revenues Walk-in Date/ Time: 2nd - 4th March 2020, 12 PM onwards Interview Venue- Dealmoney Securities Private Limited Plot No. A 356, 357, Road No. 26, CP Talav, Wagle Industrial Estate, Thane West, Maharashtra - 400 604. Contact Person- Rupali Devlekar (HR) Email- rupal.devlekar@dealmoney.in Phone No. 7678009271","location":"Mumbai","experience":"0 - 5 Years"},{"date":"3, 4 - Mar - 2020","skills":"talent acquisition, database management, hiring, recruitment","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Bharat Hyundai Showroom, Gowlidoddi, Near Q City, Financial District, Gachibowli Next to Heritage Fresh, Gowlidoddi, Hyderabad","phone":"7997158158","profile":"Recruitment Executive \nBharat MotoCorp Private Limited","description":"Candidate should be well versed with the job portals (Naukri, Monster, Shine, Quikr) Should have good experience in bulk hiring & handling drives Should be able to handle candidates database Should be multitasking handling multiple positions at different levels Should be good at bulk-hiring Should be able to handle recruitment drives independently Walk-in Date/ Time: 3rd March - 4th March 2020, 10 AM onwards Interview Venue: Bharat MotoCorp Private Limited Bharat Hyundai showroom, Gowlidoddi, Near Q City, Financial District, Gachibowli Next to Heritage Fresh, Gowlidoddi, Hyderabad Contact Person- P. Sriram (7997158158)","location":"Hyderabad","experience":"2 - 5 Years"}]}