{"Walkins":[{"date":"21 - Sept - 2020","skills":"Java/ J2ee.(Core Java, J2ee, Jsp, Servlet), MySQL, Tomcat","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Ojas Softech Private Limited, A-139 Sector 63 Noida - 201 307","phone":"8447131703","profile":"Java Developer \nOjas Softech Private Limited","description":"Candidate should have good hands on experience on following technologies- Java/ J2ee (Core Java, J2ee, Jsp, Servlet) Should have hands on experience in Java Application development. Have knowledge about the basic database development skills like MySQL, Tomcat Must have strong coding & logical skills Strong analytical skills Should be proactive & smart Open to work in a challenging environment Walk-in Date/ Time: 21st September 2020, 9.30 AM - 5.00 PM Venue Details- Ojas Softech Private Limited A-139 Sector 63 Noida - 201 307 Contact Person- Pooja Sinha (8447131703)","location":"Noida","experience":"2 - 4 Years"},{"date":"21, 22 - Sept - 2020","skills":"JAVA/ J2EE, Python, Node JS, C++, OOPs Concepts, HTML, CSS, SQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Soft Suave Technologies Private Limited, Gayatri Tech Park 4th floor Plot No 183, EPIP, Near iGate, KIADB Industrial Area, Road, 1B, EPIP Zone Whitefield Rd, Kundalahalli, Whitefield, Bengaluru, Karnataka - 560 066.","phone":"Not Provided","profile":"Full Stack Developer (Java/ Python) \nSoft Suave Technologies Private Limited","description":"Eligibility Criteria: BE/ B.Tech/ M.E/ M.Tech / MCA 2018 ,2019 & 2020 passed outs only. Immediate Joiners Preferred Required Skills: Good knowledge in JAVA, Pyton, Node JS, C++ Strong knowledge in OOPs concepts, J2EE, HTML, CSS, SQL Logical and analytical thinking towards the Java programming Should have designed at least one project module using object oriented analysis and design techniques Sound knowledge of modern software architecture and development techniques Should be a self initiator and interested in learning new technologies. Job Responsibility: Execute full software development life cycle (SDLC) Code, test and troubleshoot programs utilizing the appropriate framework, database, and programming technology. Develop flowcharts, layouts and documentation to identify requirements and solutions Maintain and modify projects; make approved changes by amending flow charts, Develop detailed programming logic, and coding changes. Write quality and clean code using prescribed specifications. Evaluate the interrelationships between programs. Analyze performance of programs and take action to correct deficiencies. Walk-in Date/ Time: 21st - 22nd September 2020, 11.00 AM - 5.00 PM Venue Details- Soft Suave Technologies Private Limited Gayatri Tech Park 4th floor Plot No 183, EPIP, Near iGate, KIADB Industrial Area, Road, 1B, EPIP Zone Whitefield Rd, Kundalahalli, Whitefield, Bengaluru, Karnataka - 560 066.","location":"Bangalore","experience":"0 - 2 Years"},{"date":"19 - Sept - 2020","skills":"Grievance Handling, Employee Orientation, Attendance, Compensation, Joining Formalities","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Soft Suave Technologies Private Limited, Gayatri Tech Park (4th floor Plot No 183, EPIP, Near iGate, KIADB Industrial Area, Road, 1B, EPIP Zone Whitefield Road, Kundalahalli, Whitefield, Bengaluru, Karnataka - 560 066.","phone":"Not Provided","profile":"HR Executive (Female Only) \nSoft Suave Technologies Private Limited","description":"Candidate should have 0 to 1 years of experience in Grievance Handling, Employee Orientation, Attendance, Compensation, Joining Formalities, Payroll Administration, Exit Interviews, Bonus, HR Policies and Recruitment. Should have excellent communication skills Job Responsibilities- Reviewing resumes and application Conducting recruitment interviews and providing the necessary inputs during the hiring process Maintaining HR records, such as those related to compensation, Incentives, health and medical insurance Managing workplace safety issues Communicating and explaining the organization's HR policies to the employee Preparation of Payroll Administration of all Employee and company docs Conducting various games & celebration activities, engagement activities, employee recognition acts Preparing and processing timely distribution of salary, bonus, increment salary slip, leave encashment and full and final settlements Recording, maintaining and monitoring attendance to ensure employee punctuality Conducting employee orientation and facilitating newcomers joining formalities Maintaining and regularly updating master database (personal file, personal database, etc.) of each employee in HR module of ERP software Walk-in Date/ Time: 19th September 2020, 11.00 AM - 6.00 PM Venue Details- Soft Suave Technologies Private Limited Gayatri Tech Park (4th floor Plot No 183, EPIP, Near iGate, KIADB Industrial Area, Road, 1B, EPIP Zone Whitefield Road, Kundalahalli, Whitefield, Bengaluru, Karnataka - 560 066.","location":"Bangalore","experience":"0 - 1 Years"},{"date":"19 - Sept - 2020","skills":"Customer Support, US Voice Process, Outbound Sales, International BPO","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Magicmind Technologies Limited, PS Srijan Corporate Park near RDB Cinema, Floor- 8th, Tower- II, SaltLake, Sector-5, Bus Stop- SDF More, Kolkata - 700 091.","phone":"9330164835","profile":"Customer Support (US Voice Process) \nMagicmind Technologies Limited","description":"Candidate should be Any Graduate with 1 to 6 years of experience in Customer Support, US Voice Process, Outbound Sales, International BPO. Must have excellent communication skills. Job Responsibilities- Understand the business needs of the Clients Giving clients clear view of how online promotion works and how their business will grow. Capabilities to handle client requirements. Walk-in Date/ Time: 19th September 2020, 4.00 PM - 7.00 PM Venue Details- Magicmind Technologies Limited PS Srijan Corporate Park near RDB Cinema, Floor- 8th, Tower- II, SaltLake, Sector-5, Bus Stop- SDF More, Kolkata - 700 091. Contact - HR Zoya ( 9330164835 )","location":"Kolkata","experience":"1 - 6 Years"},{"date":"19 - Sept - 2020","skills":"Customer Service, Outbound Sales, Domestic BPO/ Voice Process, Outbound Calling","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Ison BPO (India) Private Limited, IIFL Tower, 9th Floor, MGR Main Road, Govindasamy Nagar, Perungudi, Chennai","phone":"7358460923","profile":"Customer Care Executive \nIson BPO (India) Private Limited","description":"Candidate should be Any Graduate with good communication skills and bold nature. Both Freshers and Experienced can apply. Should be able to convince a customer. Should know Malayalam. Work location Perungudi, Chennai. Immediate joiners are preferred. Roles & Responsibilities- Convincing the customer for selling Insurance policies. Work timings will be 10am - 7pm. Maintaining daily records and the customer details. Walk-in Date/ Time: 19th September 2020, 9.30 AM - 5.30 PM Venue Details- Ison BPO (India) Private Limited IIFL Tower, 9th Floor, MGR Main Road, Govindasamy Nagar, Perungudi, Chennai Contact Person- Vanitha (7358460923)","location":"Chennai","experience":"0 - 2 Years"},{"date":"19 - Sept - 2020","skills":"IT Recruitment and Staffing, Domestic Recruitment","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"SVK Global Solutions Private Limited, Vedams Towers Patrika Nagar, Huda Techno Enclave. Hitec city, Hyderabad - 500 081. Landmark - Max Cure Hospital back side.","phone":"8886686186","profile":"Domestic IT Recruiter \nSVK Global Solutions Private Limited","description":"We are looking for an IT Recruiter to manage our full cycle recruitment, from identifying potential hires to interviewing and evaluating candidates. IT Recruiter responsibilities include sourcing candidates online, updating job ads, and conducting background checks. If you have experience with various job interview formats, including phone screenings and group interviews, and can help us recruit faster and more effectively, wed like to meet you. Ultimately, you will play an important part in building a strong employer brand for our company to ensure we attract, hire and retain the most qualified employees Job Responsibilities: Source potential candidates from various online channels (e.g. social media and professional platforms like Naukri, Monster & LinkedIn) Craft recruiting emails to attract passive candidates Screen incoming resumes Interview candidates (via phone, video, and in-person) Prepare and distribute assignments and numerical, language, and logical reasoning tests Advertise job openings on the company's careers page, social media, job boards, and internally Provide shortlists of qualified candidates to hiring managers Send job offer emails and answer queries about compensation and benefits Monitor key HR metrics, including time-to-fill, time-to-hire, and source of hire Collaborate with managers to identify future hiring needs. Walk-in Date/ Time: 19th September 2020, 9 AM onwards Venue Details- SVK Global Solutions Private Limited Vedams Towers Patrika Nagar, Huda Techno Enclave, Hitec city, Hyderabad - 500 081. Landmark - Max Cure Hospital back side. Contact Person- Kavitha (8886686186)","location":"Hyderabad","experience":"2 - 4 Years"},{"date":"19 - Sept - 2020","skills":"Customer Support, Blended Process, MS Office/ Excel/ Internet Skills","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Creative Lipi Webtech Private Limited, D-101, Sector 63 Noida, Uttar Pradesh - 201 301","phone":"7835074143","profile":"Customer Support (Blended Process) \nCreative Lipi Webtech Private Limited","description":"We have an urgent opening for a Blended process which involves both Tele-calling and backend. Candidate is expected to be proficient in written and verbal communication skills Prior Experience on E commerce platform is highly preferable. Should be Hardworking, self-motivated & quick learner Should be able to apply analytical skills. Should be able to handle client complaint, Identify customer needs with quick response time. Good knowledge of the web applications and their functioning (Internet & Search Engines). Knowledge of MS Office/ Excel will be an added advantage. Applicant should possess strong Email handling skills. Responsible for making calls to new & existing clients Must have good convincing skills. Candidate from BPO, KPO, Sales, Ecommerce industry can apply Walk-in Date/ Time: 19th September 2020, 11.30 AM - 4.30 PM Venue Details- Creative Lipi Webtech Private Limited D-101, Sector 63 Noida, Uttar Pradesh 201301 Landmark - Near Nissan Showroom Contact Person- Hemlata Bhardwaj Phone: 7835074143","location":"Noida","experience":"0 - 1 Years"},{"date":"21, 22, 23, 24, 25, 26, 28, 29, 30 - Sept - 2020","skills":"HR/ Recritment, Talent Management, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Intellecta Consultants, 302, Gemstar Commercial Complex, Ramchandra Lane Extn, Kachpada, Malad (West), Above IDBI Bank, Mumbai","phone":"9819070210","profile":"Freelance/ HR Executive \nIntellecta Consultants","description":"We are looking for Graduate/ Undergraduates with minimum 6 months of experience in a call center/ Sales/ Hospitality or Recruitment Firm. Must be Extremely Target oriented. Freshers are also welcome Responsible : Conducting recruitment drives Scheduling interviews of shortlisted candidates Sourcing candidates from job portals & other professional site Client Co ordination Walk-in Date/ Time: 21st - 30th September , 10.00 AM - 7.00 PM Venue Details- Intellecta Consultants, 302, Gemstar Commercial Complex, Ramchandra Lane Extn, Kachpada, Malad (West), Above IDBI Bank, Mumbai Call Abhishek at 9819070210 to Apply/ Interview","location":"Mumbai","experience":"0 - 5 Years"},{"date":"21, 22, 23, 24, 25, 26, 28, 29, 30 - Sept - 2020","skills":"Customer Care, Voice Process, Customer Support","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Only telephonic rounds. Contact Person- Bala (9148813839)","phone":"9148813839","profile":"Customer Support (Voice Process) \nAegis Customer Services Private Limited","description":"Great opportunity to work with Startek Aegis as Customer Support (Voice Process) Executive - Operations Eligibility Criteria:- Graduation is Mandatory (Without any arrears) Excellent Communication Skills in English & Hindi Candidates must have Laptop/ Desktop with proper Internet Connection. Fresher/ Experienced both can apply Day Shift / 6 days working Salary up to 19000/- CTC per month Job Location - Bangalore Interested candidates are requested to share their CVs to sangana.bala@startek.com Telephone Interview- 21st September - 1st October, 10 AM onwards Aegis Customer Services Private Limited Contact - Bala (9148813839) NOTE: Only telephonic rounds.","location":"Bangalore","experience":"0 - 3 Years"},{"date":"18, 19, 21, 22, 23, 24, 25, 26, 28 - Sept - 2020","skills":"C#, SQL, .Net, ASP .Net","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Chamunda Tech Net Set Services Pvt. Limited, 401 L wing, Tex Center, Nr. Narayan Plaza, Chandivli , Andheri (East), Mumbai.","phone":"022-28578271","profile":".Net/ Software Developer \nChamunda Tech Net Services Pvt. Limited","description":"Chamunda Tech Net Services Pvt. Limited, is hiring IT Freshers for Software Developers. Candidate should have good knowledge of C#, SQL, .Net, ASP .Net Perks and benefits- Capable candidates will offer good salary package Walk-in Date/ Time: 19th - 28th September 2020, 11 AM onwards Venue Details- Chamunda Tech Net Set Services Pvt. Limited 401 L wing, Tex Center, Nr. Narayan Plaza, Chandivli , Andheri (East), Mumbai. Landmark: Near Boom Rang Building Contact Person - Bhargav Pandya Phone No. 022-28578271","location":"Mumbai","experience":"0 - 2 Years"},{"date":"22 - Sept - 2020","skills":"IT Help Desk / Technical trouble Shooting / Hardware & Networking","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Ample Technologies Private Limited, 10th Cross Street, 91/1, 6th A Main Road Bengaluru, Karnataka - 560 032","phone":"9686685466","profile":"Technical Support Executive \nAmple Technologies Private Limited","description":"We are looking for Technical Support Executives for Apple service centres across Bangalore. Graduate Freshers can also apply. Any Graduate with excellent language fluency, verbal & written communication skills. Should be able to handle customer queries and should aim at customer delight. Knowledge on computer hardware & software is added advantage. Self driven & goal oriented and willing to work on Weekends Should be technically sound. Job Responsibility- Handling customer queries/ issues in the store related to (Mobile, Laptop & Desktop) Troubleshooting of technical related issues and ensure to resolve the issues/ queries Escalate problems when unable to resolve customer issues. Walk-in Date- 22nd September 2020 Timings: 10.30 AM - 4.30 PM Venue Details- Ample Technologies Private Limited 10th Cross Street, 91/1, 6th A Main Road Bengaluru, Karnataka - 560 032 Landmark - Near Vishweshwaraiah Park, HMT Layout, RT Nagar Contact Person - Jiddu Manohar For any queries, please contact -Jiddu Manohar at 9686685466 Email: jiddu.manoharan@ample.co.in","location":"Bangalore","experience":"0 - 3 Years"},{"date":"17 - Sept - 2020","skills":"Software Testing, Manual Testing, Test cases","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Changepond Technologies Pvt. Limited, H-2, SIPCOT IT Park, OMR, Siruseri - 603 103","phone":"044-47480037","profile":"Software Testing Engineer \nChangepond Technologies Pvt. Limited","description":"Changepond Technologies Pvt. Limited, is hiring Engineering Graduates for the position of Software Testing Engineer. Eligibility Criteria: Strong basic knowledge in Software Testing 2018 & 2019 passed out students only Minimum 60% throughout academics Mandate: Trained in Testing/ Testing certification Should have excellent communication skills Walk-in Date/ Time: 17th September 2020, 9.00 AM - 12.00 PM Venue Details: Changepond Technologies Pvt. Limited H-2, SIPCOT IT Park, OMR, Siruseri - 603 103 Contact Person - Edwin G (044-47480037)","location":"Chennai","experience":"0 - 1 Years"},{"date":"18, 19, 20, 21, 22, 23, 24, 25, 26, 27 - Sept - 2020","skills":"Java, Core Java, C/ C++, Java Script, HTML","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Innovation Technology, Karve Road, Near SNDT Bus Stop, Kothrud, Pune.","phone":"8805420321","profile":"Java Developer/ Freshers \nInnovation Technology","description":"Candidate should have Bachelor's Degree or above in Computer Science or related field Familiar with latest Java development framework and open-source tools Must have strong understanding of web application architectures Should have strong knowledge of SQL/ Database Familiar with AWS services Walk-in Date/ Time: 18th - 27th September 2020, 9.30 AM - 5.30 PM Venue Details- Innovation Technology Karve Road, Near SNDT Bus Stop Kothrud, Pune Contact - Jayshree (8805420321)","location":"Pune","experience":"0 - 1 Years"},{"date":"17 - Sept - 2020","skills":"Customer Support, Technical Support, Telecalling, Domestic BPO, Semi Voice","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Jeeves Consumer Services (Flipkart Group Company), #L-169, Sector 6, 5th Main, 13th Cross, 150ft, Outer Ring Road, Next to Bhagawathi Hospital, HSR Layout, Bengaluru - 560 102","phone":"Not Provided","profile":"Technical Support Executive \nJeeves Consumer Services (Flipkart Group Company)","description":"Direct Walk-IN Freshers for Electronics and Communication background are eligible Hindi, English and any south regional language. 3 months Contract Roles and Responsibilities- 1. Talking with customer and understanding there queries. 2. Handling calls and emails. 3. Provide support to the customer. 4. Good communication skills. 5. Knowledge in Home Appliances Products Perks and Benefits Salary: 16k to 21k Take home + (PF, ESI) Walk-in Date/ Time: 17th September 2020, 10.30 AM - 4.00 PM Venue Details- Jeeves Consumer Services (Flipkart Group Company) #L-169, Sector 6, 5th Main, 13th Cross, 150ft, Outer Ring Road, Next to Bhagawathi Hospital, HSR Layout, Bengaluru - 560 102 Contact Person- Pankaj Work from Home option is THERE ONLY FOR Candidates Staying in Bangalore.","location":"Bangalore","experience":"0 - 5 Years"},{"date":"17 - Sept - 2020","skills":"Customer Service, Tele Sales","qualification":"Diploma, B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Infotech Center - Globiva Services Private Limited, 5th Floor, Old Delhi Gurgaon Road, IDPL Twp, Sector 22A, Sector 19, Gurugram - 122 008. Nearest metro station: Rapid Metro Indusland Bank.","phone":"7014394904","profile":"Customer Support Executive \nGlobiva Services Private Limited","description":"Urgent Hiring for Outbound/ Inbound Executive - at Gurgaon Salary: 14K - 17K CTC (Plus Incentives) Immediate Joining All Graduate, Undergraduate, Freshers, Experience, B.Tech Everyone can Apply. Job Location: Gurgaon Candidate should have good communication skills. Attending customer queries/ sales over the phone and providing solutions through calls. Resolving matters in the best interest of both the customer and the company. Previous experience in Customer service and tele sales profile will be an added advantage. Contributes to team effort by accomplishing related results as needed. The customer is always right. You will need to be able speak in a friendly way to customers and potential customers, listening to their needs and helping communicate options for them. You will need to speak to customers about a product's different features and answer any questions they might have. Walk-in Date: 17 September 2020 Time: 10 AM to 5 PM Venue Details: Infotech Center - Globiva Services Private Limited, 5th Floor, Old Delhi Gurgaon Road, IDPL Twp, Sector 22A, Sector 19, Gurugram - 122 008. Nearest metro station: Rapid Metro Indusland Bank. Call Or WhatsApp | Shubham Grover | HR: 7014394904","location":"Gurgaon","experience":"0 - 5 Years"},{"date":"17, 18 - Sept - 2020","skills":"Java 8 Hibernate Spring Spring Boot Multi Threading SQL MySql MVC Web Services","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Chetu (India) Private Limited, H-6, Sector 63, Noida, Uttar Pradesh - 201 301","phone":"Not Provided","profile":"Java Developers \nChetu (India) Private Limited","description":"Candidate should be BE/ B.Tech or MCA with 2 to 5 years of experience in Software Development using the following technologies- Java 8 Hibernate Spring Spring Boot Multi Threading SQL MySql MVC Web Services Walk-in Date/ Time: 17th - 18th September 2020 from 2.30 PM onwards Venue Details:- Chetu (India) Private Limited H-6, Sector 63, Noida, Uttar Pradesh - 201 301","location":"Noida","experience":"2 - 5 Years"},{"date":"16, 17 - Sept - 2020","skills":"HR/ Recruitment, Attendance/ Screening, Interview Scheduling, Leave Management","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Reliable Spaces Private Limited, 5th Floor, Reliable Tech Park, Off. Thane-Belapur Road Airoli, Navi Mumbai - 400 708","phone":"7506332545","profile":"HR/ Recruitment Executive \nReliable Spaces Private Limited","description":"Candidate should have 1 to 2 years of experience in HR/ Recruitment, Attendance/ Screening, Interview Scheduling, Leave Management. Should have good communication skills. Job Responsibilities- 1) Handling end to end recruitment. 2) Scheduling interviews with employers clients. 3) Getting vacancy details from employers clients. 4) Having telephonic discussion with candidates to negotiate on profiles and package. 5) Track and fill open position in least possible time. 6) Handling joining on - boarding formalities. 7) Employee personal file maintenance. 8) Screening resume through online portal. 9) Attendance and Leave Management. Walk-in Dare/ Time: 16th - 17th September 2020, 9.30 AM - 5.30 PM Venue Details- Reliable Spaces Private Limited 5th Floor, Reliable Tech Park, Off. Thane-Belapur Road Airoli, Navi Mumbai - 400 708 Contact Person- Kavita Sharma (7506332545)","location":"Mumbai","experience":"1 - 2 Years"},{"date":"16 - Sept - 2020","skills":"Cash Handling, Operations, Supply Chain, Logistics","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Flipkart Internet Private Limited, A-4, BT industrial park, Sathiyavedu Road, Sirupuzhalpet Post, Gummidipoondi Taluk Thiruvallur District Pin - 601 201","phone":"Not Provided","profile":"Operations Executive (Logistics/ Warehouse) \nFlipkart Internet Private Limited","description":"Candidate should be a Graduate and have logistics/ warehouse work experience. Should have experience on Cash Handling, Operations, Supply Chain Management Must have excellent communication skills Roles & Responsibilities- Processing Daily In bound & Outbound Orders. Quality standards Ensuring WOM (Warehouse Order Management) & Inventory Management. Handling the team Executive & large task force Controls inventory levels by conducting physical counts. Reconciling with data storage system. Define high level of safety & quality standards/ guidelines & 100% adherence of same.(Zero Accident/incident) Managing Prexo and physical counts Team Management Walk-in Date/ Time: 16th September 2020, 9.30 AM - 11.00 AM Venue Details- Flipkart Internet Private Limited A-4, BT industrial park, Sathiyavedu Road, Sirupuzhalpet Post, Gummidipoondi Taluk Thiruvallur District Pin - 601 201 Contact Person- Arun J Candidate who are staying in and around the above location are utmost invited to apply for the role or who can relocate are also welcome.","location":"Chennai","experience":"1 - 5 Years"},{"date":"16 - Sept - 2020","skills":"Customer Support, Voice Process, Customer Service, Outbound Process","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Infotech Center Globiva Services Pvt. Limited, 5th Floor Old Delhi Gurgaon Road, IDPL Twp, Sector 22A, Sector 19, Gurugram - 122 008.","phone":"Not Provided","profile":"Customer Care Executive \nGlobiva Services Private Limited","description":"All Graduate, Undergraduate, Freshers, Experience, B.Tech Everyone can Apply. Candidate should have good communication skills. Attending customer queries/ sales over the phone and providing solutions through calls. Resolving matters in the best interest of both the customer and the company. Previous experience in Customer service and tele sales profile will be an added advantage. Contributes to team effort by accomplishing related results as needed. The customer is always right. You will need to be able speak in a friendly way to customers and potential customers, listening to their needs and helping communicate options for them. You will need to speak to customers about a product's different features and answer any questions they might have. Walk-in Date/ Time: 16th September 2020, 10.30 AM - 5.30 PM Venue Details- Infotech Center Globiva Services Pvt. Limited, 5th Floor Old Delhi Gurgaon Road, IDPL Twp, Sector 22A, Sector 19, Gurugram - 122 008. Nearest Metro Station: Rapid Metro Indusland Bank Contact Person- Shubham (HR)","location":"Gurgaon","experience":"0 - 5 Years"},{"date":"14, 15, 16, 17, 18, 19, 21, 22 - Sept - 2020","skills":"ASP .NET MVC, ASP .NET Core, MVC, C#, MS SQL/ MySQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Visual Infosoft Private Limited, 601, The Emporio, Opposite 4 D Mall, Above Croma, Near Govt. Engineering College, Visat Tapovan Road, Motera, Ahmedabad","phone":"7574857474","profile":"ASP .Net Developer \nVisual Infosoft Private Limited","description":"Candidate should have 0 to 3 years of experience in .NET Core, MVC & API development Proficient knowledge in C#, MS SQL/ MySQL Experience in developing (ASP .NET MVC, ASP .NET Core MVC Applications) Database design including indexes and data integrity (If RDBMS is required) Understanding of HTML, JS, and CSS Must have Cool & Pleasing Personality Ready to work in a team. Walk-in Date/ Time: 14th - 22nd September 2020, 2.00 PM - 7.30 PM Venue Details- Visual Infosoft Private Limited 601, The Emporio, Opposite 4 D Mall, Above Croma, Near Govt. Engineering College, Visat Tapovan Road, Motera, Ahmedabad Contact Person- Ms. Saily (7574857474)","location":"Ahmedabad","experience":"0 - 3 Years"},{"date":"15, 16, 17 - Sept - 2020","skills":"Office Assistance, General Administration, Front Desk/ Reception Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Propin Properties Private Limited 5th Floor, Vasundhara Plaza, Vishal Nagar, Pimple Nilakh, Pune - 411 027.","phone":"8669656560","profile":"Front Office Executive/ Receptionist \nPropin Properties Private Limited","description":"Person should be Any Graduate with 1 to 2 years of experience in Office Assistance, General Administration, Front Desk/ Reception Activities. Must be Confident and friendly with strong communication skills. Candidate should have good interpersonal skills. Professional and well-groomed look! Must be Fluent in English Job Responsibilities- Manage all the reception activities. Should be a pleasant personality with great communication skills and must have a kind, patient temperament. Will need to manage visitors, office directory and redirect requests to the right employee in the company Walk-in Date/ Time: 15th - 17th September, 11.00 AM - 5.30 PM Venue Details- Propin Properties Private Limited 5th Floor, Vasundhara Plaza, Vishal Nagar, Pimple Nilakh, Pune - 411 027. Interested candidates can send their updated Resume/ CV to hr@propinn.in Or can call on 8669656560","location":"Pune","experience":"1 - 2 Years"},{"date":"14, 15, 16, 17, 18, 19, 21, 22, 23 - Sept - 2020","skills":"C#, ASP .NET MVC, Web API, Windows Service, and ADO .NET","qualification":"B.E./B.Tech, MCA/PGDCA","address":"TransDyne IT Services Private Limited, Model House Lane, 1st Floor, PR Residency, Punjagutta, Hyderabad, Telangana - 500 082","phone":"6309072347","profile":".Net Full stack Developer \nTransDyne IT Services Private Limited","description":"Person would be required to design, develop and maintain both new and existing code using Java Script, HTML, and CSS, to server-side code using C# and ASP .NET MVC, Web API, Windows Service, and ADO .NET Conduct design and code reviews. Rapid prototyping Translate mockups Interview Date: 14th - 23rd September 2020 Timings: 9.30 AM - 5.30 PM Venue Details- TransDyne IT Services Private Limited Model House Lane, 1st Floor, PR Residency, Punjagutta, Hyderabad, Telangana - 500 082 Contact Person- Gayathri.A (6309072347)","location":"Hyderabad","experience":"1 - 5 Years"},{"date":"16 - Sept - 2020","skills":"C#, ASP .Net, .Net","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Changepond Technologies Pvt. Limited, H-2, SIPCOT IT Park, OMR, Siruseri, Chennai - 603 103","phone":"Not Provided","profile":".Net Developer/ Freshers \nChangepond Technologies Private Limited","description":"Changepond Technologies Private Limited, is hiring for .Net Developer/ Freshers Eligibility Criteria- B.E/ B Tech/ MCA Graduates with an aggregate of minimum 60% in Academics 2016/ 2017/ 2018 & 2019 Passed out students. Mandate: Trained in Dotnet/ Dotnet Certification Must have good communication skills Drive Date : 16th September 2020 (Wednesday) Timings : 9:00 AM to 12:00 PM Venue Details: Changepond Technologies Pvt. Limited H-2, SIPCOT IT Park, OMR, Siruseri, Chennai - 603 103 Contact Person: A G Rubas Email: rubas.a@changepond.com","location":"Chennai","experience":"0 - 1 Years"},{"date":"14, 15 - Sept - 2020","skills":"HR/ Recruitment, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Soft Suave Technologies Private Limited, 100, Lake View Estate, 3rd floor, Kundrathur Main Road, M. S. Nagar, Next to Rajan Tiles Building, Porur, Chennai, Tamilnadu - 600 116.","phone":"Not Provided","profile":"HR Internship/ Corporate IT \nSoft Suave Technologies Private Limited","description":"We are looking for an HR Intern to perform various administrative tasks and support our HR departments daily activities. The expected candidate should be go getter, proactive, and with exceptional English communication skills. Roles & Responsibilities: Organizing interviews with shortlisted candidates. Screening potential employees' resumes and application forms to identify suitable candidates to fill company job vacancies. Posting job advertisements to job boards and social media platforms. Assisting the HR staff in gathering market salary information. Assisting in the planning of company events. Preparing and sending offer and rejection letters or emails to candidates. Coordinating new hire orientations. Walk-in Date/ Time: 14th - 15th September 2020, 11.00 AM - 5.30 PM Venue Details- Soft Suave Technologies Private Limited 100, Lake View Estate, 3rd floor, Kundrathur Main Road, M. S. Nagar, Next to Rajan Tiles Building, Porur, Chennai, Tamilnadu - 600 116.","location":"Chennai","experience":"0 - 1 Years"},{"date":"16, 17 - Sept - 2020","skills":"Automation Testing, Java, Selenium","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Indium Software (India) Limited, No. 64, Eldams Road, Ganesh Chambers, Teynampet, Chennai, Tamilnadu","phone":"Not Provided","profile":"Automation Testing Engineer \nIndium Software (India) Limited","description":"Candidate should have good programming skills and 2 to 8 years of hands on experience in Java Selenium. Should have TESTNG framework development experience and good understanding of the framework. Should be willing to support manual testing if needed. Excellent communication is a must Should have experience in Version control tools like GIT Independent yet should be a team player with high flexibility. Should be good at handling challenging tasks and provide solutions Should take ownership and should stick to the day today timelines Good to Have- Willingness to learn, adapt and scale up on new technologies, upon training Experience in working in Agile projects 1. Location : Chennai 2. Notice period : Only Immediate to 30 days Zoom Link Details- 16th Sep 2020 - Day 1 Join Zoom Meeting https://us02web.zoom.us/j/84688078886?pwd=MmYyd3FoL3JzRzNWU3hyZjdmNWRXdz09 Meeting ID: 846 8807 8886 Passcode: 089688 17th Sep 2020 - Day 2 Join Zoom Meeting https://us02web.zoom.us/j/81127399489?pwd=N3lPZWFGMzk3d3MxWDNQVUJNOGVDQT09 Meeting ID: 811 2739 9489 Passcode: 151647","location":"Chennai","experience":"2 - 8 Years"},{"date":"12, 13, 14, 15, 16, 17, 18, 19, 21 - Sept - 2020","skills":"Java, HTML, CSS, Jquery, C++ or AJAX","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Greet Technologies Private Limited, 327-328, 6th Sector, 5th Main Service Road, HSR Layout, Bengaluru - 560 102.","phone":"9789830683","profile":"Java Developers - Freshers \nGreet Technologies Private Limited","description":"Candidate should be BE/ B.Tech/ BCA/ MCA or MCM with good knowledge of Java Programming & Basic knowledge on HTML, CSS, Jquery, C++ or AJAX. Roles & Responsibilities- The individual should be self-motivated, creative and proactive, to work in a fast-paced environment. Enterprise web application development (Tally) in an integrated team environment Write design and test document Develop code based on user requirements in Java Converting designs to code Unit Testing: Coding, testing, and debugging Integrating Java related Frameworks. Walk-in Date/ Time: 12th - 21st September 2020, 10.00 AM - 5.00 PM Venue Details- Greet Technologies Private Limited 327-328, 6th Sector, 5th Main Service Road, HSR Layout, Bengaluru - 560 102. Contact Person- Abhilash Nair (9789830683)","location":"Bangalore","experience":"0 - 3 Years"},{"date":"14, 15, 16 - Sept - 2020","skills":"Java Trained/ Freshers","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Epicminds Information Technology Pvt. Limited, #19, 2nd floor, 3rd Block, 3rd Stage, 1st Main Road, Basaveshwara Nagar Bangalore - 560 079.","phone":"Not Provided","profile":"Java Developer/ Fresher \nEpicminds Information Technology Pvt. Limited","description":"We at Epicminds Information Technology Pvt. Limited are hiring freshers for post of Java Developer/ Trainee. Educational Qualification- Any Graduate Work Experience: Fresher Location: Bangalore We would like to meet candidates in person for interviews between 10.30 am to 4.30 pm from at below address. Walk-in Date/ Time: 14th - 16th September 2020, 10.30 AM - 3.30 PM Venue Details- Epicminds Information Technology Pvt. Limited #19, 2nd floor, 3rd Block, 3rd Stage, 1st Main Road, Basaveshwara Nagar Bangalore - 560 079. Landmark \u0096 Above Brahmins Thatte Idli Near Basaveshwara Nagar Police Station Contact Person - Sharief","location":"Bangalore","experience":"0 - 1 Years"},{"date":"14, 15, 16, 17 - Sept - 2020","skills":"HR/ Recruitment, Resourcing, Staffing, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Crystal Fact, 308, Hi Scan House, Above Mithakhali Underbridge, Navrangpura, Ahmedabad - 380 009.","phone":"8401234774","profile":"HR/ Recruitment Consultant \nCrystal Fact","description":"Candidate should have 1 to 5 years of proven work experience as a Recruiter. Must have excellent communication and interpersonal skills. Only Females need to apply Job Responsibility- Design and implement overall recruiting strategy. Source and recruit candidates by using databases, social media etc. Screen candidates resumes and job applications. Conduct interviews using various reliable recruiting and selection tools. Work Location: Navrangpura Job time: 10:00 am to 07:00 pm Walk-in Date/ Time: 14th - 17th September 2020, 12.00 PM - 8.00 PM Interview Venue: Crystal Fact 308, Hi Scan House, Above Mithakhali Underbridge, Navrangpura, Ahmedabad - 380 009. Contact Person- Niraj Shah (8401234774)","location":"Ahmedabad","experience":"1 - 5 Years"},{"date":"14, 15, 16, 17 - Sept - 2020","skills":"Front Desk/ Front Office/ Reception","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Continental Hospitals Private Limited, Plot No-3, Road No-2, IT & Financial District, Nanakramguda, Gachibowli, Hyderabad, Telengana - 500 035.","phone":"8466998053","profile":"Front Office Executive \nContinental Hospitals Private Limited","description":"We at Continental Hospitals Private Limited are conducting walk in interviews for the below mentioned positions- Front Office / PRE Candidate must be a Graduate with excellent communication skills Must be ready to work in rotational shifts Should be an immediate joinee Should have Good typing skills Must be Fluent in English, Telugu, Hindi. Carry updated resume & all educational certificates Walk-in Date/ Time: 14th - 17th September 2020, 10.00 AM - 11.30 AM Venue Details- Continental Hospitals Private Limited Plot No-3, Road No-2, IT & Financial District, Nanakramguda, Gachibowli, Hyderabad, Telengana - 500 035. Contact Person - Swathi (8466998053)","location":"Hyderabad","experience":"2 - 8 Years"},{"date":"14 - Sept - 2020","skills":"International Voice Process, US Process, Customer Care","qualification":"Diploma, B.A., B.Com, B.B.A, B.Sc","address":"Porteck India Infoservices Private Limited, D - 179, Sector - 63, Noida. Landmark: Near Neo Nissan","phone":"0120-4356400","profile":"Customer Support (US Voice Process) \nPorteck India Infoservices Private Limited","description":"Candidate should be Graduate/ Under Graduate with good communication skills. Technical Graduates willing to work in a US Healthcare KPO can also apply. Immediate joiners who can work from home preferred Excellent command over English (Verbal & Written) Willing to work in US shifts Laptop / Desktop must for work from home Walk-in Date/ Time: 14th September 2020, 11.00 AM - 2.00 PM Venue Details- Porteck India Infoservices Private Limited D - 179, Sector - 63, Noida Landmark: Near Neo Nissan Contact - Recruitment Team (0120-4356400) Carry PAN and AAdhar for spot offers.","location":"Noida","experience":"0 - 2 Years"},{"date":"14, 15 - Sept - 2020","skills":"HR/ Recruitment, Administration, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Indiafin Technologies Private Limited, Noida One, 714, Tower C, Floor 7, B-8, Sector 62, Noida - 201 301","phone":"0120-2400840","profile":"HR Executive \nIndiafin Technologies Private Limited","description":"Candidate should have 1+ year of experience in HR/ Recruitment, Administration, Talent Acquisition. Must have excellent communication skills. Responsible for directing and overseeing the hiring, training, and dismissal processes and administering and monitoring. HR may also work with the Director to strategically plan valuable HR changes and subsequently take action to implement them. Walk-in Date/ Time: 14th - 15th September 2020, 9.30 AM - 5.30 PM Venue Details- Indiafin Technologies Private Limited Noida One, 714, Tower C, Floor 7, B-8, Sector 62, Noida - 201 309 Phone No: 0120-2400840/ 41 E-mail: hr@indiafin.com Contact Person- Saloni (9811628812)","location":"Noida","experience":"1 - 3 Years"},{"date":"14, 15 - Sept - 2020","skills":"Human Resource Management, Customer Service, Social Media, Compensation","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Oceana Positive, Besides CENTRO, No.102 1st floor, GHMC. No. 6-3-350 Ganga Estates, Nagarjuna Circle, Road Number 1, Banjara Hills, Hyderabad, Telangana - 500 034.","phone":"6309690333","profile":"HR Manager \nOceana Positive","description":"We are looking for young and dynamic professionals who have the zeal to outperform the routine and break the regular industry norms of restricted job functional roles. We believe in a team of Multi-Functional Managers with an unorthodox and out of the box approach. Qualification: Graduation (Preferably MBA/ HR) Work Experience: 2 - 5 Years Job Location: Hyderabad Requirements: Self-motivated with a result driven approach and ability to play along with the team. Ability to manage multi departmental coordination coupled with a strong analytical and observational mind. Proficiency in MS Office and Working knowledge of English, Hindi & Telugu Languages. Digital Native, HR Orientation and Customer Service Obsession is a must. Work from our Head Office, Road.No.1 Banjara Hills. Long term association and commitment. We are an equal opportunity employer and women are encouraged to apply. Walk-in Date/ Time: 14th - 15th September 2020, 9.30 AM - 5.30 PM Venue Details- Oceana Positive, Besides CENTRO, No.102 1st floor, GHMC. No. 6-3-350 Ganga Estates, Nagarjuna Circle, Road Number 1, Banjara Hills, Hyderabad, Telangana - 500 034. Contact Person- SRIRAM KUMAR (6309690333)","location":"Hyderabad","experience":"2 - 5 Years"},{"date":"14, 15, 16, 17 - Sept - 2020","skills":"Content Writers, G Suite, Google Analytics, Social Media Marketing","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Netaxis IT Solutions Private Limited, No. 151, 'O' Block, Ganapathy Colony, 30th Street, Annanagar East, Chennai, Tamil Nadu - 600 102.","phone":"9884903099","profile":"Content Writers (Female only) \nNetaxis IT Solutions Private Limited","description":"Candidates with B.ED, B.A/ M.A in English literature with good written skill & ability to write unique and high quality error free content/ business letters and should have copy editing skills. Ability to search & gather reliable data from the internet. Job Responsibilities- Write compact, fact-filled content in the form of Blogs & Articles. Selected Candidates will need to Develop unique, Error free, grammatically correct content Develop content with a variety of format. Walk-in Date/ Time: 14th - 17th September 2020, 10.00 AM - 5.00 PM Venue Details- Netaxis IT Solutions Private Limited No. 151, 'O' Block, Ganapathy Colony, 30th Street, Annanagar East, Chennai, Tamil Nadu - 600 102. Contact Person- U.S. Deepan Chakaravarthy Tel: 9884903099","location":"Chennai","experience":"0 - 1 Years"},{"date":"14, 15, 16, 17 - Sept - 2020","skills":"Java, OOPS Concepts, Advance Java, HTML5, Java Script, CSS","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Coindsyz Technology Solutions, No. 1274, 3rd Floor, Mettupalayam Road, A bove Lakshmi Industries, Coimbatore - 641043","phone":"8946066423","profile":"Junior Java Developer \nCoindsyz Technology Solutions","description":"Candidate should have good hands-on knowledge with Java & OOPS Concepts. Need knowledge in web application development (HTML5, JavaScript, CSS) Must be well acquainted with Advance Java & Java Script Eligibility: (FRESHERS) BE/ B.Tech/ MCA/ MSc (CS/ IT) How could you impress us? Through your previous experience Sound programming principles Good written English Enthusiasm and a positive attitude Willingness to learn and adapt What can you expect from us? Excellent pay Opportunity to work with international clients World-class training on multiple skills Planned career growth Why you should join us? Excellent working atmosphere Salary and bonus always paid on-time Walk-in Date/ Time: 14th - 17th September 2020, 9.30 AM - 5.30 PM Venue Details- Coindsyz Technology Solutions No. 1274, 3rd Floor, Mettupalayam Road, A bove Lakshmi Industries, Coimbatore - 641043 Contact Person- Anandhakumar (8946066423) Also can Apply https://coindsyz.com Contact Us ; 7397791116/ 7397791116","location":"Coimbatore","experience":"0 - 1 Years"},{"date":"12, 14, 15, 16, 17, 18, 19, 20 - Sept - 2020","skills":"Customer Support, Inbound/ Outbound Sales, Voice Process, International Calling","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Birfa IT Services Private Limited, WZ-122, 3rd Floor, Above Bank of India, Budhela Market, Vikaspuri, New Delhi.","phone":"9654330607","profile":"Customer Support Executive \nBirfa IT Services Private Limited","description":"We are urgently looking for an 'Inbound and Outbound Executives' for International BPO which is located in West Delhi. Desired candidate should have previous experience in a sales profile. Candidate must speak fluent English along with active listening. Customer focus and adaptability to different personality types Ability to multi-task, set priorities and manage time effectively High School Degree Fresher with good communication skills can also apply. Shift Timing: Between 6:00 pm to 5:00 am (Rotational) Roles & Responsibilities- 1) Attending customer queries over the phone and providing solutions. 2) Following quality parameters while talking or dealing with customers and clients. 3). Resolving matters in the best interest of both the customer and the company 4) Coordination with Team Supervisor and colleagues in case of any doubts and problems 5) Converting leads into sales Working Days: 5.5 days Interested candidate directly come in walk-in interview with updated resume on given address and for any relevant query contact at 9654330607 between 11:00 am to 6:00 pm only. Walk-in Date/ Time: 12th - 20th September 2020, 11.00 AM - 6.00 PM Venue Details- Birfa IT Services Private Limited WZ-122, 3rd Floor, Above Bank of India, Budhela Market, Vikaspuri, New Delhi, Near- Oxford School. Contact Person- Jyoti Gurung (9654330607)","location":"Delhi","experience":"0 - 5 Years"},{"date":"14, 15, 16, 17, 18, 19, 21, 22, 23 - Sept - 2020","skills":"Application Development, IOS/ Android, Java, SQLite, Rest API","qualification":"B.E./B.Tech, MCA/PGDCA","address":"OFFICE NO. 1 ABOVE DANISH DAIRY, NEAR HOTEL SHIVANAND, OPP COLUMBIA ASIA HOSPITAL, KHARADI PUNE - 411 014","phone":"Not Provided","profile":"Mobile App Developer - Android/ iOS \nThakur Computer Solutions & Technology Pvt. Limited","description":"Candidate should have 1+ years of experience in Android native mobile application development with basic OOP's Concepts. Clear understanding of Software development lifecycle. In-depth understanding of Android SDK and JETPACK Component. Hands-on experience building Custom UI by enhancing native UI components using XML. Knowledge of design patterns like MVP, MVVM, and composition. It can implement modular architecture using libraries. Need knowledge of Room Database/ Realm Database/ Sqlite Database. Must be experienced with consumptions of REST API (PHP/ .NET) Experienced with third party API Integration (Google/ Payment Gateway/ Others) Should have implemented Security best practices for mobile applications such as HTTPS, Certificate Pinning, etc. Knowledge of Git, GitLab. Candidate should Extensive knowledge of: HTML, CSS, JavaScript, ES6/ ES7/ ES8, Nodejs, Npm, React JS, Redux, React Navigation, AJAX. Used to working with a set of APIs (especially Google Maps, Places) Huge plus if you have expertise in one or more of the following: Python, Java, Objective-C, C++, PHP, C#, Ruby, Kotlin, Buildfire.js., Google Firebase. High understanding of UI/ UX design, testing, bug fixes etc. The candidate should be able to understand both business practices and software development process and provide solution in best perspective. Knowledge of Healthcare Domain will be an added advantage. Walk-in Date/ Time: 14th - 23rd September 2020, 9.30 AM - 5.30 PM VENUE DETAILS- Thakur Computer Solutions & Technology Pvt. Limited OFFICE NO. 1 ABOVE DANISH DAIRY, NEAR HOTEL SHIVANAND, OPP COLUMBIA ASIA HOSPITAL, KHARADI PUNE - 411 014 Contact Person- Mr. Sachin (8530115888)","location":"Pune","experience":"1 - 5 Years"},{"date":"12, 13, 14, 15, 16, 17, 18, 19, 21 - Sept - 2020","skills":"EMI, Payment Collection, Debt Collection, Telecalling, Back Office, Debt Recovery","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Toucolor Technologies Private Limited, #423, 27th Main Road, Sector 2, 1st Sector, HSR Layout, Bengaluru, Karnataka - 560 102","phone":"6364207863","profile":"Tele Collection Executive \nToucolor Technologies Private Limited","description":"Requirement - 12th class and above, should be honest, sincere and work oriented. Candidates should have 2 to 3 years' experience. Freshers can also apply Should have good experience in Emi collection. Should have Good Communication Skills Should be Presentable and punctual. Customer Relation skills, Roles & Responsibilities- Contact the Debtor through phone and discuss the matter regarding due payments to our clients. Handle internal issues and ensure timely payment to creditors. Need to achieve monthly collection target of his customers. Confirmation of the invoices received from customers as per above point. Maintaining data of all the transaction with respect to payment collection and outstanding. Send daily update on the development of the cases to their reporting managers. Maintain adequate records of follow-up activities. Job Benefits & Perks- Incentives will be provided based on the performance. Walk-in Date/ Time: 12th - 21st September , 9.30 AM - 5.30 PM Venue Details- Toucolor Technologies Private Limited #423, 27th Main Road, Sector 2, 1st Sector, HSR Layout, Bengaluru, Karnataka - 560 102 Landmark - Nift Collage Contact Person- Usha (6364207863)","location":"Bangalore","experience":"0 - 3 Years"},{"date":"12 - Sept - 2020","skills":"Customer Care, Chat/ Voice Process, Customer Support","qualification":"Diploma, B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"24/7 Customer Private Limited, Ground Floor NSL Arena Town Centre, Behind Cricket Stadium, Ramanthapur Road, Uppal, Hyderabad - 500 039","phone":"9676338009","profile":"Customer Support (Chat/ Voice Process) \n24/7 Customer Private Limited","description":"Candidate should be Any Graduate with good communication skills (verbal and written) Able to interact with customers via chat, should be able to answer servicing questions Must have good logical reasoning & analytical skills Able to work in rotational night shifts (US). Eligibility Criteria: Undergraduate/ Graduate and Postgraduate freshers and experienced can apply. Benefit- Transport facility both Pick/ Drop. Life Insurance. Medical Insurance Virtual Interview Rounds: Personal Introduction Round Online Test (Chat process) Versant Test (Voice Process) Operations Round Walk-in Date/ Time: 12th September from 11.00 AM onwards Venue Details- 24/7 Customer Private Limited Ground Floor NSL Arena Town Centre, Behind Cricket Stadium, Ramanthapur Road, Uppal, Hyderabad - 500 039 Landmark: Next to Bhadra\\'s Grand. Contact Person: Raga Sudha Contact Number: 9676338009 * Candidates attended interview within 30 days are not eligible to attend","location":"Hyderabad","experience":"0 - 3 Years"},{"date":"12, 14, 15, 16, 17, 18, 19 - Sept - 2020","skills":"Technical Support, Semi Voice Process, Technical Recruitment, Chat Process","qualification":"Diploma, B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Please Reach out on the below mentioned number for the Telephonic interview.","phone":"7729845576","profile":"Technical Support Associate \nSykes Business Services (India) Pvt. Limited","description":"We are hiring for International Semi Voice Process (Technical Support)- PILOT Batch Education: Undergraduates/ Graduates/ Post Graduation. Experience: Minimum 2 Years of experience into Technical Support is required. Candidates should be flexible with Work from office and work from home Set up. Key Skills Required: Candidate should have excellent communication skills. Minimum 2 Years of experience is mandatory. Should be interested to work in any of the night shifts. Fresher's are not Eligible. Candidate should stay within the radius of 30 kms. Candidates should have good Technical knowledge. Working Days: 5 Days Working Transportation: 2 Way (with in 30 kms Radius From work location) Job Location: 17th floor, Manthri Cosmos, Gachibowli, Hyderabad. Package : 2.5 lpa to 3.8 lpa Free food and two-way transport is provided. Shifts : Rotational Shifts including night shifts. Please Reach out on the below mentioned number for the Telephonic interview. HR Prasanna : 7729845576 NO Freshers","location":"Hyderabad","experience":"2 - 5 Years"},{"date":"12, 13 - Sept - 2020","skills":"JAVA, Python, Node JS, C++, OOPs Concepts, J2EE, HTML, CSS, SQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Soft Suave Technologies Private Limited, Gayatri Tech Park 4th floor Plot No. 183, EPIP, Near iGate, KIADB Industrial Area, Road, 1B, EPIP Zone Whitefield Road, Kundalahalli, Whitefield, Bengaluru - 560 066.","phone":"Not Provided","profile":"Java/ Trainee Engineer \nSoft Suave Technologies Private Limited","description":"Educational Qualification: BE/ B.Tech/ ME/ M.Tech/ MCA 2018, 2019 & 2020 Passed outs only. Immediate Joiners required. Required Skills: Good knowledge in JAVA, Python, Node JS, C++ Strong knowledge in OOPs Concepts, J2EE, HTML, CSS, SQL Logical and analytical thinking towards the Java programming Should have designed at least one project module using object oriented analysis and design techniques Sound knowledge of modern software architecture and development techniques Should be a self initiator and interested in learning new technologies Job Responsibility: Execute full software development life cycle (SDLC). Code, test and troubleshoot programs utilizing the appropriate framework, database, and programming technology. Develop flowcharts, layouts and documentation to identify requirements and solutions. Maintain and modify projects; make approved changes by amending flow charts, develop detailed programming logic, and coding changes. Write quality and clean code using prescribed specifications. Evaluate the interrelationships between programs. Analyze performance of programs and take action to correct deficiencies . Confer with users to gain understanding of needed changes or modifications of existing programs. Resolve questions of program intent, data input, output requirements, and inclusion of internal checks and controls. Job Location: Bangalore Salary Package: 3 L Per Annum Rounds of Interview: Level 1: Technical Aptitude test Level 2: written Programming Test Level 3: System Execution of Program Level 4: HR Interview Walk-in Date/ Time: 12th - 13th September 2020, 11.00 AM - 5.30 PM Venue Details- Soft Suave Technologies Private Limited Gayatri Tech Park 4th floor Plot No 183, EPIP, Near iGate, KIADB Industrial Area, Road, 1B, EPIP Zone Whitefield Road, Kundalahalli, Whitefield, Bengaluru - 560066. Important Note: Those who have taken up the interview in last 3 months are not eligible to undergo interview again.","location":"Bangalore","experience":"0 - 2 Years"},{"date":"12 - Sept - 2020","skills":"Java, J2ee, Spring, Spring Boot, Multi-Threading. Hibernate, RestAPI, Webservices","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Techwave Consulting India Private Limited, Techwave, Level 4, Building No. H6, Phoenix Avance Business Hub, Hitech City, Hyderabad","phone":"Not Provided","profile":"Java Developers \nTechwave Consulting India Private Limited","description":"Walk-in Interview for JAVA Developers/ Sr. Developers with multiple combination of skills. Organization : Techwave Consulting India Private Limited Requirement : Developer/ Senior Developer Job type : Permanent Location : Hyderabad Candidate must have expertise in Java, J2ee, Spring, Spring Boot. Microservices Arch. JMS (Active MQ or IBM MQ), Multi-Threading. Hibernate, RestAPI, Webservices (security). Strong in Core Java, Spring/Hibernate, JMS, Multi-threading, Scheduling. Web Technologies (Servlet, JSP, REST Web Services). Knowledge of analyzing Java thread dumps and memory leaks. Experience in Unix /Linux. Cassandra, Postgres, Docker, Node JS, Scala/AKKA, JS frameworks s.a. Angular, React, Backbone Walk-in Date : 12th September 2020 (Saturday) Timings: 10:00 AM to 3:00 PM Venue Details: Techwave Consulting India Private Limited Techwave, Level 4, Building No. H6, Phoenix Avance Business Hub, Hitech City, Hyderabad Contact Person: VinayKumar S/ Sreevani B Interview Procedure: Round 1: Online Test (Cutoff - 50%) Round 2: Technical 1 Round 3: Technical 2 Round 4: HR","location":"Hyderabad","experience":"4 - 9 Years"},{"date":"9, 10, 11 - Sept - 2020","skills":"General Administration, Front Office, Receptionist Activities, Guest Handling","qualification":"Diploma, B.A., B.Com, B.B.A, B.Sc","address":"Zebronics India Private Limited, No.118 Ponnamallee High Road, Vepery, Chennai - 600 084","phone":"8144522252","profile":"Front Office Executive \nZebronics India Private Limited","description":"Educational Qualification: Any Graduate/ Diploma Work Experience: 0 to 3 Years Age: Below 35 Years Fluency & Communication skills in English & Hindi Must. Immediate joiners only will be considered. Female candidate preferred. Languages: English, Tamil & Hindi (Mandatory) Salary: Best In Industry Duties & Responsibilities- Responsible for attending all the incoming calls, responding to them and transferring the call to the appropriate department. Responsible for greeting the visitors at the office, registering their names and contact details. Providing assistance to the heads in the administration department. Responsible for supervising the housekeeping department and ensuring that all the items are there in the stock Walk-in Date/ Time: 9th - 11th September 2020, 9 AM onwards Venue Details- Zebronics India Private Limited No.118 Ponnamallee High Road, Vepery, Chennai - 600 084 Landmark: Opposite to Sudha Hotel Contact Person- Ashwini R (8144522252)","location":"Chennai","experience":"0 - 3 Years"},{"date":"9, 10, 11, 12, 14, 15, 16, 17, 18 - Sept - 2020","skills":"Office Assistance, Front Desk, Office Management/ Documentation","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Hydraform India Private Limited, 602-B, Ansal Majestic Tower, Vikaspuri, New Delhi - 110 018","phone":"9312578095","profile":"Front Office Assistant \nHydraform India Private Limited","description":"Candidate should be Any Graduate (Female Only) with good communication skills. Must be highly motivated and should be able to work independently with limited supervision. Manage office documentation photocopying, scanning, printing, filing etc. Our ideal candidate will be one committed to maintaining a constant awareness of day to do operations and interaction with customers. Organize and schedule appointments and meetings. Supervising office staff for efficient functioning. Walk-in Date/ Time: 9th - 18th September 2020, 9.30 AM - 5.30 PM Venue Details- Hydraform India Private Limited 602-B, Ansal Majestic Tower, Vikaspuri, New Delhi - 110 018 Contact Person- Lokesh Talwar (9312578095)","location":"Delhi","experience":"2 - 4 Years"},{"date":"12 - Sept - 2020","skills":"Asp .Net, C#, MVC","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Infomaze Technologies Private Limited, #286-A, Hebbal Industrial Area, Mysuru, Karnataka - 570 018","phone":"9686549333","profile":".Net Developer/ Fresher \nInfomaze Technologies Private Limited","description":"Infomaze Technologies Private Limited is looking for .Net Developer/ Fresher Work Experience: 0 to 5 Years Technical Skills: Asp .Net, C#, MVC Job location: Mysore Walk-in Date/ Time: 12th September 2020, 9.00 AM - 12.00 PM Venue Details- Infomaze Technologies Private Limited #286-A, Hebbal Industrial Area, Mysuru, Karnataka - 570 018 Landmark: Behind L& T Technology, Opposite Oasis Hotel Contact Person- Bhagyavathi (9686549333) Please contact 9686549333, before coming for the interview","location":"Mysore","experience":"0 - 5 Years"},{"date":"7 - Sept - 2020","skills":"Tele-calling, Blended Process, Backend Support","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Creative Lipi Webtech Private Limited, D-101, Sector 63 Noida - 201 301. Landmark - Near Nissan Showroom","phone":"7835074143","profile":"Blended Process Associate \nCreative Lipi Webtech Private Limited","description":"We have an urgent opening for a Blended process which involves both Tele-calling and backend. Candidate from BPO, KPO, Sales, Ecommerce industry can apply Applicant is expected to be proficient in written and verbal communication skills Responsible for making calls to new & existing clients Prior Experience on E commerce platform is highly preferable. Candidate should be Hardworking, self-motivated & quick learner Should be able to apply analytical skills. Should be able to handle client complaint, Identify customer needs with quick response time. Applicant should possess strong Email handling skills. Good knowledge of the web applications and their functioning (Internet & Search Engines). Knowledge of MS Office/ Excel will be an added advantage. Good convincing skills. Walk-in Date/ Time: 7th September 2020, 10.30 AM - 4.00 PM Venue Details- Creative Lipi Webtech Private Limited D-101, Sector 63 Noida - 201 301 Landmark - Near Nissan Showroom Contact - Hemlata Bhardwaj (7835074143)","location":"Noida","experience":"0 - 1 Years"},{"date":"7 - Sept - 2020","skills":"Saving Account Sales, Liabilities, Fixed Deposits, Branch Banking","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"AU Small Finance Bank Limited, Shop No 1/B Ground Floor, Satva Shakti, Pushpakunj Circle, Kankaria, Maninagar, Ahmedabad \u0096 380 008.","phone":"Not Provided","profile":"Banking/ Sales Officer \nAU Small Finance Bank Limited","description":"Candidate should have 1 to 4 years of experience in Field Sales (Liability/ Insurance sales preferred), preferably localite. Should have customer service attitude, Negotiation & Relationship building skills. Ability to convince the customers and work under pressure. Must have excellent selling skills, Good communication skills, Fluently speaks and understands local language. Roles & Responsibilities: Acquisition of CASA & liabilities a/c from cold calling, market reference, cross sell and selling third party products (life & health insurance, mutual funds SIPs). Responsible for implementing sales and marketing activities within a branch in order to grow the Liabilities business and achievement of sales targets. Ensure Liability acquisition targets are met by developing new relationships and leveraging existing ones within the customer base. Responsible for acquiring new customers through multiple channels campaigns (in the vicinity), branch walk-ins, referrals from existing customers, through industry bodies and associations and through running industry Interested candidates can walk in with their updated resumes at below mentioned address on 7th September, 2020 i.e. Monday between 10:00 AM to 4:00 PM AU Small Finance Bank Limited Shop No 1/B Ground Floor, Satva Shakti, Pushpakunj Circle, Kankaria, Maninagar, Ahmedabad \u0096 380 008. Contact Person- Mr. Akhil Nair","location":"Ahmedabad","experience":"1 - 4 Years"},{"date":"7 - Sept - 2020","skills":"Inbound Process, Customer Service, Health Insurance, Claims Processing","qualification":"Diploma, B.A., B.Com, B.B.A, B.Sc","address":"PLOT NO. 13, 14, 15, TOWER 2, 1ST FLOOR, SJR I PARK, EPIP AREA, WHITEFIELD, BANGALORE","phone":"06366782144","profile":"Customer Care Executive \nVidal Health TPA Private Limited","description":"Educational Qualification/ Criteria: Any Graduate or Under Graduate Work Experience: Fresher or 0 to 3 Years of experience Flexible to work in shift Day shift for FEMALE. Rotational shift for MALE Salary - according to company standards Role & Responsibility: Handling inbound calls related to policies. Follow up with internal team for Pre-Auth cases. Convincing customer related to claims. Provide claim & Pre-Auth status to customers and hospitals. Update daily tracker to escalation team. Guide the customers about claim procedure and Pre-Auth procedure. Providing information related to corporate & individual policies. For any queries or details, Feel free to contact Kishan - 06366782144 Drop your CV to below mentioned email ID kishan.rp@vidalhealthtpa.com","location":"Bangalore","experience":"0 - 3 Years"},{"date":"7 - Sept - 2020","skills":"Business Loan, Home improvement loans, Loans against Property","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"K-1248, 1ST FLOOR, OPPOSITE SANJAY GANDHI HOSPITAL. MANGOLPURI, NEW DELHI - 110 083","phone":"Not Provided","profile":"Relationship Manager \nShubham Housing Development Finance Company Ltd.","description":"Candidate must have experience in Home loan/ LAP/ Business Loan/ MSME/ SME, Mortgage and must have incentives proof of last one year. Job Responsibility- 1. Front-end interaction, field travel and Customer interface 2. Recommending apt home loan product /solution and showcasing benefits 3. Regular interaction with the customers through group meetings, site promotions, in office meetings and presentations 4. Attending to walk ins into branches & visiting clients at their place 5. Executing Branding/ Marketing activities in the catchment area 6. Spearheading Documentation 7. Lead generation in the catchment areas Walk-in Date/ Time: 7th September 2020, 11.00 AM - 3.00 PM VENUE DETAILS- K-1248, 1ST FLOOR, OPPOSITE SANJAY GANDHI HOSPITAL. MANGOLPURI, NEW DELHI - 110 083 Contact Person- Nitin, Gurminder, Saujanya","location":"Delhi","experience":"2 - 7 Years"},{"date":"7 - Sept - 2020","skills":"Back office, Non Voice Process, Backend Support","qualification":"Diploma, B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"For venue details call - 9172742243","phone":"9172742243","profile":"Backend Process Executive \nV Connect","description":"Educational Qualification: 12th/ Diploma/ UG Vacancy: 10 Nos. Salary: 12,000-19,000 Immediately Joining Incentives Job- Full-time Job Location - Pune Qualifications-M.Com, BBA/ BBM, MA, BSc, BCA, BSW, BEd, MEd, 12th Pass (HSE), Vocational Training, PG Diploma, MSc, Certificate Course (ITI), M Phil / Ph.D, Diploma, B.Com, BFA, MCA Walk-in Date/ Time: 7th September 2020, 9 AM onwards For venue details call - 9172742243","location":"Pune","experience":"0 - 2 Years"},{"date":"7 - Sept - 2020","skills":"Core Java, J2ee, Jsp, Servlet, MySql, Tomcat","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Ojas Softech Private Limited, A-139 Sector 63 Noida - 201307","phone":"8447131703","profile":"Core Java Developer \nOjas Softech Private Limited","description":"Candidate must have good hands on experience in the following technology- Java/ J2ee (Core Java, J2ee, Jsp, Servlet) Hands on Experience on Developing Java Application. Knowledge about the basic database development skills like MySql, Tomcat Person must have strong coding & logical skills proactive & smart with strong analytical skills Open to work in a challenging environment Walk-in Date/ Time: 7th September 2020, 9.30 AM - 5.00 PM Venue Details- Ojas Softech Private Limited A-139 Sector 63 Noida - 201307 Contact Person- Pooja Sinha (8447131703)","location":"Noida","experience":"2 - 4 Years"},{"date":"7 - Sept - 2020","skills":"Stock Market, Account & Selling Mutual Funds/ Equity","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"IIFL Securities Limited, 903-9th Floor Airen heights, Opp C21 Mall. Beside Teleperformance AB Road, Indore","phone":"Not Provided","profile":"Relationship Manager/ Online Sales \nIIFL Securities Limited","description":"We at IIFL Securities Limited have urgent opening for Relationship Manager - E/ Online Sales Work Location:- Indore Nature of Work:- Tele Sales Candidate should have Graduation with expert in communication, Knowledge of Stock Market. Problem Solving approach, Good In System Navigation. Responsible for advising DEMAT &Trading A/c opening process. Collating Margins on account & Selling Mutual Funds/ Equity. All given targets in the month for account opening and funding on the same To ensure quality parameters are met and TAT to respond to the customer is maintained. To ensure that the defined productivity targets on service levels, quality parameters are met consistently. To ensure complete and accurate resolution within the defined TATs. Walk-in Date/ Time: 7th September 2020, 10.00 AM - 4.00 PM Venue Details- IIFL Securities Limited 903-9th Floor Airen heights, Opp C21 Mall. Beside Teleperformance AB Road, Indore Contact Person- Namisha Gupta/ Tapas Majumdar Tel Number: 9152023246 If your qualifications/ experience fit the mentioned profile and if you are interested, please forward your latest resume in WORD FORMAT only on namisha.gupta@iifl.com","location":"Indore","experience":"0 - 5 Years"},{"date":"7 - Sept - 2020","skills":"Back office, Non Voice Process, Backend Support","qualification":"Diploma, B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"For venue details call - 9172742243","phone":"9172742243","profile":"Backend Process Executive \nV Connect","description":"Educational Qualification: 12th/ Diploma/ UG Vacancy: 10 Nos. Salary: 12,000-19,000 Immediately Joining Incentives Job- Full-time Job Location - Pune Qualifications-M.Com, BBA/ BBM, MA, BSc, BCA, BSW, BEd, MEd, 12th Pass (HSE), Vocational Training, PG Diploma, MSc, Certificate Course (ITI), M Phil / Ph.D, Diploma, B.Com, BFA, MCA Walk-in Date/ Time: 7th September 2020, 9 AM onwards For venue details call - 9172742243","location":"Pune","experience":"0 - 2 Years"},{"date":"7 - Sept - 2020","skills":"Core Java, J2ee, Jsp, Servlet, MySql, Tomcat","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Ojas Softech Private Limited, A-139 Sector 63 Noida - 201307","phone":"8447131703","profile":"Core Java Developer \nOjas Softech Private Limited","description":"Candidate must have good hands on experience in the following technology- Java/ J2ee (Core Java, J2ee, Jsp, Servlet) Hands on Experience on Developing Java Application. Knowledge about the basic database development skills like MySql, Tomcat Person must have strong coding & logical skills proactive & smart with strong analytical skills Open to work in a challenging environment Walk-in Date/ Time: 7th September 2020, 9.30 AM - 5.00 PM Venue Details- Ojas Softech Private Limited A-139 Sector 63 Noida - 201307 Contact Person- Pooja Sinha (8447131703)","location":"Noida","experience":"2 - 4 Years"},{"date":"7 - Sept - 2020","skills":"Stock Market, Account & Selling Mutual Funds/ Equity","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"IIFL Securities Limited, 903-9th Floor Airen heights, Opp C21 Mall. Beside Teleperformance AB Road, Indore","phone":"Not Provided","profile":"Relationship Manager/ Online Sales \nIIFL Securities Limited","description":"We at IIFL Securities Limited have urgent opening for Relationship Manager - E/ Online Sales Work Location:- Indore Nature of Work:- Tele Sales Candidate should have Graduation with expert in communication, Knowledge of Stock Market. Problem Solving approach, Good In System Navigation. Responsible for advising DEMAT &Trading A/c opening process. Collating Margins on account & Selling Mutual Funds/ Equity. All given targets in the month for account opening and funding on the same To ensure quality parameters are met and TAT to respond to the customer is maintained. To ensure that the defined productivity targets on service levels, quality parameters are met consistently. To ensure complete and accurate resolution within the defined TATs. Walk-in Date/ Time: 7th September 2020, 10.00 AM - 4.00 PM Venue Details- IIFL Securities Limited 903-9th Floor Airen heights, Opp C21 Mall. Beside Teleperformance AB Road, Indore Contact Person- Namisha Gupta/ Tapas Majumdar Tel Number: 9152023246 If your qualifications/ experience fit the mentioned profile and if you are interested, please forward your latest resume in WORD FORMAT only on namisha.gupta@iifl.com","location":"Indore","experience":"0 - 5 Years"},{"date":"7 - Sept - 2020","skills":"Back office, Non Voice Process, Backend Support","qualification":"Diploma, B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"For venue details call - 9172742243","phone":"9172742243","profile":"Backend Process Executive \nV Connect","description":"Educational Qualification: 12th/ Diploma/ UG Vacancy: 10 Nos. Salary: 12,000-19,000 Immediately Joining Incentives Job- Full-time Job Location - Pune Qualifications-M.Com, BBA/ BBM, MA, BSc, BCA, BSW, BEd, MEd, 12th Pass (HSE), Vocational Training, PG Diploma, MSc, Certificate Course (ITI), M Phil / Ph.D, Diploma, B.Com, BFA, MCA Walk-in Date/ Time: 7th September 2020, 9 AM onwards For venue details call - 9172742243","location":"Pune","experience":"0 - 2 Years"},{"date":"7 - Sept - 2020","skills":"Core Java, J2ee, Jsp, Servlet, MySql, Tomcat","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Ojas Softech Private Limited, A-139 Sector 63 Noida - 201307","phone":"8447131703","profile":"Core Java Developer \nOjas Softech Private Limited","description":"Candidate must have good hands on experience in the following technology- Java/ J2ee (Core Java, J2ee, Jsp, Servlet) Hands on Experience on Developing Java Application. Knowledge about the basic database development skills like MySql, Tomcat Person must have strong coding & logical skills proactive & smart with strong analytical skills Open to work in a challenging environment Walk-in Date/ Time: 7th September 2020, 9.30 AM - 5.00 PM Venue Details- Ojas Softech Private Limited A-139 Sector 63 Noida - 201307 Contact Person- Pooja Sinha (8447131703)","location":"Noida","experience":"2 - 4 Years"},{"date":"7 - Sept - 2020","skills":"Stock Market, Account & Selling Mutual Funds/ Equity","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"IIFL Securities Limited, 903-9th Floor Airen heights, Opp C21 Mall. Beside Teleperformance AB Road, Indore","phone":"Not Provided","profile":"Relationship Manager/ Online Sales \nIIFL Securities Limited","description":"We at IIFL Securities Limited have urgent opening for Relationship Manager - E/ Online Sales Work Location:- Indore Nature of Work:- Tele Sales Candidate should have Graduation with expert in communication, Knowledge of Stock Market. Problem Solving approach, Good In System Navigation. Responsible for advising DEMAT &Trading A/c opening process. Collating Margins on account & Selling Mutual Funds/ Equity. All given targets in the month for account opening and funding on the same To ensure quality parameters are met and TAT to respond to the customer is maintained. To ensure that the defined productivity targets on service levels, quality parameters are met consistently. To ensure complete and accurate resolution within the defined TATs. Walk-in Date/ Time: 7th September 2020, 10.00 AM - 4.00 PM Venue Details- IIFL Securities Limited 903-9th Floor Airen heights, Opp C21 Mall. Beside Teleperformance AB Road, Indore Contact Person- Namisha Gupta/ Tapas Majumdar Tel Number: 9152023246 If your qualifications/ experience fit the mentioned profile and if you are interested, please forward your latest resume in WORD FORMAT only on namisha.gupta@iifl.com","location":"Indore","experience":"0 - 5 Years"},{"date":"7 - Sept - 2020","skills":"Back office, Non Voice Process, Backend Support","qualification":"Diploma, B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"For venue details call - 9172742243","phone":"9172742243","profile":"Backend Process Executive \nV Connect","description":"Educational Qualification: 12th/ Diploma/ UG Vacancy: 10 Nos. Salary: 12,000-19,000 Immediately Joining Incentives Job- Full-time Job Location - Pune Qualifications-M.Com, BBA/ BBM, MA, BSc, BCA, BSW, BEd, MEd, 12th Pass (HSE), Vocational Training, PG Diploma, MSc, Certificate Course (ITI), M Phil / Ph.D, Diploma, B.Com, BFA, MCA Walk-in Date/ Time: 7th September 2020, 9 AM onwards For venue details call - 9172742243","location":"Pune","experience":"0 - 2 Years"},{"date":"7 - Sept - 2020","skills":"Core Java, J2ee, Jsp, Servlet, MySql, Tomcat","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Ojas Softech Private Limited, A-139 Sector 63 Noida - 201307","phone":"8447131703","profile":"Core Java Developer \nOjas Softech Private Limited","description":"Candidate must have good hands on experience in the following technology- Java/ J2ee (Core Java, J2ee, Jsp, Servlet) Hands on Experience on Developing Java Application. Knowledge about the basic database development skills like MySql, Tomcat Person must have strong coding & logical skills proactive & smart with strong analytical skills Open to work in a challenging environment Walk-in Date/ Time: 7th September 2020, 9.30 AM - 5.00 PM Venue Details- Ojas Softech Private Limited A-139 Sector 63 Noida - 201307 Contact Person- Pooja Sinha (8447131703)","location":"Noida","experience":"2 - 4 Years"},{"date":"7 - Sept - 2020","skills":"Stock Market, Account & Selling Mutual Funds/ Equity","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"IIFL Securities Limited, 903-9th Floor Airen heights, Opp C21 Mall. Beside Teleperformance AB Road, Indore","phone":"Not Provided","profile":"Relationship Manager/ Online Sales \nIIFL Securities Limited","description":"We at IIFL Securities Limited have urgent opening for Relationship Manager - E/ Online Sales Work Location:- Indore Nature of Work:- Tele Sales Candidate should have Graduation with expert in communication, Knowledge of Stock Market. Problem Solving approach, Good In System Navigation. Responsible for advising DEMAT &Trading A/c opening process. Collating Margins on account & Selling Mutual Funds/ Equity. All given targets in the month for account opening and funding on the same To ensure quality parameters are met and TAT to respond to the customer is maintained. To ensure that the defined productivity targets on service levels, quality parameters are met consistently. To ensure complete and accurate resolution within the defined TATs. Walk-in Date/ Time: 7th September 2020, 10.00 AM - 4.00 PM Venue Details- IIFL Securities Limited 903-9th Floor Airen heights, Opp C21 Mall. Beside Teleperformance AB Road, Indore Contact Person- Namisha Gupta/ Tapas Majumdar Tel Number: 9152023246 If your qualifications/ experience fit the mentioned profile and if you are interested, please forward your latest resume in WORD FORMAT only on namisha.gupta@iifl.com","location":"Indore","experience":"0 - 5 Years"},{"date":"7 - Sept - 2020","skills":"Back office, Non Voice Process, Backend Support","qualification":"Diploma, B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"For venue details call - 9172742243","phone":"9172742243","profile":"Backend Process Executive \nV Connect","description":"Educational Qualification: 12th/ Diploma/ UG Vacancy: 10 Nos. Salary: 12,000-19,000 Immediately Joining Incentives Job- Full-time Job Location - Pune Qualifications-M.Com, BBA/ BBM, MA, BSc, BCA, BSW, BEd, MEd, 12th Pass (HSE), Vocational Training, PG Diploma, MSc, Certificate Course (ITI), M Phil / Ph.D, Diploma, B.Com, BFA, MCA Walk-in Date/ Time: 7th September 2020, 9 AM onwards For venue details call - 9172742243","location":"Pune","experience":"0 - 2 Years"},{"date":"7 - Sept - 2020","skills":"Core Java, J2ee, Jsp, Servlet, MySql, Tomcat","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Ojas Softech Private Limited, A-139 Sector 63 Noida - 201307","phone":"8447131703","profile":"Core Java Developer \nOjas Softech Private Limited","description":"Candidate must have good hands on experience in the following technology- Java/ J2ee (Core Java, J2ee, Jsp, Servlet) Hands on Experience on Developing Java Application. Knowledge about the basic database development skills like MySql, Tomcat Person must have strong coding & logical skills proactive & smart with strong analytical skills Open to work in a challenging environment Walk-in Date/ Time: 7th September 2020, 9.30 AM - 5.00 PM Venue Details- Ojas Softech Private Limited A-139 Sector 63 Noida - 201307 Contact Person- Pooja Sinha (8447131703)","location":"Noida","experience":"2 - 4 Years"},{"date":"7 - Sept - 2020","skills":"Stock Market, Account & Selling Mutual Funds/ Equity","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"IIFL Securities Limited, 903-9th Floor Airen heights, Opp C21 Mall. Beside Teleperformance AB Road, Indore","phone":"Not Provided","profile":"Relationship Manager/ Online Sales \nIIFL Securities Limited","description":"We at IIFL Securities Limited have urgent opening for Relationship Manager - E/ Online Sales Work Location:- Indore Nature of Work:- Tele Sales Candidate should have Graduation with expert in communication, Knowledge of Stock Market. Problem Solving approach, Good In System Navigation. Responsible for advising DEMAT &Trading A/c opening process. Collating Margins on account & Selling Mutual Funds/ Equity. All given targets in the month for account opening and funding on the same To ensure quality parameters are met and TAT to respond to the customer is maintained. To ensure that the defined productivity targets on service levels, quality parameters are met consistently. To ensure complete and accurate resolution within the defined TATs. Walk-in Date/ Time: 7th September 2020, 10.00 AM - 4.00 PM Venue Details- IIFL Securities Limited 903-9th Floor Airen heights, Opp C21 Mall. Beside Teleperformance AB Road, Indore Contact Person- Namisha Gupta/ Tapas Majumdar Tel Number: 9152023246 If your qualifications/ experience fit the mentioned profile and if you are interested, please forward your latest resume in WORD FORMAT only on namisha.gupta@iifl.com","location":"Indore","experience":"0 - 5 Years"},{"date":"7 - Sept - 2020","skills":"Back office, Non Voice Process, Backend Support","qualification":"Diploma, B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"For venue details call - 9172742243","phone":"9172742243","profile":"Backend Process Executive \nV Connect","description":"Educational Qualification: 12th/ Diploma/ UG Vacancy: 10 Nos. Salary: 12,000-19,000 Immediately Joining Incentives Job- Full-time Job Location - Pune Qualifications-M.Com, BBA/ BBM, MA, BSc, BCA, BSW, BEd, MEd, 12th Pass (HSE), Vocational Training, PG Diploma, MSc, Certificate Course (ITI), M Phil / Ph.D, Diploma, B.Com, BFA, MCA Walk-in Date/ Time: 7th September 2020, 9 AM onwards For venue details call - 9172742243","location":"Pune","experience":"0 - 2 Years"},{"date":"7 - Sept - 2020","skills":"Core Java, J2ee, Jsp, Servlet, MySql, Tomcat","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Ojas Softech Private Limited, A-139 Sector 63 Noida - 201307","phone":"8447131703","profile":"Core Java Developer \nOjas Softech Private Limited","description":"Candidate must have good hands on experience in the following technology- Java/ J2ee (Core Java, J2ee, Jsp, Servlet) Hands on Experience on Developing Java Application. Knowledge about the basic database development skills like MySql, Tomcat Person must have strong coding & logical skills proactive & smart with strong analytical skills Open to work in a challenging environment Walk-in Date/ Time: 7th September 2020, 9.30 AM - 5.00 PM Venue Details- Ojas Softech Private Limited A-139 Sector 63 Noida - 201307 Contact Person- Pooja Sinha (8447131703)","location":"Noida","experience":"2 - 4 Years"},{"date":"7 - Sept - 2020","skills":"Stock Market, Account & Selling Mutual Funds/ Equity","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"IIFL Securities Limited, 903-9th Floor Airen heights, Opp C21 Mall. Beside Teleperformance AB Road, Indore","phone":"Not Provided","profile":"Relationship Manager/ Online Sales \nIIFL Securities Limited","description":"We at IIFL Securities Limited have urgent opening for Relationship Manager - E/ Online Sales Work Location:- Indore Nature of Work:- Tele Sales Candidate should have Graduation with expert in communication, Knowledge of Stock Market. Problem Solving approach, Good In System Navigation. Responsible for advising DEMAT &Trading A/c opening process. Collating Margins on account & Selling Mutual Funds/ Equity. All given targets in the month for account opening and funding on the same To ensure quality parameters are met and TAT to respond to the customer is maintained. To ensure that the defined productivity targets on service levels, quality parameters are met consistently. To ensure complete and accurate resolution within the defined TATs. Walk-in Date/ Time: 7th September 2020, 10.00 AM - 4.00 PM Venue Details- IIFL Securities Limited 903-9th Floor Airen heights, Opp C21 Mall. Beside Teleperformance AB Road, Indore Contact Person- Namisha Gupta/ Tapas Majumdar Tel Number: 9152023246 If your qualifications/ experience fit the mentioned profile and if you are interested, please forward your latest resume in WORD FORMAT only on namisha.gupta@iifl.com","location":"Indore","experience":"0 - 5 Years"}]}