{"Walkins":[{"date":"4, 5, 6, 7 - Oct - 2019","skills":"talent acquisition hiring recruitment sourcing staffing","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"SoundLines Inc, No. 8A/19A, Ground Floor, Grants Building Annexe, Colaba, Mumbai","phone":"Not Provided","profile":"Recruitment Coordinator \nSoundLines Inc.","description":"SoundLines Inc., is looking for a Recruitment Coordinator Recruiter Qualifications/ Skills: Recruiting and interviewing skills Phone, Skype, and online meeting platform skills 1-4 years exempt and non-exempt recruiting experience in full life-cycle environment, Minimum 2 years experience recruiting in relevant industry environment Bachelors degree preferred. End to end recruitment process (From receipt of job order to final deployment) Lining up candidates, conducting initial shortlisting and coordinating with them for the Skype Interviews Coordinating and Visa processing Walk-in Date/ Time: 4th - 7th October , 10 AM onwards Interview Venue: SoundLines Inc. No. 8A/19A, Ground Floor, Grants Building Annexe, Colaba, Mumbai","location":"Mumbai","experience":"2 - 4 Years"},{"date":"5, 6, 7, 8 - Oct - 2019","skills":"General Administration, Office Administration, Front Desk Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Shivam Autotech Limited, 10, 1st floor, Emaar Digital Greens Tower A, Sector-61, Gurugram","phone":"Not Provided","profile":"Front Office cum Admin Executive \nShivam Autotech Limited","description":"Candidate should be Any Graduate with 1 to 3 years of experience in General Administration, Office Administration, Front Desk Management. Must have excellent communication skills Job Responsbility- 1- Answer, screen and forward any incoming phone calls while providing basic information when needed. 2- Receive and sort daily mail/deliveries/couriers. 3- Update appointment calendars and schedule meetings/appointment. 4- Perform other clerical duties such as filing, photocopying, collating, faxing etc. 5- Perform other duties assigned by the management. 6- Need to take care of admin related issues. Note- Female candidates only. Walk-in Date/ Time: 5th - 8th October 2019, 3 PM onwards Interview Venue: Shivam Autotech Limited 10, 1st floor, Emaar Digital Greens Tower A, Sector-61, Gurugram","location":"Gurgaon","experience":"2 - 3 Years"},{"date":"4, 5, 7, 8, 9, 10, 11, 12 - Oct - 2019","skills":"HR/ Recruitment, Interviewing, Sourcing, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Elico Healthcare Services Limited, C-56, A.P.I.E, Gate No. 6, Sanathnagar, Hyderabad - 18","phone":"8008804661","profile":"HR Trainee/ HR Executive \nElico Healthcare Services Limited","description":"We have an urgent Requirement in Human Resources for both Healthcare and Manufacturing Departments. Designation: HR Trainee / HR Executive Qualification: MBA (HR) Regular Experience: 0 - 2 Years Location : Hyderabad Exclusively looking for Male candidates and Immediate Joiners. Skill Set : Proactive with good communication skills. Should have good knowledge in Recruitment Process Experience in End to End Recruitment. Should have good knowledge on Job portals Conducting Mass Drives. Bulk Hiring Campus Drives Experience in Healthcare RCM and Manufacturing firm will be an added advantage to your profile. Freshers from MBA (HR) can also apply with MBA HR. Interested candidates, Please Walk In directly for the interview or forward your resume's to prasannam@elicohcs.com and chaitanyaka@elicohcs.com with the following details. EXP: CTC: ETC: NP: Reason for Job Change: *Please carry your Current Companies Offer Letter and Last 3 months Payslips with you while coming for the Interview Walk-in Date: 3rd - 12th October 2019 Timings : 10 AM to 5:30 PM Interview Venue: Elico Healthcare Services Limited C-56, A.P.I.E, Gate No. 6, Sanathnagar, Hyderabad - 18 Contact Person: Prasanna/ Chaitanya Contact No: 8008804661/ 8978447766","location":"Hyderabad","experience":"0 - 2 Years"},{"date":"4, 5 - Oct - 2019","skills":"BPO Hiring, IT/ Non IT Recruitment, Volume Hiring, Sourcing, Recruitment","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"HCL Technologies Limited, 1st Floor Navin,s WSS Towers, #107, Harris Road, Egmore,Chennai-600002. Land mark: Near Casino Theatre","phone":"Not Provided","profile":"HR Executive/ Recruiter \nHCL Technologies Limited","description":"Qualification: Any Graduate or Post Graduate can apply Experience : Minimum 4 to 6 years in recruitment is mandatory (IT or Non-IT) Role: End to End Recruitment Walk-in Date: 4th & 5th October 2019 Time: 11 am - 3 pm HCL Technologies Limited, 1st Floor Navin,s WSS Towers, #107, Harris Road, Egmore,Chennai - 600 002. Landmark: Near Casino Theatre Contact Person: Pradeepraj","location":"Chennai","experience":"4 - 6 Years"},{"date":"4, 5 - Oct - 2019","skills":"HR Recruitment, Sourcing/ Bulk Hiring, Talent Acquisition, Staffing","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"NBHC Private Limited, 203, Ackruti Star, MIDC Central Road, Andheri (East), Mumbai - 400 093.","phone":"Not Provided","profile":"HR Executive - Talent Acquisition \nNational Bulk Handling Corporation Pvt. Limited","description":"Candidate should have 1 to 4 years of experience in HR Recruitment, Sourcing/ Bulk Hiring, Talent Acquisition, Staffing. Sourcing of profiles through job portal, consultants and employee references. Effective offer negotiations and closures within TAT. Mandatory reference checks for the shortlisted candidates Intimation of New joinees details to all concerned departments for onboarding process. End to End recruitment closure of all positions particularly for BD, Ops, CCPM & Legal Walk-in Date/ Time: 4th - 5th October , 10 AM onwards Interview Venue: NBHC Private Limited 203, Ackruti Star, MIDC Central Road, Andheri (East), Mumbai - 400 093.","location":"Mumbai","experience":"1 - 4 Years"},{"date":"4, 5, 7, 8, 9, 10, 11 - Oct - 2019","skills":"Customer Support, Chat Process, Blended Process, Customer Service","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Svatantra Microfin Private Limited, Level 20, Sunshine Tower, Senapati Bapat Marg, Near Kamgar Krida Maidan, Dadar (West) Mumbai - 13","phone":"Not Provided","profile":"Customer Service Executive \nSvatantra Microfin Private Limited","description":"Freshers Graduate / HSC Pass can also apply. Interact with clients through telephone to provide information about services or products or obtain details of complaints and queries. To check and record details of inquiries, comments or complaints, transactions or interactions and take actions in accordance to it. Acquire and analyze all relevant information to evaluate validity of complaint and identify the possible causes. Refer unresolved and pending customer grievances to the concerned departments for further investigation and record them in complaint register sheet. Contact clients to notify regarding investigation results, respond to inquiries or any adjustments in the services (if any). Walk-in Date/ Time: 4th - 11th October , 9 AM onwards Interview Venue: Svatantra Microfin Private Limited Level 20, Sunshine Tower, Senapati Bapat Marg, Near Kamgar Krida Maidan, Dadar (West) Mumbai - 13","location":"Mumbai","experience":"0 - 3 Years"},{"date":"5, 6 - Oct - 2019","skills":"Core Java, OOPs Concepts, J2EE, HTML, CSS, SQL, IOS Objective C, Spring, Hibernate","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Soft Suave Technologies Private Limited, #100, 3 Lakeview Estate Building, M S Nagar, Kundrathur Main Road, Porur, Chennai.","phone":"044-42874244","profile":"Software Engineer - Java Trainee \nSoft Suave Technologies Private Limited","description":"Eligibility Criteria: B.E. / B.Tech / M.E. / M.Tech / MCA 2016, 2017, 2018 & 2019 passed outs. Immediate Joiners required. Job Location: Chennai Salary Package: 3 L Per Annum Required Skills: Core Java, Strong knowledge in OOPs concepts, J2EE, HTML, CSS, SQL Logical and analytical thinking towards the Java programming Should have designed at least one project module using object oriented analysis and design techniques Sound knowledge of modern software architecture and development techniques Should be a self initiator and interested in learning new technologies. OPTIONAL: IOS Objective C, Spring, Hibernate Job Responsibility: Execute full software development life cycle (SDLC) Code, test and troubleshoot programs utilizing the appropriate framework, database, and programming technology. Develop flowcharts, layouts and documentation to identify requirements and solutions Maintain and modify projects; make approved changes by amending flow charts, develop detailed programming logic, and coding changes. Write quality and clean code using prescribed specifications. Evaluate simple interrelationships between programs. Date: Oct 5th & 6th, 2019 (Saturday & Sunday) Interview Time: 10:00 am to 12:00 pm (Post this time slot, candidates will not be considered) Interview Venue: Soft Suave Technologies Private Limited #100, 3 Lakeview Estate Building, M S Nagar, Kundrathur Main Road, Porur, Chennai Rounds of Interview: Level 1: Technical Aptitude test Level 2: Programming Test Level 3: System Execution of Program Level 4: HR Interview","location":"Chennai","experience":"0 - 2 Years"},{"date":"7 - Oct - 2019","skills":"Screening, Senior Level Selection, Campus Hiring, Sourcing, HR Interviewing","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Daffodil Software Private Limited, 9th floor, Tower B1, DLF Silokhera SEZ, Sector 30, Gurgaon - 122 001.","phone":"Not Provided","profile":"Talent Acquisition Specialist \nDaffodil Software Private Limited","description":"As a part of talent acquisition team, you will be responsible for managing the recruitment process from role definition through to on boarding for entry to senior level hiring. Talent Acquisition responsibilities include sourcing candidates through various channels, planning interview and selection procedures. To be successful in this role, you should be able to develop long-term recruiting strategies and nurture trusting relationships with potential hires. Ultimately, you will create strong talent pipelines for our company's current and future hiring needs. Walk-in Date: 7th October, 2019 Timings: 10:00 am to 2:00 pm Address: Daffodil Software Private Limited 9th floor, Tower B1, DLF Silokhera SEZ, Sector 30, Gurgaon - 122 001. Nearest Landmark: Star Mall, NH 8, Gurgaon Nearest Metro Station: Huda City Center","location":"Mumbai","experience":"1 - 4 Years"},{"date":"4 - Oct - 2019","skills":"Core .Net 4 and 4.5, MVC, AJAX, MySQL, SQL Server","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"GODREJ INFOTECH LIMITED, Plant 19-A, LBS MARG, VIKHROLI (WEST) MUMBAI","phone":"022-67964084","profile":".Net Developer/ Team Lead \nGodrej Infotech Limited","description":"Qualification required: Any Stream of Graduation(Full-Time Qualification is mandatory) Cooling off Period: 6 Months for candidates who have already come for the drive Experience Required:- Within 3 to 9 years (Not less than 3 years; Not more than 9 years) Skills Required: Deep core .Net coding skills with rich experience in web development and database management using Core .Net 4 and 4.5, MVC, AJAX, MySQL, SQL Server, JQUERY, HTML5, UI DESIGNING, WORDPRESS, CMS etc. Independently able to manage and create websites and product/Application development etc. Requisite Work Experience : Experience in using .NET development Experience in using ASP .NET for developing web applications A good understanding of T-SQL, MS SQL, OOP principles, N-tier and N-layered architecture Special Skills Required: Strong analytical skills Attention to detail Experience of working effectively as part of a team Good written and verbal communication skills Inter-personal skills A flexible approach and ability to adapt Ability to work under own initiative Job Location: Mumbai (Vikhroli) If you are interested or have colleagues who suit the role kindly share a copy of your updated resume at shwethas@godrej.com Walk-in Date: 4th October 2019 Timing- 9:00 am to 12 pm Interview Venue: GODREJ INFOTECH LIMITED, Plant 19-A, LBS MARG, VIKHROLI (WEST) MUMBAI Note: Candidates who can either join immediately or within 45 days will be processed.","location":"Mumbai","experience":"3 - 9 Years"},{"date":"4 - Oct - 2019","skills":"ASP .NET, C#, etc","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Velcro Technologies Private Limited, 101/A, 1st Floor, Plot #2, Above Karnataka Bank, Opposite to, Image Gardens Road, HITEC City, Hyderabad, Telangana - 500 081","phone":"8142516243","profile":".Net Developer \nVelcro Technologies Private Limited","description":"Candidate must have profound skills like ASP .NET, C#, etc. Build an application end-to-end in a systematic fashion. Would be required to design, modify, write and implement software programming components and applications. Walk-in Date/ Time: 4th October 2019, 10 AM onwards Interview Venue: Velcro Technologies Private Limited 101/A, 1st Floor, Plot #2, Above Karnataka Bank, Opposite to, Image Gardens Road, HITEC City, Hyderabad, Telangana - 500 081","location":"Hyderabad","experience":"0 - 3 Years"},{"date":"5 - Oct - 2019","skills":"Training/ Certification in .Net or Software Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Maxval IP Services Private Limited, 4th Floor, Tower 1A, (Indialand Building) CHIL-SEZ, Keeranatham, Saravanampatti, Coimbatore - 641 035","phone":"6385191105","profile":"Trained Freshers - .Net/ Testing \nMaxval IP Services Private Limited","description":"BE/ B.Tech (IT/ CS/ ECE)/ MCA 2017, 2018/ 2019 & Trained Freshers With a specific Training or Certification in .Net or Software Testing Excellent verbal and written communication skills Should have basic knowledge on IT Technologies & company profile Salary: Best in Industry Job Location: Coimbatore Role Description: IT Date & Time: October 5, 2019 (Saturday) - 9:00 AM onwards Interview Venue: Maxval IP Services Private Limited 4th Floor, Tower 1A, (Indialand Building) CHIL-SEZ, Keeranatham, Saravanampatti, Coimbatore - 641 035","location":"Coimbatore","experience":"0 - 1 Years"},{"date":"5 - Oct - 2019","skills":"ASP .NET, C#, SQL, MVC, AJAX, JQuery, HTML/ CSS, Angular, Web API","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Hetero Learning Center-1, 1st Floor, Above Honda Showroom, Beside Gokul Theatre Erragada, Hyderabad","phone":"9515128773","profile":".Net Developers \nHetero Drugs Limited","description":"Educational Qualification: B.Tech/ M.Tech/ MCA/ BSc Work Experience: 2 to 5 Years Key Skills: ASP .NET, C#, SQL, MVC, AJAX, JQuery, HTML/ CSS, Angular, Web API Interested candidates can walk-in on 5th October 2019 (Saturday) @ 10 AM To 2 PM. Interview Venue: Hetero Learning Center-1, 1st Floor, Above Honda Showroom, Beside Gokul Theatre Erragada, Hyderabad Please carry an updated Resume along with your Photograph. If unable to attend the interview please share updated resume to Kesavapani.j@heterodrugs.com","location":"Hyderabad","experience":"2 - 5 Years"},{"date":"4, 5 - Oct - 2019","skills":"Asp .Net, C#, Jquery, WCF, Webservices/ Web Api & SQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Karvy Fintech Private Limited, Karvy Selenium Tower B, Plot Nos. 31 ; 32 Financial District Nanakramguda, Serilingampally Mandal Hyderabad - 500 032","phone":"040-33215106","profile":"Senior .Net Developer \nKarvy Fintech Private Limited","description":"Minimum 3 to 5 years of hands-on development experience with the following technologies: ASP .NET/ VB .NET projects, Web Services and SQL Server. Hands on experience in design using object oriented programming principles. Must have extensive experience in developing N-tier applications. Should have good experience with reporting tools. Mandatory Skills required for a different positions- 1. Asp .Net, C#, Jquery, WCF, Webservices/ Web Api & SQL 2. Asp & C#. 3. MVC, WebServices & Jquery, Walk-in Date: 4th - 5th October 2019 Time Slot Between: 10:00 am -3:00 pm Interview Venue: Karvy Fintech Private Limited Karvy Selenium Tower B, Plot Nos. 31 ; 32 Financial District Nanakramguda, Serilingampally Mandal Hyderabad - 500 032 Contact Person - Kalyan HRD Mode of interview : Face to Face Discussion","location":"Hyderabad","experience":"3 - 5 Years"},{"date":"4, 5 - Oct - 2019","skills":"Manual Testing/ Fresher","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"QualityKiosk Technologies Private Limited, A Wing - 419, Rupa Solitaire, Millennium Business Park, Mahape, Navi Mumbai - 400 709","phone":"Not Provided","profile":"Manual Tester/ Freshers \nQualityKiosk Technologies Private Limited","description":"Education : BE / B-Tech/ MCA /MSc/ BSc/ BCA with Throughout academics 60% ONLY CAN APPLY Candidates from western line and in central till Thane only (Eg no kalyan no dombivali no Navi Mumbai) Job Location: Base Location Navi Mumbai (Client location can be anywhere in central or western or Harbour line or Onsite or within India) Walk-in Details: Interview Date: 4 & 5 October 2019 (Friday & Saturday) Interview Time: 11:00 AM till 2:00 PM Interview Venue: QualityKiosk Technologies Private Limited A Wing - 419, Rupa Solitaire, Millennium Business Park, Mahape, Navi Mumbai - 400 709 Lift Number 24 & 25 (Directions: next to Mastek, take a right from the main entrance)","location":"Mumbai","experience":"0 - 1 Years"},{"date":"4 - Oct - 2019","skills":".Net 2.0 and above, C#, LINQ, ASP .Net, MVC, Entity framework, HTML, CSS, Javascript, jQuery","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"nThrive Global Solutions Private Limited, Unit 1-5-2, Block A - Eastern Front Wing TECCI Park No: 285, Old Mahabalipuram Road Sholinganallur, Chennai - 600 119","phone":"8448999198","profile":".Net/ Software Programmer \nnThrive Global Solutions Private Limited","description":"Educational Qualification: Graduate/ Post Graduate in Computer Science Minimum 2 years worked in C#, MVC and SQL Server 2008 R2 and above Total Experience: 2 to 4 years Required Skill Set : Good knowledge in HTML, CSS, Javascript, jQuery, .Net 2.0 and above, C#, LINQ, ASP .Net, MVC, Entity framework Must have good knowledge in SQL Server 2008 R2 and above Should have good communication skills Job Responsibilities: Knowledge in full lifecycle application development. Designing, coding and debugging applications in various software languages. Good knowledge in Object-oriented Design and Analysis (OOA and OOD). Investigate and document reported defects. Perform maintenance programming and correction of identified defects. Create, document and implement unit test plans, scripts, and test harnesses. Knowledge of database architecture and design. Integrate software with existing systems. Walk-in Date/ Time: 4th October 2019 from 11 AM onwards Interview Venue: nThrive Global Solutions Private Limited Unit 1-5-2, Block A - Eastern Front Wing TECCI Park No: 285, Old Mahabalipuram Road Sholinganallur, Chennai - 600 119 Interested candidates can walk-in directly or reach us at 8448999198","location":"Chennai","experience":"2 - 4 Years"},{"date":"4, 5, 7, 8 - Oct - 2019","skills":"Asp .NET, Javascript, JQuery, Angularjs, SQL","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Suvarna Technosoft, Plot No. 8, Durga Nagar Colony, Aneerpet, Hyderabad - 500 016.","phone":"9963426420","profile":"ASP .Net Developer \nSuvarna Technosoft","description":"Candidate should be Graduate with 0-1 year of experience. Should be proficient in Asp .NET, Javascript, JQuery, Angularjs, SQL Server Walk-in Date/ Time: 4th October - 31st October , 11 AM onwards Interview Venue: Suvarna Technosoft Plot No. 8, Durga Nagar Colony, Aneerpet, Hyderabad - 500 016. Opposite Chandana Brothers lane,","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"5 - Oct - 2019","skills":"Database Testing, Oracle,DB2 and SQL Server","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Xavient Digital-powered by TELUS International, Plot No. - 54, Noida Special Economic Zone (N.S.E.Z) Noida Phase II.","phone":"Not Provided","profile":"Database Testing Engineer \nXavient Digital - Powered by Telus International","description":"Xavient Digital - powered by TELUS International is organizing a Walk-In Drive on coming Saturday (05/October/19) for Database Testing Professional. Minimum of 2+ years of exposure in one or more of the following databases - Oracle,DB2 and SQL Server Demonstrate working experience in Quality Center, Proficient in database concept Possess good understanding in Business logic and writing SQL queries to validate data Ability to work as an individual contributor in a customer facing onshore-offshore delivery model Extensive knowledge of Waterfall and agile methodology Basic knowledge on UNIX Note: Candidates who can join early will be preferred. Please carry a hard copy of your resume for the Interview Interview details: Day & Date: Saturday (5th/ October/ 2019) Timings: 9:30 AM to 2:00 PM Venue: Xavient Digital-powered by TELUS International Plot No. - 54, Noida Special Economic Zone (N.S.E.Z) Noida Phase II. Contact Person: Naziya (Talent Acquisition Team)","location":"Noida","experience":"2 - 6 Years"},{"date":"5 - Oct - 2019","skills":"Automation Testing, Selenium, Core Java Concepts","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Xavient Digital-powered by TELUS International, Plot No. - 54, Noida Special Economic Zone (N.S.E.Z) Noida Phase II","phone":"Not Provided","profile":"Automation Tester (Selenium) \nXavient Digital - Powered by Telus International","description":"Inviting 'Automation Testing (Selenium) Professional' on 5th October' 2019 (Saturday) Work Experience: 2 - 6 Years Joining Time: Immediate - 45 days Skills Required: Should have working experience in Automation Testing, Selenium. Should have hands on experience in Core Java Concepts Experience in designing and implementing test automation frameworks with selenium web driver, TestNG/JUnit , Maven/Gradle , GitHub/Bitbucket/ Teamcity, BDD etc. Extensive experience in code repository/version control in GitHub/ Bitbucket(preferred) /SVN Solid experience in developing, debugging automation scripts Experience in Test management/CI tools using ALM/Jira/Jenkins/Maven Interview details: Day & Date: Saturday (5th/ October/ 2019) Timings: 9:30 AM to 2:00 PM Interview Venue: Xavient Digital-powered by TELUS International. Plot No. - 54, Noida Special Economic Zone (N.S.E.Z) Noida Phase II Contact Person: Naziya (Talent Acquisition Team) Note: Candidates who can join early will be preferred. Please carry a hard copy of your resume for the Interview","location":"Noida","experience":"2 - 6 Years"},{"date":"14, 15, 16, 17, 18, 21, 22, 23, 24, 25 - Oct - 2019","skills":"MVC 5.0, Entity framework, C#, MS .NET Framework 4.5 and above, AJAX, Web API, Jquery, JavaScript","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Marvel Business Solutions Private Limited, Unit 302, Matrix Square Building (Swiggy Office Building), Patrika Nagar, Madhapur, Hitech City, Hyderabad - 500 081","phone":"9030865577","profile":".Net MVC Developer \nMarvel Business Solutions Pvt. Limited (Accountri)","description":"Looking for trained fresher in building multi user .NET applications using n-tier Architecture. MVC is compulsary. Solid training in MVC 5.0, Entity framework, C#, MS .NET Framework 4.5 and above, AJAX, Web API, Jquery, JavaScript. Good knowledge in ASP.NET, Bootstrap, HTML, XML, OOA and OOD Concepts. Sound knowledge in .NET applications design including design patterns. Sound knowledge of estimation technique and TFS. Sound Knowledge of unit testing methodologies and frameworks and Agile methodology. Good communication skills (written & spoken): Should be able to communicate with customer and other teams. Sound Knowledge of SQL Server development and database design. Walk-in Date/ Time: 14th October - 25th October , 11 AM onwards Interview Venue: Marvel Business Solutions Private Limited Unit 302, Matrix Square Building (Swiggy Office building), Patrika nagar, Madhapur, Hitech City, Hyderabad - 500 081","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"12 - Oct - 2019","skills":"Software Testing, White box and Black box testing Database level testing (SQL)","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Sheorey Digital Systems Limited, Software Lab & Tech Support Center Anjaneya Techno Park, 1st Floor 147, HAL Airport Road, Kodihalli, Bengaluru - 560008","phone":"8792538063","profile":"Software Testing Engineer \nSheorey Digital Systems Limited","description":"Work Experience: 2 to 5 Years Required Skills: White box and Black box testing Database level testing (SQL) Find bugs with customer point of view, giving attention to detail ISTQB Certification and automation knowledge (is a plus) Walk-in Date/ Time: 12th October 2019, 10 AM onwards Interview Venue: Sheorey Digital Systems Limited Software Lab & Tech Support Center Anjaneya Techno Park, 1st Floor 147, HAL Airport Road, Kodihalli, Bengaluru - 560008","location":"Bangalore","experience":"2 - 5 Years"},{"date":"4 - Oct - 2019","skills":"sql queries, test plan preparation. test scenarios, performance testing, regression testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Wipro HR Services (India) Private Limited, Tower A, Tech Boulevard, Plot No. 6, Sector 127, Noida Expressway, Noida - 201 301","phone":"Not Provided","profile":"Manual Testing Engineer \nWipro HR Services (India) Private Limited","description":"Education: BE/ B.TECH (CS, IT and ECE) /MCA must apply for this position Required Experience: 18 to 36 months of work experience in Manual Testing. Job Location - Noida/ Gurgaon SQL Query write ups-Multiple complex Joints creation Should able to interpret Clients requirement and provide analysis & updates (configuration )in the system Experience in benefits administration preferably in Health or Insurance sector. Should have Excellent Communication Skills Experience in creating test plans, identifying test cases and perform test execution. Experience in relational databases, ability to write SQL queries. Experience in MS Office tools specifically MS Excel. Preferred Experience: Experience in US/CAN Health benefits domain and benefits administration (Optional) Should possess good Testing Knowledge and SQL Queries Should able to communicate on Requirement Analysis in the project involved Knowledge of Software Development Life Cycle (SDLC) principles/concepts. Experience working with mainframes sessions. Experience in VB Scripting in MS Excel. Experience in working in a client-vendor relationship. Interview Date- 4th October 2019 (Friday) Walk in time - 9:30 am to 11:00 am Interview Venue: Wipro HR Services (India) Private Limited Tower A, Tech Boulevard, Plot No. 6, Sector 127, Noida Expressway, Noida - 201 301 Contact Person - Kajol Singh","location":"Noida","experience":"2 - 3 Years"},{"date":"7, 8, 9 - Oct - 2019","skills":"Software Testing, Defect Reporting, Regression Testing, Functional Testing, Performance testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Paktolus Solutions, 405, Anurag Business Center, Opposite Amar Cinema, W. T. Patil Marg, Chembur (East), Mumbai - 400 071","phone":"9920931182","profile":"Software Testing Engineer \nPaktolus Solutions","description":"Candidate must have expertise in Defect tracking and reporting defects to improve communications & reduce delay. Proficient in analyzing client requirements & conducting Black Box & GUI Testing. Test case management, Status Reporting, Regression Testing. Well versed in the studying of Functional Requirements, Identifying scenarios, preparation of Test Cases, Execution of Test cases, Reporting Defects & Cross Browser Design Testing. Involved in Peer review of Test cases. Test case management. Walk-in Date/ Time: 7th - 9th October 2019, 12 PM onwards Interview Venue: Paktolus Solutions 405, Anurag Business Center, Opposite Amar Cinema, W. T. Patil Marg, Chembur (East), Mumbai - 400 071 Please call and kindly confirm your interview timing before coming. No Candidates will be entertained without prior confirmation. Also note Interviews are not conducted on weekends.","location":"Mumbai","experience":"2 - 3 Years"},{"date":"4, 5 - Oct - 2019","skills":".Net, OOP's, Java Script, jQuery, RDLC Reports Design, SQL ,MVC","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Avante Codeworx Private Limited, 501, 5thFloor, Pentagon 3, Magarpatta City, Hadapsar, Pune, Maharashtra - 411 028","phone":"Not Provided","profile":".Net Developer \nS2 Infotech International Private Limited","description":"Candidate must have strong knowledge of OOP's, Java Script, jQuery, RDLC Reports Design, Should have basic knowledge of SQL ,MVC Walk-in Date/ Time: 3rd - 5th October 2019, 2 PM onwards Interview Venue: Avante Codeworx Private Limited 501, 5thFloor, Pentagon 3, Magarpatta City, Hadapsar, Pune, Maharashtra - 411 028","location":"Pune","experience":"1 - 3 Years"},{"date":"4 - Oct - 2019","skills":"C#, Asp .Net, Web Api, MVC","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Constient Global Solutions Private Limited, 4th Floor, Above Cafe Coffee Day, Santhome High Road, Santhome, Chennai - 600 004. Landmark- Opposite to Indian oil petrol bunk","phone":"9566288473","profile":".Net Developers \nConstient Global Solutions Private Limited","description":"Work Experience - 1+ Years Skill set - C#, Asp .Net, Web Api, MVC Notice Period - Max 15 days Preferably male candidates Interested can walk in on 2/10/2019 from 10:30 AM to 5 PM Interview Venue: Constient Global Solutions Private Limited 4th Floor, Above Cafe Coffee Day, Santhome High Road, Santhome, Chennai - 600 004 Landmark- Opposite to Indian oil petrol bunk","location":"Chennai","experience":"1 - 5 Years"},{"date":"1, 2, 3, 4 - Oct - 2019","skills":"JAVA/ J2EE, Struts, Spring, Hibernate and Tomcat CSS, HTML, JavaScript, XML, JSON","qualification":"B.E./B.Tech","address":"Spoors Technology Solutions India Pvt. Limited, 4th Floor, Sai Prithvi - Cyber Arcades, Above Bata Showroom, Indian Oil Petrol Bunk, Madhapur, Hyderabad.","phone":"Not Provided","profile":"Java/ J2EE Developer \nSpoors Technology Solutions Pvt. Limited","description":"Candidate should have 2 to 4 years experience as a Java/ J2EE developer. Must have experience with Struts, Spring, Hibernate and Tomcat CSS, HTML, JavaScript, XML, JSON, AJAX and JSP. Good in Core JAVA, JavaScript, Spring Framework. Knowledge of Javascript and HTML is desirable. Database design and modelling skills (preferably in MySQL) Looking for Immediate joins only Walk-in Date/ Time: 30th September - 4th October , 9 AM onwards Interview Venue: Spoors Technology Solutions India Pvt. Limited, 4th Floor, Sai Prithvi - Cyber Arcades, Above Bata Showroom, Indian Oil Petrol Bunk, Madhapur, Hyderabad.","location":"Hyderabad","experience":"2 - 4 Years"},{"date":"3, 4 - Oct - 2019","skills":"Technical Support, IT Helpdesk/ Service Desk, Server Monitoring, Hardware/ Network Monitoring","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"HCL Technologies Limited, Surya Sapphire, Plot No. 3, Electronic City, Phase-1 Bangalore - 560 100","phone":"Not p","profile":"Technical Support Engineer (L1) \nHCL Technologies Limited","description":"Basic knowledge Of Unix/ Windows/ Backup will help for first level Support in few projects. ft is not mandatory that you will be troubleshooting each and every role. In most of the projects we have Catch and Dispatch SPOC for each and every business critical issue. Must have event monitoring and co-relation skills. Work as a central point to contact for all technical support teams and provide information for on-going incidents/alerts. Handle Ll troubleshooting& diagnose the issue and ny to resolve alerts at your end to balance work load of L2 technical support team. (In few Project Customer will not allow due to access issue.) Keep a G-ack on all unresolved incidents / tickets and follow up with different support team until die closer, within defined timelines. Wilt be wrong on Server Monitoring, Hardware Monitoring Network Monitoring Backup Monitoring Batch Job 00b Scheduler), ITSM Tools (Ret-dy, ServiceNow)etc These are Ble standard tools we use for DC Monitoring. It is not necessary in all project we will have diff tools. Work location : Pune (Should ready to relocate) Walk-in Details: Date: 1st to 4th Oct - 2019 (2nd Oct -Holiday) Time: 10:00 AM to 1:30 PM Interview Venue: HCL Technologies Limited, Surya Sapphire, Plot No. 3, Electronic City, Phase-1 Bangalore - 560 100 Spoc : Shobana/ Shemona Documents to Carry (Mandatory)* Hard Copy of your updated Resume. Printout / Screenshot of this walk-in One Government ID proof Xerox copy One Passport size photograph","location":"Bangalore","experience":"1 - 3 Years"},{"date":"3, 4, 5 - Oct - 2019","skills":"Desktop Support, Technical Support, Customer Support","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"HCL Technologies Limited, Lotus Business Park First floor, Tower-B , Sector-127, Noida","phone":"Not Provided","profile":"Desktop Support Engineer (RDS)-L2 \nHCL Technologies Limited","description":"Technical Requirements Phone support experience necessary. Technical Service desk or technical call center experience is necessary. Disciplined, systematic problem solving skills required. Windows Operating systems Clients: Windows7, Windows Vista, Windows XP, Windows 2000 Servers: Windows 2000, Windows 2003, Windows 2008 Knowledge of Active Directory, Exchange 2003/ 2007 ITSM ticketing tools such as Remedy, HP Service Center, Peregrine Service Center Remote desktop connectivity applications like SMS, Bomgar , WebEx, Live Meeting, and Windows Native tools MS Office Suite (XP, 2003, 2007): MS-Word, MS-Excel, MS-PowerPoint, MS-Outlook, MS Project, and MS Visio Internet browsers (e.g. Explorer, Chrome, Firefox), VPN and remote dial-in users Support for laptop, desktops, and printers PDA and blackberry support Others: Adobe Acrobat and other common desktop applications like WinZip, etc. Other Skills / Experience Ability to successfully provide hardware/software/network problem analysis and resolution support over the phone Personal dedication to providing high quality, superior service at all times. Ability to finish what is started is a must. Ability to integrate as a cross-functional, team player in a fast-paced environment where all information is shared. Ability to learn new information quickly and the willingness to do so at all times. Ability to work flexible hours from time to time to cover for other Service desk staff and to be on call via pager during the week. Customer Focus Teamwork Technical Expertise Interpersonal Effectiveness Concern for Order and Quality Certification requirements Preferred MCP/MSCE/MSCA or HDI CSS ITIL knowledge of V2 or V3 especially on Service Desk, Incident, Problem, and Change Management preferred Walk-in Date: 3rd - 5th October' 2019 (Except 2nd Oct'19- Wednesday) Time : 10:00 AM to 3.00 PM Interview Venue: HCL Technologies Limited Lotus Business Park First floor, Tower-B , Sector-127, Noida Please mention 'Chandni' on the top of your resume while coming for the interview. Documents to Carry (Mandatory)* Hard Copy of your updated Resume Printout / Screenshot of this walkin One Government ID proof Xerox copy (Preferable Passport ) One Passport size photograph","location":"Noida","experience":"3 - 7 Years"},{"date":"19 - Oct - 2019","skills":"Android, Core Java, OOPS concepts, Kotlin, MVP/ MVVM","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Bytemark Technologies Solutions (India) Pvt. Limited, 1st floor,Plot No. 6/A, Amit Plaza, (Above Axis Bank) Bannerghatta Road, J. P. Nagar 3rd Phase, Bangalore - 560 076","phone":"Not Provided","profile":"Android/ Java Developer \nBytemark Technologies Solutions Pvt. Limited","description":"Candidate should have at least 3 years of experience developing Android apps either independently or in a team Proficient in Core Java, strong understanding of OOPS concepts and basic understanding of Kotlin Solid understanding on Core Android Components like activity and services Can win arguments on MVP/ MVVM Hands on experience using dependency injection frameworks like Dagger 2 SQL and RDBMS Experience using RESTFul , JSON web services (experience in offline first is a plus) Understanding of GIT, source control procedures, and feature branching Work closely with Project Managers to design develop and test new features Strong knowledge of Layouts, Themes, Styles, Views and Other Android UI concepts especially pertaining to material design guidelines Up to date on emerging Android Architecture patterns Experience building an SDK Bonus points: Apps you have published on playstore, open source projects on github, used clean architecture,Kotlin and continuous integration Work as a member of Android Team to meet project deadlines Collaborate with development and design teams to create new features and improve user experience Work closely with QA with ensure code is clear and bug free Must be able to work in our Bangalore office during normal business hours Capable of meeting strict deadline and working under pressure Libraries we use: RxJava, Dagger2, Retrofit, Architecture components, Junit, espresso, GSON, Gradle Note: The interview will have the following rounds: 1. Technical Written test 2. Technical face to face round for selected candidates on the same day. Walk-in Date/ Time: 19th October 2019, 10 AM onwards Interview Venue: Bytemark Technologies Solutions (India) Pvt. Limited 1st floor,Plot No. 6/A, Amit Plaza, (Above Axis Bank) Bannerghatta Road, J. P. Nagar 3rd Phase, Bangalore - 560 076 Landmark: NEAR Mandovi Motors","location":"Bangalore","experience":"3 - 6 Years"},{"date":"12 - Oct - 2019","skills":"Java, REST Web Services, Spring Boot, JPA, FreeMarker, Angular JS","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"InfoDesk India Private Limited, 12- B Nutan Bharat Society, Opposite Nutan Bharat Club, Alkapuri ,Vadodara - Gujarat - 390 007","phone":"9409280003","profile":"Software Developer (Java) \nInfoDesk India Private Limited","description":"Candidate should have a Bachelor or Master Degree in Computer Science with 2 to 10 years of work experience with software development companies. Work experience on: Java, REST Web Services, Spring Boot, JPA, FreeMarker, AngularJS Work experience on XML/JSON technologies like: XSL, JAXB, XML, XSD, DTD, JSON Optional but it would add advantage if experienced on: Maven, Git, Jenkins, JIRA, BitBucket, AWS, Linux Confident communicator; able to argue a point concisely and deal positively with conflicting views Good root-cause analysis and problem-solving skills Good written and verbal communication skills Roles & Responsibilities: Develop, test (TDD), implement and maintain software applications Conduct software analysis, programming, testing and debugging Identify bottlenecks and bugs, and devise solutions to application problems Conduct research on provider's API and Content. Identify information/meta-data to be mapped to NewsML G2 specification Walk-in Date/ Time: 12th October 2019, 10 AM onwards Venue Details- InfoDesk India Private Limited, 12- B Nutan Bharat Society, Opposite Nutan Bharat Club, Alkapuri ,Vadodara - Gujarat - 390 007 Book a Slot for Interview: 9409280003/ 9638117783 or email resume at parin.padhiar@infodesk.com","location":"Vadodara","experience":"2 - 10 Years"},{"date":"7, 8, 9, 10, 11, 14, 15 - Oct - 2019","skills":"TESTING/ JAVA/ PHP Programming, OOPS Concept","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"SECRET TECHNOLOGIES INDIA (VMS Group) Office No. 302, Amit Samruddhi, Opposite Balgandharva Rang Mandir, Behind Arrow Showroom, J. M. Road, Pune - 411 004","phone":"Not Provided","profile":"IT Freshers (Testing/ Java/ PHP) \nSecret Technologies India (VMS Group)","description":"Secret Technologies India (VMS Group) Private Limited is hiring IT Freshers (Testing/ Java/ PH Qualification:BE, ME, MCA, BCA, BSC, any graduate Joining: Immediate Strong knowledge of TESTING/ JAVA/ PHP programming required. Should have knowledge of basic Programming languages like C, Java and any database Strong knowledge of OOPS Concept. Required Experience, Required Skills: Should have knowledge of basic Programming languages like C, Java and any database Strong knowledge of OOPS Concept. Should have a fair knowledge of entire SDLC, STLC. Good analytical and problem solving ability. Detail orientated with excellent written and verbal communication skills. Direct Walk-in for the Interview on weekdays (Monday to Friday) Date - 1st to 15th October 2019 Timing 10.00 Am to 4 .30 PM Venue Details SECRET TECHNOLOGIES INDIA (VMS Group) Office No. 302, Amit Samruddhi, Opposite Balgandharva Rang Mandir, Behind Arrow Showroom, J. M. Road, Pune - 411 004 You will meet HR Pritee. & Mr. Rahul Sir (Director) The interview will last about 15 minutes and you'll have the chance to discuss the Software Developer and Software Testing, Industrial Technical or Non Technical Jobs position and learn more about our company","location":"Pune","experience":"0 - 1 Years"},{"date":"1, 2, 3, 4 - Oct - 2019","skills":"Core Java, Spring, Multithreading, OOPS, Hibernate, Collections","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Verinon Technology Solutions Pvt. Limited #305, 3rd Floor, Mayfair Complex, SP Road, Begumpet, Hyderabad - 500 003. Landmark - Opposite to Traffic Police Training Center, Above Vodafone Store.","phone":"Not Mentioned","profile":"Java Trainee Developer \nVerinon Technoloy Solutions Pvt. Limited","description":"Looking for the candidate who got trained on Java (Core Java, Spring and Hibernate) Qualification : Any B.Tech/ MCA (2017/ 2018/ 2019 Passed outs) Must have trained on Java (Core Java, Spring and Hibernate) Must be willing to learn and work on new technologies Good Communication skills required Interested candidates can walk-in to the below address from 30th Sep 2019 to 4th Oct 2019 (Monday - Friday) Timings : 2:00 P.M - 5:00 P.M Venue : Verinon Technology Solutions Pvt. Limited #305, 3rd Floor, Mayfair Complex, SP Road, Begumpet Landmark - Opposite to Traffic Police Training Center, Above Vodafone Store, Hyderabad - 500 003, India","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"1, 2, 3, 4, 7, 8, 9, 10, 11 - Oct - 2019","skills":"HR Operations, Leave Management, Exit Process, Joining Formalities","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"ParadigmIT Group, eCentric Solutions Pvt. Limited, Purva Summit bldg. SMARTWORKS, 6th Floor White Field, Hitech City, Madhapur, Hyderabad - 500 081","phone":"Not Provided","profile":"Software Developer (Java/ SQL) \nParadigmIT Group (eCentric Solutions)","description":"Open Requirements:- SQL Developer [T-SQL] (Experience: 3-5 Years) Java +PLM (Experience: 4-9 Years) React Notes (Experience: 2-5 Years) Educational Qualification- BE/ B.Tech/ MCA Should have excellent communication skills Working Hours: 1.00 PM to 10.00 PM - Own Transportation Preferred Location:- Hyderabad only Note: Immediate Joiners Preferred Interview Date: Monday to Friday (27th Sep to 18th Oct) Time: 1:00 PM to 4:00 PM Interview Location: ParadigmIT Group, eCentric Solutions Pvt. Limited, Purva Summit bldg. SMARTWORKS, 6th Floor White Field, Hitech City, Madhapur, Hyderabad - 500 081 POC: Praveena","location":"Hyderabad","experience":"2 - 6 Years"},{"date":"3, 4, 5, 7, 8, 9, 10, 11, 12 - Oct - 2019","skills":"JAVA and C/ C++","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Smalsus Infolabs Private Limited, H-81 Sector-63 Noida (UP)","phone":"0120- 4116529","profile":"Trainee Developer (JAVA and C/ C++) \nSmalsus Infolabs Private Limited","description":"Urgent requirement of Software Developer Trainee. Candidate should be good in basic programming i.e. JAVA and C/ C++. We are looking to build our team with competent, energetic and result oriented freshers who wants to start their career. If you have the right skills and background and want to be part of a growing company, this is the place for you. Candidate should have done B.Tech. (CS/ IT) or MCA Should be fresher 2018/19 Pass outs Responsibilities & Duties: Knowledge and interest in computer systems and the latest technologies. The ability to learn new technologies quickly. Candidate should be a good team player. Should have good verbal and written communication skills. Key Skills : Candidate should have patience and attention to deal. Should have good analytical and problem solving skills. Should be good enough in OOPS and Basic programming. Should have good interpersonal skills. Walk-in Date/ Time: 3rd - 12th October 2019, 11 AM onwards Interview Venue: Smalsus Infolabs Private Limited H-81 Sector-63 Noida (UP), Landmark- Near Noida Electronic City Metro Station Phone No: 0120- 4116529","location":"Noida","experience":"0 - 1 Years"},{"date":"5 - Oct - 2019","skills":"Java 8, Java 11/ Java Script / AngularJS /Jasper reports/ExtJS/Open JDK","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"RAVSoft Solutions (India) Private Limited, MPL Silicon Towers, No. 23-1/ B3 5th Floor, Velachery Tambaram Main Road, Velachery, Chennai - 600 100","phone":"044-66105808","profile":"Java Developers \nRAVSoft Solutions (India) Private Limited","description":"Candidates with below technical experience can walk-in for the interview. Role : Java Developer Experience in Java 8, Java 11/ Java Script / AngularJS /Jasper Reports/ ExtJS/ Open JDK (OR) Angular 2/.Net/ C#/ NodeJS/ Type Script/ Java Experience in DICOM, HL7, Multi Planar Reconstruction (MPR) and 3D rendering will be a plus. Good verbal and written communication skills. Good Knowledge in SDLC Process Good interpersonal skills Walk-in Date: 5th October 2019 Interview Timing : 10 am - 1 pm Interview Venue: RAVSoft Solutions (India) Private Limited MPL Silicon Towers, No. 23-1/ B3 5th Floor, Velachery Tambaram Main Road, Velachery, Chennai - 600 100","location":"Chennai","experience":"1 - 6 Years"},{"date":"3, 4 - Oct - 2019","skills":"Java, Jenkins, GIT, Unit Testing, JUnit, Spring Boot, Spring Core, AWS Microservices","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Tech Mahindra Limited, Technopark, Ganga Building, Phase-III 110-N, 10th Floor, Ganga SEZ IT building Thiruvananthapuram Kerala - 695581","phone":"0471 4217400","profile":"Java Professionals \nTech Mahindra Limited","description":"Candidate should have 4+ years of experience in Java with sound knowledge on Java fundamentals 2+ years of experience in Spring Core, Spring boot with good microservices fundamentals Should have knowledge of Junit or SPOCK unit testing framework Nice to have AWS, CICD, Jenkins and GIT. Walk-in Date/ Time: 3rd - 4th October from 12 AM onwards Interview Venue: Tech Mahindra Limited Technopark, Ganga Building, Phase-III 110-N, 10th Floor, Ganga SEZ IT building Thiruvananthapuram Kerala - 695581 Phone No: 0471 4217400 Looking for 0-40 Days Notice Period Candidates only","location":"Trivandrum","experience":"4 - 9 Years"},{"date":"1, 2, 3, 4 - Oct - 2019","skills":".Net Fresher, ASP .Net, C#","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Dotphi Infosolutions Private Limited 4, Roongta Blossom Apartment, Near HP Suman Petrol Pump, Mumbai Agra Highway, Rajiv Nagar, Nashik-9","phone":"7276065777","profile":"Android/ Java Developer \nDotphi Infosolutions Private Limited","description":"Candidate must have strong knowledge of Android SDK, different versions of Android, and how to make compatibility with different screen sizes. Ability to deal with webservices in XML, JSON parsing. Must have implemented at least one application which uses server side Experience in Java and android studio Familiarity with the Android SDK Should able to work independently as well as in a team. Strong knowledge of Android UI design principles, patterns. Familiarity with Google cloud message APIs and push notificatio Walk-in Date/ Time: 26th September - 4th October , 11 AM onwards Interview Venue: Dotphi Infosolutions Private Limited 4, Roongta Blossom Apartment, Near HP Suman Petrol Pump, Mumbai Agra Highway, Rajiv Nagar, Nashik-9","location":"Nasik","experience":"1 - 3 Years"},{"date":"1, 2, 3, 4, 5, 7 - Oct - 2019","skills":"IT Recruitment, Exit Formalities/ Joining Formalities, Documentation","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"ISKPRO Private Limited, C-40, Second Floor, Sector-58, Noida","phone":"Not Provided","profile":"HR Executive (Female Only) \nISKPRO Private Limited","description":"Role:- HR Work Experience :- 0.6 - 1 Years Female candidate only needed Candidate must have experience into Technical and Non-Technical Recruitments Must have good knowledge of handling job portals and linkedIn Prior consultancy experience will be preferred. Communication should be very good. Job Responsibilities: - Recruitment & Selection for technical and non-technical position. End-to-End recruitment process for internal position. Sourcing candidates for the requirements through job portals, references / networking, and existing database. Conducting preliminary telephonic HR assessments to check their communication skills, technical skills, and stability. Briefing the candidate about the responsibilities, salary and benefits of the job. Strengthening relations with candidates. Following up with candidates. (Post joining and Pre joining) Maintaining Interview Status & Daily MIS. If Interested, kindly come directly for the interview from 1st - 7th October 2019 Interview Timing: 1:00 PM to 7:00 PM Address :- ISKPRO Private Limited C-40, Second Floor, Sector-58, Noida Contact Person - Sachin Kumar","location":"Noida","experience":"0 - 1 Years"},{"date":"3, 4 - Oct - 2019","skills":"campus recruitment, it recruitment, employee engagement","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Progressive Infotech Private Limited, C 161, C Block, Hosiery Complex, Dadri Main Road, Phase 2, Noida - 201 305","phone":"8299486465","profile":"HR Executive \nProgressive Infotech Private Limited","description":"Required Skills: 1. Excellent communication skills 2. Should be confident in giving stage presentations 3. Basic knowledge of recruitment. 4. Should know how to work on MS Word and MS Excel. 5. Strong decision-making and problem solving skills. 6. Should know how to source CVs/ resumes through job portals. Job Responsbility: 1. End to end Recruitment for Technical and Non Technical profiles 2. Coordinating with HR in Campus Recruitment. 3. Employee documentation. 4. Induction of employees. 5. Organizing employee engagement activities 6. Maintaining daily tracker. 7. Recommend strategies to motivate employees. 8. Keep up-to-date with the latest HR trends and best practice. Walk-in Date/ Time: 3rd October - 4th October , 10 AM onwards Interview Venue: Progressive Infotech Private Limited C 161, C Block, Hosiery Complex, Dadri Main Road, Phase 2, Noida - 201 305 Interested candidates can share their resume at sonam@centilytics.com","location":"Noida","experience":"0 - 1 Years"},{"date":"1, 2, 3, 4 - Oct - 2019","skills":"Backend Process (Data Processing)","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Vara Infotech Private Limited, 1st Floor, Raghuleela Arcade, Vishwaroop Software Park (Above Audi Showroom), Sector 30A, Vashi, Navi Mumbai - 400 703","phone":"022-45420045","profile":"Back Office Executive (Male) \nVara Infotech Private Limited","description":"Vara Infotech is hiring Fresher candidates for Backend Process (Data Processing) for Vashi and Andheri Location Candidate Candidate should be Graduate with minimum of 25 to 35 WPM in Typing with 95% accuracy. Should not have any gap in their education. Technical candidates need not to apply. Only MAle candidates are eligible. Willing to work in Rotational Shifts Interview location is same for both the location. Walk-in Date/ Time: 1st - 4th October , 11 AM onwards Interview Venue: Vara Infotech Private Limited 1st Floor, Raghuleela Arcade, Vishwaroop Software Park (Above Audi Showroom), Sector 30A, Vashi, Navi Mumbai - 400 703 Contact Person: Priyanka Te: 022-45420045/ 9075917122 Kindly carry the following documents during interview: All educational documents(Photo Copies of Mark Sheets degree) Aadhar Card and PAN Card Updated resume","location":"Mumbai","experience":"0 - 1 Years"},{"date":"3, 4, 5, 7, 8, 9, 10, 11, 12, 14, 15 - Oct - 2019","skills":"Customer Service, Back Office Operations and Customer Support","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"VFS Global Services Private Limited, 4th Floor , Urmi Axis Bldg , Behind Famous Studio, Near Mahalaxmi Railway Station Mahalaxmi (West), Mumbai","phone":"Not Provided","profile":"Operations Officer - Back Office \nVFS Global Services Private Limited","description":"Candidate should be Any Graduate with 0 to 1 year experience in Customer Service, Back Office Operations and Customer Support. Must have excellent communication skills Job Responsbility- Document scrutiny and collection of applications for visa processing. Handle customer/applicant queries personally or via email, telephone. Handle cash and bank related transactions if assigned and ensure 100% accuracy. Record & maintain all application data. Ensure accurate & timely data entry into the system with zero errors. Ensure all administration and logistics of passport delivery to consulate/ applicant / logistic company etc. Maintain compliance to the standard operating procedures, manuals etc. without deviation in process. Walk-in Date/ Time: 3rd - 15th October , 11 AM onwards Interview Venue: VFS Global Services Private Limited 4th Floor , Urmi Axis Bldg , Behind Famous Studio, Mahalaxmi (West) Mumbai. Landmark: Near Mahalaxmi Railway Station","location":"Mumbai","experience":"0 - 1 Years"},{"date":"3, 4, 5, 7, 8 - Oct - 2019","skills":"Front Desk, Office Administration, Facility Management","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Maveric Systems Private Limited, Anchorage, #100, 5th floor Richmond Road, Bangalore - 560 025","phone":"Not Provided","profile":"Front Office Executive \nMaveric Systems Private Limited","description":"Maveric Systems is looking for Front office Executives/ Receptionist for B'lore Location (Richmond Road) Work Experience: 1 to 3 years Location : Richmond Road, Bangalore Job Responsbility- 1. Front Desk executive/ Receptionist 2. Office Administration 3. Facility Management 4. Managing incoming calls 5. Travel Management for Leadership roles Interview Date & Time : walk in daily Time : 10:30 AM to 5 PM Interview Venue: Maveric Systems Private Limited Anchorage, #100, 5th floor Richmond Road, Bangalore - 560 025 Landmark - Opposite Neelkanth Jewellers Next building of Oriental bank of Commerce","location":"Bangalore","experience":"1 - 3 Years"},{"date":"1, 3, 4, 5, 7 - Oct - 2019","skills":"Technical Support, Web Technologies, SQL Queries, HTML, SQL","qualification":"B.E./B.Tech","address":"Amazon Development Centre (India) Private Limited, Ground Floor, Orion Building (BLR12), Bagmane Constellation Business Park, Marathalli Ring Road, Mahadevapura, Bangalore - 560 048","phone":"Not Provided","profile":"Technical Operations Associate \nAmazon Development Centre (India) Pvt. Limited","description":"We are hiring for SMT Technical Operations Associate/ Level 3 Qualification: Only Engineering Graduates Work Experience: 0-1 years Max Job Location: Bangalore Basic Linux Basic SQL commands. Basic knowledge about web (html, xml) Regular Expression. Trouble Shooting ability Preferred Qualifications: Excellent Data Accuracy skills. Excellent Analytical ability Knowledge of VBA Script Understanding and basic working knowledge with Linux. Should be able to work with files, filtering, finding patterns, etc. Should be well versed in xml, Regex, Linux commands and Sql queries needed to execute the task successfully. Ability to monitor and escalate in case of Hardware or software issues. Should have an eye for detail and escalate exceptions in a timely manner. Should be able to communicate issues/feature requests with required details. Should have good documentation skills and should contribute to maintenance of SOPs. Commitment to meet Deadlines is expected as a behavior. She/he is expected to commit and deliver as expected. Should be able to work independently, prioritize & schedule work assignments based on deadlines. Salary Range: Fixed 3,90,000 per annum only Additional Benefit: Two way cab is provided , Food Allowance 1100 every month Walk in Date: 30th September to 7th October (Except on 2nd Oct and 6th Oct) Interview time: 9:30 AM to 12:00 PM Interview Venue: Amazon Development Centre (India) Private Limited Ground Floor, Orion Building (BLR12), Bagmane Constellation Business Park, Marathalli Ring Road, Mahadevapura, Bangalore - 560 048 Contact Person: Aiyappa B R","location":"Bangalore","experience":"0 - 1 Years"},{"date":"3, 4, 5 - Oct - 2019","skills":"Technical Support, Server Monitoring, Data Center, IT Infrastructure, Troubleshooting","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"HCL Technologies Limited, Lotus Business Park Tower B, 1st floor Sector 127, Noida","phone":"Not Provided","profile":"Technical Support Engineer (L1/ L2) \nHCL Technologies Limited","description":"Candidate should have good monitoring experience Should be ready to work in 24X7 environments. rotating shifts & rotating weekly Offs. Will have to work in the current role for at least 18 months before anyinternal movement- Candidates from Data Center Monitoring background will be preferred Or trainable resource. Basic Effowledge Of Unix/Windows/Backup will help for first level Support in few projects. ft is not mandatory that you will be troubleshooting each and every aleR. In most of the projects we have Catch and Dispatch SPOC for each and every business critical issue. Event monitoring and co-relation skills. Good knowledge of IM/ PM/ CM etc-.(Preferred. Coordinate and manage relationships with vendors and support track. Responsible for manage daily/weekly/monthly performance report. - Outage (Sevl) handiing. Real time acknowledgement and ownership of IT infrastructure alerts. Quickly address the critical alerts and follow up with respective teams tili the resolution. Work as a central pointOt contact for all tednical support teams and provide information for on-going incidents/aierts. Walk-in Date: 1st to 5th Oct' 2019 (except 2nd Oct'19- Wednesday) Time: 10:00 AM to 2:00 PM Interview Venue- HCL Technologies Limited Lotus Business Park Tower B, 1st floor Sector 127, Noida Contact Person: Chandni Documents to Carry (Mandatory)* Hard Copy of your updated Resume. Printout / Screenshot of this walkin One Government ID proof Xerox copy One Passport size photograph.","location":"Noida","experience":"1 - 6 Years"},{"date":"3, 4 - Oct - 2019","skills":"production support, technical support, service desk","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Attra Infotech Private Limited, 201/ 202 Zero One, Village Mundhwa Koregaon Park Extension Pune - 410 036","phone":"020 49108500","profile":"Technical Support/ Service Desk \nAttra Infotech Private Limited","description":"Candidate should have Bachelor's degree in Information Technology, Computer Science or Management Information Systems or equivalent work experience in one or more of the following is preferred: Java, SQL Developer, Oracle, UNIX & C, C++. Must have strong communication skills -- both verbal and written with strong relationship, collaborative skills and organizational skills. Support engineers must be able to communicate technical issues to colleagues and customers with a variety of backgrounds, which means they need to be able to explain the issues. They also need to be good listeners, carefully listening to the users concern, and solving his or her problem. Must be high-energy, detail-oriented and proactive with the ability to function under pressure in an independent environment, skills to have a high degree of initiative and self-motivation with a willingness and ability to learn and take on challenging opportunities Flexibility is essential to support engineer jobs. Typically, they have to work days, nights, or even weekends. Should be open to a flexible schedule. Strong customer focus Interested applicants are requested to walk-in anytime between 9 am to 6 pm on 3rd & 4th October 2019 Interview Venue: Attra Infotech Private Limited 201/ 202 Zero One, Village Mundhwa Koregaon Park Extension Pune - 410 036 Contact Person: Babita & Jyoti Singh Tel: 020 49108500 (Ext- 8653)","location":"Pune","experience":"3 - 7 Years"},{"date":"3, 4, 5 - Oct - 2019","skills":"Technical Support, International Voice Process, Customer Support","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Tech Mahindra Limited, Gate 1, Takshashila block Survey No. 62/1 A, Qutubullapur Mandal, Bahadurpally, Hyderabad, Telangana - 500 043","phone":"9704815180","profile":"Technical Support (International Voice) \nTech Mahindra Limited","description":"Candidate should be Any Graduate, Diploma or Intermediate with excellent verbal communication skills in English. Excellent judgment skills to be able to properly evaluate situations and immediately provide effective solutions. Minimum 6 months of Voice Tech Support experience or 12 months BPO or any Voice Calling Experience is required. Excellent Communication Skills in English would be preferred. Freshers are Eligible (2018/ 2019) Interested candidates can directly walk-in to the below mentioned venue address with a copy of resume and all the necessary documents- Walk-in Date: 3rd - 5th October, 2019 Time 10:00 AM to 3:00 PM Interview Venue: Tech Mahindra Limited Gate 1, Takshashila block Survey No. 62/1 A, Qutubullapur Mandal, Bahadurpally, Hyderabad, Telangana - 500 043 Contact Person : Jyothi Mani Contact Number : 9704815180 Please carry your updated resume and mention ref Id as Jyothi on the top of your resume Documents Required (Mandatory) Kindly carry an Aadhar Card (Original & Copy). Resume & passport size photo Photocopy of Educational & Experienced related documents","location":"Hyderabad","experience":"1 - 5 Years"},{"date":"3, 4 - Oct - 2019","skills":"End User Support, Technical Support, Outlook Configuration, Remote Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"InspiriSYS Solutions Limited, 64/ 2401, (Old No: 41/1699), First Floor, Vithayathil Buildings, Veekshanam Road, Kochi - 682 018.","phone":"Not Provided","profile":"Desktop Support Engineer \nInspiriSYS Solutions Limited","description":"InspiriSYS Solutions Limited, is conducting Walk-In drive for Field Support/ Desktop Engineer L1 position at Kochi. NATURE OF JOB: Field Support & MUST Ready to travel at Kochi location. Hands-on experience on End-user computing like Desktops, Laptops, network, Wi-Fi devices, etc. on both Hardware & Software. Remote support and application knowledge. Softwares - OS-level troubleshooting in Win 7 & Win 10, MS Office 2016, etc., Outlook / Mail config. Windows applications troubleshooting, Windows updates failure troubleshooting. Antivirus troubleshooting. Wi-Fi Config. Handle daily technical support activities on desktop support Identify Improvements & quick resolution on day to day IT Operations REQUIRED EXPERIENCE, SKILLS AND QUALIFICATIONS Good communication & exceptional customer service skills and demeanor, along with the innovative ability to communicate with both technical and non-technical customers & clients. Educational Qualification: BE/ B.Tech/ BSc/ BCA Experience from Min 1 Yrs to Max 3 Yrs. Its Field Support. Candidate MUST Ready to travel at Kochi location as per required. WALK-IN DETAILS:- DATE : 3rd & 4 October 2019 (Thursday & Friday) TIME : 10:00 AM to 05:00 PM Interview Venue: InspiriSYS Solutions Limited, 64/ 2401, (Old No: 41/1699), First Floor, Vithayathil Buildings, Veekshanam Road, Kochi - 682 018. Contact Person: Steena","location":"Kochi","experience":"1 - 3 Years"},{"date":"3, 4 - Oct - 2019","skills":"IT Recruitment, Social Networking, C2H","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"GBIT India Private Limited, Plot No. #4, Advant Building, 2nd Floor, Opposite to Phonix Motors, Madhapur Road, Kavuri Hills Phase 1, Hyderabad - 500 033","phone":"9030765018","profile":"IT Recruiter \nGBIT India Private Limited","description":"Skill sets required: Must have handled complete recruitment cycle Experience in Permanent, Contract and C2H hirings. Must have worked in niche skills Should have excellent knowledge in Job portals and Social networking recruitment Understanding and analyzing the requirement of clients for different levels Monitoring/ Handling the Client requirements on a regular basis Added advantage if you have experience in Engineering / Automotive industries Must have Excellent Communication and Inter Personal skills. Walk-in Date/ Time: 3rd - 4th October , 10 AM onwards Interview Venue: GBIT India Private Limited Plot No. #4, Advant Building, 2nd Floor, Opposite to Phonix Motors, Madhapur Road, Kavuri Hills Phase 1, Hyderabad - 500 033 Contact Person: Ms. Chandini Tel: 9030765018","location":"Hyderabad","experience":"2 - 4 Years"},{"date":"1, 2, 3, 4, 5, 7, 8, 9, 10, 11, 12, 14, 15, 16 - Oct - 2019","skills":"HR Recruitment, General Administration, Statutory Compliance, Training/ Performance Management","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Innovative Retail Concepts Private Limited, # 224, Ranka Building, 4th Floor, Adjacent to Tin Factory Bus Stop, Next to Om Shakti Temple, Near KR Puram, Bangalore - 560 016","phone":"9886236804","profile":"HR Executive/ Recruiter \nInnovative Retail Concepts Private Limited","description":"Candidate should be Graduate/ MBA HR with 1 to 3 years of experience in HR Recruitment, General Administration, Statutory Compliance, Training/ Performance Management. Should have excellent communication skills. Job Responsibilities: Prepare recruitment materials and post jobs to appropriate job board/newspapers/colleges etc Source and recruit candidates by using databases, social media etc Screen candidates resumes and job applications Conduct interviews using various reliable recruiting and selection tools/methods to filter candidates within schedule Monitor and apply HR recruiting best practices Provide analytical and well documented recruiting reports to the rest of the team Act as a point of contact and build influential candidate relationships during the selection process Actively manages vendors/hiring partners to fulfill the hiring needs. Interested candidates can call on 9886236804 or walk-in to below mentioned address: Innovative Retail Concepts Private Limited # 224, Ranka Building, 4th Floor, Adjacent to Tin Factory Bus Stop, Next to Om Shakti Temple, Near KR Puram, Bangalore - 560 016 Email Your Resumes to : ramya@bigbasket.com","location":"Bangalore","experience":"1 - 3 Years"},{"date":"3 - Oct - 2019","skills":"Font desk, Office Supervision, Inventory Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Oravel Stays Private Limited, OYO Corporate Office, 10th Floor, Epicenter Room, Spaze Palazo, Sector 69, Gurugram, Haryana","phone":"Not Provided","profile":"Front Office Executive \nOravel Stays Private Limited","description":"Candidate should have 3 years degree in hotel management with experience of minimum 2 years as a front office supervisor in a mid to top brand hotel. Overall experience of five years minimum. Possess knowledge about HMS systems- IDES/ Opera/ Fidelio and various versions. Must have sound knowledge of front desk related activities, cashiering, EOS reports. Up selling skills, rooms inventory management, allocation of rooms, coordination with housekeeping. Posting of bills across POS , Folio presentations Ensuring maximum blocked inventory Excellent personality, English language, guest contact skills, guest problem handling, emergency situations. DUTIES AND RESPONSIBILITIES: Front office support for launch of 3/4/5 star properties Establishing front office systems./ HMS/ Training/ transference of systems/ all related work. Supporting Management of Front Desk Team In 3/4/5 star Properties. . Willing to travel and stay out of base city for upto 30 -45 days at a stretch. Walkin Interview on 3rd October from 10 AM onwards Interview Venue: Oravel Stays Private Limited OYO Corporate Office, 10th Floor, Epicenter Room, Spaze Palazo, Sector 69, Gurugram, Haryana","location":"Gurgaon","experience":"2 - 5 Years"},{"date":"1, 2, 3, 4, 5, 7, 8, 9, 10 - Oct - 2019","skills":"Front Office, Technician Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Rainbow Childrens Medicare Pvt. Limited, C-16&17, Vikrampuri Colony, Secunderabad (Lane Adjacent to Bata showroom)","phone":"040-42462200","profile":"Front Office Executives \nRainbow Childrens Medicare Pvt. Limited","description":"Rainbow is organising Walk in interviews for the openings in Vikrampuri (Secunderabad location)-Preferably Males from Hospital Industry. 1. Front Office Executives 2. Date Entry Operators 3. Lab Technician 4. Pharmacist Walk-in Date/ Time: 1st - 10th October , 9 AM onwards Interview Venue: Rainbow Childrens Medicare Pvt. Limited C-16&17, Vikrampuri Colony, Secunderabad (Lane Adjacent to Bata showroom) Tel No: 42462200","location":"Hyderabad","experience":"1 - 2 Years"},{"date":"30 - Sept - 2019","skills":"Asp .Net, C#, Jquery, JS, LINQ, WCF, WPF, HTML 5, CSS, Ajax, SQL Server, Web Services","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Wipro; Candor Info Space, Building 2, Subhash Chowk, Tikri, Sector 48 Gurgaon - 122 001","phone":"Not Provided","profile":"Backend Process Associate/ BOA \nWIPRO HR Services Private Limited","description":"Candidate should have 2-4 years work experience preferably backend process Skilled in computer applications including Excel Word Excellent communication skills. Should demonstrate good written verbal communication. Education: Graduate with a Bachelors Degree as B.Com, BBA, B.Sc., BA. Master degree holder as MA, M.com, MBA(only correspondence or part time) Except B-Tech/ BE/ LLB/ B.Ed./ BCA/ BSc (IT) or MBA -Regular Preferred Experience: Previous experience from Outsourcing, Backend and Customer Service Flexibility to occasionally extend work hours to meet business needs Flexibility to move across client teams . Good verbal and written communications required. Job Location - Gurgaon Immediate Joiners (Within 15 Days) Date of Interview - 30th Sep & 1st Oct 2019 Timings - 12:00 PM to 3:00 PM Interview Venue: Wipro; Candor Info Space Building 2, Subhash Chowk, Tikri, Sector 48 Gurgaon - 122 001 Contact Person - Kajol Singh","location":"Gurgaon","experience":"2 - 4 Years"},{"date":"1, 2, 3, 4, 5, 7, 8, 9 - Oct - 2019","skills":"Payroll Management, Statutory provisions like PF, ESI, Professional Tax,","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"TopSource Infotech Solutions Pvt. Limited, 3rd Floor, Gamma 1 Giga Space, Viman Nagar Opp. Maruti Showroom, Pune - 411 014","phone":"Not Provided","profile":"Payroll Executives \nTopSource Infotech Solutions Pvt. Limited","description":"We are looking for Payroll Professionals Freshers in TopSource. Any candidate who has 3 months of Payroll experience, who is good in communication and has desire to make a career in India Payroll is eligible to apply. Candidate must have 1 years of overall experience with at least last 3 months of Payroll experience. Preference would be given to candidates who have experience in worked for India payroll process. B.com background would be an added advantage Personal Characteristics- Should have excellent written and spoken English. Motivated, self-starter individual with high level of integrity, intensity and activity with a can-do attitude. Disciplined process oriented work style Able to work effectively under pressure Ability to work equally well either independently or as part of a team Experience: 0.3 - 3 year Job Location : Pune Salary : As per Market standards Please don't call us if Interested then please Walk-In with updated resume from 30th September to 9th October 2019 between (3 PM to 7:30 PM) at our office in Pune. (Full address mentioned below TopSource Infotech Solutions Pvt. Limited 3rd Floor, Gamma 1 Giga Space, Viman Nagar Opp. Maruti Showroom, Pune - 411 014 Contact Person : Pawan Kumar Email id :pawan.burman@topsource.co.in *Kindly carry a copy of your updated resume when you visit us Note: 1) please ignore this email if you have already attended interview in TopSource in last 90 days. 2) Please ignore this email if the job advertisement mentioned above is not relevant to your profile. 3) Saturday and Sunday 4 to 7 pm, 2nd October holiday. 4) Outstation candidates need to confirm their schedule by mailing at pawan.burman@topsource.co.in before coming for interview. We dont re-imburse travelling expenses)","location":"Pune","experience":"1 - 3 Years"},{"date":"30 - Sept - 2019","skills":"Java/ Core Java/ J2ee","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"NTT DATA Global Delivery Services Pvt. Limited, Splendor Trade Tower, Golf Course Extension Road, Sector 65, Gurgaon, Haryana","phone":"Not Provided","profile":"HR Operations Executive \nNTT DATA Global Delivery Services Pvt. Limited","description":"NTT DATA Global Delivery Services Pvt. Limited is hiring for an HR Associate to join its team in Gurgaon. Candidate will be responsible HR Related activities on various system (Success Factors) Responsible for Exit/ Separation actions in Success Factor. Responsible for managing Employee files. Handling Employee Grievances. Qualifications : Minimum Graduate in any discipline from a reputed university Solid skills in MS Office (Excel, Outlook, PowerPoint) Flexible to work in night shifts (shift starts after 5 pm) Walk-in Date/ Time: 30th September 2019, 2 PM onwards Interview Venue: NTT DATA Global Delivery Services Pvt. Limited Splendor Trade Tower, Golf Course Extension Road, Sector 65, Gurgaon, Haryana","location":"Gurgaon","experience":"0 - 1 Years"},{"date":"28, 29 - Sept - 2019","skills":"Core Java, Angularjs CSS Hibernate Spring Boot HTML JQuery Spring SOAP","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Capgemini Technology Services, No. 14, Chennai (Prestige Tower) PRESTIGE CYBER TOWERS, NO.117, RAJIV GANDHI SALAI, KARAPAKKAM, Chennai - 600 097","phone":"Not Provided","profile":"Java/ Full Stack Developer \nCapgemini Technology Services India Limited","description":"Person must be highly experienced with backend programming language Java (mandatory). Java 1.5 and above. [ Good to have Java 1.8 ]. Knowledge of frameworks and libraries such as Spring Boot, Spring frameworks, Hibernate. Proficient experience using advanced JavaScript libraries and frameworks such as ReactJS, AngularJS, HTML, CSS. Knowledge of code versioning tools such as GIT/JIRA or SVN. Knowledge of any DB (preferably MariaDB), SQL, PLSQL, MongoDB. Good understanding of CI/CD stack. Experience in Bootstrap compatibility, ObjectOriented Design, Web Services (REST/SOAP) Web Services (Restful/Any web services). Consumption experience is fine. Experience of working in Agile environment and good understanding of Agile processes Primary Skills: Angular/ Javascript, Java/Core Java, Spring/ Microservices Secondary Skills: AWS/Cloud, Bootstrap, Jquery, Hibernate, Nodejs, Reactjs. Rest API Interview Date : 28th & 29th Sep 2019 (Saturday & Sunday) Drive/ Interview Location : Chennai Job Location : Hyderabad Venue : Capgemini Technology Services No. 14, Chennai (Prestige Tower) PRESTIGE CYBER TOWERS, NO.117, RAJIV GANDHI SALAI, KARAPAKKAM, Chennai - 600 097 SPOC/ Contact Person: Yashwanthini/ Satish Kalappan Please carry a Government Approved Photo ID Original & 2 Passport size photograph, without these you will not be allowed to attend the interview.","location":"Chennai","experience":"3 - 9 Years"},{"date":"28, 30 - Sept - 2019","skills":"OOPS, Java, J2EE, Spring MVC, Spring Boot , Spring Security and Spring Batch SOAP","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"InfoStretch Corporation India Pvt. Limited, Workshala - Salarpuria Premia - 3rd Floor Block 11, Service Road, Kaverappa Layout, Kadubeesanahalli, Bengaluru - 560 103.","phone":"9900443841","profile":"Front End Developer (UI/ Java) \nInfoStretch Corporation (India) Pvt. Limited","description":"Qualification: BE/ B.Tech/ME/ M.Tech/ MCA Work Experience: 5 to 9 Years Job Location: Bangalore Technical Skills: OOPS, Java, J2EE, Spring MVC, Spring Boot , Spring Security and Spring Batch SOAP, REST API, Logging Framework, Hibernate, XML, JEE (Servlets/ JSP/ JMS), Web Services experience Hands on experience in frontend and cross platform development. Very good hands on experience in ReactJS. Proficient in JavaScript, jQuery and Ajax. Good hands on experience in HTML5, CSS3, JSON, XML and bootstrap. Good working exposure with REST API. NodeJS experience would be an added advantage. Cordova/ Ionic/ React Native will be an added advantage. Very strong in object oriented concepts & design patterns. Should have basic knowledge of database management system Good communication skills & good team player Demonstrable abilities to optimize code. Focus on quality & ability to perform code reviews. Ability to guide & develop junior team members on technical front. Strong analytical skills for effective problem solving. If you are interested in this opportunity, Please walk-in to the address below- InfoStretch Corporation India Pvt. Limited Workshala - Salarpuria Premia - 3rd Floor Block 11, Service Road, Kaverappa Layout, Kadubeesanahalli, Bengaluru - 560 103. Walk-in Date: 30th September - 4th October Time:11:00 AM to 5:00 PM Contact Person: Chandni Govindaraju (Executive- Human Resources) Mob: 9900443841","location":"Bangalore","experience":"5 - 9 Years"},{"date":"28, 29 - Sept - 2019","skills":"Java Hibernate JSP Spring Boot react Microservices Spring","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Nagarro Software Private Limited, Vatika Business Centre, Level-5, C - Tower, Tech Park- 1, Airport Road, Yerwada, Airport Road, Pune (Maharashtra)","phone":"Not Provided","profile":"Java Professionals \nNagarro Software Private Limited","description":"Nagarro Software Private Limited is looking for Java/ Java Fullstack Professionals at the below mentioned positions- Must Have Exposure in: Position 1 : Java with Microservices (4.5- 9 Years) Must Have exposure Java 8, Springboot, Microservices architecture (MSA), any RDBMS Preferred AWS, JIRA, MongoDB, Agile, Rest API, SQL, SWT, Spring, Java 7, Test Driven Development, Postgres SQL , Java 8 , KAFKA , Elastic Search Position 2: Java with JSP (5.6 - 9 years) Must Have exposure Java8 , JSP, Struts, Hibernate Preferred AWS, JIRA Position 3 Java with Angular 4 or above (3-9 years) Must Have exposure: Java, Microservices, Angular 4, SQL Server, spring boot Preferred: Docker, SOA, REST Position 4: Java with React (5.6-9 years) Must Have exposure Java, React Js, MS SQL, Spring boot, Preferred Microservices Work Experience- 4 to 9 Years Job location- Gurgaon Interview Location- Pune Interview Date - 28th/ 29th Sep 2019 (Saturday/ Sunday) Time : 9:30 AM -2:00 PM Interview Venue: Nagarro Software Private Limited Vatika Business Centre, Level-5, C - Tower, Tech Park- 1, Airport Road, Yerwada, Airport Road, Pune (Maharashtra) Contact person Kshama Chanda","location":"Pune","experience":"4 - 9 Years"},{"date":"1 - Oct - 2019","skills":"Core Java, Java, J2EE, JDBC, HTML, CSS, JQuery, AJAX, Cross Browser Compatibility","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Morningstar India Private Limited, Sector 30/A, 11th Floor Platinum Techno Park, Near Kalyan Jewellers. Vashi, Navi Mumbai","phone":"Not Provided","profile":"Software Engineer - Java \nMorningstar India Private Limited","description":"Candidate should have Completed Bachelors degree in Engineering with 3 to 4 years of expert experience in designing and development User Interface as well as writing backend components for cross-platform application. Expert in Core Java, Java, J2EE, JDBC Working experience on Spring Boot will be plus Knowledge of vanilla JavaScript. Knowledge of frameworks/libraries like Node.js, OOJS would be plus Knowledge on HTML, CSS, JQuery, AJAX, Cross Browser Compatibility, Responsive Designs, Single Page Application (SPA) Job Responsibilities: Participate in Agile ceremonies, design sessions, and help develop and maintain the software code base of Indexes. Help implement software solutions that meet product requirements and quality needs with respect to functionality, performance, scalability, reliability, schedules and adherence to Indexes goals and principles. Walk-in Date/ Time: 1st October 2019, 10 AM onwards Interview Venue : Morningstar India Private Limited Sector 30/A, 11th Floor Platinum Techno Park, Near Kalyan Jewellers. Vashi, Navi Mumbai Looking for Candidates who can join immediate or less than 30 days for Navi Mumbai location.","location":"Mumbai","experience":"3 - 4 Years"},{"date":"28 - Sept - 2019","skills":".Net Trained/ Freshers","qualification":"B.E./B.Tech","address":"KMG Infotech Limited, 262, Udyog Vihar Phase IV, Sector 18, Gurugram, Haryana","phone":"Not Provided","profile":".Net Developer/ Fresher \nKMG Infotech Limited","description":"KMG Infotech Limited is looking for B.Tech (Computer Science) Fresher for .Net Profile Excellent Communication skills is Mandatory Walk-in Date: 28th September 2019 Timing : 10:00 AM to 12:00 PM Interview Venue: KMG Infotech Limited 262, Udyog Vihar Phase IV, Sector 18, Gurugram, Haryana","location":"Gurgaon","experience":"0 - 1 Years"},{"date":"27, 28, 30 - Sept - 2019","skills":"Data Entry, Back Office Operations, Data Processing","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Vara Infotech Private Limited, 1st Floor, Raghuleela Arcade, Vishwaroop Software Park (Above Audi Showroom), Sector 30A, Vashi, Navi Mumbai - 400 703","phone":"9075917122","profile":"Back Office Executive \nVara Infotech Private Limited","description":"Vara Infotech is hiring Fresher candidates for Backend Process (Data Processing) for Vashi and Andheri Location Candidate should have minimum of 25 to 35 WPM in Typing with 95% accuracy. Candidate should be Graduate without any gap in education. Willing to work in Rotational Shifts Technical candidates need not to apply. Interview location is same for both the location. Walk-in Date/ Time: 27th to 30th September , 11 AM onwards Interview Venue: Vara Infotech Private Limited 1st Floor, Raghuleela Arcade, Vishwaroop Software Park (Above Audi Showroom), Sector 30A, Vashi, Navi Mumbai - 400 703 Contact Person: Priyanka Tel: 022-45420045/ 9075917122 Kindly carry the following documents during interview: All educational documents(Photo Copies of Mark Sheets degree) Aadhar Card and PAN Card Updated resume","location":"Mumbai","experience":"0 - 1 Years"},{"date":"28 - Sept - 2019","skills":"Back Office Operations, Branch Operations, MIS Reporting","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Kotak Mahindra Life Insurance Co. Limited, Building No. 21, Infinity IT Park, 7th Floor Off Western Express Highway | Gen. A. K. Vaidya Marg Goregaon East, Mumbai - 400 097","phone":"Not Provided","profile":"Operations Manager - Back Office \nKotak Mahindra Life Insurance Co. Limited","description":"Here is an opportunity to get associate and enhance your career with a leading brand. Role & Responsibilities: To prepare key MIS and analysis for Branch Ops reporting Hands on excel Need to be a team player. Processing the cases as per TAT Member addition & deletion Eligibility Criteria: Should be a Graduate with minimum 1 year of experience into MIS Should be good with communication skills Should be comfortable with 3:30PM - 11:00PM shifts Only Male candidates can apply Interested candidates can walk-in on below mentioned details Interview Date : 28th September' 2019 Interview Time : 11:00 PM - 3:00 PM Interview Venue : Kotak Mahindra Life Insurance Co. Limited Building No. 21, Infinity IT Park, 7th Floor Off Western Express Highway | Gen. A. K. Vaidya Marg Goregaon East, Mumbai - 400 097 Contact Person : Avani Sutaria","location":"Mumbai","experience":"1 - 5 Years"},{"date":"28 - Sept - 2019","skills":"Front Desk, General Administration, Front Office","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Kotak Mahindra Life Insurance Company Limited, Neelima Nirupama, 4th Floor, Plot No- 55, Old No -22A, Vijay Raghava Road, T Nagar, Near Andhra Club, Chennai - 600 017","phone":"022-66057050","profile":"Administration Executive \nKotak Mahindra Life Insurance Company Limited","description":"Candidates with experience in the below profiles will not be suitable - (Tele calling or customer care profiles (Insurance, Credit card, Holiday Selling etc), Sales background, Account Assistant/Purchase Assistant, Secretaries/Receptionists, Telephone Operators and Admin profiles from educational institutions.) Should be a graduate with min 6 month work-experience. Preferences -(Only Female Candidates can apply) Age should not be more than 28 Knowledge of Admin role is a must Aware of Local language must Walk-in Date: 28th September 2019 Interview Time : 11:00 AM - 3:00 PM Interview Venue: Kotak Mahindra Life Insurance Company Limited Neelima Nirupama, 4th Floor, Plot No- 55, Old No -22A, Vijay Raghava Road, T Nagar, Near Andhra Club, Chennai - 600 017 Interviewer Details: Nandhini K Email ID - kli.jayshree-bhati@kotak.com Contact Number - 022-66057050","location":"Chennai","experience":"0 - 1 Years"},{"date":"28 - Sept - 2019","skills":"Interviewing, front desk, front office, tele calling, hr","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Site Galleria Private Limited, #7, 2nd Main, 3rd Phase, JP Nagar Bangalore - 560078. Landmark: Near Mini Forest Road / Al-bek Restaurant","phone":"Not Provided","profile":"Front Office Executive \nSite Galleria Private Limited","description":"Looking for Female graduate candidates for the post of Front Office / HR Process in which candidate have to receive calls, coordinating for interview process. Should have basic knowledge of microsoft word,excel. Must know Hindi(mandatory) and English speaking. Walk-in Date/ Time: 28th September 2019, 10 AM onwards Interview Venue: Site Galleria Private Limited #7, 2nd Main, 3rd Phase, JP Nagar Bangalore - 560078 Landmark: Near Mini Forest Road / Al-bek Restaurant","location":"Bangalore","experience":"0 - 2 Years"},{"date":"27 - Sept - 2019","skills":"Java, J2EE, SQL, HTML, CSS, JavaScript and AngularJS","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Atria Convergence Technologies Pvt. Limited, ACT Fibernet Head office 8-2-618/B, Mithila Nagar, Banjara Hills Rd Number 11, Hyderabad Telangana - 500 034","phone":"Not Provided","profile":"Java Developer \nAtria Convergence Technologies Pvt. Limited","description":"We are looking for an Server Side Java developer responsible for the development and maintenance of applications. Your primary focus will be development of applications and their integration with other services along with constant eye of improvements through customer/ user feedback. Required Skills: 1+ years of development experience Proficient with Linux, Java, J2EE, SQL Familiarity with HTML, CSS, JavaScript and AngularJS Experience with frameworks such as spring, SpringBoot and Hibernate Experience with Eclipse IDE Familiarity with RESTful and SOAP APIs Knowledge of other web technologies and UI/UX standards Knack for benchmarking and optimization Proficient understanding of code versioning tools {{such as Git, Mercurial or SVN}} Experience with Agile and Waterfall SDLC models Walk-in Date/ Time: 27th September 2019, 10 AM onwards Interview Venue: Atria Convergence Technologies Pvt. Limited ACT Fibernet Head office 8-2-618/B, Mithila Nagar, Banjara Hills Rd Number 11, Hyderabad Telangana - 500 034 Landmark: Care Hospital-Outpatient Center & Karvy Data","location":"Hyderabad","experience":"1 - 3 Years"},{"date":"27 - Sept - 2019","skills":"Front desk, Front Office, Receptionist/ Front Office Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Ebenezer International School, Singena Agrahara Road, Via Huskur Road, A.P.M.C. Yard, Huskur P.O, Electronic City, Bengaluru - 560 099","phone":"Not Provided","profile":"Front Office Executive \nJND Edu Management Services Pvt. Limited","description":"We are looking for a pleasant and friendly Front Desk Representative to join our team! As a Front Desk Representative, your will be responsible for different receptionist and clerical duties at our office. Walk-in Date/ Time: 27th September 2019, 9 AM onwards Interview Venue: Ebenezer International School Singena Agrahara Road, Via Huskur Road, A.P.M.C. Yard, Huskur P.O, Electronic City, Bengaluru - 560 099","location":"Bangalore","experience":"0 - 2 Years"},{"date":"26, 27 - Sept - 2019","skills":"J2EE, Spring, JDBC, GWT, Multithreading, SQL / Database Concepts / LINUX / UNIX / ORACLE","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Estel Technologies Private Limited, #126, Sector 44, Institutional Area, Gurgaon, Haryana","phone":"0124 257 8204","profile":"Java Professionals \nEstel Technologies Private Limited","description":"Person should have 2.5+ to 10 years of Core JAVA in an application development environment Well versed in core Java. Which includes Springs, Hibernate, Webservices and Multi-threading. Knowledge of Java related technologies such as J2EE, Spring, JDBC, GWT, Multithreading - Proficient in: SQL / Database Concepts / LINUX / UNIX / ORACLE Strong Core JAVA development experience Good understanding Architectural Design Patterns Experience in refactoring and working with existing code Solid database experience Job Responsibility- Development, deployment and testing Agile Methodology Review currently running architecture Identify bottlenecks and loopholes for performance, memory management, code reusability, applications modules, etc. Propose industry best practices and upgraded architecture Ticket management experience: Jira Experience with source control systems such as Git, SVN, etc. Walk-in Date: 26th - 27th September , 11 AM onwards Interview timing 11:00 to 4:00 pm Interview Venue: Estel Technologies Private Limited #126, Sector 44, Institutional Area Gurgaon, Haryana, India Contact Person - Nitanjali/ Saif Phone No: 0124 257 8204/ 208","location":"Gurgaon","experience":"2 - 10 Years"},{"date":"28 - Sept - 2019","skills":"Java, Android","qualification":"B.E./B.Tech, B.Sc, BCA/BCS, Diploma","address":"Meditab Software India Private Limited, 219/A, Kalasagar Mall, Sattadhar Cross Road Ghatlodiya, Near Sai Baba Temple, Ahmedabad, Gujarat - 380 061","phone":"9099996846","profile":"Android/ Java Developer \nMeditab Software India Private Limited","description":"Meditab Software India Private Limited is hiring for below requirement for Android/ Flutter Development. Eligibility Criteria : Average 80% in 10th and 12th. Work Experience : 0 to 2 Years Job Location : Ahmedabad Proficiency in programming languages preferably Java, Kotlin. Clarity of OOPS concepts, Data structures and Basic understanding on Database Concepts. Should have prior knowledge on Stateful and Stateless widget. Experience on Android sdk, Android studio, Web Service integration, Debugging. Walk-in Date/ Time: 28th September , 10 AM onwards Interview Venue: Meditab Software India Private Limited, 219/A, Kalasagar Mall, Sattadhar Cross Road Ghatlodiya, Near Sai Baba Temple, Ahmedabad, Gujarat - 380 061","location":"Ahmedabad","experience":"0 - 2 Years"},{"date":"28 - Sept - 2019","skills":"Automation Testing, MacOS, Writing of Automation Scripts","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Rewise Analytics & Technologies Private Limited, Nyati Unitree, SmartWorks, West Wing, Level - 1, 1289/2, Nagar Road, Mother Teresa Nagar, Kashmiri Colony, Yerawada, Pune - 411 006","phone":"Not Provided","profile":"QA Testing/ Automation Engineer \nRewise Analytics & Technologies Pvt. Limited","description":"Skills Required : 1) Automation Testing 2) Hands on experience in MacOS (mandatory) 3) Writing of Automation Scripts Walk-in Date/ Time: 28th September , 9 AM onwards Interview Venue: Rewise Analytics & Technologies Private Limited Nyati Unitree, SmartWorks, West Wing, Level - 1, 1289/2, Nagar Road, Mother Teresa Nagar, Kashmiri Colony, Yerawada, Pune - 411 006 Please share your resume on, nishita.karpe@rewiseglobal.com","location":"Pune","experience":"8 - 12 Years"},{"date":"26, 27 - Sept - 2019","skills":"Quality Assurance/ Customer Care","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Episource India Private Limited, Prince Infocity, 2, 141, Old Mahabalipuram Road, Kandanchavadi, Chennai, Tamil Nadu - 600 096","phone":"Not Provided","profile":"Quality Assurance/ Customer Care \nEpisource India Private Limited","description":"Educational Qualification: Bachelors degree preferred 3 - 6 Years of Experience in Quality Assurance Call centre leadership experience Experience with implementation of call centre corrective action plans Professional telephone manner, with ability to multi-task in a fast pace environment Strong computer skills including Microsoft Office and database Walk-in Date: 26th - 27th September 2019 Timings are 10:30 am -12:30 pm & 3:30 pm - 4:30 pm Interview Venue: Episource India Private Limited, Prince Infocity, 2, 141, Old Mahabalipuram Road, Kandanchavadi, Chennai, Tamil Nadu - 600 096 Share your resumes to padmavathy.murugan@episource.com","location":"Chennai","experience":"3 - 6 Years"},{"date":"28 - Sept - 2019","skills":"Automation Testing, Selenium and Java","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Planit Testing India Pvt. Limited, Knox Plaza, A Wing, Office #104, Near Tangent Showroom, Chincholi Bunder Road, Mind space, Malad West, Mumbai - 400 064","phone":"Not Provided","profile":"Automation Testers \nPlanit Testing India Private Limited","description":"Total Experience: 1 to 4 Years in Automation Testing Relevant experience : Minimum 1 year in Selenium and Java Excellent relationship building and communication skills. Notice Period : Immediate - 30 days Please walk-in directly with your updated resumes on 28th September ' 2019 (Saturday) between 10:00 am to 4:00 pm to our Mumbai office. Venue: Planit Testing India Pvt. Limited Knox Plaza, A Wing, Office #104, Near Tangent Showroom, Chincholi Bunder Road, Mind space, Malad West, Mumbai - 400 064 (Landmark : Near Evershine Mall) Contact Person : Shruti M","location":"Mumbai","experience":"1 - 4 Years"},{"date":"28 - Sept - 2019","skills":"C#, Configuration Management, Agile Methodology, C++, Software Testing, Defect Tracking, Black Box, Test Scripts","qualification":"B.E./B.Tech","address":"Cyient Limited, Plot No. 2, IT Park, Nanakramguda, Manikonda, Hyderabad - 500 032","phone":"040-67489921","profile":"Software Testing Engineer \nCyient Limited","description":"Qualification : BE/ B.Tech (Electronics/ Computers) Years of Experience : 2 to 5 years Job Location : Hyderabad Candidate should have at least 2 years of C/ C++/ C# language experience to develop automation test scripts Must have black box software testing experience on safety critical applications from any domain Should be able to understand Hardware and Software integration Working knowledge in requirement management, configuration management and defect tracking tools On top of above, Knowledge on AGILE methodology would be an advantage. Walk in Date : 28th September (Saturday) Time : 10.00 AM - 1.00 PM Walk-In Venue: Cyient Limited, Plot No. 2, IT Park, Nanakramguda, Manikonda, Hyderabad - 500 032 Land Mark : Near Continental Hospita l Contact Person : Manohar Burri Tel: 040-67489921 Candidate who have attended the interview in last 6 months not eligible for this walk-in","location":"Hyderabad","experience":"2 - 5 Years"},{"date":"28 - Sept - 2019","skills":"Jenkins, XPath, Maven Ant, Automation Framework, Appium, Automation Testing, Selenium, Android","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Elorce Industries Private Limited, #501, 502, Aditya Trade Center, Above Passport Office Building, Ameerpet, Hyderabad - 500 038","phone":"Not Provided","profile":"QA/ Automation Tester \nElorce Industries Private Limited","description":"Candidate should have minimum 1.5 years of hands-on experience in mobile test automation for Android and iOS Native/ Web applications using Appium. Minimum 6 months of experience in Selenium with JAVA is required Mandatory skills: Basic knowledge on Testing methodologies and processes Good at writing test cases Hands-on experience in Appium, Selenium Hands on working with Page object model test automation framework Hands on experience and strong knowledge in Core JAVA Hands on experience/ knowledge in working with Git/ SVN repositories Ability to write complex XPath's Added advantage (good to have): Hands on experience/ knowledge in Jenkins Hands on experience/ knowledge in Maven/ Ant build tools Walk-in Date/ Time: 28th September 2019, 10 AM onwards Interview Venue: Elorce Industries Private Limited #501, 502, Aditya Trade Center, Above Passport Office Building, Ameerpet, Hyderabad - 500 038","location":"Hyderabad","experience":"2 - 5 Years"},{"date":"27, 28 - Sept - 2019","skills":"Automation testing, Selenium Web driver","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Perficient India Private Limited Olympia Platina, 5th Floor, Plot No. 33-B, South Phase, Guindy Industrial Estate, Guindy, Chennai - 600 032. Landmark: Zee Tamil Building I am Interested I am not Interes","phone":"Not Provided","profile":"Automation Testers \nPerficient India Private Limited","description":"Title - Automation Tester Location - Guindy, Chennai Role - Full time Strong experience in Automation testing Should be good in Selenium Web driver Should have good communication skills. Good in Java programming basic Notice Period/ Availability - Immediate / 15 days or less Walk-in Date/ Time: 27th - 28th September , 10 AM onwards Interview Venue: Perficient India Private Limited Olympia Platina, 5th Floor, Plot No. 33-B, South Phase, Guindy Industrial Estate, Guindy, Chennai - 600 032. Landmark: Zee Tamil Building I am Interested I am not Interested","location":"Chennai","experience":"2 - 6 Years"},{"date":"24, 25, 26, 27 - Sept - 2019","skills":"Java, Hibernate, Spring, MySQL and at least one web frameworks like Struts, Grails or Ruby on Rails","qualification":"B.E./B.Tech, MCA/PGDCA","address":"SMARTe DaaS Private Limited, Unit # 1101A, Vishwaroop IT Park, Plot No. 34, 35 & 38, Sector 30-A of IIP, Vashi, Navi Mumbai","phone":"Not Provided","profile":"Software Engineer (Java) \nSMARTe DaaS Private Limited","description":"Candidate should be BE/ B. Tech or MCA with 2 to 8 years of hands-on development experience in Java, Hibernate, Spring, MySQL and at least one web frameworks like Struts, Grails or Ruby on Rails. Ability to write high-quality code for software modules adhering to industry standards Hands-on experience with performance tuning and scaling the application. At least 1 year of team mentoring and leading experience is a good to have Good understanding of NoSQL or Unstructured databases such MongoDB, Hive or Casandra Real-world development experience working on large web portals is must Skills & Attitude: Excellent analytical and problem-solving skills Excellent communication skills both verbal and written Walk-in Date/ Time: 23rd - 27th September, 11 AM onwards Interview Venue: SMARTe DaaS Private Limited Unit # 1101A, Vishwaroop IT Park, Plot No. 34, 35 & 38, Sector 30-A of IIP, Vashi, Navi Mumbai Landmark: Opposite Vashi Station/ Raghuleela Mall","location":"Mumbai","experience":"2 - 8 Years"},{"date":"27, 28 - Sept - 2019","skills":".Net, C#, WCF, AS P.Net, MVC, Rest Services, Sql Server","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Tata Consultancy Services Limited, Deccan Park, Plot No.1, Software Units Layout, Madhapur, Hyderabad, Telangana - 500 081","phone":"Not Provided","profile":".Net Production/ Support Engineer \nTata Consultancy Services Limited","description":"Candidate should have 1 to 8 years of working experience with .Net Should have good communication skills. Minimum 15 years of regular education (10th + 12th + 3 years Graduation) Graduates through Open Universities / Correspondence graduates need not apply Not more than 2 years of gap in Education or Employment. Candidates who have attended the interview process in the last 6 months will not be eligible to apply again. Willingness to work in any shifts including night shifts. Notice period : 0 to 30 days (Official) Required Skills: .Net, C#, WCF, AS P.Net, MVC, Rest Services, Sql Server 2008/12/16, SOA Nice to have: Other languages ASP, VB, VB.Net, C++, Javascript framework experienced any Healthcare experience Interview Details: Date 27th and 28th September 2019 (Thursday & Friday) Time 11.00 AM to 1:00 PM Interview Venue: Tata Consultancy Services Limited Deccan Park, Plot No.1, Software Units Layout, Madhapur, Hyderabad, Telangana - 500 081 Contact Person: Subhashree (Kindly carry 2 copies of your resume and a government id proof at the time of interview) *Reference: It is mandatory to write Subhashree & EPCN Number as reference on top of your resume Mandatory Requirements - (EPCN Registration Number) (How to generate your EPCN)? EPCN number is mandatory for eligibility of the interview. Follow the below steps to register and mention the EPCN number on your resume Step 1: Go to link www.careers.tcs.com Step 2: Select India geography & next click on Experienced Professionals link Step 3: Go to create your profile (For New Users) link & fill the details. (Please select area of interest as BPO) Step 4: You will get the EPCN number & Password to your personal e-mail ID","location":"Hyderabad","experience":"1 - 8 Years"},{"date":"25 - Sept - 2019","skills":"Java/ J2EE, Groovy Grails Framework","qualification":"B.E./B.Tech","address":"Mu Sigma Business Solutions, Kalyani Platina, 4th & 5th Floor, Kundalahalli Village, KR Puram Hobli, Bangalore - 560 066","phone":"080 4054 9100","profile":"Java Developers \nMu Sigma Business Solutions Pvt. Limited","description":"Minimum Qualification- BE/ B.Tech (Preferably in Computer Science or IT domain, though not mandatory) Work Experience: 1 to 6 Years Immediate Joiners preferred. Skills & Competencies- Professional Experience on J2EE/ Groovy Grails Framework Commercial delivery experience within complex, enterprise environments using Groovy/ Java Programming Languages Roles & Responsibilities: Interact with testers and stakeholder teams to develop a strong understanding of the business processes Test Driven Development and passionate about or experience of Agile methodologies such as Extreme Programming (XP) and Scrum Comfortable working with Linux Keeping up to date with the latest technology trends Support production deployment of applications and perform validation testing during the off-hours maintenance windows Manage and prioritize multiple, diverse projects simultaneously Hands-On development along with team building and project management Candidates coming for interview will have to come to 13th Floor, get the pass from reception and sit in the 7th Floor. Please carry your updated Resume and ID proof.","location":"Bangalore","experience":"1 - 6 Years"},{"date":"28 - Sept - 2019","skills":"Core Java, OOPs Concepts & Patterns, Algorithms, Multithreading, Data Structures, MS SQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Micro Focus Software India Private Limited, Laurel Building, Block A, 4th floor CV Raman Nagar, Bagmane Techpark Bengaluru - 560 093","phone":"Not Provided","profile":"Java/ UI Developer \nMicro Focus Software India Private Limited","description":"Candidate should have Bachelor's or Master's degree in Computer Science, Information Systems, or equivalent with minimum 3 to 5 years of relevant experience. Must be familiar with J2EE (Servlet, Struts, HTML) Knowledge and Skills: Extensive experience with multiple software applications design tools and languages. Core Java is a must: OOPs Concepts & Patterns, Algorithms, Multithreading, Data Structures Familiar with - J2EE (Servlet, Struts, HTML) Advantage. Network knowledge and experience in Protocols such as :IP, HTTP, TCP, FTP,UDP. MS SQL and Oracle DB Knowledge (SQL Queries, Stored Procedures, Triggers, Cursors) is advanta Read, understand and debug big existing coded base of a complex product. Excellent analytical and problem solving skills Experience in overall architecture of software applications for products and solutions. Designing and integrating software applications running on multiple platform types into overall architecture. Excellent written and verbal communication skills; mastery in English and local language. Ability to effectively communicate product architectures, customers and support engineers for design Problem solving proposals and negotiate options at senior management levels. If you are interested in above job opportunity, walk-in to below venue on 28th September, 2019 between 9:00 am to 1 pm and also share your updated profile with below details at mashood.hussain@microfocus.com Total Experience: Current Company: Current CTC: Expected CTC: Notice Period: Interview Venue: Micro Focus Software India Private Limited Laurel Building, Block A, 4th floor CV Raman Nagar, Bagmane Techpark Bengaluru - 560 093 Contact Person: Mashood Hussain Note: Request you to carry hardcopy of resume and Govt ID proof","location":"Bangalore","experience":"3 - 5 Years"},{"date":"23, 24, 25, 26, 27, 28, 30 - Sept - 2019","skills":"Talent Acquisition, Business Services, HR Recruitment, Hiring/ Resourcing","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Tech Mahindra Business Services Limited, Commerzone, Building No - 3, Recruitment Desk, 1st floor, Samrat Ashoka, Path, Close to YERWADA JAIL, Off Airport Road, Yerwada, PUNE, Maharashtra - 411 006","phone":"Not Provided","profile":"HR Executive \nTech Mahindra Business Services Limited","description":"Graduates having minimum 6 Months of recruitment experience into a BPO sector. Should have great interpersonal skills and ability to perform under pressure Should be having excellent communication skills. FRESHERS CAN ALSO APPLY!! Additional Benefits:- Performance based incentives Free Home Pick & Drop transport facility will be provided subject to the transport boundaries. 6 working days in a week. Job location : Yerwada, Pune Walk-in Date/ Time: 23rd to 30th September, 12 PM onwards Interview Venue: Tech Mahindra Business Services Limited Commerzone, Building No - 3, Recruitment Desk, 1st floor, Samrat Ashoka, Path, Close to YERWADA JAIL, Off Airport Road, Yerwada, PUNE, Maharashtra - 411 006","location":"Pune","experience":"0 - 1 Years"},{"date":"27, 28 - Sept - 2019","skills":"Core Java/ J2EE (Jsp / Servlets, Struts, Enterprise Java Beans (EJB), Web Services, MVC, Springs)","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Tata Consultancy Services Limited, Deccan Park, Plot No.1, Software Units Layout, Madhapur, Hyderabad, Telangana - 500 081","phone":"7674970271","profile":"Java Production/ Application Support \nTata Consultancy Services Limited","description":"Candidate should have 1 to 8 years of working experience with Java Should have good communication skills. Minimum 15 years of regular education (10th + 12th + 3 years Graduation) Graduates through Open Universities / Correspondence graduates need not apply Not more than 2 years of gap in Education or Employment. Candidates who have attended the interview process in the last 6 months will not be eligible to apply again. Willingness to work in any shifts including night shifts. Notice period : 0 to 30 days (Official) Technical/ Functional skills: Core Java/ J2EE (Jsp / Servlets, Struts, Enterprise Java Beans (EJB), Web Services, MVC, Springs), Java script and JQuery. Interview Details: Date 27th and 28th September 2019 (Thursday & Friday) Time 11.00 AM to 1:00 PM Interview Venue: Tata Consultancy Services Limited Deccan Park, Plot No.1, Software Units Layout, Madhapur, Hyderabad, Telangana - 500 081 Contact Person: Subhashree (Kindly carry 2 copies of your resume and a government id proof at the time of interview) *Reference: It is mandatory to write Subhashree & EPCN Number as reference on top of your resume Mandatory Requirements - (EPCN Registration Number) (How to generate your EPCN)? EPCN number is mandatory for eligibility of the interview. Follow the below steps to register and mention the EPCN number on your resume Step 1: Go to link www.careers.tcs.com Step 2: Select India geography & next click on Experienced Professionals link Step 3: Go to create your profile (For New Users) link & fill the details. (Please select area of interest as BPO) Step 4: You will get the EPCN number & Password to your personal e-mail ID","location":"Hyderabad","experience":"1 - 8 Years"},{"date":"27 - Sept - 2019","skills":"Core Java, Spring, Multithreading, Collections, OOPs Concepts, HTML5, jQuery, CSS3","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"YAMAHA Motor Solutions India Pvt. Limited, (Gate No. 1) 19/6, Mathura Road, FARIDABAD Haryana- 121 006","phone":"0129-4013957","profile":"Full Stack/ Java Developer \nYamaha Motor Solutions India Pvt. Limited","description":"Looking for a Full Stack Java Developer with 2 to 4 years of experience. Strong in Core Java, Spring, Multithreading, Collections, OOPs Concepts. Good hands on experience on HTML5, jQuery, CSS3. Should have good exposure on web applications development. QUALIFICATIONS REQUIRED: B.Tech/ M.Tech/ MCA/ M.Sc. or equivalent (Regular) DESIGNATION: JAVA Developer (SE/SSE) DUTIES AND RESPONSIBILITIES: Responsible for coding, debugging and support of applications. Responsible for adhering to defined processes, timeliness & quality. Responsible for ensuring developed code is as per the design and business requirement. Open to work on Open Source Software/Products for POC/Projects Should be proactive and flexible to learn new programs and script languages. REQUIRED SKILLS: Good Knowledge of Webservices (REST) Good knowledge of relational databases (e.g. PostgreSQL, MySQL) Familiarity with Linux commands. Must have good understanding of JQuery, CSS3, HTML5, Node.js, angular 5 Experience with Tomcat, WildFly. Ability to work independently and within team. Excellent analytical and Problem-solving skills, combined with the ability to provide quick resolutions to the issues/problem. Strong written and verbal skills If interested, then do come directly for face to face interview with below mandates & within specified time only. Date: 27th September 2019 (Friday) Time in between: 10 AM - 12 PM Address: YAMAHA Motor Solutions India Pvt. Limited (Gate No. 1) 19/6, Mathura Road, FARIDABAD Haryana- 121 006 (Landmark: Opposite Escorts Mujesar Metro station) Contact Person Name: Ms. Anu Contact No: 0129-4013957 Mandates - You need to carry your updated resume & pen. Do not carry pendrive, laptop etc. Note: Those who have appeared earlier in Yamaha's interview in last 6 months, are not entitled for this walk-in interview.","location":"Faridabad","experience":"2 - 4 Years"},{"date":"25 - Sept - 2019","skills":"HR, Talent Management, Employee Engagement, Recruitment, Training","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"GOQii Technologies Private Limited, 101, Satyam Tower, Sanghi Industrial Estate, Near Wasan Motors, Govandi-East. Mumbai - 400088","phone":"Not Provided","profile":"Senior HR Executive/ Asst. Manager \nGOQii Technologies Private Limited","description":"Candidate should be Any Graduate/ MBA (HR) with 4 to 9 years of experience in HR, Talent Management, Employee Engagement, Recruitment, Training. Must have excellent communication skills. Job Responsibility- Responsible for maintaining a steady inflow of candidates for various positions through multiple channels of recruitment like Direct channel, Referrals and Consultants. Responsible for ensuring that all positions are closed and offers are executed on time maintaining 100% process compliance at all times. Conducting Reference Checks, preparing Salary Breakup and issuing of Offer Letter & Appointment Letters. Leading an aggressive talent management process designed to attract and recruit new talent for all levels. Walk-in Date/ Time: 25th September 2019, 11 AM onwards Interview Venue: GOQii Technologies Private Limited, 101, Satyam Tower, Sanghi Industrial Estate, Near Wasan Motors, Govandi-East. Mumbai - 400088","location":"Mumbai","experience":"4 - 9 Years"},{"date":"28 - Sept - 2019","skills":"Interviewing, Talent Acquisition, Recruitment","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Cotiviti India Private Limited, Podium Floor, Binarius/ Deepak Complex, Opposite Golf Course, Near Old WNS Office, Shastrinagar, Yerwada, Pune - 411 006","phone":"7350534498","profile":"Talent Acquisition Coordinator \nCotiviti India Private Limited","description":"The role will be instrumental in supporting the coordination of candidate/ Hiring Manager/ Recruiter schedules for complex or multi meet assessments activities, providing administrative support to hiring activities, completing and administering associated new hire paperwork and processes, production of defined reporting / metrics, maintenance of appropriate talent pipeline / preferred supplier / key contact lists, and any other related Recruiting support as required. Recruitment Operations Partner with Recruiters to effectively and efficiently schedule and coordinate relevant parties for assessment activities (interviews etc), ensuring high quality client/candidate experience is maintained throughout. Prepare interview packs as needed. Interview Date- 28 Sep 2019/ Saturday Time: 9 AM to 3 PM Address: Cotiviti India Private Limited Podium Floor, Binarius/ Deepak Complex, Opposite Golf Course, Near Old WNS Office, Shastrinagar, Yerwada, Pune - 411 006","location":"Pune","experience":"1 - 3 Years"},{"date":"25 - Sept - 2019","skills":"HR, Recruitment, Administration, Sourcing","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"HCL Technologies - Bserv, A-22, Sector 60 Noida (Nearest metro station will be Noida sec-59)","phone":"Not Provided","profile":"Senior HR Executive/ Lead \nHCL Technologies Limited","description":"We are pleased to inform you about the opening in Noida with the No.1 employer in India, HCL Technologies for the profile of Non IT Recruiter. Minimum 1+ years of strong experience is required Should be able to understand any given JD and source profiles accordingly. Good understanding of Industry recruitment sourcing practices and connections Solid interpersonal, communication and team skills Job Responsibilities: Posting jobs to appropriate job board/ colleges/ Social media platforms etc. Sourcing & Headhunting candidates through all possible channel(s). Screen the candidates as per the job description by conducting telephonic interviews. Meet established hiring targets Good experience in BPO requirements Open to extend the Working hours if required. Preferably from Consultancy background. Benefits of joining HCL:- Compensation Best in the industry. Both side cab facility. Opportunity for fast track career growth. International standard facility. Recreational activities and cultural programs. Walk-in Date/ Time: 24th - 25th September from 12 PM onwards Interview Venue: HCL Technologies- Bserv A-22, Sector 60 Noida (Nearest metro station will be Noida sec-59) Contact Person- Niharika","location":"Noida","experience":"1 - 6 Years"},{"date":"25, 26, 27 - Sept - 2019","skills":"Front Desk, Front Office, Receptionist Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"MacCare Solutions India Private Limited, iCareCentre 70, 7th Main, A Cross B, Koramangala 4th Block, Koramangala, Bengaluru, Karnataka - 560 034","phone":"Not Provided","profile":"Receptionist/ Front Desk Executive \nMacCare Solutions India Private Limited","description":"Candidate should be Any Graduate with 1 to 6 years of experience in Front Desk, Front Office, Receptionist Activities. Must have excellent communication skills. Greet and welcome guests as soon as they arrive at the office Direct visitors to the appropriate person and office Ensure reception area and office area is tidy and presentable, with all necessary stationery and material. Provide basic and accurate information in-person and via phone/email Undertake the tasks of receiving calls, take messages and routing correspondence Maintain office supplies and keep inventory of stock Arrange travel and accommodations of Engineers Perform other clerical receptionist duties such as filing, photocopying, transcribing and faxing Monitor office supplies and research advantageous deals or suppliers Walk-in Date/ Time: 25th - 27th September , 12 PM onwards Interview Venue: MacCare Solutions India Private Limited iCareCentre 70, 7th Main, A Cross B, Koramangala 4th Block, Koramangala, Bengaluru, Karnataka - 560 034","location":"Bangalore","experience":"1 - 6 Years"},{"date":"25 - Sept - 2019","skills":"Software Testing, Automation Testing, VB, Grails, C++, SQL Server","qualification":"B.E./B.Tech","address":"Mu Sigma Business Solutions, Kalyani Platina, 4th & 5th Floor, Kundalahalli Village, KR Puram Hobli, Bangalore - 560 066.","phone":"Not Provided","profile":"Automation Testing Engineer \nMu Sigma Business Solutions Private Limited","description":"Minimum Qualification- BE/ B.Tech (Preferably in Computer Science or IT domain, though not mandatory) Work Experience: 1 to 6 Years Immediate Joiners preferred. Skills & Competencies: Relevant work experience in development and/or testing role. Excellent verbal and written communication skills Technical background and an understanding of the analytical industry Good development/scripting skills in common languages like VB, Grails, C++ (good to have) Database skills, mainly in PostgreSQL and SQL Server Good experience with different Operating Systems, with emphasis on Unix variants Roles & Responsibilities: Interact with development and stakeholder teams to develop a strong understanding of the application and testing objectives Design and create test conditions and scripts to address business and technical use cases Use existing tools and techniques to execute test cases and build/script new tools for performing testing/validation function Develop and lead the automation strategy/effort and generate scripts to perform automated testing cycles Execute and analysis automation test results Participate in troubleshooting and prioritize issues with different teams to drive towards root cause identification and resolution Document, track and escalate issues as appropriate, using relevant tools/means Support production deployment of applications and perform validation testing during the off-hours maintenance windows Candidates coming for interview will have to come to 13th Floor, get the pass from reception and sit in the 7th Floor. Please carry your updated Resume and ID proof.","location":"Bangalore","experience":"1 - 6 Years"},{"date":"25, 26, 27 - Sept - 2019","skills":"Office Administration, Back Office / Data Entry","qualification":"B.E./B.Tech, M.Tech","address":"SpiceJet Limited, Plot No. 319, Udhyog Vihar, Phase-4 Gurugram, Haryana - 122 016","phone":"Not Provided","profile":"Android & IOS Developer \nSpiceJet Limited","description":"SpiceJet Limited, is conducting walk-in interviews for the position of Android & IOS Developer in the Information Technology on 25th, 26th & 27th September ' 2019 from 10 am Till 12 Noon (Wednesday, Thursday, Friday) Designation: Android Developer & IOS Developer Department: Information Technology Job Location: Gurgaon Educational Qualification: B. Tech/ M. Tech Work Experience: 3 - 6 Years Required Skills for Android :: Excellent knowledge in core Java Hands on experience in the full life cycle of Android application development Strong knowledge in RESTful web services Good Knowledge of Android SDK's Push Notifications & Toast Eclipse & ANT based build system Android Studio Experience in Gradle. Good Communication Skills Required Skills for IOS Developer: Very good experience with Objective-C and iOS SDK Good working knowledge in Cocoa Touch Experience with memory management and caching mechanisms specific to mobile devices Experience working with iOS frameworks such as Core Data, Core Animation, Core Graphics and Core Text Should have Good Communication Skills Kindly report at the below mentioned address and do carry a copy of your updated resume along: Dress Code : Formals Date : 25th, 26th, 27th September' 2019 (Wednesday, Thursday, Friday) Timing : 10 am till 12 Noon Interview Venue: SpiceJet Limited Plot No. 319, Udhyog Vihar, Phase-4 Gurugram, Haryana - 122 016","location":"Gurgaon","experience":"3 - 6 Years"},{"date":"28 - Sept - 2019","skills":"Java, Spring 3.0+, Hibernate/ JPA, AOP, JSP, Servlet, JQuery, JavaScript, JSON, SQL Server, REST Services","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"SHL India Private Limited, 9th Floor, Building No. 10B, DLF Cyber City, Gurgaon - 122 002","phone":"Not Provided","profile":"Java Professionals \nSHL India Private Limited","description":"Candidate must have 6 to 8 years of relevant experience with Thorough understanding of OO concepts & its application in development. Should have previously worked in the position as a Java/ Web Developer developing web site/ applications. Experience with RDBMS database SQL Server 2012 or later, Knowledge of Oracle/My SQL will be add-ons. Must have worked on one application or Web server like Glassfish, Tomcat Hands-on with spring 3.0 + Hands-on with Hibernate / JPA Hands-on with AOP Hands-on with JSP, Servlet, JQuery, JavaScript, JSON Hands-on with SQL Server Hands-on with REST Services Strong understanding and practical knowledge of distributed version control systems like Git. Strong knowledge of DevOps technologies and processes related to cloud solutions. Good hands on experience in using cloud based development platforms such as AWS or Azure. Strong analytical skills. 4+ year of working experience on live product. Good to have Skills: Front-end engineering using Object-Oriented JavaScript, and has knowledge of at least one of the following JavaScript Frameworks (Angular, Backbone, Ember, etc.), along with HTML5 and CSS3 Knowledge of XML parsing, and/or DOM traversal. Create logical data structures, Coding, and Apply best practices/ design patterns of coding Product / application development, and knowledge of SDLC of multiple products/applications Responsible for and produces complete, quality deliverables Adherence and compliance to Project/organization processes and standards A good team player and have strong communication skills. Can be able handle a team of 2-3 players Walk-In Details Day & Date: Saturday September 28th, 2019 Interview Venue: SHL India Private Limited 9th Floor, Building No. 10B, DLF Cyber City, Gurgaon - 122 002","location":"Gurgaon","experience":"6 - 8 Years"},{"date":"24, 25, 26, 27 - Sept - 2019","skills":"Customer Support, Voice Process, Customer Service","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Nucleus Software Exports Limited, A-39, Sector-62, Noida (Opposite Noida Electronic City Metro Station)","phone":"0120-2403970","profile":"Java Developers \nNucleus Software Exports Limited","description":"Nucleus Software Exports Limited, is inviting applicants for our product development team in Java Spring Hibernate Educational Qualification: B.Tech/ BE/ MCA with 60% and above Work Experience: 3 to 6 Years Job Location: Noida, Sector-62 Job Responsibility; Developing Custom layer code based on solution designed following standard coding practice Needs to adhere to committed delivery timelines Sharing status update to supervisors on time Needs to interact with customer for issue analysis & resolution related to Product & Interfaces developed Issue/log analysis and fixing- Innovate and create re-usable component Expectations from role: Hands on experience in Core Java[Threading, Collections, Exception handling JSP, Spring Core, MVC, Hibernate, J Query Basic knowledge of SQL, PLSQL Writing and maintaining unit test cases Technical architecture log analysis, l1/l2 Custom layer development Walk-in Interview from 23rd to 27th September 2019 Timings - 10.00 am to 2 pm Venue Details : Nucleus Software Exports Limited A-39, Sector-62, Noida (Opposite Noida Electronic City Metro Station) Interested candidates may send their applications to karan.setia@nucleussoftware.com with below details to check the fitment at glance Total Experience- Current CTC- Expected CTC- Notice Period-","location":"Noida","experience":"3 - 6 Years"},{"date":"28 - Sept - 2019","skills":"Java, C++, Sockets, Opengl, Android Development, JSON, Android SDK","qualification":"B.E./B.Tech, M.Tech","address":"Onnet Systems (India) Private Limited, Unit 702, 7th Floor, Brigade Rubix, 20, HMT Watch Factroy, Main Road, Peenya 1st Stage, Bangalore - 560 013","phone":"080-29724142","profile":"Android Developer \nOnnet Systems (India) Private Limited","description":"We are looking for an Android Developer with experience in building high-performing, scalable enterprise level applications. Be a part to contribute in all phases of our product development. Qualification/ Skills- Engineering in Computer Science / Electronics or equivalent 2+ years of professional experience in Android development Experience in implementing Multimedia (Video) related applications in Android e.g., Streaming Media Playback, Video Playback, Camera viewer and recorder, Video Editor. Expertise in Android SDK and NDK must Experience with streaming protocols such as RTSP, RTP, HTTP Streaming, RTMP, etc. Exposure to network programming using sockets is a plus. Proficient in Java/ JNI programming on Android Proficient in multithreaded programming and middleware solution development in the Android environment. Strong in fundamentals of Android IPC and OS concepts. Experience with RESTful APIs, JSON. Knowledge on OpenGL is plus Basic C/ C++ Key Responsibilities: Contribute in all phases of the development lifecycle Write well designed, testable, efficient code Ensure designs are in compliance with specifications Support continuous improvement by investigating alternatives and technologies and presenting these for architectural review Maintain the existing solutions by enhancing current features, architecture improvements and performance optimization. Make certain that clients needs are met as the project evolves Monitor and track project progress and handle any issues that arise Act as the point of contact and communicate project status adequately to the Project Manager Create and maintain comprehensive project documentation, plans and reports. Walk-in Date/ Time: 28th September 2019, 10 AM onwards Interview Venue: Onnet Systems (India) Private Limited Unit 702, 7th Floor, Brigade Rubix, 20, HMT Watch Factroy Main Road, Peenya 1st Stage, Bangalore - 560 013","location":"Bangalore","experience":"2 - 5 Years"},{"date":"26 - Sept - 2019","skills":"Database Maintenance, Screening, Sourcing, HR/ Interviewing, Recruitment","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Amway India Enterprises Pvt. Limited, Plot No. 84, Sector 32, Gurgaon. Nearest Landmark : NIIT Building","phone":"Not Provided","profile":"HR Recruiter/ Coordinator \nEnvision Enterprise Solution Pvt Limited","description":"Candidate should have minimum 1 years of Recruitment Experience. Should have good communication skills (verbal and written) Ability to handle multiple requirements independently Role & Responsibility: Sourcing the right candidates through job portals. Resume Screening, Interview Schedule, HR Interview, Salary negotiation. Maintaining Database Walk-in Date: 26th September 2019 Time : 10 AM - 4 PM Interview Venue : Amway India Enterprises Pvt. Limited, Plot No. 84, Sector 32, Gurgaon, Nearest Landmark : NIIT Building","location":"Gurgaon","experience":"1 - 4 Years"},{"date":"23, 24, 25 - Sept - 2019","skills":".Net, SQL, MVC third Party","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Avante Codeworx Private Limited, 501, 5thFloor, Pentagon 3, Magarpatta City, Hadapsar, Pune, Maharashtra - 411 028","phone":"Not Provided","profile":".Net Developer \nAvante Codeworx Private Limited","description":"Candidate should be BE/ B.Tech or MCA with 1 to 3 years of experience in .Net/ Software Development. Must have strong knowledge SQL, MVC third Party control Like Telerik Walk-in Date/ Time: 23rd - 25th September , 11 AM onwards Interview Venue: Avante Codeworx Private Limited 501, 5thFloor, Pentagon 3, Magarpatta City, Hadapsar, Pune, Maharashtra - 411 028","location":"Pune","experience":"1 - 3 Years"},{"date":"24, 25 - Sept - 2019","skills":".Net, C#, ASP .NET MVC, WebAPI / WCF/ Web Services/ REST services","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Baxture Technologies Private Limited, 9th Floor, Office No. 903, Suratwala Mark Plaza, Hinjewadi, Pune - 411 057","phone":"9604377560","profile":"Senior .Net Developer \nBaxture Technologies Private Limited","description":"We are looking for a talented Senior .NET Developer to work as part of our team. Work Experience : 1 - 4 Years Technical Skills:- Deep knowledge of the .NET 4.5 and above Frameworks C#, ASP .NET MVC, WebAPI / WCF/ Web Services/ REST services Front end: HTML5, CSS3, JavaScript, JQuery, AJAX, Angular/React Direct Walk-In on 24th & 25th September 2019 . Time: Between 3:00 PM - 7:00 PM Address: Baxture Technologies Private Limited, 9th Floor, Office No. 903, Suratwala Mark Plaza, Hinjewadi, Pune - 411 057 Contact Person : Miss. Jenu James (HR) Mobile:+91 9604377560 Kindly mention HR reference on top of the resume - *Jenu James* Kindly consider this mail as interview call letter. You can directly come for the interview process. You can also bring your friends and colleagues for the interview process if they have a similar kind of experience. Candidate are requested to brush-up all your technical and logical skills before coming for the interview. Interview Rounds: 1) Logical Coding Test 2) Technical F2F Round (Level 1) 3) Technical F2F Round (Level 2) 4) HR Discussion","location":"Pune","experience":"1 - 4 Years"},{"date":"28 - Sept - 2019","skills":"Full life cycle software development, ASP .NET, VB / C# .NET), MVC 4 and Above","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Jupiter Life Line Hospitals Limited, 1004, 360 Degree business Park, LBS Road, Mulund (West), Mumbai - 400 080","phone":"Not Provided","profile":"Software Developer & Tester \nJupiter Life Line Hospitals Limited","description":"Education: MCA/ B.Tech/ BE or B.Sc in Computer Science Experience: Minimum 2 years in Dot Net with MVC Technical Skills: Visual Studio 2008 and Above (ASP .NET, VB / C# .NET), MVC 4 and Above, HTML, CSS, bootstrap and Java Script. Job Responsibility- 1. Execute full life cycle software development 2. Write well designed, testable, efficient code 3. Produce specifications and determine operational feasibility 4. Integrate software components into a fully functional software system 5. Develop software verification plans and quality assurance procedures 6. Document and maintain software functionality 7. Tailor and deploy software tools, processes and metrics 8. Serve as a subject matter expert 9. Comply with project plans and industry standards Walk-in Date/ Time: 28th September 2019, 10 AM onwards Interview Venue: Jupiter Life Line Hospitals Limited 1004, 360 Degree business Park, LBS Road, Mulund (West), Mumbai - 400 080","location":"Mumbai","experience":"2 - 6 Years"},{"date":"24, 25, 26, 27 - Sept - 2019","skills":"C# .Net, SQL Server","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Fidelity National Financial India Private Limited, Umiya Business Bay Tower 2,6th Floor, Cessna Business Park, Kadubisanahalli, Bangalore - 560 103","phone":"Not Provided","profile":"Data Analyst/ .Net Fresher \nFidelity National Financial India Pvt. Limited","description":"Candidate should be BE/ B.Tech/ M.Tech/ MCA- (Fresher or 6 months Experience) Required Skills: Good Communication skills ,understanding and Meticulous Knowledge on Relational Databases and SQL Server 2005/ 2008/ 2012 Knowledge on C# [Dot Net]. Analytical, problem-solving and Debugging skills The candidate should be able to contribute independently and at the same time work with the team Job Responsibilities: The candidate will perform an analysis on data in SQL Database and creates the Business rules Spec sheet. By using the Business rules need to incorporate into C# [.Net] coding language to generate the required output format. Walk-in Date/ Time: 24th - 27th September , 11 AM onwards Interview Venue: Fidelity National Financial India Private Limited Umiya Business Bay Tower 2,6th Floor, Cessna Business Park, Kadubisanahalli, Bangalore - 560 103 Contact Person: Goutam/ Sharoon I am Interested I am not Interested","location":"Bangalore","experience":"0 - 1 Years"},{"date":"24 - Sept - 2019","skills":".Net, ASP .Net, VB .Net","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Vidushi Infotech Software Solutions Pvt. Limited, Cerebrum IT Park, B-3 Building, 2nd Floor, Office 3-A, Kalyani Nagar, Pune - 411 014","phone":"020-41315176","profile":"Software Developer (.Net Trainee) \nVidushi Infotech Software Solutions Pvt. Limited","description":"Vidushi Infotech (A CMMI Level 3, MNC Company) is NOW HIRING young engineering graduates & masters degree holders with a craving to start their IT careers for the Software Developer (.Net) Trainee position with 0-1 Years of experience in .Net Technologies. Requirement Details: B.E/ B. Tech CS / IT & MCA - 2018/ 2019 Passed out only. (Must) Must have 55% & above Marks in Class X, Class XII and Graduation. Priority will be given to the candidate, who has undergone IT training courses in .Net and completed 2-3 Projects in .Net during academics. Correspondence and Distance education-based qualification will not be considered. Only the suitable candidates who match on the above criteria will be consent to attend our interview process. Terms and conditions of the employment: Interested and qualified candidates can directly Walk-in on- 24th Sep 2019 (Tuesday) in-between 10 am to 11:30 am to Vidushi Infotechs Office Interview Venue: Vidushi Infotech Software Solutions Pvt. Limited Cerebrum IT Park, B-3 Building, 2nd Floor, Office 3-A, Kalyani Nagar, Pune - 411 014 Note: 1. The shortlisted candidates should join on 1st October 2019. 2. Candidates should sign the Service agreement with the company for the period of two (2) Yrs.","location":"Pune","experience":"0 - 1 Years"},{"date":"24, 25, 26, 27, 28 - Sept - 2019","skills":".NET Framework 4.0, ASP .NET, MVC, ADO.NET, AJAX, jQuery, Prototype","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Starmark Software Private Limited, Wings, 3rd Floor, 16/1, Cambridge Road, Halasuru, Bangalore","phone":"080 25555800","profile":".Net Developer \nStarmark Software Private Limited","description":"We are currently seeking an energetic and highly motivated .Net Developer who thrives in a team environment, has a desire to learn new technologies and who wants to be part of a progressive team. Skills Required- Core Programming Languages: C#, SQL, XML, JSON Databases: MS SQL Server 2008 Technologies and Frameworks: .NET Framework 4.0, ASP .NET, MVC, ADO.NET, AJAX, jQuery, Prototype, WCF, IIS 7.5, NUnit, LINQ, Web services, JavaScript, UI Development, AngularJS Development Methodologies: Test Driven Development, Agile development, Scrum Key Accountabilities & Deliverables: Write clean, scalable code using .NET programming languages Producing code using .NET languages (C#, VB .NET) Upgrading, configuring and debugging existing systems Develop documentation throughout the software development life cycle (SDLC) Walk-in Date/ Time: 24th - 28th September , 10 AM onwards Interview Venue: Starmark Software Private Limited, Wings, 3rd Floor, 16/1, Cambridge Road, Halasuru, Bangalore Landmark: Opposite to Frank Anthony Public School, Cambridge Layout, Close to Indiranagar/ MG Road Contact No: 080 25555800/ 801","location":"Bangalore","experience":"2 - 7 Years"},{"date":"24, 25, 26, 27 - Sept - 2019","skills":".NET, Visual Studio, .Net C#, Web applications, Web services, WCF and XML","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Lionbridge Technologies LLP, 'Ascendas' International Tech Park, Taramani (On CSIR Road)","phone":"8807199968","profile":".Net Professionals \nLionbridge Technologies","description":"Lionbridge Technologies is conducting walk-in Interview for .Net Professionals skilled in C# Development. Responsibilities/ Job Functions: Participates in all aspects of the product development life cycle from design to delivery Works closely with the module/team leads to help deliver innovative, world-class software solutions Develops software systems as per specifications Prepares technical documentation Participate in testing process through unit testing and bug fixing Applies diagnostic and debugging skills to troubleshoot complex software applications Well organized, good communication and reporting skills Able to work in a fast-paced environment focused on delivery Self-motivated, team player, action and results oriented Specialized Knowledge & Skills .NET 4.0 and upwards with Visual Studio Expertise in .Net with C-Sharp in Windows and Web applications. Knowledge of Web services, WCF and XML Experience in writing test code in Unit test. Knowledge of working with versioning or ALM tools like TFS or SVN Knowledge of Entity Framework 4.0+ or any other ORM tool. Knowledge of Windows App development Knowledge of Microsoft Enterprise Library Knowledge of AGILE/ SCRUM /Iterative Knowledge of Project SDLC and processes Well versed with practical OOPs concepts and demonstrates workable knowledge of the same. Understands and thinks in objects for system design. Would be required to talk to Client directly, understanding their issues and thereon provide solutions within the stipulated time. Walk-in Details: Date: 24 - 27 September 2019 Time: 10:00 AM to 6:30 PM Venue: Lionbridge Technologies 'Ascendas' International Tech Park, Taramani (On CSIR Road) Contact person: Raja if you have any queries please send an email to raja.muralidharan@lionbridge.com or call me @ 8807199968","location":"Chennai","experience":"2 - 4 Years"}]}