{"Walkins":[{"date":"26, 27, 28 - Dec - 2019","skills":"PHP, Linux, Java, J2EE, SQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"ACT Learning & Development Center Building, 8-2-610/A, Road No. 10, Gaffar Khan Colony, Banjara Hills, Hyderabad, Telangana - 500 034","phone":"Not Provided","profile":"Java Developers \nAtria Convergence Technologies Limited","description":"We are looking for a Server Side PHP and Java developer responsible for the development and maintenance of applications. Your primary focus will be development and maintenance of CMS, Web Application and their integration with other services along with constant eye of improvements through customer/user feedback. Educational Qualification: BE/ MSc (Computers/ IT) Experience: 1+ years of development experience Proficient with PHP, Linux, Java, J2EE, SQL Experience with frameworks such as CodeIgniter, SpringBoot and Hibernate Experience with Eclipse IDE Familiarity with RESTful and SOAP APIs Knowledge of other web technologies and UI/UX standards Knack for benchmarking and optimization Proficient understanding of code versioning tools {{such as Git, Mercurial or SVN}} Experience with Agile and Waterfall SDLC models Walk-in Date/ Time: 24th - 28th December from 9 AM onwards Interview Venue: ACT Learning & Development Center Building 8-2-610/A, Road No. 10, Gaffar Khan Colony, Banjara Hills, Hyderabad, Telangana - 500 034 Landmark: Near Care Hospital out patient center, Opposite to Rainbow Children's Hospital Corporate Office","location":"Hyderabad","experience":"1 - 3 Years"},{"date":"26, 27 - Dec - 2019","skills":"Office/ Personal Assistance, Report Generation, General Administration","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Dynacons Systems & Solutions Limited, 76, Ratnajyot Industrial Estate, Irla Lane, Ambe Mata Chowk, Vile Parle (West), Mumbai - 400 056","phone":"8484033808","profile":"Back Office/ Admin Assistant \nDynacons Systems & Solutions Limited","description":"Education Requirement - Any Graduate, Work Experience: 0 - 2 Years Job Location - Andheri (East) Must have excellent communication skills Handling office tasks, such as filing, generating reports and presentations. Providing real-time scheduling support by booking appointments Walk-in Date/ Time: 24th - 27th December , 10 AM onwards Interview Venue: Dynacons Systems & Solutions Limited 76, Ratnajyot Industrial Estate, Irla Lane, Ambe Mata Chowk, Vile Parle (West), Mumbai - 400 056 Contact Person- Pooja Sharma Email- Pooja.sharma@dynacons.com","location":"Mumbai","experience":"0 - 2 Years"},{"date":"28 - Dec - 2019","skills":"Core Java , J2EE that includes JSP, Servlets, and EJB","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Sys Arc Infomatix Private Limited, No. 1, Defence Officer's Colony, Opposite New Military Hospital, Nandambakkam, Chennai - 600032.","phone":"044-43542969","profile":"Software Engineer (Java) \nSysArc Infomatix Private Limited","description":"Education: BE/ B Tech OR any Masters in Computers. Work Experience: 2 to 4 Years Job Location: Chennai. Mandatory Skill Sets: Proficient in understanding the requirements and converting them into systematic solutions Min 2 years of hands-on experience in Core Java , J2EE that includes JSP, Servlets, and EJB Must have worked in at least one project using Java and J2EE that includes JSP, Servlets, and EJB Knowledge/ experience in Spring boot, Hibernate, Angular 2 or above Must have 2 years of experience in writing database queries - SQL Should have min 1 year of experience in Webservices (SOAP, REST) Walk-in Date: 28th December 2019 Interview Time : 10:00 AM - 2:00 PM Interview Venue: Sys Arc Infomatix Private Limited No. 1, Defence Officer's Colony, Opposite New Military Hospital, Nandambakkam, Chennai - 600032. Contact Person- Angel A Phone No: 044-43542969","location":"Chennai","experience":"2 - 4 Years"},{"date":"26, 27 - Dec - 2019","skills":"Core Java/ J2EE, Web Services (SOAP and REST)","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Prospecta Soft Private Limited, IRIS Tech Park, Unit No. 206, Second Floor, Block A, Sector 48, Gurugram, Haryana","phone":"0124-4497439","profile":"Senior Java Developer \nProspecta Soft Private Limited","description":"Candidate should have BE or MCA degree in Computer Science, Information Technology, or equivalent with 3 to 8 years or more experience in Software Development or other technology related field. Strong hands on experience in Core Java/ J2EE development. Exposing and consuming Web Services (SOAP and REST). Understanding and prior experience developing and designing client facing software systems. Proven analytical and problem-solving skills. Strong negotiation and influence skills. Ability to manage risk appropriately. Ability to thrive in a team-oriented, fast-paced environment. Excellent technical written and verbal communication skills. Walk-in Date/ Time: 26th & 27th December , 10 AM onwards Interview Venue: Prospecta Soft Private Limited IRIS Tech Park, Unit No. 206, Second Floor, Block A, Sector 48, Gurugram, Haryana Contact Person- Neema/ Shalini Phone No. 0124-4497439","location":"Gurgaon","experience":"3 - 8 Years"},{"date":"4 - Jan - 2020","skills":"Java/ J2EE, Spring Core/ Boot/ MVC/ Transaction/ JMS/ etc","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Nisum Consulting Private Limited, 6th floor, A3 Building, E Space IT Park, Viman Nagar Pune - 411 014.","phone":"Not Provided","profile":"Java Full Stack Developer \nNisum Consulting Private Limited","description":"Candidate should have Bachelor's degree in Engineering or equivalent with minimum 7 years of hands on full cycle Web Development in J2EE/ UI/ Front end development experience to design and development of high-volume, high-performance, high-availability applications. Experience with Agile practices Must to have Skills: Strong with Spring Core/ Boot/ MVC/ Transaction/ JMS/ etc across various Spring versions, Experience with Java/ J2EE tech stack - capable to write Rest services and expose them securely, Experience designing and executing responsive web applications, Experience building Java web applications, JSP, Spring, XML, Xpath, JSON and with J2EE application Java 8 features Centric Interested Candidates can Walk-In to our office on Jan 4th ,2020. Address: Nisum Consulting Private Limited 6th floor, A3 Building, E Space IT Park, Viman Nagar Pune - 411 014","location":"Pune","experience":"7 - 10 Years"},{"date":"4 - Jan - 2020","skills":"Core Java, Jsp, Servelets, Java, Spring, Hibernate","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Trantor Software Private Limited, 6th Floor, A Square, Plot No. 278, Udyog Vihar II Rd, Phase II, Sector 20, Gurugram, Haryana","phone":"0172-4033013","profile":"Java Developers \nTrantor Software Private Limited","description":"Walk in Drive for Java Developers on 4th January 2020 at Trantor Software Private Limited Required Skills: Coding experience in Java Skills Set : Jsp, Servelets, Java, Spring, Hibernate Must have worked on Core Java and Advanced Java Walk-in Date/ Time: 4th January 2020, 10 AM onwards Interview Venue: Trantor Software Private Limited 6th Floor, A Square, Plot No. 278, Udyog Vihar II Rd, Phase II, Sector 20, Gurugram, Haryana And, 18S G-9, Rajiv Gandhi Chandigarh Technology Park, Chandigarh, India Contact Person- Shradha Arora Contact No. 0172-4033013","location":"Chandigarh, Gurgaon","experience":"2 - 7 Years"},{"date":"28 - Dec - 2019","skills":"Core JAVA, JPA, Hibernate, Spring and Spring boot, Spring framework","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Daffodil Software Private Limited, 9th Floor, Building B1, DLF Silokhera SEZ, Sector 30, Gurgaon - 122 001.","phone":"Not Provided","profile":"Core Java Developer \nDaffodil Software Private Limited","description":"Daffodil Software Private Limited is looking for Java Developer to expand and strengthen its exceptional team at one of the most prime office spaces at DLF SEZ, Gurgaon. Candidate must have experience in- Core JAVA, JPA, Hibernate, Must have a good command on Spring and Spring boot, Spring framework Must have good knowledge of programming languages Should be able to deliver in a fast paced - Agile environment Hands on experience in API development, Strong analytical skills. Strong logical reasoning and problem solving skills Excellent written and verbal communication skills. Kindly register on below given link: http://bit.ly/Javawalkdrive Walk-in Date/ Time: 28th December 2019, 9 AM onwards Interview Venue: Daffodil Software Private Limited 9th Floor, Building B1, DLF Silokhera SEZ, Sector 30, Gurgaon - 122 001. Nearest Landmark: Star Mall, NH 8, Gurgaon Nearest Metro Station: Huda City Center. Contact Person- Payal Singh","location":"Gurgaon","experience":"4 - 8 Years"},{"date":"27 - Dec - 2019","skills":"HR Administration/ MIS Reporting/ Telecalling","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Axis Securities Limited, 2nd Floor, 3A Shakespear Sarani, Kolkata - 700 071.","phone":"Not Provided","profile":"MIS Executive / HR \nAxis Bank Limited","description":"We are conducting walk-in drive for HR Executive/ MIS Executive/ Telecaller (1 - 6 years experience) profile for Kolkata location on Renowned Partner Payroll Candidates should have good knowledge in Excel, Preparing reports and Dashboards using Excel formulae and Functions. Must have excellent communication & presentation skills. Ability to develop dashboards and reports based on requirements shared Prepare daily, weekly and monthly reports and dashboards Preparation of weekly review data Sales data Management, Analysis, presentation Administrative role in sales office Interested candidates kindly go through the JD mentioned above and walk-in with your updated resume as per the below mentioned schedule. Interview Date - 27th December 2019 Time - 10 AM - 2 PM Address: Axis Securities Limited 2nd Floor, 3A Shakespear Sarani, Kolkata - 700 071. Beside of Shakespear Sarani AC Market","location":"Kolkata","experience":"1 - 6 Years"},{"date":"26, 27 - Nov - 2019","skills":"Core Java, Spring Mvc","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Mindgate Solutions Private Limited, 14th Floor, Damji Shamji Business Gallaeria, LBS Marg, Above D-Mart, Kanjur Marg West, Mumbai - 400 078.","phone":"9699625001","profile":"Java Developer \nMindgate Solutions Private Limited","description":"Urgently require Software developers with hand-on experience in Core Java. Candidate must have minimum 2 years experience Good verbal communication in English would be an advantage Immediate joiners within 7 days of the offer would get a joining bonus of 20k Domain: Payments Banking (UPI Payments) Company Type : Product based Clients : All Banks Pay Role : Permanent Payroll of Mindgate Solutions Pvt Ltd Location : KanjurMarg West, Mumbai (Permanent) Perks and Benefits Immediate joiners joining within 7 days of the offer would get 20k joining bonus Note - Only candidates from Mumbai may apply Walk-in Date/ Time: 26th - 27th December , 10 AM onwards Interview Venue: Mindgate Solutions Private Limited 14th Floor, Damji Shamji Business Gallaeria, LBS Marg, Above D-Mart, Kanjur Marg West, Mumbai - 400 078. Contact Person- Sharan Tel: 9699625001","location":"Mumbai","experience":"2 - 4 Years"},{"date":"3, 4 - Jan - 2020","skills":"Android SDK, Rest, Web Services, Android Studio, RSS, MySQL, Oracle","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Concourse Solutions Private Limited, 502, Suratwala Mark Plazzo, Wakad - Hinjewadi Road, Hinjewadi Pune - 411 057.","phone":"9766916660","profile":"Android Developer \nConcourse Solutions Private Limited","description":"Educational Qualification: Any Graduate Experience: 2-4 years experience in Android development Job Location: Pune Candidate should have good & hands on experience on Android SDK, Rest, Web Services, Android Studio, RSS, GIT, OOPs, Core Java, Retrofit, JSON, Kotlin, Eclise, MySQL, Oracle Scheduled Walk-in is on 3rd & 4th Jan 2020 Timings: 12:00 PM to 5:00 PM Interview Venue: Concourse Solutions Private Limited 502, Suratwala Mark Plazzo, Wakad - Hinjewadi Road, Hinjewadi Pune - 411 057. Contact Person- Pramod Wankhede Tel Number: 9766916660 If you are interested in the above positions, please share your updated profile with the below information to pramod@concoursesols.com Total Experience: Relevant Experience: Current CTC: Expected CTC: Notice Period:","location":"Hyderabad","experience":"2 - 4 Years"},{"date":"30 - Dec - 2019","skills":"Volume Hiring, Interviewing, Recruitment, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Williams Lea India Private Limited, Plot #1, Muthoot Technopolis Kakkanad, Cochin, Kerala, India","phone":"Not Provided","profile":"Talent Acquisition Executive \nWilliams Lea India Private Limited","description":"Designation : Talent Acquisition Specialist Job Location : Cochin Shift : General shift Skills Required: Minimum of 2 years experience in end to end recruitment Experience in volume hiring would be an added advantage Must have good communication skills Walk-in Interview on on 30th December 2019 from 10:00 am to 1:00 pm Venue Details: Williams Lea India Private Limited Plot #1, Muthoot Technopolis Kakkanad, Cochin, Kerala, India","location":"Cochin, Kochi","experience":"2 - 6 Years"},{"date":"26, 27, 28 - Dec - 2019","skills":"HR, Talent Acquisition, IT Recruitment, Technical Recruitment, IT Staffing","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Information Dynamics India Private Limited, 6th Floor, Elnet Software City, TS, OMR Service Road, 140, Old Mahabalipuram Road, Taramani, Chennai - 600 113.","phone":"044-46702255","profile":"IT Recruiter \nInformation Dynamics India Pvt. Limited","description":"Candidate should be Any Graduate/ MBA (HR) with 1 to 4 years of experience in HR, Talent Acquisition, IT Recruitment, Technical Recruitment, IT Staffing Handles end to end recruitment from finding the potential candidates to closing up the positions for particular requisitions. Sourcing profiles through different Strategies like Postings, Networking sites & Job Portals. Hiring through recruitment network and reference Conduct pre-screening interviews through phone and F2F interview. Organizing and coordinating the walk-In & Scheduled interviews with the requirement. Discussed and negotiated the salary propositions with candidates, delivering the employment offer to the candidate. Coordinating and taking care of on-boarding activities Walk-in Date/ Time: 26th - 28th December 2019, 10 AM onwards Interview Venue: Information Dynamics India Private Limited 6th Floor, Elnet Software City, TS, OMR Service Road, 140, Old Mahabalipuram Road, Taramani, Chennai - 600 113. Contact Person- Deepa Phone No. 044-46702255 If you are interested please share your resume to deepalakshmi.r@in.infodynamic.net","location":"Chennai","experience":"1 - 4 Years"},{"date":"26, 27, 30, 31 - Dec - 2019","skills":"Back Office Operations, Non Voice Process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Hinduja Global Solutions Limited, No. 115, Sri Chamundi Towers, C-2 Building, Hosur Main Road, Garvebhavi Palya, Opp: Sai Baba Temple, Bangalore - 560 068.","phone":"Not Provided","profile":"Back Office Executive \nHinduja Global Solutions Limited","description":"Any Graduate-Fresher or Experienced (NO - BE, B.Tech, Post Graduates) Willing to work in rotational shifts 2 Way cab facility provided 5 Days working, 2 Days Off Desired Skills/ Abilities: Good communication skills Good Analytical Skills Basic computer knowledge Walk-in Date: 26th - 31st December 2019 Time Slot: (10 am - 2 pm/ Monday-Friday) Walk in location: Hinduja Global Solutions Limited No. 115, Sri Chamundi Towers, C-2 Building, Hosur Main Road, Garvebhavi Palya, Opp: Sai Baba Temple, Bangalore - 560068. Contact HR person: Pooja-7829533724","location":"Noida","experience":"0 - 1 Years"},{"date":"27 - Dec - 2019","skills":"Linux, Java, J2EE, SQL, HTML, CSS, JavaScript and AngularJS","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Atria Convergence Technologies Pvt. Limited, ACT Fibernet,Golden Heights, 1st Floor, 59th C Cross, 4th M Block, Near Sujatha Theatre, Rajajinagar, Bengaluru - 560 010","phone":"Not Provided","profile":"Java Developers \nAtria Convergence Technologies Pvt. Limited","description":"We are looking for an Server Side Java developer responsible for the development and maintenance of applications. Your primary focus will be development of applications and their integration with other services along with constant eye of improvements through customer/ user feedback. Required Skills: 1+ years of development experience Proficient with Linux, Java, J2EE, SQL Familiarity with HTML, CSS, JavaScript and AngularJS Experience with frameworks such as spring, SpringBoot and Hibernate Experience with Eclipse IDE Familiarity with RESTful and SOAP APIs Knowledge of other web technologies and UI/ UX standards Knack for benchmarking and optimization Proficient understanding of code versioning tools {such as Git, Mercurial or SVN} Experience with Agile and Waterfall SDLC models Walk-in Date/ Time: 27 December 2019, 10 AM onwards Interview Venue: Atria Convergence Technologies Pvt. Limited ACT Fibernet,Golden Heights, 1st Floor, 59th C Cross, 4th M Block, Near Sujatha Theatre, Rajajinagar, Bengaluru - 560 010 Contact - HR Team","location":"Bangalore","experience":"1 - 3 Years"},{"date":"23, 24 - Dec - 2019","skills":"Back End Operations, Non Voice Process, Recruitment","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"SLK Global Solutions Private Limited, 6th Floor, Building No. 2, Commerce Zone IT Park, Yerwada, Pune","phone":"Not Provided","profile":"Backend Process Associate \nSLK Global Solutions Private Limited","description":"SLK Global Solutions Private Limited is hiring for freshers for International Process for Non Voice/ Backend Process. Qualification: Any Undergraduate/ Graduate (No - BE/ BCA/ B.Sc/ MBA) Work Experience: Fresher Job Location:-Pune Role: Permanent Shifts: Night shifts (24*7) Travel: 1 way cab drop is available as per transport boundary (Free for Female candidates) Skill Set: Must have good English communication skills Must be open to work in rotational shifts Should have good typing skills No regional language Walk-in Date: 23rd - 24th December 2019 Time: 12.00 PM to 3:00 PM Interview Venue: SLK Global Solutions Private Limited, 6th Floor, Building No. 2, Commerce Zone IT Park, Yerwada, Pune Note: The applicant must have a valid PAN and Aadhar card","location":"Pune","experience":"0 - 1 Years"},{"date":"23, 24 - Dec - 2019","skills":"Back Office Processing, Business Services, Claim Caculation, Insurance Operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"AXA Business Services Private Limited, 2nd Floor, MFAR Building, Manyata Tech Park, Green Heart, Phase IV, Rachenahalli, Nagavara, Bangalore - 560 045.","phone":"Not Provided","profile":"Back Office (Non-Voice Process) \nAXA Business Services Pvt. Limited","description":"AXA Business Services Pvt. Limited, is hiring for Non-voice Process insurance domain-Bangalore Experience/ Skills required: Fresher or experienced professionals with up to 2 years of experience into Non voice. Excellent in conversational and comprehension skills Non technical Graduates. Flexible to work with night shift. Work Location: MFAR Manyata Tech Park, Bangalore. Interested candidates can walk in with their updated resumes to the below mentioned address- AXA Business Services Private Limited 2nd Floor, MFAR Building, Manyata Tech Park, Green Heart, Phase IV, Rachenahalli, Nagavara, Bangalore - 560 045. Date: 23rd to 24th December 2019 Time: 11 am- 1 pm Contact Person: Najeeb/ Sushmitha/ Akansha","location":"Bangalore","experience":"0 - 2 Years"},{"date":"23, 24 - Dec - 2019","skills":"Back office Operations, Customer Service, Front Office","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"VFS Global Services Private Limited, Srida Anushka Pride, 3rd Floor Road No. 12, Banjarahills, Hyderabad.","phone":"8688671162","profile":"Backoffice Operations Officer \nVFS Global Services Private Limited","description":"Candidate should be Any Graduate/ Fresher with good communication skills Day shift working. No Night Shifts Saturday & Sunday Weekly offs Job Responsibility- Document scrutiny and collection of applications for visa processing. Handle customer/ applicant queries personally or via email, telephone. Handle cash and bank related transactions if assigned and ensure 100% accuracy. Record & maintain all application data. Ensure accurate & timely data entry into the system with zero errors. Ensure all administration and logistics of passport delivery to consulate/ applicant/ logistic company etc. Maintain compliance to the standard operating procedures, manuals etc. without deviation in process. Walk-in Date/ Time: 23rd - 24th December , 11 AM onwards Interview Venue: VFS Global Services Private Limited Srida Anushka Pride, 3rd Floor Road No. 12, Banjarahills, Hyderabad. Contact Person - Bhavana Phone: 8688671162","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"23, 24 - Dec - 2019","skills":"Back Office Operations, Non Voice Process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"HCL Technologies Limited, A-22, Sector 60, Noida (Near Noida sector 59 Metro Station)","phone":"7330395349","profile":"Backend Process Executive \nHCL Technologies Limited","description":"HCL BSERV is hiring for a banking process for entry level positions for Noida location. Qualification: B.Com Graduates (Basic banking knowledge required) Work Experience: *Fresher Shifts:- UK Shifts Salary:- Upto 1.8 LPA 5 Days Working(Fixed Saturday & Sunday off) Required Skill Set:- Basic knowledge of Banking. Must have exposure to MS Office (Word, Excel etc.) Verbal & Written communication/ Language skills. Must have good analytical and interpretation skills Typing speed - 25 wpm with 85% accuracy. Should have familiarity with Windows Operating System and desktop system. Should have keen eye for details. Walk-in Date: 23rd to 24th December 2019 Time - 1:00 pm to 4:00 pm Interview Venue- HCL Technologies Limited A-22, Sector 60, Noida (Near Noida sector 59 Metro Station) Contact Person - Jyoti Gupta Kindly Carry: 1) A copy of your updated resume 2) A govt. address/ Id proof 3) A print out of this email","location":"Noida","experience":"0 - 1 Years"},{"date":"23, 24 - Dec - 2019","skills":"Software Testing, Test Engineering, Automation Testing, Manual Testing, Selenium, Test Scripts","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Baysquare Technology Private Limited, 401, 4th Floor, Sigma Building, Hiranandani, Powai, Mumbai - 400 076.","phone":"022 61533105","profile":"Automation Test Engineer \nBaysquare Technology Private Limited","description":"Candidate should be BE, B.Tech, MCA (IT Graduate) with 3+ years of extensive testing experience with skill to review the design and maintenance of automation test cases. Should have knowledge of all types of testing - integration testing, system testing, functional testing, UI testing, load testing, performance testing. Selenium , JIRA, Bugzilla, Basic SQL Queries, Agile Job Responsibilities: Manual Testing - Writing System Test Cases, Execute System Test Cases. Automation Testing - Writing Test Scripts that would run during Automation testing Prepare Bug Report. Good understanding of automation framework. Understands application requirements, write and maintain test cases according to functional and technical design specifications. Looking for immediate joiners Candidates with more than 45 days of notice period please do not apply. Walk-in Date/ Time: 23 December - 24 December , 11 AM onwards Interview Venue: Baysquare Technology Private Limited 401, 4th Floor, Sigma Building, Hiranandani, Powai, Mumbai - 400 076. Contact Person - Divya Interested candidates kindly share your resume at shetty.divya@baysquare.com or can directly call at 022 61533105","location":"Mumbai","experience":"3 - 5 Years"},{"date":"21, 23, 24, 26, 27, 28 - Dec - 2019","skills":"Software Testing, Automation Tools, Performance Testing, Usability Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Rentokil PCI, Narayni Ambabai Temple Compound, Aarey Road Junction, Goregaon West, Mumbai - 400 104","phone":"022-40865747","profile":"Software Tester \nPCI Pest Control Private Limited","description":"The person will be responsible for to find bugs and issues within a product before it gets deployed to everyday users. He should be capable of designing test suites and should have the ability to understand usability issues. The person should have sound knowledge of software test design and test execution methodologies. Core Competencies, Knowledge, Skills & Abilities: Good understanding of the software development process Strong analytical and problem-solving abilities Attention to detail Able to use own initiative Must be able to continuously learn new skills to keep abreast of industry trends The ability to work under pressure and to tight deadlines Walk-in Date/ Time: 20th December - 28 December , 10 AM onwards Interview Venue: Rentokil PCI Narayni Ambabai Temple Compound, Aarey Road Junction, Goregaon West, Mumbai - 400 104 Contact - Pratik Pandya ( 02240865747 )","location":"Mumbai","experience":"0 - 2 Years"},{"date":"20, 21, 23, 24, 25, 26, 27 - Dec - 2019","skills":"Back End Operations, Non Voice Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"3i Infotech Limited, Akruti Trade Centr 3rd Floor Bhim Nagar Gautam Nagar Andheri MIDC, Mumbai.","phone":"Not Provided","profile":"Back Office Executive \n3i Infotech Limited","description":"Walk in interview for Back Office Executive in Andheri office for Fixed Night shift & Part time Any Graduate with good communication skills can apply Should have Minimum Typing Speed of 25 WPM Will be work in Night Shifts Interested candidate can walk in on below venue for the interview Date: 19th - 27th December 2019 Interview Timings 11 am to 1.PM Interview Venue: 3i Infotech Limited Akruti Trade Centr 3rd Floor Bhim Nagar Gautam Nagar Andheri MIDC, Mumbai. Contact Person- Ankit Mota/ Manoj Mandavagane","location":"Mumbai","experience":"1 - 4 Years"},{"date":"21 - Dec - 2019","skills":"Core Java, J2EE framework like Spring Boot, Spring MVC, MySQL/ PostgreSQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Oodles Technologies Private Limited, Unit No. 951, 9th Floor, Tower B1 Spaze I-tech Park, Sector 49, Gurugram, Haryana","phone":"Not Provided","profile":"Core Java Developer \nOodles Technologies Private Limited","description":"Candidate should have strong experience in Core Java. Hands-on development in a J2EE framework like Spring Boot, Spring MVC. Good knowledge of Relational Databases like MySQL, PostgreSQL, MS SQL Server with complex SQL Queries, Stored Procedure, Triggers. Candidate must have knowledge of ORM like Hibernate Must have good working knowledge of Data Structure Unit testing experience using Junit, Spock Knowledge of versioning tools like GIT, SVN Knowledge of build tools like Maven, Gradle, Ant Walk-in Date/ Time: 21st December 2019, 10 AM onwards Interview Venue: Oodles Technologies Private Limited Unit No. 951, 9th Floor, Tower B1 Spaze I-tech Park, Sector 49, Gurugram, Haryana Landmark: Near to Omaxe City Centre Nearest Metro : Huda City Centre Contact Person - Vineeta","location":"Gurgaon","experience":"1 - 4 Years"},{"date":"21 - Dec - 2019","skills":".Net, ASP .Net, Software Engineering","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Concerto Software & Systems Private Limited, Building No. 305, 2nd Floor, A- Wing, Sector 2, Millennium Business Park, Mahape, Navi Mumbai - 400 710.","phone":"Not Provided","profile":"Trainee - .Net Developer \nConcerto Software Systems Pvt. Limited","description":"Candidate will be involved in Development, Implementation, Support Execution of the tasks related to support and development Must be clear with Basic Technology, concepts & Logic Skill Required: Should have analytical and programming logic skills Candidate must have good communications and interpersonal skills Should have positive & proactive attitude Walk-in Date: 21st December 2019 Time:- 9 AM to 11 AM. Interview Venue- Concerto Software & Systems Private Limited Building No. 305, 2nd Floor, A- Wing, Sector 2, Millennium Business Park, Mahape, Navi Mumbai - 400 710. Contact Person- Pranali Ghanekar Note: Candidate has to sign the service level agreement for specified tenure with the company (Mandatory) Please carry your Pan card or Adhar Card. Candidate appeared within last six months will not be eligible to reappear.","location":"Mumbai","experience":"0 - 1 Years"},{"date":"20, 21, 23, 24 - Dec - 2019","skills":".Net & Node JS","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"MAINTEC Technologies Private Limited, 3M-215 Building, East of NGEF, Outer Ring Road, Kasturi Nagar, Bangalore - 560 043.","phone":"080-42718000","profile":".Net/ Node JS Developer (Freshers) \nMaintec Technologies Private Limited","description":"We have huge opening for Dot Net & Node JS Developer Skills for our client in Bangalore location. Eligibility Criteria: Degree: BE, B.Tech, ME, M.Tech (EEE, ECE, CSE, IT), BCA, MCA, BSC (CSE) Year of Pass out: 2018 & 2019 Only Percentage: 60% throughout, in academics, Admirable English communication skills Immediate joiners preferred. Interview Type: Face 2 Face Please walk-in to our office for a F2F interview on Monday to Friday between 10:30 AM to 5:00 PM along with your resume. Walk-in Date/ Time: 20th - 24th December 2019, 10 AM onwards Interview Venue: MAINTEC Technologies Private Limited 3M-215 Building, East of NGEF, Outer Ring Road, Kasturi Nagar, Bangalore - 560 043. Contact Person- Anusha K Land Line: 080-42718000","location":"Bangalore","experience":"0 - 1 Years"},{"date":"23, 24, 25, 26, 27 - Dec - 2019","skills":".Net, (SQL, Angular, AngularJS, Node.JS, Java Script, Jquery)","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Infosense Global Private Limited, A-103, Info Tower-3, Infocity, Gandhinagar - 382 009, Gujarat.","phone":"9687644166","profile":".Net Trainee Developer \nInfosense Global Private Limited","description":"Walk In Drive for SQL Developer trainee and Front End (.NET ) Developer trainee. Candidate must have excellent knolwdge of .Net, (SQL, Angular, AngularJS, Node.JS, Java Script, Jquery) Freshers and Interns can Walk-in directly from 23rd - 27th December (Monday to Friday) between 4:00 pm to 6:00 pm Interview Venue: Infosense Global Private Limited A-103, Info Tower-3, Infocity, Gandhinagar - 382 009, Gujarat. Contact Person- Bhumika Vaghela Phone: 9687644166","location":"Gandhinagar","experience":"0 - 1 Years"},{"date":"21 - Dec - 2019","skills":"JavaScript/ CSS3/ HTML5/ Angular Java, SQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"GlobalLogic India Limited, ASF Insignia SEZ Private Limited Tower D, Grand Canyon Building, 15th Floor, Faridabad Road, Gwal Pahari, Gurgaon - 122003","phone":"98111 70057","profile":"Java Developers \nGlobalLogic India Limited","description":"Work Experience : 4-8 Years Job Location : Gurgaon Interview Mode : Face2Face Notice Period Max 30 DAYS Mandatory Skills- JavaScript/ CSS3/ HTML5/ Angular Java, SQL (2 years) Experience with CI/CD tools such as Maven, Jenkins, Docker, Kubernetes, ELK Stack Experience with RESTful API design and development Desired Skills- SAFE Agile trained T-SQL, PL/SQL SOLR MS Azure Cloud Experience Knowledge of UML Python experience Walk-in Date/ Time: 21st December 2019, 9 AM onwards Interview Venue: GlobalLogic India Limited ASF Insignia SEZ Private Limited Tower D, Grand Canyon Building, 15th Floor, Faridabad Road, Gwal Pahari, Gurgaon - 122003 Contact Person- Rajat Arora","location":"Gurgaon","experience":"4 - 8 Years"},{"date":"21 - Dec - 2019","skills":"Java, J2EE, Spring, Hibernate","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Cognizant Technology Solutions, Manyata Embassy Business Park, F3 Building, Ground Floor, Outer Ring Road, Near Nagawara, Rachenahalli village, Bangalore - 560 045.","phone":"Not Provided","profile":"Java Developers \nCognizant Technology Solutions India Limited","description":"Candidate must have hands-on experience Java/ J2EE Application development / support Projects. should have good technical problem solving skills. Exposure to the below skill combination is mandatory to have: Combo 1: Java, Spring, Hibernate (Recent hands on experience with Spring/ Hibernate is mandatory). Candidate with hands on experience on above skills will be eligible to apply for this position For all the above roles the candidate should possess a BE/ B. Tech/ B. Sc/ BCA/ MCA/ M. Tech/ M. Sc with consistent above 50% is Mandatory Job Responsibilities- Responsible for delivery of assigned module/ components /phases of a project Responsible for Status reporting Responsible for estimation, planning and execution with specific focus on requirement analysis and design Responsible for Knowledge transfer and arriving at SLAs for steady state Notice Period: 90 Days (Candidates between Immediate to 30 days are most preferred) Walk-in Date/ Time: 21st December 2019, 9 AM onwards Interview Venue: Cognizant Technology Solutions, Manyata Embassy Business Park, F3 Building, Ground Floor, Outer Ring Road, Near Nagawara, Rachenahalli village, Bangalore - 560 045. Contact Person - Arul","location":"Bangalore","experience":"3 - 8 Years"},{"date":"21 - Dec - 2019","skills":"Java, Hive, NoSQL, Cloudera, Couchdb, Hadoop, Big Data, MongoDB","qualification":"B.E./B.Tech","address":"Merilytics Intelytics Private Limited, 7 Floor, Gutenberg, Road Number 2, Sai Pruthvi Enclave, Kondapur, Hyderabad, Telangana - 500 084.","phone":"8106192426","profile":"Big Data/ Java Developer \nMerilytics Intelytics Private Limited","description":"Candidate should have 1 to 3 years of working experience in any one of the Big Data technologies and Hadoop distributions -Apache Project, Cloudera, MapR or HortonWorks. Development experience in Java, MapReduce2, Pig, Hive is a must . Should have development experience in any of the NoSQL databases - Hbase, Casssandra, CouchDB, MongoDB. Development experience in design, implementation and deployment of any ETL tool to load data into Hadoop/ NoSQL environment. Should have exposure to UNIX / Linux programming language. Should have good communication & interpersonal skills Note: The candidates who meet the eligibility criteria i.e. 60% through out the academics with B. Tech graduation can directly walk-in to our office for the interview process on December 21, 2019 along with your updated resume and ID proof. Walk-In Timings: 2 PM to 3 PM Interview Venue: Merilytics Intelytics Private Limited 7 Floor, Gutenberg, Road Number 2, Sai Pruthvi Enclave, Kondapur, Hyderabad, Telangana - 500 084. Contact Person- Sushmitha Pamreddy Phone: 8106192426 Interested candidates can send their updated resume to careers@merilytics.com","location":"Hyderabad","experience":"1 - 3 Years"},{"date":"20, 23, 24, 25, 26, 27 - Dec - 2019","skills":"Back Office Processing, Non Voice","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Mphasis Limited, Eon Cluster C: Wing 2, Ground Floor, Kharadi Infrastructure Pvt. Limited: SEZ, Plot No. 1, Survey 77, MIDC, Kharadi, Pune - 411 014.","phone":"Not Provided","profile":"Back Office Associate \nMphasis Limited","description":"Mphasis Limited is hiring Freshers for Back Office Process Associate at Pune location Candidate should be a B.Com/ M.Com/ MBA Finance/ PGDBM Require people with banking and finance knowledge Should be ok with 24*7 shift / US Shift Rotational week off Interested candidate can walk in for the interview from 20th to 27th December 2019 on the below mentioned address- Mphasis Limited Eon Cluster C: Wing 2, Ground Floor, Kharadi Infrastructure Pvt. Limited: SEZ, Plot No. 1, Survey 77, MIDC, Kharadi, Pune - 411 014. Contact Person : Matin Shaikh Timings : 11.00am to 4.00pm","location":"Pune","experience":"0 - 1 Years"},{"date":"21 - Dec - 2019","skills":"ASP .Net , C# MVC WCF WPF HTML, CSS, Java Script, Ajax, SQL Server/ MySQL/ Oracle","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Vyom Labs Private Limited, 1st Floor, Murkute Complex, Opposite to Veritas Near Hotel Mahabaleshwar, Baner Road, Pune - 411 045","phone":"Not Provided","profile":".NET Developers \nVyom Labs Private Limited","description":"Eligibility Criteria : Graduates 2017 or before pass outs/ Post Graduates: 2019 or before pass outs Work Experience Required : 0-2 Years Job Location : Pune Any work or project related experience on ASP .Net , C# MVC WCF WPF HTML, CSS, Java Script, Ajax Database: SQL Server/ MySQL/ Oracle Ability to work independently without any supervision Open to learn new technology and grasp it quickly Good communication skill, verbal as well as written. Procedure for Interview : 1. MCQ test on .NET and English (30-45 minutes) 2. Introduction to Profile, Projects and Technology 3. Technical and HR discussion 4. Assignment : to be submitted within 2 days Walk-in/ Full day Workshop date : 21st December 2019 Walk-in time : 9:30 to 10:30 AM Address : Vyom Labs Private Limited 1st Floor, Murkute Complex, Opposite to Veritas Near Hotel Mahabaleshwar, Baner Road, Pune - 411 045 Selected candidates should be willing to work in shifts and ready to travel anywhere according to projects","location":"Pune","experience":"0 - 2 Years"},{"date":"20, 23, 24, 25, 26, 27, 30, 31 - Dec - 2019","skills":"Data Validation, Back Office Processing, Non Voice Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Atidiv India Private Limited, Unit 9 & 10, First Floor, Wing B, Business at Mantri, Nagar Road, Pune - 410 014.","phone":"2067486141","profile":"Back Office Process (Male) \nAtidiv India Private Limited","description":"Qualification: Graduates in Any Stream Work Experience: 0-3 Years Freshers can also apply. Must have Basic Communication skills (Spoken and Written English) Should be good in Basic research, Data Validation, Internet savvy and Content Analysis. Work experience into Back-office will be an advantage. Willing to work for US/ UK shifts. Salary : No bar for right candidate. Attractive monthly incentive structure and Annual Bonus. Walk-in Date: 19th December - 3rd January Time: 11 am onwards (Mon - Friday) Interview Venue: Atidiv India Private Limited Unit 9 & 10, First Floor, Wing B, Business at Mantri, Nagar Road, Pune - 410 014, Maharashtra. Contact Details: 2067486141","location":"Pune","experience":"0 - 3 Years"},{"date":"21 - Dec - 2019","skills":"Web Services - REST/ SOAP, Struts, Spring, SQL, Script, Oracle/ SQL Server","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"FIS Global Business Solutions India Pvt. Limited, 2nd floor, Wrap Tower, SJR iPark, Whitefield, Bangalore","phone":"Not Provided","profile":"Java Professionals \nFIS Global Business Solutions India Pvt. Limited","description":"Candidate should have sound exposure in Web Services - REST/ SOAP, Server-side programming. Good hands of working experience in API development and Spring Integration. Hand on experience with Struts, Spring, SQL, Script, Oracle/SQL Server database experience is needed. Banking domain exposure is preferable Knowledge of end-to-end SDLC, i.e., waterfall, iterative and other modern approaches to software development. If you have experience in above mentioned technical skills, interested candidates can attend F2F interview as per below details: Interview Date: 21st December' 2019 (Saturday) Interview Time: 9:30 AM - 2 PM Interview Venue: FIS Global Business Solutions India Pvt. Limited 2nd floor, Wrap Tower, SJR iPark, Whitefield, Bangalore. Landmark: Opposite to Sai Baba Hospital/ Inorbit Mall Contact Person - Saroj","location":"Bangalore","experience":"2 - 7 Years"},{"date":"20, 21 - Dec - 2019","skills":"HR/ Administration","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Pioneer Design & Engineering Pvt. Limited, VBR enclave, Beside TipsyTopsy Bakery, Westernhills, kukatpally Hyderabad - 500 072.","phone":"9032511007","profile":"Trainee HR Executive \nPioneer Design & Engineering Pvt. Limited","description":"Looking for FEMALE Trainee HR Executive for our Hyderabad Location. Education: Any Degree Good Communication with Interpersonal Skill Selected candidates will be undergoing training for a period of 3/6 months. Please walkin immdeliately : Walk-in Date/ Time: 19th - 21st December , 10 AM onwards Interview Venue: Pioneer Design & Engineering Pvt. Limited VBR enclave, Beside TipsyTopsy Bakery, Westernhills, Kukatpally Hyderabad- 500 072. Contact Person- Pavani (9032511007)","location":"Hyderabad","experience":"0 - 2 Years"},{"date":"28, 29 - Dec - 2019","skills":"Technical Support, IT Helpdesk/ Service Desk, Product Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"KIO IT Solutions Private Limited, RAM SVR, 3RD FLOOR, SECTOR 1, MADHAPUR, HUDA TECHNO ENCLAVE, HI-TECH CITY, HYDERABAD - 500 081","phone":"040-48555009","profile":"Technical Support Engineer \nKIO IT Solutions Private Limited","description":"Candidate should be Any Graduate with basic knowledge of Unix commands Should have good knowledge of C and Java programming language. Must have excellent English language skills. Hard working and team player Willing to help clients with a smile. Job Responsibility- Configuring product according to client specifications. Conducting product training session for clients. Handling client queries through calls and emails. Walk-in Date/ Time: 28 - 29 December 2019, 10 AM onwards Interview Venue: KIO IT Solutions Private Limited RAM SVR, 3RD FLOOR, SECTOR 1, MADHAPUR, HUDA TECHNO ENCLAVE, HI-TECH CITY, HYDERABAD - 500 081 (LANDMARK: RENT A DESK - HITECH CITY)","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"21, 22, 23 - Dec - 2019","skills":"Technical Support, Desktop Suppot. IT Help Desk","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Prayosha Food Services Private Limited, Unit 81, Titanium, Corporate Road Prahladnagar, Ahmedabad - 380 015.","phone":"8155009175","profile":"Technical Support Engineer \nPrayosha Food Services Private Limited","description":"Candidate should have proven work experience as a Technical Support Engineer, Desktop Support Engineer, IT Help Desk Technician or similar role. Hands-on experience with Windows/ Linux/ Mac OS environments. Good understanding of computer systems, mobile devices and other tech products. Ability to diagnose and troubleshoot basic technical issues Familiarity with remote desktop applications. Excellent problem-solving and communication skills Ability to provide step-by-step technical help, both written and verbal Additional certification in Microsoft, Linux, Cisco or similar technologies is a plus. Job Responsibilities: Research and identify solutions to software and hardware issues. Diagnose and troubleshoot technical issues, including account setup and network configuration. Ask customers targeted questions to quickly understand the root of the problem Talk clients through a series of actions, either via phone, email or chat, until they've solved a technical issue. Ensure all issues are properly logged. Walk-in Date/ Time: 21st - 23rd December 2019, 11 AM onwards Interview Venue: Prayosha Food Services Private Limited Unit 81, Titanium, Corporate Road Prahladnagar, Ahmedabad - 380 015. Contact Person - Aarfa Neha Phone No. 8155009175","location":"Ahmedabad","experience":"1 - 6 Years"},{"date":"23, 24, 25, 26, 27 - Dec - 2019","skills":"Technical Support, IT Helpdesk, Customer Support","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Microland Limited, RMZ Ecospace, 1B, 2nd floor Outer Ring Road, Bellandur, Bengaluru, Karnataka - 560 103.","phone":"Not Provided","profile":"Technical Support Representative \nMicroland Limited","description":"Candidate should be Any Graduate with excellent communication skills. Knowledge of relevant software computer applications and equipment; Knowledge of customer service principles and practices; Effective listening skills; Willingness to co-operate with others and work to the greater good; Multi-tasking capabilities; Competencies: Exemplary Attendance and Punctuality Maintains effectiveness when experiencing major changes in personal work tasks or work environment; Adjusts effectively to work within new work structures, processes, requirements, or cultures. Focuses and guides self and team members in accomplishing work objectives. Interacts with others in a way that gives them confidence in one's intentions and those of the organization. Walk-in Date/ Time: 23 December - 27 December , 12 PM onwards Interview Venue: Microland Limited, RMZ Ecospace, 1B, 2nd floor Outer Ring Road, Bellandur, Bengaluru, Karnataka - 560 103. Contact Person - Sridhar RS Interested Candidates mail your Cv to rasmineep@microland.com","location":"Bangalore","experience":"1 - 4 Years"},{"date":"21 - Dec - 2019","skills":"Service desk, Technical Support, Global voice Process, Customer Service","qualification":"B.Sc, BCA/BCS, B.E./B.Tech, Diploma","address":"HCL Technologies Limited, Sector 126, Tower 1, Entry Gate 1, Noida","phone":"Not Provided","profile":"Technical Support/ Service Desk (L1) \nHCL Technologies Limited","description":"Candidate should have 1 to 3 years of experience in Service desk, Technical Support, Global voice customer service. Must have good problem solving skills involving hardware, involving hardware, software, and networks. Must have excellent communication skills Education Requirement: Bachelors/ Masters/ Equivalent Total: 3-4 years of University education post High school (B.Sc. or Diploma) Job Responsibilities:- Provide hardware/ software/ network problem diagnosis/ resolution via telephone/ email/ chat for customers end users Route problems to internal 2nd and 3rd level IT support staff. Coordinate and manage relationships with vendors and support staff that provide hardware/ software/ network problem resolution. Administer and provide User account provisioning. Walk-in Date/ Time 21st December 2019, 10 AM onwards Interview Venue: HCL Technologies Limited Sector 126, Tower 1, Entry Gate 1, Noida","location":"Noida","experience":"1 - 3 Years"},{"date":"21 - Dec - 2019","skills":"Service desk (Voice Process), Technical support, Active directory, Voice Customer Service","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"HCL Technologies Limited, Plot No. 3, Surya Sapphire Hosur Road Near D-Mart, 1st Phase, Electronic City, Bangalore - 560 100","phone":"Not Provided","profile":"Technical Support/ Service Desk (L1) \nHCL Technologies Limited","description":"Candidate should be Any Graduate with 6 months to 3 years of experience in Service desk (Voice Process), Technical support, Active directory, Voice customer service. Must have good problem solving involving troubleshooting hardware, involving hardware, software, and networks issues. Technical Requirements: Phone support experience necessary(Voice Process) Technical Service desk or technical call center experience is necessary. Disciplined, systematic problem solving skills required. Hands-on work experience with the following: Windows Operating systems Walk -in Date: 21st December 2019 Time : 10:00 AM to 1.00 PM Interview Venue: HCL Technologies Limited Plot No. 3, Surya Sapphire Hosur Road Near D-Mart, 1st Phase, Electronic City, Bangalore - 560 100 Spoc : Shobhana","location":"Bangalore","experience":"1 - 3 Years"},{"date":"21, 23, 24 - Dec - 2019","skills":"PHP, MySQL Database, MongoDB","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Aimil Limited, Naimex House, A-8, Mohan Cooperative Industrial Estate, Mathura Road, New Delhi - 110 044","phone":"011-61310202","profile":"MySQL (Php) Developer \nAimil Limited","description":"Candidate must have strong proficiency in MySQL database management Exposure in latest versions of MySQL Experience with replication configuration in MySQL Knowledge of de-facto standards and best practices in MySQL. Knowledge of MySQL features, such as its event schedule. Familiarity with other databases such as MongoDB, Proficient understanding of code versioning tools. Responsibility Import and Export data in database and query the db related things Walk-in Date/ Time: 19th December - 24 December , 9 AM onwards Interview Venue: Aimil Limited Naimex House, A-8, Mohan Cooperative Industrial Estate, Mathura Road, New Delhi - 110 044 Contact - HR (011-61310202)","location":"Delhi","experience":"1 - 3 Years"},{"date":"21, 23, 24 - Dec - 2019","skills":"Core PHP, MVC, CMS, MySQL, Java Script, JQuery, HTML, CSS","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Cue Blocks Technologies Pvt. Limited, SCO 822, Second Floor, NAC, Manimajra, Chandigarh","phone":"09876008994","profile":"Core PHP Developer \nCue Blocks Technologies Pvt. Limited","description":"We are in search of highly motivated and passionate individuals with strong PHP coding experience who has good knowledge of Core PHP, MVC, CMS, MySQL, Java Script, JQuery, HTML, CSS. Must have very good knowledge of database technologies and SQL optimization. Walk-in Date/ Time: 21st - 24th December , 11 AM onwards Interview Venue: Cue Blocks Technologies Pvt. Limited SCO 822, Second Floor, NAC, Manimajra, Chandigarh Landmark: Above Liberty Showroom Contact - Pooja Rathore Tel: 09876008994","location":"Chandigarh","experience":"1 - 3 Years"},{"date":"21, 23 - Dec - 2019","skills":"PHP, Web frameworks, Codeigniter, CMS technologies like Word press, Drupal","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Sandip University (For Carrot Technologies), 1st floor, Manisha Pride, Jawaharlal Nehru Road, Mulund (West), Mumbai - 400 080.","phone":"022-66048501","profile":"PHP Codeigniter Developer \nCarrot Technologies Private Limited","description":"Candidate should have minimum 2 years of working experience with PHP web frameworks Strong knowledge of Codeigniter Web Framework Must be proficient in core PHP framework Open source CMS technologies like Word press, Drupal would be added advantage Walk-in Date/Time: 19th - 23 December 2019, 11 AM onwards Interview Venue: Sandip University (For Carrot Technologies) 1st floor, Manisha Pride, Jawaharlal Nehru Road, Mulund (West), Mumbai - 400 080. Contact Person- Archana Pagare","location":"Mumbai","experience":"2 - 8 Years"},{"date":"21 - Dec - 2019","skills":"PHP, Microservices Architecture, PostgreSQL, MySQL or MS SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"DBXento Systems Private Limited, Fourth Floor, Tower 9, SEZ, Magarpatta City, Pune - 411 013.","phone":"Not Provided","profile":"PHP Developers \nDBXento Systems Private Limited","description":"Qualifications: Bachelors degree in Computer Science or a related field. 1 - 6 years of experience with web application development Good to Have: Experience in front end development Knowledge of Microservices Architecture. Understanding of 12 factor Apps. Understanding of Service Oriented Architectures and RESTful Web Service best practices. Well versed with cloud computing concepts. Experience of unit testing Walk-in Date: 21st December 2019 Timings: 9 AM to 2 PM Interview Venue: DBXento Systems Private Limited Fourth Floor, Tower 9, SEZ, Magarpatta City, Pune - 411 013.","location":"Pune","experience":"1 - 6 Years"},{"date":"21 - Dec - 2019","skills":"PHP Frameworks, Javascript, Wordpress & Drupal","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Netedge Computing Solutions Pvt. Limited, C-56/39 NetEdge Tower, Sector-62, Noida - 201 301.","phone":"882622715","profile":"Senior Wordpress/ Php Developer \nNetedge Computing Solutions Pvt. Limited","description":"The person must have : Experience in Development using PHP Frameworks, Javascript, Wordpress & Drupal He/She must be able to Independently Develop Websites & Web Applications He/She must have orientation towards quality & customer satisfaction The Person Will be Responsible for: 1. Development of Websites in Wordpress 2. Development of Wordpress Plugins 3. Coding of Applications & Modules in PHP 4. Good communication skills 5. Strong analytical skills Walk-in Date/ Time: 21st December 2019, 9 AM onwards Interview Venue: Netedge Computing Solutions Pvt. Limited C-56/39 NetEdge Tower, Sector-62, Noida - 201 301. Contact Person- Shweta Singh Phone No. 882622715","location":"Noida","experience":"3 - 4 Years"},{"date":"21 - Dec - 2019","skills":"HR Administration, Recruitment, Office Administration","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"IndusInd Bank Limited, GN Chetty Road, T. Nagar, Chennai - 17 (Landmark - Opposite AGS Cinemas T Nagar)","phone":"Not Provided","profile":"HR Associate \nIndusInd Bank Limited","description":"Candidate should be Any Graduate/ Post Graduate with 0 - 1 year of experience in HR Administration, Recruitment, Office Administration. Must have excellent communication skills. Should be willing to work on a contractual basis for 11 months (Contract can be renewed basis performance) Good Excel knowledge Age below 30 Male candidates ONLY Job Responsibilities: Handling Pre and Post Joining formalties Handling recruitment for Chennai Addressing employee queries Walk-in Date/ Time: 21st December 2019, 10 AM onwards Interview Venue: IndusInd Bank Limited, GN Chetty Road, T. Nagar, Chennai - 17 (Landmark - Opposite AGS Cinemas T Nagar) Contact Person - Sherin Toohey","location":"Chennai","experience":"0 - 1 Years"},{"date":"21, 23, 24, 26 - Dec - 2019","skills":"C#. Net, C, C++, Javascript, Jquery and Html","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Suvarna Technosoft Private Limited, Plot No. 8, Suvarna House, Opp. Chandana Brothers, Durga Nagar, Ameerpet, Hyderabad - 500 016.","phone":"9963426420","profile":".Net Developer \nSuvarna Technosoft Private Limited","description":"Candidate must have the working knowledge of C#. Net programming with the knowledge of C, C++, Javascript, Jquery and Html programming languages. Must be efficient with XML, HTML, CSS, TCP/ IP, Web Services, Windows C#. NET services, WCF, WPF & Crystal Reports Walk-in Date/ Time: 16th December - 26 December , 11 AM onwards Interview Venue: Suvarna Technosoft Private Limited Plot No. 8, Suvarna House, Opp. Chandana Brothers, Durga Nagar, Ameerpet, Hyderabad - 500 016. Contact Person - Bhupathi Srinivas/ K Laxmi Phone No. 9963426420","location":"Hyderabad","experience":"0 - 2 Years"},{"date":"21, 23, 24, 25, 26, 27, 28, 30, 31 - Dec - 2019","skills":"Asp .Net, SQL Server","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Pamac Finserve Private Limited, C-19, Shriram Industrial Estate, Opposite Wadala Udyog Bhavan, Dadar (East), Mumbai","phone":"Not Provided","profile":".Net Developers \nPamac Finserve Private Limited","description":"Educational Qualification: BE/ BSc/ MSc/ MCA/ BCA/ B-Tech Experience Required: For back fill at least 2 year experience Must have excellent communication skills Specific Skill set Required- Asp .Net, SQL Server Walk-in Date/ Time: 19th December - 31st December , 10 AM onwards Interview Venue: Pamac Finserve Private Limited, C-19, Shriram Industrial Estate, Opposite Wadala Udyog Bhavan, Dadar (East), Mumbai","location":"Mumbai","experience":"0 - 2 Years"},{"date":"21 - Dec - 2019","skills":"Java/ J2EE, Server Side Scripting, HTML5, JS MVC framework","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Sapiens Technologies (India) Private Limited, 8th Floor, Building No 11, Cessna Business Park Kadubeesanahalli, Bengaluru - 560 103.","phone":"080-49061357","profile":"Senior Java Developers \nSapiens Technologies (India) Pvt. Limited","description":"Candidate should be BE/ B.Tech or Equivalent with 5+years of experience in Java development. Should have experience working with relational database, such as MS-SQL and/or Oracle. Sound understanding of Object-Oriented principles. Must be experienced working with SPML, JavaScript, XML and JSON, Spring, Hibernate and web services architecture, such as SOAP and/or REST. Job Responsibilities- Designing, development of core components/services which are flexible, extensible, multi-tier, scalable, high performance and reliable applications of an advanced complex software system, called ALIS both in R&D and Delivery. Object Oriented Analysis, Design, development of software components and applications. Providing technical leadership and mentoring to junior developers. Walk-in Date/ Time: 21st December 2019, 9 AM onwards Interview Venue: Sapiens Technologies (India) Private Limited 8th Floor, Building No 11, Cessna Business Park Kadubeesanahalli, Bengaluru - 560 103. Contact Person - Abhinay S Phone: 080-49061357","location":"Bangalore","experience":"5 - 7 Years"},{"date":"21 - Dec - 2019","skills":"Java, J2EE, Spring","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"HCL Chennai, Sholinganallur, SPOC: Ahmed_s@hcl.com","phone":"Not Provided","profile":"Java/ Full Stack Developer \nHCL Technologies Limited","description":"We are looking for a Java resource who is strong in Java, J2EE & Web services for a Senior Developer position at Chennai Location. Work Experience: 3 to 12 Years Should have good experience in Java, J2EE, Spring Must have Good Communication skills and Attitude Kindly revert us with your updated CV if you're Interested with the following details to ahmed_s@hcl.com Name: Contact No: Email ID: Highest Qualification: Current Company: Contract or Permanent: If Contract Please do mention Payroll company name: Total years of Experience: Relevant years of Experience in Java, J2EE: Relevant years of Experience in Spring MVC / Spring boot: Relevant Years of Experience in React JS: Relevant Years of experience in SOAP/ Rest: Current CTC: Expected CTC: Notice period: Current Location: Availability for 21st Dec'19 Weekend Drive @ Sholingallur, Chennai: Please feel free to contact us if you have any doubt about the requirement.","location":"Chennai","experience":"3 - 12 Years"},{"date":"21 - Dec - 2019","skills":"Java, J2EE, Spring, Hibernate","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Cognizant Technology Solutions, 2nd Floor, Right Wing, KNC Office, Varalakshmi Tech Park, Kandhanchavadi, OMR, Chennai.","phone":"Not Provided","profile":"Java Developers \nCognizant Technology Solutions India Limited","description":"Candidate must have hands-on experience Java/ J2EE Application development/ support Projects. Should have good technical problem solving skills. Exposure to the below skill combination is mandatory to have: Combo 1: Java, Spring, Hibernate (Recent hands on experience with Spring/ Hibernate is mandatory). Candidate with hands on experience on above skills will be eligible to apply for this position For all the above roles the candidate should possess a BE/ B. Tech/ B. Sc/ BCA/ MCA/ M. Tech/ M. Sc with consistent above 50% is Mandatory Job Responsibilities- Responsible for delivery of assigned module/ components/ phases of a project Responsible for Status reporting Responsible for estimation, planning and execution with specific focus on requirement analysis and design Responsible for Knowledge transfer and arriving at SLAs for steady state Notice Period: 90 Days (Candidates between Immediate to 30 days are most preferred) Walk-in Date/ Time: 21st December 2019, 9 AM onwards Venue Details- Cognizant Technology Solutions 2nd Floor, Right Wing, KNC Office, Varalakshmi Tech Park, Kandhanchavadi, OMR, Chennai. Opp to Hi STYLE building/ Behind Apollo Lifeline hospital Contact Person- Manoj","location":"Chennai","experience":"3 - 8 Years"},{"date":"18, 19, 20, 23, 24, 26, 27 - Dec - 2019","skills":"Front Office Administration, HR Support, Office Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Urja Money Private Limited, 147/148 CreditMate, Udyog Bhavan, Sonawala Lane, Goregaon (East), Mumbai","phone":"8369891181","profile":"Office Manager (Female Only) \nUrja Money Private Limited","description":"Work Experience Required: 6 months Age Criteria: less than 30 years Working Days: Mon to Friday Working Time: 10 to 7 Job Responsbility- Attending all the incoming calls at reception Maintain register of both inward and outward courier to logistic person. Connect guests with the right person and coordinate with them. Provide support to each department as per their requirement. Ensure reception area is tidy and presentable, with all necessary stationery and material Provide office support services to ensure efficiency. Coordinate the repair and maintenance of office supplies Assist HR in recruitment and other day to day admin related things Immediate Joiner is preferred Walk-in Date/ Time: 17th - 27 December 2019, 11 AM onwards (No interviews on Sat-Sun and Christmas day) Interview Venue: Urja Money Private Limited 147/148 CreditMate, Udyog Bhavan, Sonawala Lane, Goregaon (East), Mumbai Contact Person- Sana Sheikh Contact No: 8369891181","location":"Mumbai","experience":"1 - 7 Years"},{"date":"18, 19, 20 - Dec - 2019","skills":"HR Operations/ Recruitment, Employee Engagement, HR Administration","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Capita India Private Limited, Godrej IT Park, Gate No 2, Plant No. 6, LBS Marg, Opposite Vikhroli Bus Depot, Vikhroli (West), Mumbai - 400 079","phone":"Not Provided","profile":"HR Operations Executive \nCapita India Private Limited","description":"Capita India Private Limited, is hiring for UK HR Operations Executive Candidate must be Any Graduation with excellent communication skills Work Experience: 0 to 4 Years Freshers can apply. Shifts: 6.30 am to 3.30 pm 3.30 pm to 12.30 pm Walk-in Date/ Time: 18th - 20th December , 12 PM onwards Interview Venue: Capita India Private Limited Godrej IT Park, Gate No 2, Plant No. 6, LBS Marg, Opposite Vikhroli Bus Depot, Vikhroli (West), Mumbai - 400 079 Meet Sakshi Shukla/ Sabah Khan Contact - Sakshi","location":"Mumbai","experience":"0 - 4 Years"},{"date":"19, 20 - Dec - 2019","skills":"Back End Operations, Non Voice Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"EXL Services India Private Limited, EXL Service Tower 1, Cybercity Magarpatta City, Pune","phone":"Not Provided","profile":"Back Office Executive \nEXL Services India Private Limited","description":"Candidates should be Any Graduate with minimum 2 years of general insurance/ underwriting experience is mandatory. Must not have any gap in their profile in the last 2 years Should have excellent communication skills Should be OK with night / rotational shifts Walk-in Date: 19th - 20th December 2019 Time: 11:30 AM to 2:30 PM Interview Venue: EXL Services India Private Limited EXL Service Tower 1, Cybercity Magarpatta City, Pune. Note: Please carry your updated resume and Aadhar Card (original + 2 photocopy) along with 02 passport size photographs is mandatory to enter inside the premises.","location":"Pune","experience":"2 - 6 Years"},{"date":"19 - Dec - 2019","skills":"General Administration, Front Office/ Receptionist Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Amadeus India Private Limited, Plot No.7, Local Shopping Centre, Pocket No. 6&7, Sector-C, Vasant Kunj New Delhi - 110 070","phone":"011-41336615","profile":"Front Office Executive (Female) \nResBird Technologies Private Limited","description":"Candidate should be Graduate in any stream with excellent communication and inter personal skills. Must have the ability to handle various stations and maintain a smooth coordination. Sound computer knowledge is required Experience on travel booking and visa documentation mandatory Handling the reception area, Handling visitors and call inflow. Coordinating with other departments as and when required. Basic Administration work. Handling the travel arrangements. Handling Transport / Catering Any other tasks and duties as may be required by time to time Walk-in Date/ Time: 19th December 2019, 10 AM onwards Interview Venue: Amadeus India Private Limited Plot No.7, Local Shopping Centre, Pocket No. 6&7, Sector-C, Vasant Kunj New Delhi - 110 070 Landmark: Opposite to DPS School, Beside Bird Automotive Contact Person - Deepa (011-41336615)","location":"Delhi","experience":"2 - 3 Years"},{"date":"18, 19, 20 - Dec - 2019","skills":"HR/ Recruitment, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Sutherland Global Services Pvt. Limited, Gateway Office Parks, A1 Block, Ground Floor, Perungalathur, Chennai - 63.","phone":"7397647886","profile":"Talent Acquisition Specialist \nSutherland Global Services Pvt. Limited","description":"Educational Qualification: Preferably MBA in HR Work Experience: 0 to 3 Years Required Skills: Excellent oral and verbal communication skills Excellent analytical and problem solving skills Must be good in related domain Notice Period: Immediate Joiners. Working Days: 6 Days Shift : Day Shift Work Timings : 9 to 8 (Any 9 hours) Responsibilities include: Interacting with potential candidates on social media and professional networks (e.g. Naukri, Monster, LinkedIn, FB) Crafting and sending recruiting emails. Coordinating with hiring managers to determine position requirements. Identify qualified candidate profiles using various sourcing techniques (e.g. Boolean search) Develop talent pipelines for future hiring needs Ask for referrals from current employees and external networks Promote our employer brand online and offline Maintain candidate databases (e.g. via our Applicant Tracking System) Communicate with past applicants regarding new job opportunities Walk-in Date/ Time: 18th - 20th December , 11 AM onwards Interview Venue: Sutherland Global Services Pvt. Limited Gateway Office Parks, A1 Block, Ground Floor, Perungalathur, Chennai - 63. Contact HR - Rumal Sakthi M ( 7397647886 ) Documents to be carried: 3 copies of resume 1 passport size photo Govt. ID proof","location":"Chennai","experience":"0 - 3 Years"},{"date":"18, 19, 20, 23, 24, 25 - Dec - 2019","skills":"Back End Operations, Non Voice Process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Hinduja Global Solutions Limited, No. 115, Sri Chamundi Towers, C-2 Building, Hosur Main Road, Garvebhavi Palya, Opp: Sai Baba temple, Bangalore - 560068","phone":"7829533724","profile":"Back Office Operations/ Trainee \nHinduja Global Solutions Limited","description":"Any Graduate-Fresher or Experienced (NO - BE, B.Tech, Post Graduates) Willing to work in rotational shifts 2 Way cab facility provided 5 Days working, 2 Days Off Desired Skills/ Abilities: Msut have good communication skills Good Analytical Skills Basic computer knowledge Walk-in Date: 18th - 25 December 2019 Time Slot: (10 am - 2 pm/ Mon-Fri) Interview Venue: Hinduja Global Solutions Limited No. 115, Sri Chamundi Towers, C-2 Building, Hosur Main Road, Garvebhavi Palya, Opp: Sai Baba temple, Bangalore - 560068 Contact HR Person: Pooja Phone: 7829533724","location":"Bangalore","experience":"0 - 1 Years"},{"date":"21 - Dec - 2019","skills":"Software Testing, SDLC, Write test Scripts & Execute, Testing Life cycle","qualification":"B.E./B.Tech, MCA/PGDCA","address":"ABM Knowledgeware Limited, ABM House, Plot No. 268, 7th Floor, Linking Road, Bandra (West), Mumbai","phone":"022-42909700","profile":"Manual Tester \nABM Knowledgeware Limited","description":"Candidate must have good hands on experience on Software Testing, SDLC, STLC. Should be able to write test scripts & execute and well versed with Testing Life cycle. Should be mature individual capable of handling multiple modules. Experience on Database testing & Backend testing will be preferred. Should have good communication skills. Mode of Interview : 1. Aptitude Test 2. Technical F2F 3. HR Discussion Walk-in Date: Saturday - 21st December, 2019 Time - 9.30 AM - 4.00 PM Interview Venue: ABM Knowledgeware Limited ABM House, Plot No. 268, 7th Floor, Linking Road, Bandra (West), Mumbai Landmark - Shopper Stop/ Hotel Persian Darabar Contact - Hetali Shah (42909700)","location":"Mumbai","experience":"3 - 6 Years"},{"date":"21, 23, 24, 25, 26, 27, 28, 30, 31 - Dec - 2019","skills":"QA Automation Testing, Selenium, Appium, Performance Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Veritech Infosystems Private Limited, 10th floor, RMZ Latitude Commercial Building, Bellary Road, Hebbal, Bengaluru - 560 024.","phone":"9148810443","profile":"QA/ Automation Tester \nVeritech Infosystems Private Limited","description":"Looking for QA Automation- Selenium (Lead Role & Senior Role), with good experience in Appium and Performance Testing. Excellent troubleshooting & Isolate Problem solving skills Notice Period Immediate Joiner & 30 days. Must be willing to work in Hebbal? Walk-in Date/ Time: 21st December - 25 January, 10 AM onwards Interview Venue: Veritech Infosystems Private Limited 10th floor, RMZ Latitude Commercial Building, Bellary Road, Hebbal, Bengaluru - 560 024. Contact Person - Tasleem (9148810443)","location":"Bangalore","experience":"2 - 7 Years"},{"date":"18 - Dec - 2019","skills":"Software Testing, Functional Testing, Regression Testing, Automation Testing","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Indium Software (India) Limited, #64, Ganesh Chambers, Edams Road, Teynampet, Chennai.","phone":"044-66069102","profile":"Software Testing Engineer \nIndium Software (India) Limited","description":"Eligibility Criteria: BE/ B.Sc/ MCA (Only 2018 & 2019 Pass outs) Good knowledge in any Programming Language Mandatory 60% and above(overall Percentage) and No standing arrears Excellent Communication Skills Walkin Date 18th December 2019 (Wednesday) Time: 11 AM to 1 PM Interview Venue: Indium Software (India) Limited, #64, Ganesh Chambers, Edams Road, Teynampet, Chennai.","location":"Chennai","experience":"0 - 1 Years"},{"date":"19, 20 - Dec - 2019","skills":"Manual Testing, Test Scripts, Test Cases, Shell Scripting. Selenium, Protractor, JMeter","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Everi India Private Limited, Elnet Software City, 2nd floor, Rajiv Gandhi Salai, Taramani, Chennai - 600 113.","phone":"Not Provided","profile":"Software Testing Engineer \nEveri India Private Limited","description":"We are Looking for Test Engineers/ Senior Test Engineers with 1 to 6 years of experience for our Product development team. The associates are expected to have experience and knowledge on below mentioned skill sets. Manual Testing of Web / Enterprise Applications. Must posses strong hands on experience in manual testing and process. Should have strong Analytical and Logical abilities. Candidates with prior experience in BFSI / Payments domain preferred. Good to have Skills: Test Scripts, Test Cases, Shell Scripting. Selenium, Protractor, JMeter. Java, C#, JavaScript, Python, Shell Script. Test Scripts, Test Cases Visual Studio, TFS, Dev Express, Jenkins, SVN, Git SOAP UI/Fiddler SQL Server (SQL , PL/SQL) Walk-in Date/ Time: 19th - 20th December , 11 AM onwards Interview Venue: Everi India Private Limited Elnet Software City, 2nd floor, Rajiv Gandhi Salai, Taramani, Chennai - 600 113. Contact Person - Ilakya Rajan","location":"Chennai","experience":"1 - 6 Years"},{"date":"18 - Dec - 2019","skills":"C, C++, Java Basic concepts of OOPS","qualification":"B.E./B.Tech","address":"Jardine Lloyd Thompson India Pvt. Limited, 10th Floor, A Wing, Supreme Business Park, Hiranandani Gardens,Powai, Mumbai - 400 076","phone":"02242743001","profile":"BE/ B.Tech (IT Freshers) \nJardine Lloyd Thompson India Pvt. Limited","description":"We are looking for candidates who are comfortable to work on either development, support or testing requirements & are flexible to work either in Mumbai/ Pune. Eligibility Criteria: Consistently excellent academic track record i.e. 60% and above in 10th, 12th graduation (BE/ B.TECH) Stream: Computer Science/ IT/ EXTC Year of Passing: 2018, 2019 No gaps in education Not eligible - BCA, BSc, MCA Shifts: Should be comfortable working in morning/ afternoon shifts Job Location: Should be comfortable working at Pune/ Mumbai office. Technical Skills- Programing Language: C, C++, Java Basic concepts of OOPS Should well versed with SDLC fundamentals - Dev, Test and Support Technical skills (Front-end): HTML/ HTML5 / CSS / jQuery / JavaScript MS Office Word, Excel and PowerPoint Technical skills (back-end): Working knowledge on SQL Queries, RDBMS Database General Skills Good Analysis and Design Skills Able to work on multiple requests at the same time Knowledge on Agile and SDLC Good communication skills Event Date: Wednesday, 18th December, 2019 Walk-In Timings: 8AM - 9AM strictly. Interview Venue: Jardine Lloyd Thompson India Pvt. Limited, 10th Floor, A Wing, Supreme Business Park, Hiranandani Gardens,Powai, Mumbai - 400 076 (Applicants would not be allowed beyond the mentioned timings)","location":"Mumbai","experience":"0 - 1 Years"},{"date":"17, 18, 19, 20 - Dec - 2019","skills":"Automated testing, Selenium, Web Driver, Create Test Scenarios, Test Script, and Test Cases","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Techbooks International Pvt. Limited, Aptara, A-37, Sector - 60, NOIDA, Uttar Pradesh - 201 301.","phone":"0120-41682424","profile":"Software Testing Engineer \nTechbooks International Pvt. Limited","description":"Person should have 2 to 5 years testing experience for web based software products. Should have 1+ years of software testing experience in automated testing on Selenium Web Driver. Create test scenarios, test script, and test cases prior to feature delivery in order to support continuous delivery. Work on traceability matrix to trace requirements to estimate test case development and execution effort. Must have hands on experience in Web services. Preparation of test coverage, and regression analysis reports to support high quality delivery. Desired Skills- Strong knowledge of software QA methodologies and processes Excellent communication skills, good sense of teamwork Knowledge of MS Office (Word, Excel, PPT, Visio) Disciplined and self-motivated in delivering high-quality software. Walk-in Date/ Time: 16th - 20th December , 11 AM onwards Interview Venue: Techbooks International Pvt. Limited Aptara, A-37, Sector - 60, NOIDA, Uttar Pradesh - 201 301 Contact Person- Aishwarya Tel: 120-41682424","location":"Noida","experience":"2 - 5 Years"},{"date":"18, 19 - Dec - 2019","skills":"Java, Software Testing, Automation Testing, Selenium","qualification":"B.E./B.Tech, MCA/PGDCA","address":"ApMoSys Technologies Private Limited, A-105, Greenscape Technocity, Shil Phata Mahape Road, Mahape, Navi Mumbai - 400 710.","phone":"8657487488","profile":"Automation Tester/ Fresher \nApMoSys Technologies Private Limited","description":"Person should have knowledge of basic Java & Selenium Must have completed with Software Testing course Male candidates only need to apply Candidates only having knowledge of Manual testing do not apply Open to travel anywhere in Mumbai as per project Immediate joiner Quick learner Walk-in Date: 18th - 19th December 2019 Timings: 11 AM to 3 PM Interview Venue: ApMoSys Technologies Private Limited A-105, Greenscape Technocity, Shil Phata Mahape Road, Mahape, Navi Mumbai - 400 710 Landmark: Next to Country Inn Hotel & Suites Contact - Bhairavi (8657487488) Please carry Update resume & come in proper formals","location":"Mumbai","experience":"0 - 1 Years"},{"date":"17, 18, 19, 20 - Dec - 2019","skills":"Java, Core Java, Multi-Threading, Spring Framework, JSP, HTML, JQuery & Any Database","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"For More Information Call to 8095348111 OR E-Mail your Updated CV to babu.balaraman@adecco.com","phone":"8095348111","profile":"Core Java/ Fullstack Developer \nAdecco India Private Limited","description":"Educational Qualification: BE/ B.Tech/ M.Tech/ MCA Mandatory Skills: Java, JSP, HTML, JQuery & Any Database Work Experience: 2.5 to 7 Years 1) Core Java Developer Required Skills: Mandate Skills are Core Java, Multi-Threading & Spring Framework. Restful Web services is an added advantage. 2) Full Stack Developer Required Skills: Mandate skills are HTML, JSP and Java with any framework (Spring, Hibernate & Struts) CSS & Boot Strap is an added advantage. Candidate who are able to join within 30 Days need to apply F2F Interviews starts from Tuesday, Wednesday, Thursday & Friday For More Information Call to 8095348111 or E-Mail your updated CV to babu.balaraman@adecco.com with below mentioned details:- Total Experience: Relevant Experience: Current CTC: Expected CTC: Notice Period","location":"Bangalore","experience":"2 - 7 Years"},{"date":"18 - Dec - 2019","skills":"Manual Testing, Quality Assurance Engineering, Test Cases, Project Documentation","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Navatar Consulting Private Limited, A-42/6, 5th Floor, Pinnacle Tower, Sector - 62, Main Road, Noida.","phone":"Not Provided","profile":"Manual Testers /QA Engineer \nNavatar Consulting Private Limited","description":"The role requires only 2 to 4 years of experience along with good communication and logical skills. Responsible to create and execute tests to verify that software runs properly and without defects on each platform requested and to handle test procedures efficiently in order to result the extreme product stability, product usability and performance. We are looking for early joiners. Walk-in Date: 18th December 2019 Registration Timing : 11:00 am - 1:00 pm Interview Venue: Navatar Consulting Private Limited A-42/6, 5th Floor, Pinnacle Tower, Sector - 62, Main Road, Noida Landmark: Adjacent to Corenthum Building","location":"Noida","experience":"2 - 4 Years"},{"date":"16, 17, 18, 19, 20 - Dec - 2019","skills":"QA/ Software Testing, Shell, Python, VB Scripting, etc.","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Svaya Robotics, 2nd Floor, NSL Icon, Road No: 12, Banjara Hills, Hyderabad - 500 034.","phone":"7702700960","profile":"QA/ Testing Engineer \nZuti Engineering Solutions Pvt. Limited","description":"Applicant need to have solid experience in QA/ Software testing. Must have good experience in Scripting language like Shell, Python, VB Scripting, etc. In depth knowledge and experience in SDLC and Quality Assurance. Walk-in Date/ Time: 16th - 20th December 2019, 10 AM onwards Interview Venue: Svaya Robotics, 2nd Floor, NSL Icon, Road No: 12, Banjara Hills, Hyderabad - 500 034. Landmark: Opposite to ICICI Bank Contact Person : Bhargav Contact No: 7702700960","location":"Hyderabad","experience":"4 - 8 Years"},{"date":"21 - Dec - 2019","skills":"Manual and Automated testing (Selenium with JAVA)","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Merilytics Intelytics Private Limited, 2nd Floor, Gutenberg, Road Number 2, Sai Pruthvi Enclave, Kondapur, Hyderabad, Telangana - 500 084.","phone":"Not Provided","profile":"Software Testing Analyst \nMerilytics Intelytics Private Limited","description":"Person must have at least 2 years of testing experience in manual and automated testing (Selenium with JAVA). Analyze requirements and develop test strategies, test plans, test scenarios and test cases. Perform functional, stress, integration and regression testing based on product release requirements. Should have good experience in TestNG (Testing Framework) and any one of the open source tools like Selenium, JRunner, or SoapUI. Excellent verbal and written communication skills Must be flexible, independent and self-motivated. Familiarity with code coverage tools and concepts Interview Rounds: Online Test followed by Face to Face Interviews. Walk-in Time: 21st December 2019 Timings: 9.00 AM to 11.00 AM Interview Venue: Merilytics Intelytics Private Limited 2nd Floor, Gutenberg, Road Number 2, Sai Pruthvi Enclave, Kondapur, Hyderabad, Telangana - 500 084. Contact Person- Sushmitha Pamreddy Note: The candidates who meet the eligibility criteria i.e. 60% through out the academics with B. Tech graduation can directly walk-in to our office for the interview process on December 21, 2019 along with your updated resume and ID proof. Candidates with 60 days notice period are preferred. Candidates who have applied with our company in the recent 6 months are not eligible.","location":"Hyderabad","experience":"2 - 3 Years"},{"date":"18 - Dec - 2019","skills":"Game Testing, Mobile Application Testing, Software Testing","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Splash Math (Studypad Private Limited), 1026, JMD Megapolis, Sector 48, Gurgaon, Haryana.","phone":"Not Provided","profile":"QA- Game Testers (App Testing) \nSplash Math (Studypad Private Limited)","description":"Candidate should have 1 to 2 years of relevant experience in Mobile Application Software Testing. Must have experience on Android, iOS platforms. Experience on Web Application Testing would be a plus Should have excellent analytical and problem solving skills Have a testing mind-set with a passion for quality Works independently under minimal direction with strong work ethic Experience working in agile methodology Should be able to convert the requirements into testable solution and manage the work done from team. Good knowledge on bug tracking, bug analysis, and bug reporting. Must have strong written and oral communication skills including proactive, positive work attitude Walk-in Date/ Time: 18th December 2019, 9 AM onwards Interview Venue: Splash Math (Studypad Private Limited) 1026, JMD Megapolis, Sector 48, Gurgaon, Haryana. Contact Person - Mudita","location":"Gurgaon","experience":"1 - 2 Years"},{"date":"16, 17, 18 - Dec - 2019","skills":"ASP .Net / C#, Web Services, Web API, SQL Serve","qualification":"B.E./B.Tech, MCA/PGDCA","address":"KMG Infotech Limited, 262, Udyog Vihar Phase IV, Sector 18, Gurugram, Haryana","phone":"Not Provided","profile":".Net Developers \nKMG Infotech Limited","description":"Technical Skills: VS 2013/ 2015/ 2017, Framework 3.5/ 4.5, ASP .Net / C#, Web Services, Web API, SQL Server 2010/2012/2014+, MVC 4/5/6, Essential Skills: Experience in team handling, working as Technical mentor to team members, code reviews Must have excellent communication skills Strong teamwork and interpersonal skills Walk-in Date/ Time: 16th - 18th December , 11 AM onwards Interview Venue: KMG Infotech Limited 262, Udyog Vihar Phase IV, Sector 18, Gurugram, Haryana Contact Person- Vartika Sharma","location":"Gurgaon","experience":"1 - 6 Years"},{"date":"17, 18, 19 - Dec - 2019","skills":"Core PHP, jQuery, JavaScript, CSS, Ajax, MySQL","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Aimil Limited, Naimex House, A-8 Mohan Co-operative Industrial Estate Mathura Road, New Delhi - 110 044","phone":"01161310202","profile":"Core PHP Developer \nAimil Limited","description":"Applicant must have extensive knowledge in the following- Core PHP jQuery JavaScript CSS, Ajax, MySQL Good understanding of object oriented principles / programming and MVC frameworks. Walk-in Date/ Time: 17th December - 19th December , 9 AM onwards Interview Venue: Naimex House, A-8 Mohan Co-operative Industrial Estate Mathura Road, New Delhi - 110 044 Nearest Metro: Sarita Vihar Metro Station Contact - Shubha Pandey (1161310202)","location":"Delhi","experience":"0 - 1 Years"},{"date":"17, 18, 19, 20, 23, 24, 25, 26, 27 - Dec - 2019","skills":"Python/ PHP, HTML, CSS and JavaScript, MySQL, Oracle and MongoDB","qualification":"B.E./B.Tech, MCA/PGDCA","address":"GKBLABS LLP, 37-32, Plot No. 337, DURSE ARECADE 3rd floor. Defence Colony, Sainikpuri Secunderabad, Telangana - 500 094.","phone":"Not Provided","profile":"Full Stack Developer (Python/ PHP) \nGKB Labs","description":"We are looking for a highly skilled computer programmer who is comfortable with both front and back end programming. Full Stack Developers are responsible for developing and designing front end web architecture, ensuring the responsiveness of applications and working alongside graphic designers for web design features, among other duties. Candidate should have Degree in Computer Science with strong organizational and project management skills. Proficiency in fundamental front end languages such as HTML, CSS and JavaScript. Familiarity with any one of the JavaScript frameworks such as Angular JS, React. Proficiency in server-side languages such as Python and PHP. Familiarity with database technology such as MySQL, Oracle and MongoDB. Must have a strong knowledge of framework concepts. If PHP one should be familiar with the PHP framework Laravel or any other. Must have excellent verbal communication skills. Good problem-solving skills. Attention to detail. Walk-in Date/ Time: 17th December - 27 December , 9 AM onwards Interview Venue: GKBLABS LLP 37-32, Plot No. 337, DURSE ARECADE 3rd floor. Defence Colony, Sainikpuri Secunderabad, Telangana - 500 094. Contact Person- Aditya","location":"Hyderabad","experience":"0 - 3 Years"},{"date":"17, 18, 19, 20, 23, 24, 25, 26, 27, 30, 31 - Dec - 2019","skills":"OOP's, Java Script , Jquery, RDLC Reports Design, SQL, MVC and Third Party control Like Telerik","qualification":"B.E./B.Tech, MCA/PGDCA","address":"S2 Infotech International Limited, 501 504 5th Floor, Pentagon 3 Magarpatta City Hadpasar, Pune - 411 013.","phone":"Not Mentioned","profile":"Software Developer (.Net) \nS2 Infotech International Limited","description":"Candidate must have strong knowledge of OOP's, Java Script , Jquery, RDLC Reports Design. Should have basic knowledge of SQL, MVC and Third Party control Like Telerik. Walk-in Date: 17th - 31st December 2019. Timing : 10.30 AM to 5.30 PM (Monday to Friday) Interview Venue: S2 Infotech International Limited 501 504 5th Floor, Pentagon 3 Magarpatta City Hadpasar, Pune - 411 013. Contact Person- Ms Ashwini Contact No : 020 67000000","location":"Pune","experience":"1 - 3 Years"},{"date":"16, 17, 18, 19 - Dec - 2019","skills":".Net, MVC, ASP .Net, SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Opportune Technologies Pvt. Limited, 411, Gemstar Commercial Complex, Ramchandra Ln, Kanchpada, Malad (West), Mumbai, Maharashtra - 400 064.","phone":"Not Provided","profile":".Net Developer \nOpportune Technologies Private Limited","description":"Candidate must have be having 1 year and above valid experience Must have good knowledge about the .Net Languages Work experience on HRMS will be an advantage Walk-in Date/ Time: 16th - 19th December , 11 AM onwards Interview Venue: Opportune Technologies Pvt. Limited 411, Gemstar Commercial Complex, Ramchandra Ln, Kanchpada, Malad (West), Mumbai, Maharashtra - 400 064. Contact Person - Dhwani Mehta","location":"Mumbai","experience":"1 - 6 Years"},{"date":"16, 17 - Dec - 2019","skills":"Back End Operations, Non Voice Process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"SLK Global Solutions Private Limited, 6th Floor, Building No 2, Commerce Zone IT Park, Yerwada, Pune","phone":"Not Provided","profile":"Back Office Associate/ Fresher \nSLK Global Solutions Private Limited","description":"SLK Global Solutions Private Limited is recruiting for freshers for Banking/ Mortgage/ Insurance process for Non Voice/ Back end process. Qualification: Any Graduate (Except BE/ BCA/ B.Sc/ MBA) Work Experience: Freshers Job Location:Pune Role: Permanent Shifts: Night shifts - US shifts Travel: 1 way cab drop is available (Free for Female candidates) Skill set: The applicant must have a valid PAN and Aadhar card Must have basic knowledge of banking terminologies Must have good English communication skills Must be open to work in rotational shifts Should have good typing skill No regional language Walk-in Date: 16th - 17th December 2019 Time: 12.00 PM to 3.00 PM Interview Venue: SLK Global Solutions Private Limited 6th Floor, Building No 2, Commerce Zone IT Park, Yerwada, Pune","location":"Pune","experience":"0 - 1 Years"},{"date":"16, 17, 18, 19, 20, 21, 23, 24, 25, 26, 27, 28 - Dec - 2019","skills":"VB .Net, MS SQL Server, ADO .Net & Dot Net API's, Store Procedures, MS SQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"H-Tech Solutions Private Limited, 'Office No.203 2nd Floor Core Business Center The Latitude (Ahura Builders) NIBM, Pune, Maharashtra - 411 048.","phone":"Not Provided","profile":".Net Programmer \nH-Tech Solutions Private Limited","description":"Candidate should have minimum 2 years of relevant experience Must have good personality & fluent in English Immediate joining required Required Skills- VB .Net MS SQL Server Worked on Windows Application Aware about ADO .Net & Dot Net API's Dev Express Controls MS SQL Triggers MS SQL Functions/ MS SQL/ Store Procedures Walk-in Date/ Time: 14th December - 28 December , 1 PM onwards Interview Venue: H-Tech Solutions Private Limited 'Office No.203 2nd Floor Core Business Center The Latitude (Ahura Builders) NIBM, Pune, Maharashtra - 411 048. Contact Person - Surya Prakash","location":"Pune","experience":"2 - 4 Years"},{"date":"19, 20 - Dec - 2019","skills":".NET, ASP.NET MVC, C#, WPF, WCF, SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Infosys BPM Limited, #785, Ground Floor Axis Sai Jyoti, 15th Cross 100 Feet Road, Sarakki, 1st Phase J P Nagar, Bengaluru - 560 078","phone":"Not Provided","profile":".Net Developer \nInfosys BPM Limited","description":"Qualification: Any Graduate with Full-time Education Work Experience : Minimum 1-4 Years Job Location: Bangalore Shifts: Should be flexible for 24*7 Shifts Note: Should be flexible to relocate for Chennai, Hyderabad, Pune Candidate Should have worked on .Net development/implementation project Must have experience in .NET, ASP.NET MVC, C#, WPF, WCF, SQL Server Must have experience in Web services, Web API, REST services, HTML, CSS3 Location of posting is driven by business needs and the role fitment shall be subject to the experience level and technical, feedback. Walk-in Date/ Time: 19th - 20th December , 9 AM onwards Interview Venue: Infosys BPM Limited #785, Ground Floor Axis Sai Jyoti, 15th Cross 100 Feet Road, Sarakki, 1st Phase J P Nagar, Bengaluru - 560 078 Contact Person - Mahadev Vamsi","location":"Bangalore","experience":"1 - 4 Years"},{"date":"16, 17, 18, 19, 20 - Dec - 2019","skills":"Asp .Net, MVC, Javascript, Jquery, SQL, ASP .NET, MVC .Net","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Kellton Tech Solutions Limited, Plot No. 404-405 iLABS Centre Near Raddison Hotel, Phase III, Udyog Vihar, Gurugram, Haryana - 122 016.","phone":"0124-4698912","profile":".Net Developer \nKellton Tech Solutions Limited","description":"Candidate should have good hands-on experience in developing enterprise web/ SOA applications on Microsoft .NET platform using C#, VB .NET, ASP .NET, Team Foundation Server, SharePoint, Entity Framework. Knowledge and hands-on experience in one or more of these technologies - WCF, WF, WPF, WebAPI. In-depth understanding of SOA, Web services and XML. Work Experince: 3 to 7 Years Mandatory Skills - .Net And MVC Responsible for Requirement Management, High Level and Low Level Design and Design documents using Use Cases and Visio Diagrams. Management of complete Life cycle of the project. Design of project and components. Primary Skills (Must have): Must have knowledge of web services implementation. Should have exposure to design patterns. Good verbal and written communication skills. HTML 4 knowledge is must. HTML 5 knowledge would be preferred. Must have good knowledge of javascript including Jquery framework. Must have good knowledge of entity framework/ nhibernate. Walk-in Date/ Time: 16th - 20th December , 11 AM onwards Interview Venue: Kellton Tech Solutions Limited Plot No. 404-405 iLABS Centre Near Raddison Hotel, Phase III, Udyog Vihar, Gurugram, Haryana - 122 016. Contact - HR - Tamanna (0124-4698912)","location":"Gurgaon","experience":"3 - 7 Years"},{"date":"17, 18, 19 - Dec - 2019","skills":"ASP .NET, C#, MVC, SQL, Web API, Angular JS, HTML, CSS, JQuery, Bootstrap","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Digital Minds Software Solutions Pvt. Limited, 2nd Floor, A-Wing, Softsol Building, #4 Infocity, Beside Mindspace,Hi-tech City, Madhapur, Hyderabad, Telangana - 500 081.","phone":"040 66885669","profile":".Net/ Software Engineer \nDigital Minds Software Solution Pvt. Limited","description":"Educational Qualification: B. Tech/ MCA Work Experience: 2 - 3 years Process: .Net Domain Shift Timings: 9:00 am to 6:00 pm. Experience in designing web applications using HTML, CSS, Bootstarp, JQuery, Angular JS. Experience on Developing applications using ASP .Net MVC & C# Writing and Consuming Web services & Web API. Experience on SQL Server and dealing database using Entity Framework. Knowledge on Kentico is an added advantage. Skill Set: ASP .NET, C#, MVC, SQL, Web API, Angular JS, HTML, CSS, JQuery, Bootstrap Walk-in Date: 17th - 19th December 2019 Time: 10:00 AM to 4:00 PM Interview Venue: Digital Minds Software Solutions Pvt. Limited 2nd Floor, A-Wing, Softsol Building, #4 Infocity, Beside Mindspace,Hi-tech City, Madhapur, Hyderabad, Telangana - 500 081. Contact Person- Kalpna G Contact No. 9063610208/ 040 66885669","location":"Hyderabad","experience":"2 - 3 Years"},{"date":"16, 17, 18, 19, 20, 21, 23, 24, 25, 26 - Dec - 2019","skills":"C#. Net programming, C/ C++, Javascript, Jquery and Html","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Suvarna Technosoft Private Limited, Plot No. 8, Suvarna House, Opp. Chandana Brothers, Durga Nagar, Ameerpet, Hyderabad - 500 016.","phone":"9963426420","profile":".Net Trainee/ Developer \nSuvarna Technosoft Private Limited","description":"Candidate must have the working knowledge of C#. Net programming with the knowledge of C, C++, Javascript, Jquery and Html programming languages. Must be efficient with XML, HTML, CSS, TCP/ IP, WebServices, Windows C#. NET Services, WCF, WPF & Crystal Reports Walk-in Date/ Time: 16th December - 26 December , 11 AM onwards Interview Venue: Suvarna Technosoft Private Limited Plot No. 8, Suvarna House, Opp. Chandana Brothers, Durga Nagar, Ameerpet, Hyderabad - 500 016. Contact Person - Bhupathi Srinivas, K Laxmi Phone No. 9963426420","location":"Hyderabad","experience":"0 - 2 Years"},{"date":"16, 17, 18, 19, 20, 21 - Dec - 2019","skills":".NET MVC/ Web API, C#, Microsoft Azure, SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Cuembux Software Solutions Private Limited, Vatika Business Centre, Level-5, Panchsheel Tech Park One Shashtri Nagar, Yerwada, Pune - 411 006","phone":"8263072261","profile":"Senior .Net Developer \nCuembux Software Solutions Pvt. Limited","description":"Minimum 3 to 5 years of experience in .NET MVC/ Web API, C# Basic knowledge of Microsoft Azure. Candidate should have worked on Entity framework 6.0 Candidate should have working experience with SQL Server. Candidate should be expert in C#, REST APIs. Good to Have skills .NET Core is added advantage. Knowledge of Any other cloud platform is again added. Angular 2.0+, JavaScript/jQuery. Good communication skill. Walk-in Date/ Time: 16th - 31st December , 10 AM onwards Interview Venue: Cuembux Software Solutions Private Limited Vatika Business Centre, Level-5, Panchsheel Tech Park One Shashtri Nagar, Yerwada, Pune - 411 006 Contact Person- HR (8263072261)","location":"Pune","experience":"3 - 5 Years"},{"date":"16, 17 - Dec - 2019","skills":"Core Java, OOPS Concepts, Spring, Hibernate Angular, Mongo DB, SQL and PSQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Exela Technologies Private Limited, 9th Floor, ICC Tech Park, SB Road, Pune","phone":"9307130780","profile":"Java Developer \nExela Technologies Private Limited","description":"Graduate in B.E/B.Tech/ M.E./ M.Tech/ MCA or Equivalent Excellent verbal and written communication skills Primary Skills: 3+ years of hands-on Software Development experience 3+ years of experience in Java Web Application Development Hands on experience in Core Java with good in OOPS Concepts. Framework: Spring, Hibernate Angular 2/4/5/6/7/8 (Mandatory) Experience with Mongo DB.. Hands on experience in jQuery, Javascript & Ajax Framework Secondary Skills: Good knowledge of Relational Databases, SQL and PSQL Walk-in Date/ Time: 16th - 17th December from 10 AM onwards Interview Venue: Exela Technologies Private Limited, 9th Floor, ICC Tech Park, SB Road, Pune","location":"Pune","experience":"3 - 8 Years"},{"date":"16, 17 - Dec - 2019","skills":"ASP .NET, C#, MVC, WCF, SQL Server, Windows Forms, Web API/ Rest API, SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Aapna Infotheek Private Limited, Building No. 2, 2nd Floor, B-1 Community Centre, Behind CAFE ME Restaurant, Janakpuri, New Delhi - 110 058.","phone":"9667482186","profile":".Net Developer \nAapna Infotheek Private Limited","description":"Candidate should have minimum 5+ years' experience in designing and developing applications on the .NET platform. Design and build highly scalable applications using Microsoft technologies (ASP .NET, C#, MVC, WCF, SQL Server, Windows Forms, Web API/ Rest API). Expert-level knowledge of SQL Server programming. Strong understanding of OOPS fundamentals, Entity Framework, LINQ and REST APIs. Good knowledge of SQL Server Reporting Services and Crystal Reports Work with the quality assurance team to ensure that the software is fully unit tested, can be performance tested, and passes quality requirements Must possess very good logical, analytical and communication skills Please come for the interview drive directly between 10 AM to 2:00 PM if you are confident about your skills. Interview process will involve the following rounds. Written IQ (25 Min) Technical Written objective/Subjective- 30 Min Machine Test (Part of F2F)- 25 min-Not Applicable for 7 or more than 7+ year experienced candidate. Technical Face to face round- 20 Min Managerial Technical round- 20 Min HR Round/ MD Round- 20 Min Client Interview (If needed)","location":"Delhi","experience":"5 - 8 Years"},{"date":"21 - Dec - 2019","skills":"Jenkins, Maven, Core Java, JUnit, Cass, Automation Testing, Selenium","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"GSPANN Technologies Limited, 2nd floor, N Heights, Plot No. 38, Hitech City Phase II, Hyderabad, Telangana - 500 081","phone":"Not Provided","profile":"Testing Engineer - Java/ Selenium \nGSPANN Technologies Limited","description":"Candidate should have 5+ years of experience in Core Java, JUnit, Testing. Must have good hands-on experience in BDD frameworks like JBehave, Cucumber, Git, Jenkins and build tools like Maven and Gradle. Good knowledge of NoSQL Databases Mongo and Cassandra and messaging frameworks like Kafka, TIBCO and MQ. Should have experience in UI automation testing using Java and Selenium. Must have good communication skills Good analytical and troubleshooting skills Should have a go-getter attitude Able to work within timelines Walk-in Date/ Time: 21st December 2019 from 10 AM onwards Interview Venue: GSPANN Technologies Limited, 2nd floor, N Heights, Plot No. 38, Hitech City Phase II, Hyderabad, Telangana - 500 081","location":"Hyderabad","experience":"5 - 10 Years"},{"date":"17, 18, 19, 20 - Dec - 2019","skills":"PHP MVC frameworks, OOPS Concepts, Javascript, JQuery, HTML, CSS, SQL","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Datazoic Machines Private Limited, 141, TVH Agnitio Park, 2nd Floor, OMR, Kandanchavadi, Chennai - 96.","phone":"Not Provided","profile":"Core PHP Developer \nDatazoic Machines Private Limited","description":"Candidate should have 1 to 3 years of solid hands-on experience in developing complex applications using PHP MVC frameworks, OOPS Concepts. Strong fundamentals in object-oriented concepts and hands-on experience in design and development of object-oriented applications Hands-on experience in development of PHP based APIs Strong knowledge and hands-on experience in SQL Hands-on experience in Javascript, JQuery, HTML, CSS is a big advantage Hands-on experience in JIRA, JUnit Strong desire to learn new functional areas and technologies. Excellent written and verbal communication skills Walk-in Date/ Time: 16th December - 20th December , 11 AM onwards Interview Venue: Datazoic Machines Private Limited 141, TVH Agnitio Park, 2nd Floor, OMR, Kandanchavadi, Chennai - 96. Contact Person- Naveen Kumar","location":"Chennai","experience":"1 - 3 Years"},{"date":"18, 21 - Dec - 2019","skills":"Core PHP with MySQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Matrimony.com Limited, Bellicia Towers, 10th floor, MRC Nagar, Chennai.","phone":"044-49001919","profile":"PHP/ MySQL Developer \nMatrimony.com Limited","description":"Required Skills : Core PHP with MySQL Work Experience : 3-5 Years Job Location: Chennai Walk in Date : 18th & 21st December 2019 (Wednesday and Saturday) Time : 10.00 AM - 5.00 PM Venue: Matrimony.com Limited Bellicia Towers, 10th floor, MRC Nagar, Chennai. Landmark : Behind SUN TV office. SPOC : Santhosh Babu Tel: 044-49001919 (Ext 710) If you are interested for this opening, Kindly send me your updated CV, CTC and ECTC to santhoshbabu.k@matrimony.com for taking forward your profile for further proceedings.","location":"Chennai","experience":"3 - 5 Years"},{"date":"17, 18 - Dec - 2019","skills":"PHP, HTML5, JavaScript, Ajax & JQuery","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Council of Education & Development Programmes Pvt. Limited, 5th Floor, New English High School, Ram Maruti Road, Thane (West) - 400 602","phone":"9152013064","profile":"PHP Developer \nCouncil of Education & Development Programmes","description":"Candidate must be proficient in PHP, HTML5, JavaScript, Ajax & JQuery Excellent relational database skills with MySQL Experience with PHP MVC frameworks (Symfony, Laravel, CodeIgniter, Zend, etc.) Previous working experience as a PHP Developer for 4 years Knowledge of API's, such as twitter, Facebook, Google maps, Instagram etc Knowledge of payment gateway integration Candidates having relevant experience may walk in for an interview at our Thane office. Date: 13th December - 18th December , 11 AM onwards Interview Venue: Council of Education & Development Programmes Pvt. Limited 5th Floor, New English High School, Ram Maruti Road, Thane (West) - 400 602 Tel: 9152013064 Please mail your cv to jobs@cedp-edu.com before coming for interview.","location":"Mumbai","experience":"4 - 5 Years"},{"date":"17 - Dec - 2019","skills":"Java J2EE, Spring, JSF, Java Scripts, Tag Libs, Jasper, XML, XSL, CSS, Oracle, DB2, SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA","address":"DXC Technology India Private Limited, 39/40, Digital Park, Electronic City Phase 1, Bangalore, Karnataka - 560 100","phone":"Not Provided","profile":"Java Developer/ Java Support \nDXC Technology India Private Limited","description":"1) Java Support Engineer Technical Skills: Java J2EE, Spring, JSF, Java Scripts, Tag Libs, Jasper, XML, XSL, CSS, Database : Oracle, DB2, SQL Server Nice to have Angular 1.0, Azure AWS knowledge, Tools : CVS, PVCS, Eclipse, RAD, WebSphere Application Server, Maven Concepts: Familiar and knowledge on OOPS, Database SQL queries, Deployment of code to environments. Others: Strong Analytical skills Strong communication skills Flexible work in 24*7 support Good team player 2) Java Developer: Technical Skills: Java J2EE, Spring, JSF,JavaScripts, Tag Libs, Jasper, XML, XSL, CSS, Database : Oracle, DB2, SQL Server Nice to have Angular 1.0, Azure AWS knowledge, Tools : CVS, PVCS, Eclipse, RAD, WebSphere Application Server, Maven Concepts: Familiar and knowledge on OOPS, Database SQL queries, Deployment of code to environments. Others: Strong Analytical skills Strong communication skills Good team player Walk-in Date/ Time: 17th December 2019, 11 AM onwards Interview Venue: DXC Technology India Private Limited, 39/40, Digital Park, Electronic City Phase 1 Bangalore, Karnataka - 560 100","location":"Bangalore","experience":"3 - 8 Years"},{"date":"21 - Dec - 2019","skills":"PHP, SQL Server, GIT, Postgresql, Javascript","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"DBXento Systems Private Limited, Fourth Floor, Tower 9, SEZ, Magarpatta City, Pune 411 013.","phone":"Not Provided","profile":"PHP Developer \nDBXento Systems Private Limited","description":"Qualifications: Bachelors degree in Computer Science or a related field. 1 - 6 years of experience with web application development You have strong debugging, problem-solving and analytical skills. Strong sense of writing quality code. Passion for developing highly scalable systems. You are quick, resourceful, flexible, and an excellent collaborator. Hands-on technical coding, and implementing of product features Peer code review Strong experience in OOPS and MVC frameworks in PHP. Database experience on any of the following: PostgreSQL, MySQL or MS SQL Server (Preferably PostgreSQL). Knowledge of software design patterns. Basic understanding of front end technologies (JavaScript, Ajax, etc.). Experience participating in agile and fast-paced software development methodologies. Experience of collaborating in a cross-functional agile team Good verbal and written communication skills Good to Have: Experience in front end development Knowledge of Microservices architecture. Understanding of 12 factor Apps. Understanding of Service Oriented Architectures and RESTful Web Service best practices. Well versed with cloud computing concepts. Experience of unit testing Walk-in Date: 21st December 2019 Timings will be 9 AM to 2 PM Interview Venue: DBXento Systems Private Limited Fourth Floor, Tower 9, SEZ, Magarpatta City, Pune 411 013.","location":"Pune","experience":"1 - 6 Years"},{"date":"16, 17 - Dec - 2019","skills":"Talent Acquisition, HR/ Recruitment","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Aakash Tower, 8, Pusa Road, Near Karol Bagh Metro Station, Karol Bagh. New Delhi- 110 005","phone":"7428290943","profile":"Executive - Talent Acquisition \nAakash Educational Service Limited","description":"Candidate should have 3 or more years of experience in talent acquisition. Must be comfortable working in Six Days in a week. Should have handled bulk hiring previously. Hands-on experience with full-cycle recruiting. Excellent verbal and written communication skills. Ability to work under high pressure. Only Male Candidates required Job Responsbility- Understanding the in-house requirements and designing the JDs. Sourcing potential candidates through Naukri portal, Internal Database, Linked-in, and other medium. Conducting first round of telephonic interviews. Coordinating with the respective hiring managers and scheduling shortlisted candidates for F2F Interview with them. Closing the recruitment requirement at less TAT in case of urgent hiring. Ability to close positions in short TAT. Follow up with selected candidates until their Joining. Required Candidate profile Walk-in Date/ Time: 16th - 17th December , 11 AM onwards Interview Venue: Aakash Tower, 8, Pusa Road, Near Karol Bagh Metro Station, Karol Bagh. New Delhi- 110 005 Contact Person- Yogesh Nanda","location":"Delhi","experience":"3 - 5 Years"},{"date":"17, 18, 19, 20 - Dec - 2019","skills":"Technical Support, Sservice Desk, IT Helpdesk","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Microland Limited, RMZ Ecospace, 1B,2nd floor Outer Ring Road, Bellandur, Bengaluru, Karnataka - 560 103","phone":"Not Provided","profile":"Technical Support Representative \nMicroland Limited","description":"Skill and Knowledge Qualifications: Proper phone etiquette; Ability to speak and write clearly and accurately; Demonstrated proficiency in typing and grammar; Knowledge of relevant software computer applications and equipment; Knowledge of customer service principles and practices; Effective listening skills; Willingness to co-operate with others and work to the greater good; Multi-tasking capabilities; Competencies: Exemplary Attendance and Punctuality Maintains effectiveness when experiencing major changes in personal work tasks or work environment; adjusts effectively to work within new work structures, processes, requirements, or cultures. Focuses and guides self and team members in accomplishing work objectives. Interacts with others in a way that gives them confidence in one's intentions and those of the organization. Clearly conveys and receives information and ideas, through a variety of media, to individuals or groups in a manner that engages the audience, helping them understand and retain the message, and permitting response and feedback from the listener. Walk-in Date/ Time: 16th December - 20th December , 12 PM onwards Interview Venue: Microland Limited, RMZ Ecospace, 1B,2nd floor Outer Ring Road, Bellandur, Bengaluru, Karnataka - 560 103. Contact - Sridhar RS RS Interested Candidates mail your Cv to rasmineep@microland.com","location":"Bangalore","experience":"1 - 4 Years"},{"date":"16, 17, 18, 19, 20 - Dec - 2019","skills":"Back office Operations, good communication skills","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Teleperformance Global Services Pvt. Limited, Plot No. 408 Udyog Vihar Phase 3 Gurgaon.","phone":"8779395873","profile":"Back End Executive \nTeleperformance Global Services Pvt. Limited","description":"Looking only for B.Com Graduates Fresher can also apply Good Communication Skills. Both Side Cab's UK Shifts Five Days Working Job Location : Gurgaon Package : 11K inhand Walk-in Date/ Time: 16th - 20th December 2019, 2 PM onwards Interview Venue: Teleperformance Global Services Pvt. Limited Plot No. 408 Udyog Vihar Phase 3 Gurgaon Landmark: Near Country Inn and Suites Contact Person: KOMAL Contact No: 8285709849","location":"Gurgaon","experience":"0 - 3 Years"},{"date":"16, 17, 18, 19, 20, 21 - Dec - 2019","skills":"HRO, HR shared Services, HR Outsourcing","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Hexaware Technologies Limited, Chennai One, Phase 2, 3rd Floor, Pallavaram 200 feet Ring Road, Thoraipakkam, Chennai.","phone":"9884903575","profile":"HRO Backend Process Executive \nHexaware Technologies Limited","description":"Candidate should have 1 to 3 years of experience in HRO, HR shared Services, HR Outsourcing. Should have good knowledge in HR Payroll, Retirement, Data management, Benefits. Knowledge in Excel with good typing skills Should be flexible to work in shifts. Pickup / Drop would be provided. Interested candidates can walk-in directly between Monday - Friday. Walk-in Time: 12 PM to 5 PM Interview Venue: Hexaware Technologies Limited, Chennai One, Phase 2, 3rd Floor, Pallavaram 200 feet Ring Road, Thoraipakkam, Chennai. For queries contact., Vignesh : 9884903575","location":"Chennai","experience":"1 - 3 Years"},{"date":"17, 18 - Dec - 2019","skills":"Front Office Assistance, Front Desk Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Aliengena Captive Private Limited (US based) G1, Sigma House, Near Mariott Hotel Senapati Bapat Road, Shivaji Nagar, Pune - 411 016.","phone":"7620605245","profile":"Front Office Assistant \nAliengena Captive Private Limited","description":"We have a opportunity available for 'Back Office Assistant' position. Educational Qualification: Minimum 12th Pass Person should be committed towards Education & Growth English speaking is required Fresher are welcome. Walk-in Date/ Time: 17th December - 18th December , 12 PM onwards Interview Venue: Aliengena Captive Private Limited (US based) G1, Sigma House, Near Mariott Hotel Senapati Bapat Road, Shivaji Nagar Pune - 411 016. Lankmark: Next to Persistent Softwares or ICC Tech Park Contact - Rachna Kandhalkar Call on 7620605245.","location":"Pune","experience":"0 - 1 Years"},{"date":"13, 14 - Dec - 2019","skills":"Customer Service, Front Office Assistant, Customer Care, Guest Service","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"The LaLiT Hotel Mumbai","phone":"9004653630","profile":"Front Office Associate \nBharat Hotels Limited (The Lalit)","description":"Walk In Interview at The LaLiT Mumbai for the Front Office Associate/ GRE Date:10th to 14th December 2019 Time: 10 AM - 4 PM Interview Venue : The LaLiT Hotel Mumbai Contact Person: Disha Jain, HR Contact No. 9004653630 Interested candidates can directly walk In or can share their resume on mumhrexec@thelalit.com","location":"Mumbai","experience":"1 - 5 Years"},{"date":"13, 14, 16, 17, 18, 19, 20 - Dec - 2019","skills":"General Administration, Office Assistance, Statutory Compliance, Security, Cafeteria/ Facilities Management","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Conneqt Business Solutions Limited, 1st floor, Gowra Trinity Building, Chiran Fort Lane, Begumpet, Hyderabad - 500 003.","phone":"8688530678","profile":"Asst. Manager - Facilities/ Admin \nConneqt Business Solutions Limited","description":"Candidate should be Any Graduate with 2 to 5 years of experience in General Administration, Office Assistance, Statutory Compliance, Security, Cafeteria/ Facilities Management. Should have excellent communication skills. Job Responsbility- All Cafeteria vendors SLA's to be followed. All Food Vendors Agreements Tracker to be maintained. Responsible for Cafeteria operations & ensure Proper Ambiance maintained along with hygienic food. Conducting regular food festivals for All 03 Locations. Should act as a Facilities lead for location Operations Resolve all the facilities issues during the shift & get them to a closure. Managing the Security, Housekeeping, BMS, Cafeteria, Pest control, Washroom Hygiene & other soft service related works. Vendor Performance Assessment & Evaluation. Statutory Compliance. Walk-in Date/ Time: 13th December - 20th December from 9 AM onwards Interview Venue- Conneqt Business Solutions Limited 1st floor, Gowra Trinity Building, Chiran Fort Lane, Begumpet, Hyderabad - 500 003. Landmark, Begum pet Passport Office, Contact Person- Mahindra Phone No: 8688530678","location":"Hyderabad","experience":"2 - 5 Years"}]}