{"Walkins":[{"date":"17, 18, 19, 20, 21 - Feb - 2020","skills":"Software Testing, Java, Php, SQL, Dotnet","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Appsource Services Private Limited, No 12, Ramanuja Plaza 1st Floor, Malleshwaram 5th Cross, Bangalore - 560 003.","phone":"080-41280490","profile":"Software Engineers \nAppsource Services Private Limited","description":"Educational Qualification: BE/ B.Tech/ M.Tech/ MCA Work Experience: 0 to 2 Years Candidates with below skills can apply- Software Testing Java Php SQL Dotnet Walk-in Date/ Time: 17th - 21st February 2020, 11 AM onwards Interview Venue: Appsource Services Private Limited No 12, Ramanuja Plaza 1st Floor, Malleshwaram 5th Cross, Bangalore - 560 003. Contact Person- Shwetha (080-41280490)","location":"Bangalore","experience":"0 - 2 Years"},{"date":"18, 19 - Feb - 2020","skills":"Software Testing, Testing Tools, QA Testing, Test Scenarios, Manual Testing","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Prometric Testing Private Limited, 2nd Floor, DLF Infinity Tower - A Sector-25, Phase 2, DLF City Gurgaon - 122 002.","phone":"0124-4517145","profile":"Manual Testing Engineer \nPrometric Testing Private Limited","description":"Candidate should have Bachelors/ Masters degree in Computer Science, Engineering or a related subject with proven work experience in Manual Testing, Quality assurance, Writing clear, Concise and comprehensive test plans and test cases. Experience with performance and/or security testing is a plus. Should have excellent communication & analytical skills Shift Timings: 9:00 am - 5:30 pm/ 11:30 am - 8:00 pm Saturdays & Sunday Fixed Weekly Off Job Responsibility- Executing tests as per the specification documents Review for any logical/ documentation defects Reporting defects found during testing. Walk-in Date: 18th - 19th February 2020 Time: 11:30 am - 4:00 pm ONLY Interview Venue: Prometric Testing Private Limited 2nd Floor, DLF Infinity Tower - A Sector-25, Phase 2, DLF City Gurgaon - 122 002,","location":"Gurgaon","experience":"1 - 4 Years"},{"date":"22 - Feb - 2020","skills":"Software Testing, Mobile Testing, Automation Testing, Test Engineering","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Syncfusion Software Private Limited, AJ-217, 4th Avenue, Shanthi Colony, Anna Nagar, Chennai - 600 040.","phone":"Not Provided","profile":"Software Testing Engineer \nSyncfusion Software Private Limited","description":"Syncfusion Software Private Limited is looking for Testing Engineers to be based in Chennai. Syncfusion is a fast paced, growing organization that offers a challenging work environment with excellent rewards for the right candidate. Qualification: BE/ B.Tech, ME/ M.Tech, M.Sc, MCA with over 65% in all academics Eligibility Criteria: 2019 pass-outs with minimum 65% in all academics Experience: Not required but candidates with relevant experience will be preferred Must have completed the testing course with certificate No gaps of any kind Must have strong knowledge of software testing, web, desktop and mobile testing Should be willing to learn on the job and progress quickly Should have good overall communication skills. Should be hard working and self-motivated. Knowledge of automated testing will be preferred. Candidates with basic knowledge of a programming language will be preferred. Roles & Responsibilities: Perform manual and automated testing under tight deadlines. Be responsible for accurately recording issues with all relevant details. Able to switch between products and platforms with ease. Handle other tasks as assigned. Walk-in Date: 22nd February, 2020 Timings: 10:00 AM to 2:00 PM Interview Venue: Syncfusion Software Private Limited, AJ-217, 4th Avenue, Shanthi Colony, Anna Nagar, Chennai - 600 040. Contact Person- Daniel Jebaraj For any clarifications please contact the Recruitment team email id: recruitment@syncfusion.com","location":"Chennai","experience":"0 - 1 Years"},{"date":"17 - Feb - 2020","skills":"Windows Troubleshooting, Technical Support, Hardware Maintenance","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Accordion Technology Private Limited, 1st Floor, Krishe Sapphire, Madhapur, Hyderabad, Telangana - 500 081.","phone":"040-42036601","profile":"Software Testing Engineer \nAccordion Technology Private Limited","description":"Person must have good understanding of testing methodologies and concepts. Understand requirement and write test case/test scenario and execute them. Create, execute, maintain comprehensive test scenarios for manual testing. Perform various types of testing like functionality testing, content testing, UI testing, sanity testing and browser compatibility. Good to have knowledge of Selenium, Regression testing. Should be good at documentation of UAT test scenarios, test cases. Run manual test scripts and maintaining scripts for the assigned modules. Analyse failed tests and manage defects using the bug reporting tool. Must have excellent communication skills. Perform preliminary investigation of issues, finding the root cause and report all data captured for an issue so that the resolution is more efficient. Walk-in Date/ Time: 17th February 2020, 1 PM onwards Interview Venue: Accordion Technology Private Limited 1st Floor, Krishe Sapphire, Madhapur, Hyderabad, Telangana - 500 081. Contact Person- Rama Krishna Phone No. 040-42036601","location":"Hyderabad","experience":"2 - 7 Years"},{"date":"17, 18, 19 - Feb - 2020","skills":"Web automation/ Mobile automation using tools like Selenium, Appium, Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Yatra Online Private Limited, Level 4, Gulf Adiba, Plot No. 272, Phase II, Sector 20, Gurgaon","phone":"Not Provided","profile":"QA/ Testing Engineer \nYatra Online Private Limited","description":"Person must hold an Engineering Degree or MCA from a reputed institute with hands on experience in web automation and mobile automation using tools like Selenium, Appium, Testing. Must have good knowledge in functional, performance, compatibility, system integration, API testing and Core Java. Excellent communication skills and ability to identify, articulate and report issues found during application testing. Good to have knowledge of performance tools like JMeter. Ability to use tools for versioning and bug-tracking. Must have strong analytical and problem-solving skills. Job Responsibility- Tests large scale software applications in a manual, automated or hybrid setting. Translates business requirements into system test cases. Understands the business impact of the application well enough to make user-centric analysis. Takes ownership of the health of key software modules, which would involve functional, regression, performance and compatibility testing. Walk-in Date/ Time: 17th February - 19th February , 10 AM onwards Interview Venue: Yatra Online Private Limited, Level 4, Gulf Adiba, Plot No. 272, Phase II, Sector 20, Gurgaon Contact Persson- Kuntal Sinha Roy Kumar","location":"Gurgaon","experience":"0 - 3 Years"},{"date":"17, 18, 19 - Feb - 2020","skills":"Core PHP, MySQL, Linux + SVN CodeIgnitor or any PHP based Framework","qualification":"B.E./B.Tech, M.Tech","address":"SVG Media Private Limited, AIHP Palms, LGF, Plot - 242 & 243, Udyog Vihar, Phase-IV, Gurgaon - 122 016.","phone":"8800242494","profile":"Software Engineer - Core PHP \nSVG Media Private Limited","description":"SVG Media Private Limited is conducting walk-in drive to hire experienced candidates for Software Engineer - PHP position Qualification: Engineering Graduate (B. Tech or BE/ M.Tech or ME) BCA/ MCA not allowed Required Skills- Core PHP MySQL Database Web Development for mobile handsets Web Development for Ad Serving Platform Linux + SVN CodeIgnitor or Any PHP based Framework Work on open source AD Server Work on building user profiling & segmenting Work on analyzing user behavior through real-time data capture & data mining Work on technology which helps process big data Work on data workflow model for transaction data & reporting Strong knowledge of following is necessary Walk-in Date/ Time: 17th February - 19th February , 11 AM onwards Interview Venue: SVG Media Private Limited AIHP Palms, LGF, Plot - 242 & 243, Udyog Vihar, Phase-IV, Gurgaon - 122 016 Contact Person: Tarun Kumar Phone No. 8800242494","location":"Gurgaon","experience":"1 - 3 Years"},{"date":"17 - Feb - 2020","skills":"C/ C++ Java HTML/ XML/ Javascript Python Perl PHP","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Vaco Binary Semantics LLP, Sector 18, Plot No. 15, Electronic City, Gurgaon, Haryana - 122 015.","phone":"Not Provided","profile":"Software Engineer (C/ C++, Java/ PHP) \nVaco Binary Semantics LLP","description":"Vaco Binary Semantics is hiring Software Engineer for Gurgaon for its Client (Top most Search Engine) Skills and Requirement: Preferably B.Tech/ MCA or other Graduate in Computer Science with good academics Strong analytical, logical reasoning and problem solving skills Knowledge of any of the below languages (any one) C/ C++ Java HTML/ XML/ Javascript Python Perl PHP Has a sound understanding of computer science concepts like OOPS, Database (SQL) and Data Structure Preferred knowledge of JavaScript and Regular Expression Good verbal and written communication skills In addition to the above requirements, please include the following observations based on previous selection: Good academics Quick Learner Vocal and loud with decent attitude Interested candidate may directly come for face to face interview at below mentioned venue on 17th February, 2020 (Monday) from 11:00 AM to 4:00 PM Vaco Binary Semantics LLP Sector 18, Plot No. 15, Electronic City, Gurgaon, Haryana - 122015. Nearest Metro Station- Sikanderpur Contact Person - Chetna Rai Mail id - chetna.rai@vacobinary.in","location":"Gurgaon","experience":"2 - 6 Years"},{"date":"17, 18, 19, 20, 21 - Feb - 2020","skills":"PHP/ MySQL, WordPress, Drupal, Jquery, Java Script, HTML5, CSS","qualification":"B.E./B.Tech, MCA/PGDCA","address":"GlobalData Research Center Private Limited, 3rd Floor, Jyoti Pinnacle Building, Opp to Prestige IVY League Appt, Kondapur Road, Near to Google Office, Hyderabad - 500 081.","phone":"Not Provided","profile":"Senior Php Developer \nGD Research Center Private Limited","description":"Urgent job opening for SE (Software Engineer 3 years plus experience) & SSE (Senior Software Engineer with 5 years plus experience) for WordPress/ PHP requirement @ GlobalData-Hyderabad. Candidate should have Bachelor's Degree (B-Tech) or MCA with 3+ years' of experience in PHP Should have good aptitude and problem solving skills Must have strong programming skills This job requires the candidate to- Design and implement applications/ sites in WordPress/ Drupal Good knowledge in developing custom plugins/modules in Wordpress Must have good knowledge in MySQL/ HTML/ JQuery/ CSS To pro-actively address all technical issues and coordinate with India and UK teams Participate in agile development process to ensure project deliverables are met, on time and of high quality Should have good communication skills and should be a great team player Understand specification document and perform coding as per the requirements and standards Skill Set: Proven experience in PHP MySQL WordPress Drupal Jquery, Java Script, HTML5, CSS Also, you may walk-in directly for personal interview- Walk-in Date: 17th till 21st February 2020 (Monday - Friday) Timings : 11:00 am till 5:00 pm Interview Venue: GlobalData Research Center Private Limited 3rd Floor, Jyoti Pinnacle Building, Opp to Prestige IVY League Appt, Kondapur Road, Near to Google Office, Hyderabad - 500 081. Kindly go through above description & forward resume to msalim@gdresearchcenter.com","location":"Hyderabad","experience":"3 - 5 Years"},{"date":"19 - Feb - 2020","skills":"Java, Angular JS, CSS, PHP, .Net, HTML, IOS, Android","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Rapidsoft Technologies Private Limited, Plot No. 63, Phase IV, Udyog Vihar, Sector 18, Gurugram, Haryana - 122 001.","phone":"0124-4852851","profile":"IT Freshers (Java/ .Net/ PHP) \nRapidsoft Technologies Private Limited","description":"Qualification: BE/ B.Tech/ M.Tech (CS/ CE/ IT) or MCA with 65% Compulsory Work Experience: Fresh College hires (0 to 12 months experience) Excellent communication skills & good at logical thinking Must be willing to learn new technologies Should have basic knowledge of performance task Excellent understanding of analytical techniques & technology Must have excellent verbal communications skills Problem-solving, Troubleshooting skills are must Immediate Joinee can only apply Walk-in Date/ Time: 19th February 2020, 11 AM onwards Interview Venue: Rapidsoft Technologies Private Limited Plot No. 63, Phase IV, Udyog Vihar, Sector 18, Gurugram, Haryana - 122 001. Contact - Priya (0124-4852851)","location":"Gurgaon","experience":"0 - 1 Years"},{"date":"17 - Feb - 2020","skills":"Java, NoSQL, Open Source, Scalability, MySQL, Cassandra, PHP, MongoDB, Laravel","qualification":"B.E./B.Tech, MCA/PGDCA","address":"DXC Technology India Private Limited, RGA Tech Park, Sarjapur Main Road, 8th Floor, Carmelaram, Hadosiddapura Chikkakannalli, Bengaluru - 560 035.","phone":"Not Provided","profile":"Full Stack Developer - PHP/ Laravel \nDXC Technology India Private Limited","description":"This is an individual contributor role & the resource will be expected to work alongside the Project Manager and/or the Business Analyst to design solutions for the business stakeholders with proficiency in LARAVEL & any other PHP frameworks. Build & maintain web-based tools accessed by employees at an organizational level managing both the UI & the backend database will be the primary expertise required. Technical Expertise: Proficiency in LARAVEL - any knowledge on other PHP frameworks is an added advantage Proficiency in SQL, Java, .Net and/or other web related technologies Should have experience in leveraging open source libraries/technologies Fundamental knowledge in object-oriented design, data structures, algorithm design, problem solving & complexity analysis. Should be able to estimate engineering effort, plan implementation & help in rolling out system changes that meet requirements for functionality, performance, scalability & reliability. Knowledge of relational databases such MySQL or Postsgre and of NoSql databases such as Cassandra or MongoDB Fundamentals of technical SAP (ABAP, FICO etc.) experience would also be an added advantage Any working experience on Robotics technologies such as BluePrism & UiPath will be an added advantage General Skill Sets: Strong analytical skills & out of the box thinking Able to work independently while under significant pressure High adaptability - flexible & able to cope with continuous and rapid change Proactive behavior, Critical thinking, Problem solving skills & Decision-making skills Interview Date: 17th February 2020 Reporting Time: 2:00 PM Venue: DXC Technology India Private Limited RGA Tech Park, Sarjapur Main Road, 8th Floor, Carmelaram, Hadosiddapura Chikkakannalli, Bengaluru - 560 035. SPOC: Neema Satheesh","location":"Bangalore","experience":"2 - 6 Years"},{"date":"14, 15 - Feb - 2020","skills":"HR Operations, Time Management, MS Word & Excel","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"PC Solutions Private Limited, A-72/73, FIEE Complex (Opposite C-Lal Chowk Bus Stand) Okhla Industrial Area, Phase - II, New Delhi - 110 020","phone":"011-46555999","profile":"HR Operations (Only Female) \nPC Solutions Private Limited","description":"We are conducting Walk-in Drive for HR - Operations Executive (Only Fresher) with PC Solution Private Limited - Okhla location. Only Female candidates need to apply Good interpersonal & communication skills. Good Computer Skills Hands on experience in MS Word & Excel. Time Management. Fresher can also apply. Job Responsibility- On-boarding and Documentation. To prepare offer letter & Joining Letter for the selected candidates. Background Verification of employees. Managing the Employee Mediclaim insurance Benefits & ESI Benefits. To prepare candidate assessment sheet for the approval & define the salary. HR query management to be handled by liaising with other functions. To prepare and check all the essential papers of candidates from HR department side before joining. Ensure required documentation is received and reflected in the appropriate systems. Create an engaging environment; coordinate with facilities & IT to arrange work place. Walk In Date: 14th (Friday) to 15th Feb 20 (Saturday) Time: 10 AM onwards Interview Venue :- PC Solutions Private Limited A-72/73, FIEE Complex (Opposite C-Lal Chowk Bus stand) Okhla Industrial Area, Phase - II New Delhi - 110 020 Contact Person - Sanjay Kumar","location":"Delhi","experience":"0 - 1 Years"},{"date":"14, 15, 17 - Feb - 2020","skills":"HR/ Recruitment, Talent Acquisition, Interviewing, Head Hunting, Screening, Selection","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Midway Cafe, A -125 Ground Floor, Sector 63, Noida","phone":"9717293005","profile":"HR Recruiter \nMidway Cafe India Corporation","description":"Candidate should have good communication skills. Target driven, Good at multi-tasking. End to end recruitment process Screening resumes Performing in-person and phone interviews with candidates Performing reference and background checks Coordinating walk-ins interviews with the HR manager Following up on the interview process status Walk-in Date/ Time: 13th February - 17th February , 12 AM onwards Interview Venue: Midway Cafe, A -125 Ground Floor, Sector 63, Noida Contact Person- Rahul (9717293005) If interested, kindly share your resume to hr.midwaycafe@gmail.com or call to us on above given number","location":"Noida","experience":"1 - 4 Years"},{"date":"15 - Feb - 2020","skills":"Java/ J2ee / Spring / Hibernate","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Nucleus Software Exports Limited, A-39, Sector-62, Noida Nearest Metro Station- Noida Electronic City","phone":"0120-2403970","profile":"Java Developers \nNucleus Software Exports Limited","description":"Nucleus Software Exports Limited, is urgently looking for Java Developers at - Noida location Education - 60% in X, XII and Graduation Skills- J2ee / Spring / Struts / Hibernate Work Experience - 2 to 4 Years Candidate must have knowledge in Core java: OOPS, Collection Framework, Threads, and Exception Handling; Must have hands-on experience with one of the web application frameworks: Spring MVC, Hibernate (Core, DI, Transactions ,Dependency Injection, Inversion of control, MVC, Bean Life Cycle, AOP, and Connection pooling) MustWalk-in Date: 15th February 2020 have experience in Hibernate: ORM, portability, different mappings, annotations, transactions; Work Location Noida Walk-in Date: 15th February 2020 Time - 9 AM to 12 PM Interview Venue: Nucleus Software Exports Limited A-39, Sector-62, Noida Nearest Metro Station- Noida Electronic City Contact Person- Vandana Singh Tel No. 0120-2403970","location":"Noida","experience":"2 - 4 Years"},{"date":"22 - Feb - 2020","skills":"ASP .NET, MVC, WCF, WEB API, C#, LINQ, Java, JSP, Servlet, Struts, Spring MVC, Hibernate, OOPS","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Celtic Systems Private Limited, 405-410 , OCEAN, Sarabhai Compound, Near Central Square Mall, Vadodara - 390 003.","phone":"7485991304","profile":"Trainee Engineers - ASP .Net/ Java \nCeltic Systems Private Limited","description":"Celtic Systems Private Limited, is looking for Trainee Software Engineer - ASP .Net MVC / Java 1) Trainee Software Engineer (ASP .Net, MVC) ASP .NET, MVC, WCF, WEB API, C#, LINQ, OOPS, Data Structure, MS SQL SERVER, Oracle DBMS, SQL/T-SQL, JavaScript, jQuery, XML, LINQ, HTML5, CSS3, Bootstrap, JSON 2) Trainee Software Engineer (Java) Java, JSP, Servlet, Struts, Spring MVC, Hibernate, OOPS, Data Structure, MS SQL SERVER, Oracle DBMS, SQL/T-SQL, JavaScript, jQuery, XML, HTML5, CSS3, Bootstrap, JSON Walk-in Date/ Time: 22nd February 2020, 10 AM onwards Interview Venue: Celtic Systems Private Limited 405-410 , OCEAN, Sarabhai Compound, Near Central Square Mall, Vadodara - 390 003. Contact Person- Anuradha Rode Phone: 7485991304","location":"Vadodara","experience":"0 - 1 Years"},{"date":"16 - Feb - 2020","skills":"Core Java or HTML, CSS & Javascript or SAP ABAP","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Signiwis Technologies Private Limited, #579, 3rd Floor, MG Complex, 2nd Main, 2nd Block, Rajajinagar, Bengaluru","phone":"Not Provided","profile":"Software Developer (Core Java/ SAP) \nSigniwis Technologies Private Limited","description":"Qualification: Post graduation, Graduates (2018, 2017, 2016 and earlier pass outs) 2019 and 2020 YOP graduates aren't allowed. Skills: Core Java or HTML, CSS & Javascript or SAP ABAP. Walk-in Date: 16th February 2020 Timings: 10 AM to 12 PM Interview Venue: Signiwis Technologies Private Limited #579, 3rd Floor, MG Complex, 2nd Main, 2nd Block, Rajajinagar, Bengaluru Contact Person- Surya Prabha","location":"Bangalore","experience":"0 - 1 Years"},{"date":"14, 15, 17, 18, 19, 20 - Feb - 2020","skills":"HR/ Administration, Payroll Management, Joining formalities, Exit formalities","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Light Microfinance Private Limited, 310-A, Pinnacle Business Park, Corporate Road, Prahladnagar, Satellite, Ahmedabad - 380 015.","phone":"9033251069","profile":"HR & Admin Executive \nLight Microfinance Private Limited","description":"Candidate should be Any Graduate/ MBA with 1 to 4 years of experience in - HR Operation, Payroll Management, Attendance Management, Joining formalities / Exit formalities. Must have good knowledge of PF/ ESIC. Walk-in Date/ Time: 14th - 20th February 2020, 10 AM onwards Interview Venue: Light Microfinance Private Limited 310-A, Pinnacle Business Park, Corporate Road, Prahladnagar, Satellite, Ahmedabad - 380 015. Contact - Mr. Saumil Adalwar (9033251069)","location":"Ahmedabad","experience":"1 - 4 Years"},{"date":"15 - Feb - 2020","skills":"Recruitment & Selection, Performance Management, Corporate Social Responsibility","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Shivam Autotech Limited, 10, 1st floor,Emaar Digital Greens Tower A, Sector-61, Gurugram, Haryana","phone":"Not Mentioned","profile":"Corporate HR Executive \nShivam Autotech Limited","description":"Candidate should have 3 to 6 years of experience in Recruitment & Selection, Performance Management, Corporate Social Responsibility, Employee Engagement, Training/ Development, and other Admin related activities. Note- Female candidate from Automobile industry only. Walk-in Date/ Time: 15th February 2020, 10 AM onwards Interview Venue: Shivam Autotech Limited 10, 1st floor,Emaar Digital Greens Tower A, Sector-61, Gurugram, Haryana Near by Rapid Metro Sector: 55-56 Contact - Ms. Nisha Kumari","location":"Gurgaon","experience":"3 - 6 Years"},{"date":"14, 15, 17, 18, 19, 20, 21, 22, 24, 25, 26, 27, 28 - Feb - 2020","skills":"HR/ Recruitment, Talent Acquisition, Sourcing","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"AGS Health Private Limited, # 3rd Floor, BNR SV Mall, Air By Pass Road, STV Nagar, Tirupati, AP- 517 507.","phone":"9840086807","profile":"HR Recruiter/ Executive \nAGS Health Private Limited","description":"We are hiring HR Recruiter with 0 - 1 years of relevant experience. Educational Qualification: MBA or MSW or MHRM Experience - 0 to 1 years Job Location - Tirupati REQUIRED SKILLS- Excellent written and spoken English Excellent interpersonal and collaborative skills Good industry networks Confident, amicable and ability to persuade and influence Unflinching integrity and personal work ethics Self-starter with the ability to lead and own projects end to end Attention to detail and concern for accuracy Effective balance between break-through creativity and compliance for company processes Excellent time management skills and multi-tasking ability Excellent team player skills JOB RESPONSIBILITIES- Sourcing of profiles from Job Portals Scheduling of candidates for assessments and interview Interview the candidates based on the competencies defined for the role Co-ordinate with Interview panels for Operations round of interview Collection of documents and offer negotiation Maintain and generate reports Collaborate with other departments for On-boarding and Training Adherence to process compliance Walk-in Date/ Time: 14th February - 28 February , 11 AM onwards Interview Venue: AGS Health Private Limited, # 3rd Floor, BNR SV Mall, Air By Pass Road, STV Nagar, Tirupati, AP- 517 507. Landmark: Big Bazaar Building Contact - Sarath Kumar ( 9840086807 )","location":"Tirupati","experience":"0 - 1 Years"},{"date":"15, 16, 22, 23 - Feb - 2020","skills":"Core Java/ .Net/ Android","qualification":"B.E./B.Tech, MCA/PGDCA","address":"SSB Software Solutions Private Limited, 28, 1st Main Road, SHENOY NAGAR WEST, CHENNAI - 30.","phone":"7200929777","profile":"IT Freshers (Java/ .Net/ Android) \nSSB Software Solutions Private Limited","description":"We are looking for Freshers with sound knowledge in Core Java/ .Net/ Android Candidate should have great attitude with good problem solving skills Must have good work ethics We are a happy family and have fun working with each other and want to keep it that way. We have a pretty flat hierarchy with very little management. So good ethics is very much valued. Walk-in Date: 15th-16th & 22nd-23rd February 2020. Timings: 9 AM onwards Interview Venue: SSB Software Solutions Private Limited 28, 1st Main Road, SHENOY NAGAR WEST, CHENNAI - 30. Contact Person- Saravanan (7200929777)","location":"Chennai","experience":"0 - 1 Years"},{"date":"12, 13, 14, 15 - Feb - 2020","skills":"VB .Net/ ASP .Net, WPF, WCF & SQL Server 2010","qualification":"B.E./B.Tech, MCA/PGDCA","address":"D2K Technologies (India) Private Limited, 605, Pujit Plaza, Plot No 67,Sector-11, CBD Belapur, Navi Mumbai.","phone":"022-27562853","profile":".Net Trainee Developer \nD2K Technologies (India) Private Limited","description":"Candidate should have good knowledge of VB .Net/ ASP .Net & SQL Server 2010 Must have good knowledge in writing & Debugging code. Should have knowledge of WPF, WCF Fresher should be willing to work on VB .Net and Win Form Male candidate only need to apply Job Responsibility- Developing, Designing & Implementing the project Attending client Queries, Troubleshooting related to project & giving Solutions. Client Site traveling across India. Walk-in Date: 12th - 15th February 2020 Time : 11.00 am to 3.30 pm Interview Venue: D2K Technologies (India) Private Limited 605, Pujit Plaza, Plot No 67,Sector-11, CBD Belapur, Navi Mumbai. Contact Person- Verunika (022-27562853)","location":"Mumbai","experience":"0 - 1 Years"},{"date":"13, 14 - Feb - 2020","skills":"HTML5, CSS, Bootstrap, JQUERY, SQL Server 2008, ASP .Net, VB .Net","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Precision Group, 22, 1st Floor, Habibullah Road, T. Nagar, Chennai - 600 017.","phone":"9384033712","profile":"VB .Net Developer \nPrecision Techserve Private Limited","description":"Qualification: BE (CSE, IT any MCA, BCA any Computer Science background) Experience: 2 to 3 years (2 years in VB .Net experience is mandatory) Nature of Job : Permanent Salary Range : 2.5 LPA - 3.20 LPA Shift timing : General Shift Duration for Joining: 15 days to 1 Month Key Requirements- Proven work experience as a Software Engineer or Software Developer. Experience designing interactive applications. Ability to develop software in VB.net, and SQL Server 2008. Excellent knowledge of relational databases. Experience developing web applications using at least Bootstrap, JQuery. BSc degree in Computer Science, Engineering or relevant field Job Responsibilities- Write well-designed, testable code. Integrate software components into a fully functional software system. Develop software verification plans and quality assurance procedures. Troubleshoot, debug and upgrade existing systems Deploy programs and evaluate user feedback. Desired Skills and Experience : Technical: HTML5, CSS, Bootstrap, JQUERY, SQL Server 2008, ASP .Net, VB .Net, Additional: Crystal Reports, RDLC Reports, Cordova Walk-in Date/ Time: 13th - 14th February 2020, 10 AM onwards Interview Venue: Precision Group 22, 1st Floor, Habibullah Road, T. Nagar, Chennai - 600 017. Contact Person- Charles K M Phone No: 9384033712","location":"Chennai","experience":"2 - 3 Years"},{"date":"13, 14, 17, 18, 19, 20, 21 - Feb - 2020","skills":".Net, ASP .Net, Json, VB .Net, Angularjs, Javascript, jQuery","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Infosense Global Private Limited, A-103, InfoTower-3, Infocity, Gandhinagar - 382009, Gujarat","phone":"9687644166","profile":".Net Developer \nInfosense Global Private Limited","description":"Walk-in Monday to Friday between 3:00 pm to 6:00 pm till 14th Feb, 2020 Skills: .Net, ASP .Net, Json, VB .Net, Angularjs, Javascript, jQuery Work Experience: 0 to 3 years Location : Gandhinagar , Gujarat Walk-in Date/ Time: 12th February - 21st February , 3 PM onwards Interview Venue: Infosense Global Private Limited A-103, InfoTower-3, Infocity, Gandhinagar - 382009, Gujarat Contact Person- Bhumika Vaghela Phone No. 9687644166","location":"Gandhinagar","experience":"0 - 3 Years"},{"date":"15 - Feb - 2020","skills":"MVC, .NET, C#, Asp .NET, Version Control tools, Angular JS","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Writer House, CTS no. 1377 and 1378, 5th Floor, Marol Church Road, Near Airport Road Metro Station, Marol, Andheri (East), Mumbai - 400 059.","phone":"Not Provided","profile":".Net Developers \nWriter Business Services Private Limited","description":"Candidate should have 2 to 4 years of proven experience in web development using MVC, .NET technologies including C#, Asp .NET Must have strong problem solving, debugging, and analytical skills Should have good understanding of version control tools Experience in Angular JS will be preferred Candidates interested can walk-in directly on 15th February, 2020 between 10 am-3 pm to the below mentioned address- Writer House, CTS no. 1377 and 1378, 5th Floor, Marol Church Road, Near Airport Road Metro Station, Marol, Andheri (East), Mumbai - 400 059. Contact Person- Hufriyar Daruwalla","location":"Mumbai","experience":"2 - 4 Years"},{"date":"13, 14 - Feb - 2020","skills":"C#, ASP .Net, MVC, Web Api, Angular, jQuery, JSON, JavaScript, CSS, HTML","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Inditrade Business Consultants Limited, Balaji Empire, Plot No 6, Sy. No 103/1,105 & 106, Jayaberi Enclave, Gachibowli, Hyderabad - 500 032.","phone":"Not Provided","profile":".Net Developer \nInditrade Business Consultants Limited","description":"Required Skills : C#, ASP .Net, MVC, Web Api, Angular, jQuery, JSON, JavaScript, CSS, HTML Need to be Good at .Net, MVC, Design Patterns. Experience with MS SQL Server (T/SQL) Work Experience: 3 to 5 Years Ability to create good software, along with performing bug tracking, problem-solving, issue-resolution and correction, and project documentation skills is Necessary: Bachelor's/Master degree in Information Systems, Computer Science or related field. Thorough understanding on Programming fundamentals Must have strong problem solving and debugging skills Reading and understanding requirements Quick learner & Self- organized Walk-in Date/ Time: 13th - 14th February 2020, 10 AM onwards Interview Venue: Inditrade Business Consultants Limited Balaji Empire, Plot No 6, Sy. No 103/1,105 & 106, Jayaberi Enclave, Gachibowli, Hyderabad - 500 032. Contact Person- Shyam","location":"Hyderabad","experience":"3 - 5 Years"},{"date":"17, 18, 19, 20, 21 - Feb - 2020","skills":".Net/ Asp .Net/ C#, OOPS Concepts, JQuery, JSON and Ajax, Sql Server","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Ebix Software (India) Private Limited, 122 & 123, NSEZ, Phase-II, Noida - 201 305","phone":"9528457331","profile":".Net Developers \nEbix Software (India) Private Limited","description":"Person must have excellent knowledge of .Net/ Asp .Net/ C# and Sql Server Good knowledge of OOPS Concepts, JQuery, JSON and Ajax calls. Ability to handle project independently. Exposure in J-Query, AJAX & JSON or any JavaScript Libraries. Walk-in Date: 17th - 21st February 2020 Time: 9:30 AM-1:00 PM Interview Venue: Ebix Software (India) Private Limited 122 & 123, NSEZ, Phase-II, Noida - 201 305 Nearest metro: NSEZ on aqua line Contact - Nilesh Kumar (9528457331)","location":"Noida","experience":"1 - 6 Years"},{"date":"13, 14, 15 - Feb - 2020","skills":"C/ C++, Java/ J2ee, .Net, Software Engineering","qualification":"B.E./B.Tech, M.Tech","address":"Manpower Group Services India Pvt. Limited, 2nd Floor, 1-8-384 &amp; 385, Gowra Grand, S.P Road, Patigadda, Begumpet, Hyderabad - 500003","phone":"7676806525","profile":"Associate Software Engineer \nExperis IT Private Limited","description":"We have urgent requirements for Associate Software Engineer and we are looking for freshers with the following eligibility criteria. Interested and eligible candidates can follow the below details for interview. Mandatory Requirement: Candidates should be either 2018/2019 passed out BE/ B.Tech, ME/ M.Tech Graduates. Aggregate should be more than 65% throughout in graduation and 60%in 12th and 10th. Looking for only CSE/ IT/ ISE branches. Candidates should be ready to relocate anywhere in India Candidate can refer their friends also Interview Process: 1. Personal Introduction 2. Group Discussion 3. Online Test a. Technical Aptitude b. Analytical c. Verbal 4. HR Discussion Role: Associate Software Engineer Package: 2.8 LPA Interview Location: Hyderabad Work Location: PAN India (Anywhere In India) Interview Date: 13th to 15th February 2020 Time: 9:00 AM to 12:30 PM Interview Venue: Manpower Group Services India Pvt. Limited 2nd Floor, 1-8-384 &amp; 385, Gowra Grand, S.P Road, Patigadda, Begumpet, Hyderabad - 500003 Landmark: Near Rasoolpura Metro Station","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"15 - Feb - 2020","skills":".Net, ASP .Net, SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA","address":"HCL Technologies Limited, Surya Sapphire, Plot #3, 1st Phase, Hosur Road Electronic City, Bangalore - 560100","phone":"Not Provided","profile":"Full Stack .Net Developer \nHCL Technologies Limited","description":"We are pleased to inform you that we currently have opening for Full Stack .Net Developer @ Bangalore Work Experience: 3 - 5 Years Interview & Job Location: Bangalore Walk-in Interview on 15th February from 9 AM onwards Interview Venue: HCL Technologies Limited Surya Sapphire, Plot #3, 1st Phase, Hosur Road Electronic City, Bangalore - 560100 The candidates who are interested & ready to attend interview on 15th February, please share your resume with below details to sugitha.p@hcl.com Name: Contact Number: Email ID : Total Experience: Current Organisation: Current Location: Preferred Location: Notice Period: Availability for F2F on 15th Feb (Yes/No):","location":"Bangalore","experience":"3 - 5 Years"},{"date":"14 - Feb - 2020","skills":"Java, Web Services and Serialization (i.e. XML, JSON, SOAP, REST) & SQL databases","qualification":"B.E./B.Tech","address":"DealerSocket (India) Private Limited, LEVEL 4, TOWER 2, PRESTIGE TECHNOSTAR, PHASE 1, DODDANEKUNDI INDUSTRY AREA BENGALURU - 560 074.","phone":"Not Provided","profile":"Software Engineer (Java) \nDealerSocket (India) Private Limited","description":"Educational Qualification: Bachelor's Degree in Computer Science or equivalent Minimum Experience: 2+ Years Specialized Knowledge & Skills: Experience with Web Services and Serialization (i.e. XML, JSON, SOAP, REST) & SQL databases Experience with OOP Architecture, Design Patterns and Implementation Experience with Agile Management Tools (i.e. Confluence, JIRA, VersionOne) Familiar with Java Programming Familiar with at least one dynamic scripting language (PHP, Perl, Python or Ruby) Familiar with at least one high level language (C++, Java, Objective C, C# etc..) Proficiency with ECMAScript, CSS and SASS/ LESS frameworks Interview Process : - Coding online test ( Java ) Please bring your laptop - Aptitude test - F2F Walk-in Interview on 14th February 2020 from 9 AM onwards Interview Venue: DealerSocket (India) Private Limited LEVEL 4, TOWER 2, PRESTIGE TECHNOSTAR, PHASE 1, DODDANEKUNDI INDUSTRY AREA BENGALURU - 560 074.","location":"Bangalore","experience":"2 - 7 Years"},{"date":"11, 12, 13, 14 - Feb - 2020","skills":"Core JAVA, Spring, Hibernate, J2EE","qualification":"B.E./B.Tech, MCA/PGDCA","address":"3i Infotech Limited, Prince infocity 2, 3rd Floor, Kandanchavadi, Chennai - 96.","phone":"044-71622577","profile":"Java Developer \n3i Infotech Limited","description":"Work Experience - 3 to 8 Years Notice Period : 15 Days (30 Days Max) Salary : Industry Standard Primary Skill Set: Core JAVA, Spring, Hibernate, J2EE Interested candidates can walk-in to below mentioned address: 3i Infotech Limited, Prince infocity 2, 3rd Floor, Kandanchavadi, Chennai - 96. Contact Person: Vivek/ Showmiya Interview Date : 11th & 14th February 2020 Time : 10.30 AM to 4 PM","location":"Chennai","experience":"3 - 8 Years"},{"date":"12, 13, 14, 15 - Feb - 2020","skills":"Android SDK, Core Java, OOPS & various Android Components & APIs.","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Tekege Solutions Private Limited, 128 B, Second Floor, Shahpur Jat, New Delhi - 110 049","phone":"8287854151","profile":"Android Developer \nTekege Solutions Private Limited","description":"Candidate must have strong knowledge of Android SDK, different versions of Android & how to deal with different screen sizes. Strong fundamentals in Core Java, OOPS & various Android Components & APIs. Work on bug fixing and improving application performance Good understanding of DBMS, SQL, Data Structures, Algorithms & Complexity. Core, hands-on development work on live projects Familiarity with FCM, Audio Recording, Running background task Understanding of code versioning tool, Git Familiarity Walk-in Date/ Time: 10th February - 15th February, 11 AM onwards Interview Venue: Tekege Solutions Private Limited 128 B, Second Floor, Shahpur Jat, New Delhi - 110 049 Landmark- Slice of Italy, Next to UCO Bank Nearest Metro- Greenpark/ Hauzkhas/ Panchsheel Contact Person- Diksha / Arpita ( 8287854151 )","location":"Delhi","experience":"1 - 3 Years"},{"date":"13 - Feb - 2020","skills":"Java, Spring Boot, RESTFUL Web Services, Angular4+","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Wipro HR Services (India) Private Limited, Building 2, Candor Tech Space, Tikri Sector 48, Gurgaon, Haryana","phone":"Not Provided","profile":"Java Full Stack Developer \nWipro HR Services (India) Private Limited","description":"Education & Certification: B. Tech /BE- CSE, ECE, IT, MCA (only Full time education) Mandatory Skills: Java, Spring boot, RESTFUL Web Services, Angular 4+ Work Experience:- 2 to 4 Years Candidate should have good technical background in Java, Spring Boot, RESTFUL Web services. Excellent knowledge of Core Java and Spring Candidate should have working knowledge on web services Should have worked in distributed agile model and continuous integration Should have worked on Angular 4+ versions. Work Conditions- 11.30 am -9 pm Walk-in Date- 13th February 2020 Timing- 9:00 AM - 1:00 PM Interview Location- Wipro HR Services (India) Private Limited, Building 2, Candor Tech Space, Tikri Sector 48, Gurgaon, Haryana. Interview Process:- Each round will be elimination round Interview duration -3-5 hours","location":"Gurgaon","experience":"2 - 4 Years"},{"date":"15 - Feb - 2020","skills":"Android SDK, Android Studio, Gradle, SQLite database","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Capgemini Technology Services India Limited, No. 14, Phase III, Rajiv Gandhi Infotech Park, Village Man, Taluka, Mulshi, Haveli, Hinjewadi, Pune - 411 057","phone":"Not Provided","profile":"Android Developer/ Lead \nCapgemini Technology Services India Limited","description":"Person must have strong knowledge on Android SDK, Android Studio and Gradle Good understanding on Core Java + Android Strong knowledge on OOPS Concepts Must have Kotlin experience. Good understanding on Android development Tools, Architecture Good understanding on networking libraries like Volley, Retrofit. Data handing using SQLite database, Preferences Strong experience working with Unit testing and BDD Should have good understanding of design patterns Familiarity with Git, GitHub and SVN Strong Agile development principles is necessary Interview Date: 15th February 2020 (Saturday) Timing: 9.00 AM to 3.00 PM Interview Venue: Capgemini Technology Services India Limited No.14, Phase III, Rajiv Gandhi Infotech Park, Village Man, Taluka, Mulshi, Haveli, Hinjewadi, Pune - 411 057. Mandatory Documents to carry: Hardcopy of the updated CV Two Passport size photograph Note: Please ignore if you've been interviewed with Capgemini in past 2 months.","location":"Pune","experience":"4 - 9 Years"},{"date":"15 - Feb - 2020","skills":"Core Java (1.8 or higher), OOPS concepts and Spring framework (Core, AOP, Batch, JMS)","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Globant India Private Limited, 5th floor, IT-8 Building, Blue Ridge SEZ, S.No. 173, Near Cognizant Tech Sys, Rajiv Gandhi Infotech Park Phase-I, Hinjewadi, Pune - 411 057.","phone":"Not Provided","profile":"Java/ Microservices Developer \nGlobant India Private Limited","description":"We are looking for a Java Developer with experience in building high-performing, scalable, enterprise-grade applications. You will be responsible for Java/ Java EE application development while providing expertise in the full software development lifecycle, from concept and design to testing. Strong experience of Core Java (1.8 or higher), OOPS concepts and Spring framework (Core, AOP, Batch, JMS) Demonstrated Microservices APIs design experience using Spring, Springboot. String handling, Collection framework, Multithreading, Exception handling. Should have hands-on experience on Design patterns and exposure on Spring or any other framework. Candidate having experience in frontend technologies like Angularjs, Reactjs, vuejs is added advantage. Candidate having experience in cloud technologies like AWS, AZURE or GCP is added Demonstrated design using Web Services (SOAP and REST)\\ Ability to adapt to a rapidly changing environment Good communication skills and logical reasoning. Walk-in Date: 15th February 2020, 9 AM onwards Interview Venue: Globant India Private Limited 5th floor, IT-8 Building, Blue Ridge SEZ, S.No. 173, Near Cognizant Tech Sys, Rajiv Gandhi Infotech Park Phase-I, Hinjewadi, Pune - 411 057. Contact Person- Anuja Pawar","location":"Pune","experience":"4 - 9 Years"},{"date":"12, 13, 14, 15, 17, 18, 19, 20, 21, 22 - Feb - 2020","skills":"Java, Angular JS, CSS, PHP, .Net, HTML, IOS/ Android","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Rapidsoft Technologies Private Limited, Plot No. 63, Phase IV, Udyog Vihar, Sector 18, Gurugram, Haryana - 122 001.","phone":"0124-4852851","profile":"IT Freshers (BE/ B.Tech & MCA) \nRapidsoft Technologies Private Limited","description":"Education Qualification: BE/ B Tech/ M Tech (CS/ CE/ IT), MCA with 65% compulsory Work Experience: Fresh College Hires (0 -12 months experience) Excellent Communication Skills & Good at logical thinking Must be willing to learn new technologies Should have basic knowledge of Performance TAsk. Excellent understanding of analytical techniques & technology Must have excellent verbal communications skills. Problem-solving, Troubleshooting skills are must. Walk-in Date/ Time: 12th February - 29 February , 9 AM onwards Interview Venue: Rapidsoft Technologies Private Limited Plot No. 63, Phase IV, Udyog Vihar, Sector 18, Gurugram, Haryana - 122 001. Contact Person- Priya (0124-4852851)","location":"Gurgaon","experience":"0 - 1 Years"},{"date":"15 - Feb - 2020","skills":"Java 8, RESTful API, Web Services, Microservices, CI/ CD, Cloud","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Atos Global IT Solutions Pvt. Limited, RMZ Centennial, ITPL Main Rd, B Block, EPIP Zone, Whitefield, Bengaluru, Karnataka - 560 048.","phone":"Not Provided","profile":"Java Consultants \nAtos Syntel Private Limited","description":"Candidate must have strong experience in design and development of Enterprise Applications. Strong Understanding of Microservices, Docker, SOA, Event Driven Architecture, Cloud native applications, J2EE design patterns Skills Needed: * Java 8 * RESTful API webservices * Microservices * CI/ CD * Cloud experience * Junit , BDD * Groovy, Powermockito * NoSQL DB(MongoDB/ Cassandra), Walk-in Date/ Time: 15th February 2020, 9 AM onwards Interview Venue: Atos Global IT Solutions Pvt. Limited RMZ Centennial, ITPL Main Rd, B Block, EPIP Zone, Whitefield, Bengaluru, Karnataka - 560 048. Contact Person- Narashiman N","location":"Bangalore","experience":"3 - 8 Years"},{"date":"16, 17, 18, 19, 20 - Feb - 2020","skills":"Core Java, Spring, Hibernate, Web Services, Objective-C, Swift, Sqlite, Core data","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Convergent Technologies Solutions Pvt. Limited, Anmol Palani Block 7th floor, Unit No. B8, No. 88, GN Chetty Road, T. Nagar, Chennai - 600 017.","phone":"044-45561433","profile":"Software Programmer - Java & IOS \nConvergent Technology Solutions Pvt. Limited","description":"Fresher opening for Java & IOS Developers at Chennai location Skill 1 : Strong knowledge on Core Java, Spring, Hibernate, Web Services. Good attitude and communication skills. Skill 2: Objective-C, Swift, Sqlite, Core data Walk-in Date/ Time: 16th February - 20th February , 11 AM onwards Interview Venue: Convergent Technologies Solutions Pvt. Limited Anmol Palani Block 7th floor, Unit No. B8, No. 88, GN Chetty Road, T. Nagar, Chennai - 600 017. Landmark: Near Dee Cee Manor Hotel or Jeeva Park and opposite of Vani Mahal Contact Person- SATHYA M","location":"Chennai","experience":"0 - 1 Years"},{"date":"12, 13 - Feb - 2020","skills":"Java, J2EE, Spring, JDBC, GWT, Multithreading, SQL/ Database Concepts","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Estel Technologies Private Limited, #126, Sector 44, Institutional Area, Gurgaon, Haryana","phone":"0124-2578204","profile":"Java Professionals \nEstel Technologies Private Limited","description":"Candidate should have 3 to 7 years of Core JAVA in an application development environment Well versed in core Java. Which includes Springs, Hibernate, Web Services and Multi-threading. Knowledge of Java related technologies such as J2EE, Spring, JDBC, GWT, Multithreading - Proficient in: SQL/ Database Concepts/ LINUX/ UNIX/ ORACLE Walk-in Date: 12th - 13th February 2020 Timing - Between 11:00 am to 4:00 pm Interview Venue: Estel Technologies Private Limited #126, Sector 44, Institutional Area Gurgaon, Haryana Contact - Nitanjali/ Saif (0124-2578204)","location":"Gurgaon","experience":"3 - 7 Years"},{"date":"12, 13, 14 - Feb - 2020","skills":"Android SDK, Java, Kotlin, SQLite, Twitter API, Google Maps, JSON, Google Api","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Q3 Technologies Private Limited, 6th floor, JMD Megapolis (Opposite Big Bazar, Sohna Road) Sohna Road, Sector 48 Gurgaon - 122 001.","phone":"Not Provided","profile":"PHP/ Android Developer \nQ3 Technologies Private Limited","description":"We are conducting walk-in interviews for PHP and Android developer position. Interested candidates may directly come down for the interview. Requirements: - 60% and above throughout academics Excellent Communication Skills 1) Android Developer: Android SDK, Java, Kotlin, SQLite, Twitter API, Google Maps, JSON, Google Api, XML, MySQL, Rest Work Experience: 2 to 4 years 2) PHP Developer: Professional experience in developing solid PHP applications using any MVC Frameworks such as Laravel / Phalcon / CakePHP. Experience in Core PHP. Extensive knowledge of RESTful API development, JSON and XML & HTML5, JQuery, CSS and responsive UI development. Walk-in Date/ Time: 12th - 14th February , 10 AM onwards Interview Venue: Q3 Technologies Private Limited 6th floor, JMD Megapolis (Opposite Big Bazar, Sohna Road) Sohna Road, Sector 48 Gurgaon - 122 001. Contact Person- Rajeeb","location":"Gurgaon","experience":"2 - 7 Years"},{"date":"15 - Feb - 2020","skills":"Web API, .Net, Web Technologies, MySQL, ASP .Net, SQL Server, MVC, Angular","qualification":"B.E./B.Tech, MCA/PGDCA","address":"IndusInd Bank Limited, IBL House Office CTS No 179 G, MIDC, Cross Road-B, Extn of Andheri Kurla Road, Andheri (East) Mumbai - 400 059","phone":"Not Provided","profile":".Net Developer (Angular) \nIndusInd Bank Limited","description":"Angular - Having minimum 2 years of experience Web API - having at least 2 years of experience SQL Server 12 and above - having minimum 3 years experience MySQL - having minimum 1 year experience Knowledge of client-side scripting frameworks Financial domain knowledge Walk-in Date/ Time: 15th February 2020, 10 AM onwards Interview Venue: IndusInd Bank Limited, IBL House Office CTS No 179 G, MIDC, Cross Road-B, Extn of Andheri Kurla Road, Andheri (East) Mumbai - 400 059 Contact Person- Namrata, Nancy","location":"Mumbai","experience":"3 - 5 Years"},{"date":"15 - Feb - 2020","skills":"Core Java, J2EE, Spring, Hibernate, Web Services - REST, Agile Methodologies, Oracle/ MySQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Hurits Consulting Private Limited, No. 376/A, 1st Floor, Obeya Verve, Opposite to KLAY Play School, 5th Main, Near Rajesh Jewellery, Sector 6, HSR Layout, Bangalore - 560 102.","phone":"6366672974","profile":"Senior Java Developer \nHurits Consulting Private Limited","description":"Candidate must have strong experience in Core Java, J2EE, Spring, Hibernate, Web Services - REST and Agile Methodologies. Must have knowledge on one of Databases (Oracle/ MySQL/ SQL). Ability to work individually with teams in different geographies. Job Responsibility- Design and implement extremely high-volume, fault-tolerant, scalable web-based systems solutions J2EE, JavaScript, and SQL. Work with system analysts, engineers, programmers and others to design the online Marketplace Walk-in Date/ Time: 15th February 2020, 9 AM onwards Interview Venue- Hurits Consulting Private Limited No. 376/A, 1st Floor, Obeya Verve, Opposite to KLAY Play School, 5th Main, Near Rajesh Jewellery, Sector 6, HSR Layout, Bangalore - 560 102. Contact - HR @ 6366672974","location":"Bangalore","experience":"4 - 9 Years"},{"date":"12, 13, 14 - Feb - 2020","skills":"Java Coding, Spring, Hibernate","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Affluent Global Service Private Limited, Patton House-2, 3rd Floor, 4th B Cross Road, 5th Block, Kormangala, Behind Empire Hotel Bangalore, Karnataka - 560 034.","phone":"8123200700","profile":"Java Full Stack Developer \nAffluent Global Services Private Limited","description":"This is a Full-time opportunity with Affluent Global Services Private Limited Work Experience: 3 to 15 Years Job Location: Bangalore Notice Period: Immediate/ 15 Days Required Skills: Very strong in Java Coding Strong in Backend development Experience in Product Development Spring, Hibernate If you are interested send me your profile on harihara@affluentgs.com or Walkin directly to below address- Walk-in Date/ Time: 10th February - 14th February , 11 AM onwards Interview Venue: Affluent Global Service Private Limited Patton House-2, 3rd Floor, 4th B Cross Road, 5th Block, Kormangala, Behind Empire Hotel Bangalore, Karnataka - 560 034. Contact Person- Hari Hara-D (8123200700)","location":"Bangalore","experience":"3 - 15 Years"},{"date":"11 - Feb - 2020","skills":"Front desk operations, General Administration, Guest Relations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"SpiceJet Limited, Plot No. 319, Udhyog Vihar, Phase-4 Gurugram, Haryana - 122 016","phone":"Not Provided","profile":"Front Office Executive - Administration \nSpice Jet Limited","description":"We are conducting walk-in interviews for the position Front Office Executive- Administration in our Administration Department on 11th Feb '20 from 10:00 am till 12:00 noon (Tuesday) Designation: Front Office Executive - Administration (Female Only) Educational Qualification: Graduate (Any Stream) Job Location: Gurugram JOB RESPONSIBILITIES: * Attending Guest. * Attending Calls * Maintaining the reception area * Take care of the courier entry * Handling candidates for interviews. * Coordination with departments internally REQUIRED SKILLS: * Good verbal communication skills in both Hindi and English. * Candidate should have prior experience in front desk customer experience Kindly report at the below mentioned address and do carry a copy of below listed documents: 1) PAN CARD 2) ADHAAR CARD/PASSPORT/VOTERS ID CARD 3) 10th, 12th & Graduation (Mark sheet/ Certificate) Age Criteria - 21 - 28 Years Dress Code - Formals Date - 11th February 2020 (Tuesday) Timing -10:00 am -12:00 noon Venue - Plot No. 319, Udhyog Vihar, Phase-4 Gurugram, Haryana - 122 016","location":"Gurgaon","experience":"0 - 1 Years"},{"date":"12 - Feb - 2020","skills":"Software Testing, Manual/ Automation Testing, Database testing","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"NIIT Technologies Limited, 223 -224, Udyog Vihar, Phase-I, Gurgaon, Haryana - 122 002.","phone":"Not Provided","profile":"Software Testing Engineer \nNIIT Technologies Limited","description":"Candidate should be BCA/ MCA/ B-Tech with 1 to 4 years Experience/ Diploma/ Training in Manual - Automation Testing. Must have good knowledge/ experience specific to software testing or Database testing. Solid experience with testing tools, techniques, processes, methodologies. Should have experience in managing testing utilizing both manual and with automated testing tools. Experience with development and implementation of business and applications systems testing strategy and framework, including functional, system integration and performance testing, GUI testing, regression testing and smoke testing. Know-how of Applications systems testing with automation tools, white box and black box, and the preparation of Automation framework for testing. Experience in defining test strategy, RTM & test planning, test cases. Must have exposure to ETL/ DW/ BI testing with Data Analysis skills Candidates should be comfortable working in Night shifts(Mainly Evening Shifts). Both side free cab facility will be provided within Hiring Zone. Interested candidates are requested to directly visit us at the below mentioned address: NIIT Technologies Limited 223 -224, Udyog Vihar, Phase-I, Gurgaon, Haryana - 122 002. Land Mark: MDH and S&D Building Contact Person: Anika Walk in Drive on 12th February, 2020 Interview Timing: 3:00 PM to 5:00 PM","location":"Gurgaon","experience":"1 - 4 Years"},{"date":"14 - Feb - 2020","skills":"Automation Testing, Selenium Web Driver with JAVA","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Ingram Micro SSC Private Limited, Unit No. G 2, Second Floor, Akruti Corporate Park, LBS Marg, Kanjurmarg West, Mumbai - 400 078.","phone":"Not Provided","profile":"QA Automation Tester \nIngram Micro (India) Private Limited","description":"Candidate should have minimum 3 to 4 years work experience as QA and at least 2 to 3 years experience in executing and maintaining automated test scripts. Knowledge and working experience on Test Automation Framework using Selenium. Hands on automation developer using C#/Java and Selenium Web driver. Good understanding of testing concepts of Manual testing, E2E Testing, Functional & Nonfunctional testing, System Integration testing and Regression testing Should have experience using TestNG framework Solid coding skills and object-oriented programming concepts Should have experience and knowledge of API testing Experience working in an Agile development environment - SCRUM is a plus Prepare/Review Test Cases, Execute and Report test cycles for both Manual and Automated tests Understanding of web-based application and architecture Experience using a Test management tool: JIRA-Xray/ Test Rail/ Test Manager/ HP ALM or any other leading tools Demonstrates excellent process, documentation, team participation and problem-solving skills Testing experience of an eCommerce domain would be added advantage API Automation experience using Rest Assured/Java would be plus, but not essential Walk-in Date: 14th February 2020, (Friday) Timing: Between 8.30 am to 11.30 am Interview Venue: Ingram Micro SSC Private Limited Unit No. G 2, Second Floor, Akruti Corporate Park, LBS Marg, Kanjurmarg West, Mumbai - 400 078. Contact Person- Ameya","location":"Mumbai","experience":"3 - 5 Years"},{"date":"12, 13, 14 - Feb - 2020","skills":"Software Testing, Writing test plans and Test cases","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Ashore Systems Private Limited, Meridian Plaza, 5th Floor, Above WS Bakers, Near to University Chowk S B Road, Pune","phone":"9921100498","profile":"Software Tester \nAshore Systems Private Limited","description":"Candidate should have minimum 1 to 2.5 years of experience in Software Testing, Writing test plans and Test cases. Hands on experience in Mobile Application Testing both Android & IOS Apps. Backend database testing in Microsoft SQL environment including validating stored procedures, jobs and triggers. Hands on Experience on Payment Gateways Developing, documenting and maintaining functional test cases and other test artifacts like the test data, data validation, harness scripts and automated scripts. Identifying any potential quality issues as per defined processes and escalating potential quality issues immediately to management Interested candidates can come directly for an interview. Walk-in Date/ Time: 12th February - 14th February , 11 AM onwards Interview Venue: Ashore Systems Private Limited Meridian Plaza, 5th Floor, Above WS Bakers, Near to University Chowk S B Road, Pune Contact Person- Minal (9921100498)","location":"Pune","experience":"1 - 3 Years"},{"date":"11, 12, 13 - Feb - 2020","skills":"Automation Testing, Appium, JMeter, Selenium","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Hurix Systems Private Limited, Unit # 102, 1st Floor, Multistoried Building, SEEPZ - SEZ, Andheri (East), Mumbai - 400096","phone":"8657534393","profile":"Automation Testers \nHurix Systems Private Limited","description":"Looking for Automation testers for Mumbai location who can join immediately Work Experience: 1- 4 Years Candidates should join within 15 days Experience working on Automation Testing Experience working on Appium, JMeter Must have worked on Selenium API and Web based testing Hands on experience on Java Walk-in Date: 11th - 13th February 2020 Time: 10.00 AM - to 4.00 PM Only Interview Venue: Hurix Systems Private Limited Unit # 102, 1st Floor, Multistoried Building, SEEPZ - SEZ, Andheri (East), Mumbai - 400096 Interested candidates can mail their resume to nafisa.shaikh@hurix.com Or call on 8657534393 Kindly note that SEEPZ has certain regulations for entry-exit in the premises and hence you'll need a gatepass which will be arranged by us. For this, please share a scanned copy of your passport size photograph and Aadhaar card copy.","location":"Mumbai","experience":"1 - 4 Years"},{"date":"11, 12, 13, 14, 15 - Feb - 2020","skills":"General Administration, Front Office and Client Meeting","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Big-C Mobiles Private Limited, Bigc Towers, 5th left of Image Hospital, Madhapur Hyderabad","phone":"7330750888","profile":"Front Office Executive \nBig-C Mobiles Private Limited","description":"Candidate should be Any Graduate with 0 to 3 years of experience in General Administration, Front Office and Client Meeting. Should have excellent communication skills Job Responsibility- 1. Coordinating Director's Schedule 2. Coordinating Client meeting 3. Coordinating Board Meetings 4. Manning Admin Process Walk-in Date/ Time: 8th February - 15th February , 10 AM onwards Interview Venue: Big-C Mobiles Private Limited Bigc Towers, 5th left of Image Hospital, Madhapur Hyderabad Contact Person- Vegunta Sri Yamini ( 7330750888 )","location":"Hyderabad","experience":"0 - 3 Years"},{"date":"11, 12, 13, 14, 15 - Feb - 2020","skills":"Front Desk, General Administration, Receptionist Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Imperia Structures Limited, 512, 5th Floor, Suncity Business Tower Golf Course Road, Sector 54, Gurugram, Haryana","phone":"9643104159","profile":"Front Office Executive/ Receptionist \nImperia Structures Limited","description":"Educational Qualification: Minimum Graduate (Female Only) Experience: Minimum 1 year on same profile Age limit: Up to 30 Year Office Timing: 10 AM to 6:30 PM (2nd & 4th Saturday off) Salary: Up to 30k Required Skills/ Experience: Prior experience as a receptionist or in related field. Consistent, professional dress and manner. Excellent written and verbal communication skills. Competency in Microsoft applications including Word, Excel, and Outlook. Good time management skills. Experience with administrative and clerical procedures. Able to contribute positively as part of a team, helping out with various tasks as required. Receptionist Responsibilities: Greet clients and visitors with a positive, helpful attitude. Assisting clients in finding their way around the office. Preparing meeting and training rooms. Answering phones in a professional manner, and routing calls as necessary. Assisting colleagues with administrative tasks. Sorting and distributing mail. Scheduling appointments. Walk-in Date/ Time: 11th February - 15th February from 11 AM onwards Interview Venue: Imperia Structures Limited 512, 5th Floor, Suncity Business Tower Golf Course Road, Sector 54, Gurugram, Haryana Contact Person: Mr. Amanpreet Singh","location":"Gurgaon","experience":"1 - 6 Years"},{"date":"11, 12, 13, 14, 15, 17, 18, 19, 20 - Feb - 2020","skills":"Front Office/ Guest Relations Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"AstraZeneca India Private Limited, C/O Sodexo Facility Management India Pvt. Limited, Ramanujan IT City, 10th &amp; 11th Floor Neville Tower 2nd Floor Hardy Towers, Tharamani, Chennai - 600 113.","phone":"9962026287","profile":"Front Office Executive (Female) \nSodexo Food Solutions (India) Private Limited","description":"Sodexo Food Solutions (India) Private Limited is looking for Front Office Candidates with pleasing personality and good communication for our Tharamani Location Chennai. CANDIDATES with minimum of 6 months experience in Front Office/ Guest Relations Management Female Candidates only can apply for this post. Must have good communication skills Should have a pleasing personality Minimum UG Qualification is must Walk-in Date: 11th - 20th February 2020 Timings: 10 AM to 4 PM Interview Venue: AstraZeneca India Private Limited C/O Sodexo Facility Management India Pvt. Limited Ramanujan IT City, 10th & 11th Floor Neville Tower 2nd Floor Hardy Towers, Tharamani, Chennai - 600 113. Contact Person- Mr. Sivakumar E - Site Manager Phone: 9962026287 Interested candidates can send your updated resume to gopalakrishnan.s@sodexo.com","location":"Chennai","experience":"1 - 3 Years"},{"date":"11, 12, 13, 14 - Feb - 2020","skills":"Front office/ Receptionist Activities, Stock Inventory, Facility Management & General Administration","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"MeritTrac Services Private Limited, #12/5, Market Square, 4th floor, Kaikondarahalli, Varthur Hobli, Sarjapur Main Road, Bangalore - 560 035.","phone":"9901866499","profile":"Front Office/ Admin Executive \nMeritTrac Services Private Limited","description":"Candidate should be Any Graduate with 1 to 4 years of experience in Front office/ Receptionist Activities, Stock Inventory, Facility Management & General Administration. Would be responsible for Front Office management of the Bangalore Corporate Office. To ensure smooth business operations, by providing required facilities, in turn providing more productive time for the business Role & Responsibility- 1. Front Office Management Support in the office's administrative tasks so that it always runs smoothly as an organized office engenders effective business operations Receiving visitors at the front desk by greeting and directing them appropriately Answering, screening and forwarding incoming phone calls Coordinating for the distribution of incoming mails / couriers. Updating the Contact lists and extension list of all employees. Ensure reception area is tidy and presentable Provide basic and accurate information in-person and via phone/email Update calendars and blocking conference rooms. Perform other clerical duties such as filing, maintaining registers and records etc. 2. Facilities Helpdesk- Managing Facilities service request tickets. 3. Exam Center Booking: Pariksha center to be booked based on the requirement and tracker to be maintained also to ensure the upkeep of pariksha center. 4. Conference Call- Responsible for management of bridge calls and its payments. 5. Stationary and Printing Management - To procure stationary and manage optimum stock. 6. Courier Services - Verify the courier delivery status and maintain the tracker on day to day basis. 7. Meeting Arrangements - To ensure conference room are maintained and necessary requirements are available as per booking. 8. First Aid - Basic first aid to be maintained always as per the standard list provided. 9. Weekly Report - Facilities activities weekly report submission. Walk-in Date/ Time: 11th - 14th February 2020, 11 AM onwards Interview Venue: MeritTrac Services Private Limited #12/5, Market Square, 4th floor, Kaikondarahalli, Varthur Hobli, Sarjapur Main Road, Bangalore - 560 035. Landmark- Opposite to Motherhood Hospital/ Above More store Contact person- K. Pushpalatha (HR Team)","location":"Bangalore","experience":"1 - 4 Years"},{"date":"11, 12, 13, 14 - Feb - 2020","skills":"Selenium/ Automation testing, OOPs Concepts, C, C++, SQL and Java","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Biz2Credit InfoServices Private Limited, 9th Floor, Express Trade Tower-2 Block A, Sector 132, Noida","phone":"Not Provided","profile":"Software Testing Engineer \nBiz2Credit InfoServices Private Limited","description":"Candidate must have excellent understanding of Computer Science fundamentals - OOPs Concepts, C, C++, SQL and Java. Must have deep understanding of testing and its various types. Candidates with Selenium/ Automation testing training will be preferred. Deep understanding of data modeling and data architecture Knowledge of Automation and functional testing is an advantage. Walk-in Date/ Time: 11th February - 14th February, 10 AM onwards Interview Venue: Biz2Credit InfoServices Private Limited 9th Floor, Express Trade Tower-2 Block A, Sector 132, Noida Contact Person- Neha","location":"Noida","experience":"0 - 1 Years"},{"date":"11, 12, 13, 14 - Feb - 2020","skills":"Automation & Manual Testing, Functional/ Performance/ Regression Testing, Test cases","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Auth Bridge Research Services Pvt. Limited, Plot No. 123, Second Floor, Udyog Vihar Phase 4, Gurgaon - 122 015.","phone":"Not Provided","profile":"Automation Test Engineer \nAuth Bridge Research Services Pvt. Limited","description":"Candidate must be excellent Automation & Manual Tester with core focus on functionality. Can independently develop different (Functional/ Performance/ Regression) test cases from requirements. Has strong exposure to web based application testing. Hands on with writing web automation tests using Selenium Web driver. Has exposure to Defect Management and related tools including JIRA,Mantis. Has exposure to variety of open source testing tools including Postman, Jmeter, Burp security testing tool Hands on with scripting using any scripting language including javascript or programming language including C, C#,Java etc . Knowledge of Rest & Soap web services testing using any tool & its automation,preferably with postman or SOAP UI . Good Communication Skills,written & speaking . Team contribution & grow along with others should be work motto. Walk-in Date/ Time: 11th February - 14th February , 11 AM onwards Interview Venue: Auth Bridge Research Services Pvt. Limited Plot No. 123, Second Floor, Udyog Vihar Phase 4, Gurgaon - 122 015. Contact Person- Anuradha Yadav","location":"Gurgaon","experience":"4 - 5 Years"},{"date":"12, 13, 14 - Feb - 2020","skills":"Regression Testing, Application Testing, Quality Assurance, Test Engineering, Field Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"TurningPoint Software Solutions (Pvt) Limited, No. 20, Park Area, 9th A Cross, Wilson Garden Bangalore - 27","phone":"Not Provided","profile":"Senior QA/ Testing Engineer \nTurningPoint Global Solutions Pvt. Limited","description":"Candidate should have Bachelor's degree or its equivalent in computer science, information technology, engineering, or related technical field with 3 to 5 years of overall experience in application testing. Testing Certificate would be an advantage MUST have good analytical ability to breakdown problem statements into solutions MUST have worked on an Agile based development project and familiar with associated tools like JIRA, confluence. Working knowledge oftesting tools, source control systems (Git, SVN) Strong written and verbal communication skills and the ability to follow verbal/written instructions Ability to troubleshoot assigned issues and also the ability to meet tight project deadlines Ability to work extended hours, off-hours and/or weekends, as required, in support of the company's business needs. Working knowledge MySQL, Mongo DB would be an advantage Working knowledge Linux/UNIX would be an advantage Working knowledge Telecom Domain would be an advantage Preferred Skills: Working experience on different kinds of testing viz., Functional, System, Acceptance, Regression and non-functional testing. Working experience of creating test plans and test-case documents. Hands-on knowledge of continuous integration and deployment tools and technologies. Working experience on Agile based software development model (Scrum, Kanban etc) Walk-in Date: 12th - 14th February 2020 Timings: 11.30 am - 1.30 pm Interview Venue: TurningPoint Software Solutions (Pvt) Limited No. 20, Park Area, 9th A Cross, Wilson Garden Bangalore - 27 Contact Person- Deepika M","location":"Bangalore","experience":"3 - 5 Years"},{"date":"15 - Feb - 2020","skills":"Software Testing, Appium, Manual Testing, Performance Testing, Core Java, QA Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Hurits Consulting Private Limited, No. 376/A, 1st Floor, Obeya Verve, Opposite to KLAY play school, 5th Main, Near Rajesh Jewellery, Sector 6, HSR Layout, Bangalore - 560 102.","phone":"6366672974","profile":"QA/ Manual Tester \nHurits Consulting Private Limited","description":"Candidate should have experience in testing multi-tiered applications developed using Java/ J2EE related technologies. Must have solid experience in Mobile and Web both iOS and Android Testing. Ability to write, execute and analyse test results. Experience writing functional test cases. Ability to write Database queries is must. Having knowledge of Automation testing be added advantage Create tests plans, test cases, test strategy, running tests, implementing build and test infrastructure & test automation Walk-in Date/ Time: 15th February 2020, 9 AM onwards Interview Venue: Hurits Consulting Private Limited No. 376/A, 1st Floor, Obeya Verve, Opposite to KLAY play school, 5th Main, Near Rajesh Jewellery, Sector 6, HSR Layout, Bangalore - 560 102. Contact Person- Rani Phone: 6366672974","location":"Bangalore","experience":"3 - 5 Years"},{"date":"12 - Feb - 2020","skills":"Technical Support, Technical Helpdesk, Customer Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"DXC Technology India Private Limited, Maruti Concorde Business Park, Service Road, Konappana Agrahara, Electronics City, Bengaluru, Karnataka - 560 010.","phone":"Not Provided","profile":"Technical Support Engineer \nDXC Technology India Private Limited","description":"Only Graduates/ Freshers or with 1 to 3 years of experience Must have good infrastructure domain knowledge Should have good communication skills in English Benefits- Two Way Cabs provided from us 5 Days Working 2 Days Off Additional shift allowance will be provided. Ready to work in global shift Walk-in Date: 12th February 2020 (Wednesday) Time : 11:00 AM to 1:00 PM Interview Venue: DXC Technology India Private Limited Maruti Concorde Business Park, Service Road, Konappana Agrahara, Electronics City, Bengaluru, Karnataka - 560 010. Point of Contact : Gopala BR List Of Mandatory Documents to carry for interview 1) Pan Card 2) Aadhar card 3) 10th Marks card 4) 12th Marks card 5) Degree Certificate & Last sem marks card 6) If Experience (Relieving Letter/ Full and Final Settlement/ Service Certificate/ Offer Letter) Interview Rounds: Group Discussion/ Written Test/ Operations Round","location":"Bangalore","experience":"1 - 3 Years"},{"date":"12, 13, 14, 15 - Feb - 2020","skills":"Technical Support, Voice Process, Customer Support","qualification":"Diploma, B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Tech Mahindra Campus Sez, Hi-tech city, near Rai Durga Metro Station, Hyderabad.","phone":"Not Provided","profile":"Technical Support Associate \nTech Mahindra Limited","description":"Qualification: Any Graduate/ Undergraduate/ Postgraduate can apply Experience: 6 months in Technical Support (OR) 1 year in Customer Support Candidate should be from International voice background Should have excellent communication skills Should have basic technical knowledge NOTE: Freshers are not eligible Shifts : US Rotational Shifts 5 Days a week (Rotational & Split week off) 2 way transport provided. Interested candidates directly walk-in at the below mentioned venue- Tech Mahindra Campus Sez, Hi-tech city, near Rai Durga Metro Station, Hyderabad. Point of contact: Jahangir (Please mention ' Jahangir' on 1st page of your resume) Interview timing - 12 PM to 3 PM","location":"Hyderabad","experience":"1 - 4 Years"},{"date":"12, 13, 14 - Feb - 2020","skills":"Technical Support, Customer Support, US Process","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Porteck India Infoservices Private Limited, D - 179, Near ExtraMarks, Sector - 63, Noida","phone":"0120-4356400","profile":"Technical Support Executive \nPorteck India Infoservices Private Limited","description":"Candidate must have atleast 6 months of experience into Technical Support. Should have good communication skills in English language Must be willing to work in US shifts Immediate joiners preferred Job Responsibility- Research, diagnose, troubleshoot and identify solutions to resolve customer issues. Taking calls with server, printer, router and antivirus issues from the US customers. Exposure to Exchange, Office 365 Walk-in Date/ Time: 12th February - 14th February , 12 PM onwards Interview Venue: Porteck India Infoservices Private Limited D - 179, Near ExtraMarks, Sector - 63, Noida Phone# 0120-4356400/ 401 Contact - Recruitment Team (4356400)","location":"Noida","experience":"1 - 4 Years"},{"date":"15 - Feb - 2020","skills":"Technical Support, Desktop Support, Networking, Remote Desktop","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"HCL Technologies Limited, First Floor Tower B Lotus Business Park Sector 127, Noida","phone":"Not Provided","profile":"Desktop Support Engineer \nHCL Technologies Limited","description":"Technical Requirements- Phone support experience necessary. Technical Service desk or technical call center experience is necessary. Disciplined, systematic problem solving skills required. Windows Operating systems Clients: Windows 7, Windows Vista, Windows XP, Windows 2000 Servers: Windows 2000, Windows 2003, Windows 2008 Knowledge of Active Directory, Exchange 2003/ 2007 ITSM ticketing tools such as Remedy, HP Service Center, Remote desktop connectivity applications like SMS, Bomgar, WebEx, Live Meeting, and Windows Native tools Internet browsers (e.g. Explorer, Chrome, Firefox), Support for laptop, desktops, and printers PDA and blackberry support Other Skills/ Experience: Ability to successfully provide Hardware/ Software/ Network problem analysis and resolution support over the phone. ITIL knowledge of V2 or V3 especially on Service Desk, Incident, Problem, and Change Walkin Interview on 15th February 2020 (between 11 AM to 3 PM) Interview Venue: HCL Technologies Limited First Floor Tower B Lotus Business Park Sector 127, Noida Interested candidates can send their updated CV on- surabhi.srivastava@hcl.com","location":"Noida","experience":"0 - 2 Years"},{"date":"12, 13, 14 - Feb - 2020","skills":"Technical Support, Voice Process, Customer Support","qualification":"Diploma, B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Hinduja Global Solutions Limited, AMR Tech Park,2nd floor, Bommanahalli, Next to Oxford Engineering College, Bangalore-68","phone":"9620528909","profile":"Technical Support (Voice Process) \nHinduja Global Solutions Limited","description":"Hinduja Global Solutions Limited, is hiring Technical Support (Voice Process) Freshers for the Premier Business Process Profile Requirement: 10+2 /10+3(Diploma) / Any Degree. Candidate should possess Excellent Communication Skills Should be good at analytical ability (simple mathematical calculations) Candidate should be flexible working in night shifts Should possess basic knowledge on internet & its devices 5 Days working + 2 Days Off Cab Facility shall be provided both sides (within boundary limits). Roles & Responsibilities: - Performing the basic troubleshooting step to resolve the query - Take ownership of the call and drive first call resolution - Looping the necessary department for a quick solution in a timely manner - Document the troubleshooting steps as per the process requirement - Deliver excellence as per the process metrics Walk-in Date/ Time: 12th February - 14th February , 12 PM onwards Interview Venue: Hinduja Global Solutions Limited AMR Tech Park,2nd floor, Bommanahalli, Next to Oxford Engineering College, Bangalore-68 Contact Person- Athar","location":"Bangalore","experience":"0 - 2 Years"},{"date":"11, 12 - Feb - 2020","skills":"Manual and Functionality Testing, Bug tracking tool like Bugzilla/ Jira","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Hurix Systems Private Limited, Old No. 10, New No. 34, Taylors Road, Kilpauk, Chennai - 600 010.","phone":"9840442523","profile":"Manual Testing Engineer \nHurix Systems Private Limited","description":"Candidate must have strong knowledge in Manual and Functionality Testing Understand and analyze Business, Functional, and Technical requirements of the project Knowledge in using any of the bug tracking tool like Bugzilla/ Jira Interested candidates can walk in for F2F interview with your updates resume to the below Venue: Walk-in Date/ Time: 10th February - 12th February , 11 AM onwards Interview Venue: Hurix Systems Private Limited Old No. 10, New No. 34, Taylors Road, Kilpauk, Chennai - 600 010. Contact Person- Parag Khude","location":"Chennai","experience":"1 - 2 Years"},{"date":"10, 11, 12 - Feb - 2020","skills":"Non Voice Process, Back Office Operations","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Hexaware BPS- Prince Info City II 2nd Floor, No. 283/3A Old Mahabalipuram Road, Kandanchavadi, Chennai- 600 096.","phone":"9156735477","profile":"Back Office Executive \nHexaware Technologies Limited","description":"Eligibility: Any Graduate Or Experienced can apply Shifts : Rotational 24*7 Salary : Upto 15.5 k/- In Hand 1 rotational week off Limited Openings apply now Interested applicants can directly walk in for interview between 11:00 am - 8:00 pm at the below mentioned address- Hexaware BPS- Prince Info City II 2nd Floor, No. 283/3A Old Mahabalipuram Road, Kandanchavadi, Chennai- 600 096. Contact Person- Mansi Mokashi Kindly mention 'HR Mansi' on top of your resume","location":"Chennai","experience":"0 - 1 Years"},{"date":"8 - Feb - 2020","skills":"OOPS and MVC frameworks in PHP, PostgreSQL, MySQL or MS SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"DBXento Systems Private Limited, Fourth Floor, Tower 9, SEZ, Magarpatta City, Pune - 411 013.","phone":"7774033591","profile":"PHP Developer \nDBXento Systems Private Limited","description":"Candidate must have Bachelors degree in Computer Science or a related field. Should have 2 - 7 years of experience with web application development Must have strong experience in OOPS and MVC frameworks in PHP. Database experience on any of the following: PostgreSQL, MySQL or MS SQL Server (Preferably PostgreSQL). Knowledge of software design patterns. Basic understanding of front end technologies (JavaScript, Ajax, etc.). Experience participating in agile and fast-paced software development methodologies. Experience of collaborating in a cross-functional agile team Good verbal and written communication skills Good to Have: Experience in front end development Knowledge of Microservices architecture. Understanding of 12 factor Apps. Understanding of Service Oriented Architectures and RESTful Web Service best practices. Well versed with cloud computing concepts. Experience of unit testing Walk-in Date: 8th February 2020 Timings: 9 AM to 2 PM Interview Venue: DBXento Systems Private Limited Fourth Floor, Tower 9, SEZ, Magarpatta City, Pune - 411 013. Contact Person- Swapnil Khade Phone No: 7774033591","location":"Pune","experience":"2 - 7 Years"},{"date":"8, 9 - Feb - 2020","skills":"jQuery, Ionic Framework, MySQL, Javascript, PHP, Cordova","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Acorn Tech, Co-win, Gracia Society, R/H No. C-01, Shakar Kalat Nagar Behind Sanket Inn Hotel, Near bhumkar chowk, Wakad, Pune - 411057.","phone":"Not Provided","profile":"PHP/ Full Stack Developer \nAcorn Tech","description":"Our client, a UK based company with offices in India, wishes to recruit an experienced PHP Developer. The right candidate will have a great attitude and will have ample opportunities to advance their career in India and abroad, if wanted! Ideal candidate should have: Two years experience in PHP Experience in jQuery, Javascript and HTML Should know responsive design Ideally should know codeigniter or other MVC framework Advantageous if they know hybrid mobile framework Walk-in Date/ Time: 8th February - 9th March , 10 AM onwards Interview Venue: Acorn Tech Co-win, Gracia Society, R/H No. C-01, Shakar Kalat Nagar Behind Sanket Inn Hotel, Near bhumkar chowk, Wakad, Pune - 411057. Contact Person- Sawan","location":"Pune","experience":"2 - 6 Years"},{"date":"14 - Feb - 2020","skills":"Vue.JS, PHP/ Laravel, HTML5, CSS2/3, and standard Java Script.","qualification":"B.E./B.Tech, MCA/PGDCA","address":"The Residency Hotel,1075, Avinashi Road, P N Palayam, Coimbathore - 641 018.","phone":"Not Provided","profile":"PHP Full Stack Developer \nMKS Vision Private Limited","description":"Job Title: PHP Full Stack Developer (Web Development) Work Experience: 5+ Years Job Location: Hyderabad Full Stack Web Developer is responsible for working with both front end and back end technologies. From the conceptual phase through project completion, the full stack developers need to be proficient with providing feedback and ideas, writing code that is clean and organized, meet coding standards set by the team, and troubleshooting bugs. Our front-end development is expected to be mobile-first, and we primarily use Vue.JS, PHP/ Laravel, HTML5, CSS2/3, and standard JavaScript. Job Responsibilities: Developing responsive/ adaptive code that is mobile-first Understanding how to support future browsers while maintaining functionality in older browsers such as IE11 Working with UX/ Creative to design user interactions/micro animations Understand performance and techniques associated with improving performance Walk-in Date/ Time: 14th February 2020, 11 AM onwards Interview Venue: The Residency Hotel,1075, Avinashi Road, P N Palayam, Coimbathore - 641 018. Contact Person- Amit","location":"Coimbatore","experience":"5 - 10 Years"},{"date":"10, 11, 12, 13, 14 - Feb - 2020","skills":"PHP/ MySQL, MVC based Code Igniter PHP Framework and Zend","qualification":"B.E./B.Tech, MCA/PGDCA","address":"AAPC India LLP. Logix Techno Park, 3rd Floor, Tower C, Sector 127, Noida. Opposite HCL Gate No 1. Nearest Metro Station: Okhla Bird Sanctuary","phone":"9999630511","profile":"PHP Developer \nAmerican Academy of Professional Coders","description":"AAPC India is looking for PHP Develope at Noida location (Nearest Metro Station: Okhla Bird Sanctuary and Botanical Garden). Job Timings: 1:00 PM to 10:00 PM IST Candidate should have 3 to 5 years of experience in Web Application Development using PHP/ MySQL of which at least three years in any MVC based Code Igniter PHP Framework and Zend. Must have experience in developing Rich UI based web application using HTML 2.0 web standards, AJAX, JavaScript libraries and framework such as JQuery and Prototype etc. Experience in building high-volume, highly scalable custom websites Should have strong Database Knowledge Should have worked in Agile Scrum framework Walk-in Date/ Time: 10th February - 15th February , 12 PM onwards Interview Venue: AAPC India LLP. Logix Techno Park, 3rd Floor, Tower C, Sector 127, Noida. Opposite HCL Gate No 1. Nearest Metro Station: Okhla Bird Sanctuary Contact Person- Purnima Arora (9999630511)","location":"Noida","experience":"3 - 5 Years"},{"date":"9, 10, 11, 12, 13, 14 - Feb - 2020","skills":"Back Office, Advanced excel, Office Assistance, Business services","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Tech Mahindra Business Services Limited, Spectrum Towers, Ground Floor, Mindspace, Malad (West), Mumbai - 400 064.","phone":"Not Provided","profile":"Back Office Executive \nTech Mahindra Business Services Limited","description":"Tech Mahindra Business Services Limited, is currently hiring for Back Office role for Mumbai Location. Looking for Candidates with experience working on excel and Advance Excel. Should be comfortable with 24*7 shifts Freshers can also apply. Nature of employment - Third party Contract Interested candidates walk in with your updated profile Date: 9th - 14th February , 12 PM onwards Interview Venue- Tech Mahindra Business Services Limited Spectrum Towers, Ground Floor, Mindspace, Malad (West), Mumbai - 400 064. Contact Person- Lakshmi Kumar","location":"Mumbai","experience":"0 - 4 Years"},{"date":"10, 11, 12, 13, 14, 17, 18, 19, 20, 21 - Feb - 2020","skills":"Back Office Operations, Data Entry, Back Office Processing, Customer Care","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Info-X Software Technology Pvt Limited, 335 Udyog Vihar Phase 2, Gurugram - 122016","phone":"9910768257","profile":"Back Office Executive \nInfo-X Software Technology Private Limited","description":"Excellent Opportunity to Work for an International US Back office process Only Graduates with streams like BA, B Com, B Sc, etc.may apply. Candidate should be good at Typing speed with Good Accuracy. (Typing speed of less than 25 wpm is not eligible) Minimum experience: 1 to 6 Years. US based Back Office process (Business to Business Campaign). Processing of Documents for US based clients. Kindly Walk-in for Interview till 28th February 2020 Timings 4:00 PM to 6:00 PM at below mention address. (No Interviews on Saturday and Sunday) Interview Venue: Info-X Software Technology Pvt Limited 335 Udyog Vihar Phase 2, Gurugram - 122016 Contact Sanjay: 9910768257 Email: pramod@infoxwebware.net","location":"Gurgaon","experience":"1 - 6 Years"},{"date":"10, 11, 12, 13 - Feb - 2020","skills":"Back Office Operations, Non Voice Process","qualification":"Diploma, B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Srhi Rathi Steel Company Limited, A 29, Sector 65, Near Mamura Chawk Noida","phone":"9873574051","profile":"Back Office Executive \nSrhi Rathi Steel Company Limited","description":"Minimum Qualification: Graduation (Any Specialization) Or Diploma holder Candidate should have good communication skills Must have Basic Computer Knowledge Walk-in Date/ Time: 10th - 13th February 2020, 12 AM onwards Interview Venue: Srhi Rathi Steel Company Limited A 29, Sector 65, Near Mamura Chawk Noida Contact Person- Ms. Ankita Srivastava Phone No. 9873574051","location":"Noida","experience":"0 - 1 Years"},{"date":"10, 11, 12, 13, 14, 17, 18, 19, 20, 21 - Feb - 2020","skills":"Back Office Operations, Non Voice Process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Hinduja Global Solutions Limited, No. 115, Sri Chamundi Towers, C-2 Building, Hosur Main Road, Garvebhavi Palya, Bangalore - 560 068.","phone":"7829533724","profile":"Back Office Operations- Fresher \nHinduja Global Solutions Limited","description":"Any Graduate- Fresher or Experienced (NO - BE, B.TECH, Post Graduates) Desired Skills: Good communication & analytical skills Basic computer knowledge Must be willing to work in rotational shifts 2 Way cab facility provided 5 Days working, 2 Days Off Walk-in Date: 10th to 21st February 2020 (Monday to Friday) Time Slot: 10 am - 2 pm Walk-in Location: Hinduja Global Solutions Limited No. 115, Sri Chamundi Towers, C-2 Building, Hosur Main Road, Garvebhavi Palya, Bangalore - 560 068. Landmark: Sai Baba temple Contact HR Person: Pooja- 7829533724","location":"Bangalore","experience":"0 - 1 Years"},{"date":"10, 11, 12, 13, 14 - Feb - 2020","skills":"back office, International bpo","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Powerweave Software Services Pvt. Limited, Plot No.27 Road No.11 Behind Tunga Paradise Opposite Gemini House Andheri (East), Mumbai - 400 093","phone":"022-40079322","profile":"Back Office Executive \nPowerweave Software Services Pvt. Limited","description":"Position: Back Office Executive Timings: Night Shift 7:30 PM to 5:30 AM (No Transport Facility) Job Location: Mumbai (Andheri-East) Position Type: Full Time Employment Work Experience: 1 - 6 Years Salary: Depends on Last drawn. Age Criteria: 35 Years Person must have knowledge of MS word, MS excel and MS office including internet explorer. Good Typing speeds. Might also be required to enter product details from printed catalogs into excel sheets or web forms. Freshers are Welcome!!!! Interview Time: 6th February - 14th February (Monday to Friday) Timings: 6:00 PM to 8:00 PM Interview Venue: Powerweave Software Services Pvt. Limited Plot No.27 Road No.11 Behind Tunga Paradise Opposite Gemini House Andheri (East), Mumbai 400093 Contact Person- Megha Haldankar Phone: 022-40079322","location":"Mumbai","experience":"1 - 6 Years"},{"date":"7, 8 - Feb - 2020","skills":"Java Trained/ Fresher","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Meshark Software Technologies Private Limited, Manjeera Trinity Corporate, 13th Floor, #12A02 A2, Plot No. S2, Kukatpally, JNTU Road, Hyderabad - 500072","phone":"7331199975","profile":"Java Developer/ Fresher \nMeshark Software Technologies Pvt. Limited","description":"Meshark Software Technologies Pvt. Limited, is having an immediate requirement for Java Developer. Candidate should be excellent in coding skills in Java Must have good communication skills Walk-in Date/ Time: 4th February - 8th February , 11 AM onwards Interview Venue: Meshark Software Technologies Private Limited Manjeera Trinity Corporate, 13th Floor, #12A02 A2, Plot No. S2, Kukatpally, JNTU Road, Hyderabad - 500072 Contact Person: Chandhini Phone No. 7331199975","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"8 - Feb - 2020","skills":"ASP .NET, Web Service, ADO .Net, MVC 4/5, HTML, HTML5, XML, JavaScript","qualification":"B.E./B.Tech, MCA/PGDCA","address":"XL Health Corporation India Private Limited, Search Results Sarakki Industrial Layout, Dollar Layout, 3rd Phase, J. P. Nagar, Bengaluru, Karnataka - 560 078","phone":"Not Provided","profile":"ASP .Net Developer \nOptum Global Solutions (India) Private Limited","description":"Candidate must be proficient with Microsoft .NET development using C#. In depth knowledge and experience with web development technologies including ASP .NET, Web Service, ADO .Net, MVC 4/5, HTML, HTML5, XML, JavaScript (Vue JS), JSON, JQUERY, AJAX and CSS, database development including relational database design, MS SQL. In depth knowledge and experience with distributed application development: Web API, WCF, LINQ Knowledge or Experience with SQL Server Technologies like - SSIS, SSRS would be an added advantage Walk-in Date/ Time: 8th February 2020 from 9 AM onwards Interview Venue: XL Health Corporation India Private Limited Search Results Sarakki Industrial Layout, Dollar Layout, 3rd Phase, J. P. Nagar, Bengaluru, Karnataka - 560 078 Email : ranjith_k@uhc.com","location":"Bangalore","experience":"4 - 8 Years"},{"date":"15 - Feb - 2020","skills":"Java, pring Boot/ Spring MVC, NodeJS/ Express, Angular, React, ExtJS, Vue","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Paxcom India Private Limited, Unit No. 64, Hartron Complex, Sector 18, Electronic City, Gurugram, Haryana - 122 001.","phone":"Not Provided","profile":"Java Developers \nPaxcom India Private Limited","description":"Candidate should have 2 to 8 years of experience with Java development, and/or other object-oriented programming languages. Should have atleast 1+ years' experience with one or more JS frameworks: NodeJS/ Express, Angular, React, ExtJS, Vue. Must have good experience with Spring Boot/ Spring MVC Walk-in Date/ Time: 15th February 2020, 10 AM onwards Interview Venue: Paxcom India Private Limited Unit No. 64, Hartron Complex, Sector 18, Electronic City, Gurugram, Haryana - 122 001. Contact Person- Madhuri","location":"Gurgaon","experience":"2 - 8 Years"},{"date":"8 - Feb - 2020","skills":"Java, J2EE application servers: Tomcat, WebLogic, WebSphere","qualification":"B.E./B.Tech, MCA/PGDCA","address":"ASG Worldwide Private Limited, 12th Floor, Cambridge Tower. Ramanujan IT City, OMR, Taramani Chennai, Tamil Nadu - 600 113.","phone":"9962055448","profile":"Software Engineer - Java \nASG Worldwide Private Limited","description":"Required (Primary) Skills- Demonstrable professional expertise in Java programming Proficiency with data structures, algorithms, multi-threading, object-oriented programming and design patterns. Strong diagnostic and problem-solving skills . Familiarity with software development for the Windows and/or Linux operating systems. Experience working with Web Services (REST) with an understanding of RESTful service design Practical knowledge of working with one or more of the following J2EE application servers: Tomcat, WebLogic, WebSphere. Development tools such as Eclipse IDE, IntelliJ, Maven, (Gradle, Ant), Artifactory, Jenkins, GIT Essential Duties & Responsibilities- Enhance, maintain, and support our cutting-edge Content Services Platform, primarily using Java. Participate in the full software development life-cycle: requirements analysis, design, coding, testing, debugging, problem resolution. Work in an agile environment with a cross-functional team staffed in the USA and India Provide guidance to Customer Support and field representatives in resolving problems and implementing new solutions at customers sites as necessary Walk-in Date/ Time: 8th February 2020, 9 AM onwards Interview Venue: ASG Worldwide Private Limited 12th Floor, Cambridge Tower. Ramanujan IT City, OMR, Taramani Chennai, Tamil Nadu - 600 113. POC: Gopi (9962055448)/ Bala (9003019525)","location":"Chennai","experience":"3 - 5 Years"},{"date":"9 - Feb - 2020","skills":"Java, Groovy, JavaScript, Python, PHP, .NET or similar","qualification":"B.E./B.Tech","address":"Ericsson India Global Services Pvt. Limited, 7th Floor, Tower A, Knowledge Boulevard Sector 62, Noida - 201 301.","phone":"Not Provided","profile":"Java/ Groovy Automation Developer \nEricsson India Global Services Pvt. Limited","description":"Candidate should have Bachelors degree, preferably B.E or B.Tech or higher with a major in CS or IT with At least 2 years of software development experience (Java, Groovy, JavaScript, Python, PHP, .NET or similar); knowledge web services is a plus. knowledge and skills on any RDBMS, preferably on Unix/ Linux platforms, e.g., Oracle, Sybase, PostgreSQL, etc. Alternatively, MS SQL Server knowledge and skills Experience in improving and maintaining automation, robotics, networks, and processing systems. Good working knowledge of packet networking. Development experience on this would be a definite plus Knowledge of XML/ XSL/ XSLT Good working knowledge on Unix / Linux platforms & MS Windows Server Technical knowledge of TCP/IP protocols and Telecom environment/ architecture would be an added advantage SLCM knowledge, skills and experience would be a significant advantage, especially proficiency in tools like JIRA,CVS, GIT, etc Walk-in Date/ Time: 9th February 2020, 9 AM onwards Interview Venue: Ericsson India Global Services Pvt. Limited 7th Floor, Tower A, Knowledge Boulevard Sector 62, Noida - 201 301. Contact Person- Tomin","location":"Noida","experience":"3 - 8 Years"},{"date":"8 - Feb - 2020","skills":"Core Java, JSP/ Servlet, MS SQL, SQL Queries & Stored Procedures","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Godrej Infotech Limited, Plant 19A, 2nd floor, Pirojsha Nagar, Vikhroli (West), Mumbai.","phone":"022-67964084","profile":"Core Java Developer \nGodrej Infotech Limited","description":"Educational Qualification: Full-time Graduates (Only) Work Experience: 2 to 5 Years Notice Period- Maximum 45 days Job Location: Mumbai (Vikhroli) Primary Skills- 1) Must have strong background/ knowledge in Core Java and JSP/ Servlet 2) MS SQL database design and writing SQL Queries & Stored Procedures. 3) Sound knowledge in HTML, CSS, AJAX and JavaScript. 4) Should be capable of doing Code Review and testing for team members. 5) Should have sound knowledge of Software Development Secondary Skills- 1) Have Good knowledge of React JS, Angular 2 or above. Walk-in Date: 8th February 2020 Timing: 9 AM to 12 PM Interview Venue: Godrej Infotech Limited, Plant 19A , 2nd floor, Pirojsha Nagar, Vikhroli (West), Mumbai. Entry from Gate 4 (Near Petrol Pump) Contact - Ms. Shwetha Shetty (022-67964084)","location":"Mumbai","experience":"2 - 5 Years"},{"date":"7, 10, 11, 12, 13, 14 - Feb - 2020","skills":"Core Java, J2EE, Java, Spring.","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Mahindra & Mahindra Limited, Signal Hill Avenue via Reay Road, Sewree, Opp Raj Oil Mills, Next to Reliance IT Centre,","phone":"Not Provided","profile":"Junior Java Developers \nBristlecone India Limited","description":"Work Experience Required: 1 to 3 Years Required Skills: Core Java, J2EE, Java, Spring Duration: 1 Year Contarct (Extendable) Job Location: Mumbai (Sewri) Walk-in Date/ Time: (Monday to Friday) 4th - 14th February 2020, 10 AM onwards Interview Venue: Mahindra & Mahindra Limited Signal Hill Avenue via Reay Road, Sewree, Opp Raj Oil Mills, Next to Reliance IT Centre, Contact Person: Rajesh Kumar","location":"Mumbai","experience":"1 - 3 Years"},{"date":"10, 11, 12, 13, 14 - Feb - 2020","skills":"MVC C# Entiry Framework MS SQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"RR Donnelley India Outsource Private Limited, 6th floor, Prestige Polygon tower, 471, Anna Salai, (Opposite Raintree hotel) Teynampet, Chennai - 18","phone":"Not Provided","profile":".Net Developers \nRR Donnelley India Outsource Pvt. Limited","description":"Candidate must be able to demonstrate a good understanding of the information technology environment/ infrastructure utilized for the job. Demonstrate good knowledge of the assigned information technology platform and ability to convey that understanding to others in work teams on projects. Good knowledge and ability to set up test scenarios. Primary Skill set: MVC C# Entiry Framework MS SQL Secondary Skills: HTML5, Javascript, JQuery Angular Microsoft Azure Functions Agile Methodology Angular JS Walk-in Date/ Time: 10th February - 14th February , 12 PM onwards Interview Venue: RR Donnelley India Outsource Private Limited, 6th floor, Prestige Polygon tower, 471, Anna Salai, (Opposite Raintree hotel) Teynampet, Chennai - 18 Contact Person- Jones Vasanth","location":"Chennai","experience":"3 - 8 Years"},{"date":"8 - Feb - 2020","skills":"C#, SQL Server, ASP .Net, MVC","qualification":"B.E./B.Tech, MCA/PGDCA","address":"InfoVision Labs India Private Limited, Office No. 2 4th Floor, Block IT 7, Qubix Business Park, Blue Ridge, Phase 1 Hinjawadi, Pune - 411 057","phone":"8778797160","profile":"Senior .Net Developer \nInfoVision Labs India Private Limited","description":"Candidate should be able to do planning & tracking of team Agile & SCRUM required Java Script, HTML, CSS 3 required (Debajyoti to confirm on this point) Must have used SQL 2014 version Knowledge on Scripting & Writing Queries Required Resource must have below 3 skill sets: Good in Full-stack Exposure of minimum 2 WEB Applications Aptitude to clear with knowledge on ALGORITHMS, PROBLEM Statement, Multithreading Walk-in Date/ Time: 8th February 2020 from 10 AM onwards Interview Venue: InfoVision Labs India Private Limited Office No. 2 4th Floor, Block IT 7, Qubix Business Park, Blue Ridge, Phase 1 Hinjawadi, Pune - 411 057","location":"Pune","experience":"5 - 8 Years"},{"date":"8 - Feb - 2020","skills":".Net Trained/ Fresher","qualification":"B.E./B.Tech, MCA/PGDCA","address":"RM Education Solutions Private Limited, 2nd Floor Ganga Building, Technopark Phase III, Trivandrum, Kerala","phone":"Not Provided","profile":".Net Trainee/ Software Engineer \nRM Education Solutions Private Limited","description":"Qualification: Graduate with no experience (2019 pass-outs with no backlogs) Preferred Graduated in B.Tech (IT/ CS/ EEE/ ECE), BCA, MCA, BSc/ MSc (IT/ CS) Work Experience: Fresher/ 0 to 1 Year Walk-in Date/ Time: 8th February 2020, 10 AM onwards Interview Venue: RM Education Solutions Private Limited, 2nd Floor Ganga Building, Technopark Phase III, Trivandrum, Kerala Contact Person- Sreehari","location":"Trivandrum","experience":"0 - 1 Years"},{"date":"10 - Feb - 2020","skills":".NET Framework, C#, MVC, WCF, Web Services, Web APIs, JavaScript (jQuery), Angular JS","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Cirrius Technologies Private Limited, Cirrius Centre A-19 MIDC Area Cross Road B Andheri (East) Mumbai - 400 093.","phone":"Not Provided","profile":".Net Developer/ Fresher \nCirrius Technologies Private Limited","description":"Candidate should have 0 to 1 year of experience/ knowledge into .NET Frameworks 2.0/ 3/ 5/ 4.0, C#, MVC, WCF, Web Services, Web APIs, JavaScript (jQuery), Angular JS. Must have expert knowledge on ADO .Net, Entity Framework. Someone majorly into development, programming. Walk-in Date/ Time: 10th February 2020, 10 AM onwards Interview Venue: Cirrius Technologies Private Limited Cirrius Centre A-19 MIDC Area Cross Road B Andheri (East) Mumbai - 400 093. Land Mark : JB Nagar/ Chakala (Metro Stn.), MIDC Police Station Reporting Time between 10.00 AM to 11.00 AM Contact - Sapna Rajbhar- HR Executive Interview Process- 1. Aptitude Round 2. HR Round 3. Technical Round Who have attended interview in last 6 month are not eligible to attend interview.","location":"Mumbai","experience":"0 - 1 Years"},{"date":"10, 11 - Feb - 2020","skills":"ASP .Net/ VB .Net, MS SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA","address":"P2B Ace Solutions Private Limited, A-38, First Floor, Road No. 11, Wagale Industrial Estate, Thane (West) - 400 604","phone":"8691047842","profile":"Software Developer - ASP .Net \nP2B Ace Solutions Private Limited","description":"Candidate should have 0 to 2 years of experience in Software Development using ASP .Net/ VB .Net with database knowledge in MS SQL Server Walk-in Date/ Time: 10th - 11th February 2020, 11 AM onwards Interview Venue: P2B Ace Solutions Private Limited A-38, First Floor, Road No. 11, Wagale Industrial Estate, Thane (West) - 400 604 Tel: 022-25827444/ 25804877","location":"Mumbai","experience":"0 - 2 Years"},{"date":"7 - Feb - 2020","skills":"Java, Spring Boot, RESTFUL Web Services","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Wipro, Building 2, Candor Tech Space Tikri | Sector 48, Gurgaon","phone":"Not Provided","profile":"Java Developer \nWipro HR Services (India) Private Limited","description":"Education & Certification B. Tech/ BE- CSE, ECE,IT, MCA is MUST apply Mandatory Skills: Java, Springboot, RESTFUL Webservices. Work Experience: 2 to 4 Years Candidate should have good technical background in Java, Spring Boot, RESTFUL Web Services. Must have excellent knowledge of Core Java and Spring Should have working knowledge on web services Should have worked in distributed agile model and continuous integration Work Conditions- 11.30 am -9 pm Walk-in Date- 7th February 2020 Interview Timing- 9:00 AM - 1:00 PM Interview Location- Wipro, Building 2, Candor Tech Space Tikri | Sector 48, Gurgaon Interview Process:- Each round will be elimination round Interview duration -3-5 hours","location":"Gurgaon","experience":"2 - 4 Years"},{"date":"10, 11, 12, 13, 14 - Feb - 2020","skills":".Net, ASP .Net, VB .Net, Angular JS, Javascript, jQuery","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Infosense Global, A-103, InfoTower-3, Infocity, Gandhinagar - 382009, Gujarat.","phone":"9687644166","profile":".Net Developers \nInfosense Private Limited","description":"Candidate should have 0 to 3 years experience as .NET Developer Job Location: Gandhinagar, Gujarat. Required Skills: .Net, ASP .Net, VB .Net, Angular JS, Javascript, jQuery Walk-in Monday to Friday between 3:00 pm to 6:00 pm till 14th February, 2020 Interview Venue: Infosense Global A-103, InfoTower-3, Infocity, Gandhinagar - 382009, Gujarat. Contact Person- Bhumika Vaghela Phone: 9687644166","location":"Gandhinagar","experience":"0 - 3 Years"},{"date":"8 - Feb - 2020","skills":"Java, J2ee, Core Java","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Oottru Technologies Private Limited, Pride Hulkul, #116, 802, Lal Bagh Main Road, SGN Layout, Doddamavalli, Sudhama Nagar, Bengaluru, Karnataka - 560 027.","phone":"Not Provided","profile":"QA Testing Engineer/ API Testing \nOottru Technologies Private Limited","description":"Person should be BE/ B.Tech/ MCA with 3 to 8 years of experience working with product companies or top service organizations. Hands on experience on API Testing tools like Postman, Rest Assurred, HTTP Client or Rest Sharp using Java or C# programming language. Must be strong in Programming using Java or C#. Hands on experience with testing, analyzing and troubleshooting communication between front-end and API/ Web Services Nice to have: Hands on experience on UI Automation using Selenium, Cucumber or Specflow using Java or C# Experience is designing the automation framework for API as well as UI Hands on experience on designing Xpath Walk-in Interview on 8th February 2020 (Saturday) Time: 10 AM to 2 PM Interview Venue: Oottru Technologies Private Limited Pride Hulkul, #116, 802, Lal Bagh Main Road, SGN Layout, Doddamavalli, Sudhama Nagar, Bengaluru, Karnataka - 560 027. Contact - Talent Acquisition Team ( 22223055 )","location":"Bangalore","experience":"3 - 8 Years"},{"date":"8 - Feb - 2020","skills":"R Functions, Labour Laws, Employee Management, Business Operations, HR Operations","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"RIG Enterprise Applications, Plot 682, 4th Floor BabuKhan Rasheed Plaza Jubliee Hills Road No. 36, Hyderabad","phone":"9535121978","profile":"HR Process Associate \nRIG Enterprise Applications","description":"Candidate should have Any Bachelor Degree with Passion of HR and 0 - 2 years of experience in HR operations. Highly motivated self-starter with a competitive personality, drive to exceed goals, and strong attention to detail. Must have exceptional communication skills, both oral and written, coupled with a positive and energetic phone presence Creative, ambitious and very detail oriented Ability to work independently as well as part of a team in a fast-paced environment Must be willing to work in US/ Night Shift Job Responsibility- Manage training, transition and implementation initiatives in various HR functions. Work on any Employee Management System to streamline processes that support acquisition, management & immigration of workforce at client locations. Develop a good understanding of client companies, their industry, what they do and their work culture and environment Focus on HR process development & improvement; create awareness amongst employees, review & documentation. Regular Meetings with clients to co-ordinate business operations. Knowledge of compliance of all Labour Law/statutory registers & Immigration of US is a plus Those who are ready to work in NIGHT SHIFT (USA TIMINGS) then only attend the interview on 8th February, Saturday from 11:00 AM to 2:00 PM (maximum) Interview Venue: RIG Enterprise Applications Plot 682, 4th Floor BabuKhan Rasheed Plaza Jubliee Hills Road No. 36, Hyderabad Land Mark: Opposite to Brand factory building Next to Madhapur Metro Station Contact Person- Pavitra (9535121978)","location":"Hyderabad","experience":"0 - 2 Years"},{"date":"6, 7, 8 - Feb - 2020","skills":"Automation Testing with UFT/ QTP using VB Scripting","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Karani Projects Private Limited, Ground Floor, Gala No. 29, Sona Udyog Premises, Parsi Panchayat Road, Andheri (East), Mumbai - 400069","phone":"Not Provided","profile":"HR Administrator (Female) \nKarani Projects Private Limited","description":"Qualification: Any Degree or Diploma in Human Resources. Work Experience: 3 - 7 years working experience in a similar capacity. Added advantage if available immediately or within short-notice. Key Requirements: Proven work experience as an HR Administrator, HR Administrative Assistant or relevant role Experience with HR software, like HRIS or HRMS Computer literacy (MS Office applications, in particular) Thorough knowledge of labor laws Excellent organizational skills, with an ability to prioritize important projects Strong phone, email and in-person communication skills BS in Human Resources or relevant field. Walk-in Date/ Time: 6th February - 8th February , 10 AM onwards Interview Venue: Karani Projects Private Limited Ground Floor, Gala No. 29, Sona Udyog Premises, Parsi Panchayat Road, Andheri (East), Mumbai - 400069 Contact Person- Tejas Sidnal","location":"Mumbai","experience":"3 - 7 Years"},{"date":"6, 7 - Feb - 2020","skills":"Lateral Hiring, Bfsi Recruitment, Bulk Hiring, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"IDBI Federal Life Insurance Company Limited, 22nd Floor, A Wing, Marathon Futurex, NM Joshi Marg, Lower Parel East, Mumbai, Maharashtra - 400 013.","phone":"9653466730","profile":"HR Executive/ Recruiter \nIDBI Federal Life Insurance Co. Limited","description":"Applicant should be well versed with working on sites as Naukri, Monster, Shine, LinkedIn, IIMjobs etc. Must have understanding Clients JDs & Specifications. Taking initial rounds of interviews and Scheduling for further rounds of discussion. Maintaining daily data. Handling end to end recruitment. Screening and Short listing profiles from Job portals, Networking sites and Referrals. Walk-in Date: 6th - 7th February 2020 Time- 10.30 am to 5.00 pm Interview Venue: IDBI Federal Life Insurance Company Limited 22nd Floor, A Wing, Marathon Futurex, NM Joshi Marg, Lower Parel East, Mumbai, Maharashtra - 400 013. Contact Person- Nayana Panicker ( 9653466730 )","location":"Mumbai","experience":"0 - 5 Years"},{"date":"7 - Jan - 2020","skills":"HR/ Recruitment, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"K12 Techno Services Private Limited, #41 Trinetra Building, New BEL Road Mayuri Signal, Behind Punjab National Bank, AG's Layout, Mathikere, Bengaluru, Karnataka - 560 054.","phone":"6364899690","profile":"HR Intern/ Executive (Fresher) \nK12 Techno Services Private Limited","description":"Candidate must have excellent communication skills with willingness and passion to learn new things by grabbing the opportunity. Should have good experience with Microsoft Excel & Quick learner. Experience in recruitment preferred Job Responsibility- Recruitment/ Talent Acquisition Demonstrating the use of multiple channels in sourcing by attracting candidates Posting job ads and organizing resumes and job application Assisting with leadership hiring and other miscellaneous HR processes. Walk-in Date/ Time 7th February 2020, 10 AM onwards Interview Venue: K12 Techno Services Private Limited #41 Trinetra Building, New BEL Road Mayuri Signal, Behind Punjab National Bank, AG's Layout, Mathikere, Bengaluru, Karnataka - 560 054. Contact Person- Komal (6364899690)","location":"Bangalore","experience":"0 - 1 Years"},{"date":"7 - Feb - 2020","skills":"Software Testing, Automation Testing, Manual Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"AGS Transact Technologies Limited, AGS House, Plot No. EL 82 & 83, TTC Industrial Estate, MIDC Electronic Zone, Navi Mumbai - 400 705.","phone":"Not Provided","profile":"Software Tester \nAGS Transact Technologies Limited","description":"Candidate should have experience in Manual Testing/ Automation Testing Should be working in ATM/ POS/ IMPS Switch Support Should be working in banking domain. Walk-in Date/ Time: 7th February 2020, 9 AM onwards Venue Details- AGS Transact Technologies Limited AGS House, Plot No. EL 82 & 83, TTC Industrial Estate, MIDC Electronic Zone, Navi Mumbai - 400 705. Contact Person : Rasika HR team 1st floor","location":"Mumbai","experience":"1 - 4 Years"},{"date":"8 - Feb - 2020","skills":"Production Support, Desktop Support, Application Support","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Financial Software & Systems Private Limited, 1st Floor, Kalpataru Prime, Plot, 3, Road No. 16, Nehru Nagar, Wagle Industrial Estate, Thane West, Mumbai, Maharashtra - 400 604.","phone":"8390013136","profile":"Application Support Engineer \nFinancial Software & Systems Pvt. Limited","description":"Educational Qualification: BE, B.Tech, MSC, MCA, B.SC (Computer Science) Sound Knowledge on BASE24, Banking Applications, SQL, Linux & Unix, Only Male candidates can apply. Must have excellent Customer Service Skills and Aptitude. Resolving technical issues relating to banking through Emails / telephonic support. Liaising with internal / external teams for resolving technical issues at the earliest. Liaising with vendors for issues related to UPI, Mpay, PG Providing reports to Bank as per requirement analysis. Should have good communication Skills Knowledge of Products and Processes Ability to analyze and solve Semi-technical issues. Willingness to work in night shifts and 24 / 7 environment Responsible for providing technical support for client/ Bank in timely manner. Notice period : Immediate Job Location : Mumbai If interested kindly share your resume on Gagandeepkaurr@fss.co.in and Walking for interview on 8th February 2020 at 9:00 am. Interview Venue: Financial Software & Systems Private Limited 1st Floor, Kalpataru Prime, Plot, 3, Road No. 16, Nehru Nagar, Wagle Industrial Estate, Thane West, Mumbai, Maharashtra - 400 604. Contact Person- Gagandeep Phone No. 8390013136 Kindly bring updated resume, salary slips, offer letter, passport size photo while coming for interview.","location":"Mumbai","experience":"1 - 6 Years"},{"date":"15 - Feb - 2020","skills":"Technical Support, Application Support, Production Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Seclore Technology Private Limited, Excom House, 2nd floor, Behind HP petrol pump, Near Sakinaka Metro Sakinaka, Mumbai - 72","phone":"Not Provided","profile":"Application Support Engineer \nSeclore Technology Private Limited","description":"Candidate should have 3 to 5 years' experience in a Technical Support role, preferably application support. Hands on experience across the following core technologies. Must have good communication skill and learning attitude. Operating systems - Windows Server/Windows Client Infrastructure technologies - AD, DNS, DHCP, IIS Working knowledge of Relational DB principles and methodologies - MS-SQL, Oracle Managed Customers from regions such as NA, EMEA or APAC Ready to work on 24/7 support centre. Willing to work in night shifts Walk-in Interview on 15th February 2020 Time: 10 am - 5 pm Interview venue: Seclore Technology Private Limited Excom House, 2nd floor, Behind HP petrol pump, Near Sakinaka Metro Sakinaka, Mumbai - 72","location":"Mumbai","experience":"3 - 5 Years"},{"date":"8 - Feb - 2020","skills":"Orcale/ PL SQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Broadridge Financial Solutions (India) Private Limited, DivyaSree NR Enclave, EPIP Industrial Area, 1 EPIP Industrial Area, Whitefield, Bengaluru Karnataka - 560 066.","phone":"Not Provided","profile":"Oracle PL/ SQL Developer \nBroadridge Financial Solutions (India) Pvt. Limited","description":"Qualification: BE/ B.Tech/ MCA/ M.Tech/ MSc or equivalent 2-4 years of experience in Oracle PL/ SQL technology with strong RDBMS concepts. Experience in Oracle 11g, Toad or Oracle PL/SQL developer will be a plus Should have excellent problem solving skills. Should able to write high performance code. Ability to model, analyze and manage large volumes of data. Highly motivated with the ability to work well independently and within a team environment Experience in dealing with clients on a verbal and written basis. Excellent communication and written skills Walk-in Date: 8th February, 2020 - Saturday Time slot: 10:00 AM to 2:00 PM Interview Venue: Broadridge Financial Solutions (India) Private Limited, DivyaSree NR Enclave, EPIP Industrial Area, 1 EPIP Industrial Area, Whitefield, Bengaluru Karnataka - 560 066.","location":"Bangalore","experience":"2 - 4 Years"},{"date":"8 - Feb - 2020","skills":"Technical Support, Customer Support, Service Desk, Voice Process","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"DXC Technology (India) Private Limited, Maruti Concorde Business Park, Service Road, Konappana Agrahara, Electronics City, Bengaluru, Karnataka - 560 010.","phone":"Not Provided","profile":"Technical Support Engineer \nDXC Technology India Private Limited","description":"Qualification: Only Graduates (BE/ B.Tech/ BSc/ BCA/ MCA etc) Work Experience: Freshers with 0-1 years Experience Good communication in English Benefits- Good infrastructure domain knowledge Two Way Cabs provided from us 5 Days Working 2 Days Off Additional shift allowance will be provided. Ready to work in global shift Walk-in Date/ Time: 8th February 2020, 11 AM onwards Interview Venue: DXC Technology (India) Private Limited DXC Technology, Maruti Concorde Business Park, Service Road, Konappana Agrahara, Electronics City, Bengaluru, Karnataka - 560 010. Landmark: Near Electronic Bus stand, Service Road Contact Person- Gopala BR List Of Mandatory Documents to carry for interview 1 Pan Card 2 Aadhar card 3 10th Marks card 4 12th Marks card 5 Degree Certificate & Last sem marks card 6 If Experience (Relieving Letter/ Full and Final Settlement /Service Certificate / Offer Letter) Interview Rounds : Group Discussion/ Written Test / Operations round","location":"Bangalore","experience":"0 - 1 Years"},{"date":"7, 8, 10, 11, 12, 13 - Feb - 2020","skills":"Desktop Support, Troubleshooting, Networking, OS Installation","qualification":"B.E./B.Tech, MCA/PGDCA, Diploma","address":"Progressive Infotech Private Limited, No:177/1, 2nd Floor , 7th B, Main Road, 3rd Block Jayanagar, Bangalore - 560 011.","phone":"9101394095","profile":"Desktop Support Engineer \nProgressive Infotech Private Limited","description":"Education: Any Graduate or 3 Yrs. Diploma holder Work Experience: 1 to 2 Years Duties & Responsibilities: Installation and Roll out services of new desktops & laptops. Hardware fault diagnosis & isolation on desktops / laptops. First level of support on desktop / laptops under warranty / AMC with third part vendor & vendor coordination for L2/L3 & Spares support Installation and OS Support - Repair / Re-Installation or fresh Installation Installation and Software Support on Office Automation software, Anti-virus software, Email Client (Outlook), IE, Chrome & other Business Critical Applications Walk-in Date/ Time: 7th February - 13th February , 10 AM onwards Interview Venue: Progressive Infotech Private Limited No:177/1, 2nd Floor , 7th B, Main Road, 3rd Block Jayanagar, Bangalore - 560 011. Landmark- (NMKRV, College) Contact - Arunoday Chakraborty (9101394095)","location":"Bangalore","experience":"1 - 2 Years"},{"date":"8 - Feb - 2020","skills":"SQL Queries, Stored procedure, functions, SQL Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Cognizant Technology Solutions India Limited, Building No. 12A, 1st floor, Raheja Mind Space, Hi-tech city, Hyderabad - 500 081","phone":"Not Provided","profile":"Technical Support Engineer (SQL) \nCognizant Technology Solutions India Limited","description":"Walk In Interview for Technical Support Engineer (SQL Support) role at Hyderabad Location. Please find the below details for your reference. Skill: SQL Support Role Designation: Level 2 ork Experience: 2 - 4 years Notice Period : immediate only Shift : Flexible for Night shifts Candidates should have Minimum 15 years of education is mandate with supporting documents. Should be interested to work on SQL support role Not a developer Should have good understanding of SQL Statements. Has working knowledge on Types of Joins Syntax structure of SQL script Strong expertise in writing complex SQL Queries, Stored procedure, functions Expert understanding of SQL Server 2005, 2008, 2012 and SQL Server administration, troubleshooting. Joins , SQL Server , Data Warehouse , SSIS , T-SQL , Java script , SSAS , MSBI Excellent in Microsoft SQL Database Walk-in Interview on 8th February 2020 Timings: 10 am to 11:30 am Interview Venue: Cognizant Technology Solutions India Limited Building No. 12A, 1st floor, Raheja Mind Space, Hi-tech city, Hyderabad - 500 081","location":"Hyderabad","experience":"2 - 4 Years"}]}