{"Walkins":[{"date":"14, 15 - Apr - 2021","skills":"Lead Generation, Inside Sales, Banking Sales, Credit Card Operations","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"NVR Outsourcing & Management Services Pvt. Limited, 525, B Block, 5th,Floor, Chandhralok Complex, Paradise Ameerpet, Secunderabad - 500 003.","phone":"7801056330","profile":" Inside Banking Executive \nNVR Outsourcing & Management Services Pvt. Limited","description":"Educational Qualification :10+2, Any Degree Gender : Male / Females Both or Apply Age: 20 Years to 34 Years Job Locations : Hyderabad all areas Working Timings : Banking Timings Position: Branch Relationship Executives Walk-in Date/ Time- 14th to 15th April 2021, 10.00 AM - 4.00 PM Venue Details- NVR Outsourcing & Management Services Pvt. Limited 525, B Block, 5th,Floor, Chandhralok Complex, Paradise Ameerpet, Secunderabad - 500 003. Contact - Mounika (7801056330)  ","location":"Hyderabad, Secunderabad","experience":"0-1Years"},{"date":"15 - Apr - 2021","skills":"Customer Support, Reservations, Travel Process, Customer Care","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Spice Jet Limited, Building No. 321, Udyog Vihar, Phase 4, Gurgaon - 120 016.","phone":"Not Provided","profile":" Support Executive - Reservations \nSpice Jet Limited","description":"SpiceJet invites energetic and enthusiastic candidates to join them for Walk-in interviews on April 15th 2021 (10:00 AM to 11:00 AM) for the position of Executive - Reservations in our Reservations Department. Please find below details for the Walk in. Educational Qualification: Pursuing Graduation/ Graduate any stream Eligibility Criteria: 18 -27 Years Job Location: Gurgaon Required Skills- Communication skills good in Verbal (both Hindi and English ) & Written (English). Computer skills and typing knowledge will be added advantage. Confidence and ability to handle passengers and provide only the best customer service. The candidates should be willing to work in rotational shifts/ 24 x 7 Operations The job involves handling inbound and outbound calls of SpiceJet's external/ internal customers pertaining to bookings, re-schedulement, queries, complaint handling and facilitation over the call. To respond on the questions about airline regulations, assisting customers on their travel plans. Adherence to departmental productivity standards Additionally, Reservation Executive could be involved in offering selling competitive prices & packages Perks & Benefit : Pick-Up/ Drop Facility Interested candidates may walk- in with their updated resume at the below mentioned interview and venue details: Walk-in Date/ Time: 15th April 2021, 10.00 AM - 11.00 AM Venue Details- Spice Jet Limited Building No. 321, Udyog Vihar, Phase 4, Gurgaon - 120 016.  ","location":"Gurgaon","experience":"0-2Years"},{"date":"15 - Apr - 2021","skills":"Customer Relationship, Customer Support, Semi Voice/ Voice Process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"DTDC Express Limited, B14, TVK INDUSTRIAL ESTATE, GUINDY, CHENNAI - 600 032.","phone":"Not Provided","profile":" Client Relationship Executive \nDTDC Express Limited","description":"Candidate should be Any Graduate with excellent knowledge of Excel Need to taking care of Clients calls Tracking the shipment Handling E Mail queries Coordinating with sales team and operations team MIS report preparation Walk-in Date/ Time: 15th April 2021, 9.30 AM - 4.00 PM VENUE- DTDC Express Limited B14, TVK INDUSTRIAL ESTATE, GUINDY, CHENNAI - 600 032. Contact Person- Vijayalakshmi  ","location":"Chennai","experience":"2-7Years"},{"date":"13 - Apr - 2021","skills":"Handling Customer Queries, Travel Process, Customer Service","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"SpiceJet Limited, Building No. 321, Udyog Vihar, Phase 4, Gurgaon - 120 016","phone":"Not Provided","profile":" Customer Support Executive \nSpice Jet Limited","description":"We are conducting walk-in interviews for the position of Executive / Senior Executive in our Customer Experience Department on 13th Apr'21 from 10:00 am Till 11:00 am ( Tuesday) Educational Qualification: Graduate (Any Stream) Work Experience : 1- 5 Years Job Location: Gurugram Job Responsibilities: Handling mails from both internal & external customers Handling cases (Query / Request / Complaint / Appreciations) Handling billing inquiries Dealing with various internal departments Offering alternative solutions where appropriate with the objective of retaining customer's business Communicating with customers using web-based tools and demonstrates the associated proficiency writing/grammar and hence are able to write concise and clear emails and letters. Achieving a response time in accordance with set Company guidelines and requirements Making recommendations according to customers needs and complaints. Maintaining reports in excel Performing other duties as assigned by management Required Skill Sets: Excellent communication skills (verbal & written) Good working knowledge of Ms. Office (excel, PowerPoint, word) Strong decision making and problem solving ability Ability to work under pressure Qualities of being -Organized, Disciplined and Result Oriented Courtesy and professionalism to resolve customer issues with one call resolution Ability to be a change agent and bring about improvement in processes and procedures Comfortable with rotational shift Prior experience in customer service Benefits - Pick-Up/Drop Facility Age Criteria - 23 Yrs - 30 Yrs Kindly report at the below mentioned address and do carry your updated resume Dress Code - Formals Walk-in Date/ Time: 13th April 2021, 10 AM onwards Venue Details- SpiceJet Limited Building No. 321, Udyog Vihar, Phase 4, Gurgaon - 120 016  ","location":"Gurgaon","experience":"1-5Years"},{"date":"13 - Apr - 2021","skills":"Customer Support, Voice Process, Recovery/ Collections, Banking Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"iSON Xperiences India Private Limited, 2nd Floor, Concord @ Manthri Building, No. 10, Richmond Road, Bangalore - 560 025","phone":"7907365351","profile":" Customer Support - Banking Process \niSON Xperiences India Private Limited","description":"Immediate Opening For Collection and Recovery Agents For Leading Banking Process Must know two or more south Indian Languages or Fluency in Hindi Must. Roles and Responsibilities- Convincing the customer for the assigned recovery. Handling transactions, recovering the Debt, Maintaining the recovery data. This position is responsible for day-to-day operations. Work timings will be 9 am - 6 pm. 6 days working, one-day rotational week-off. Required Candidate profile- Should have good verbal communication skills and bold nature. Should be able to convince the customers and recover the debt. Should know English + two or more South Indian Languages. Should be Fluent in English + Hindi+ Kannada. Kannada, Telugu, Tamil, Language skill set preferred. Immediate joiners are preferred. Freshers are welcomed and a higher preference for candidates with a minimum of 6 months of experience in any relevant field. Work location Richmond Road, Bangalore. Age Limit: 18-30. DRA-certified people are preferred. Minimum Qualification- 12th pass or higher. (Graduates with backlogs are also considerable) Perks and Benefits Day Shift only. Attractive salary + incentives up to Rs.40000. No fieldwork involved. We provide the best growth opportunities. IJP opportunities open just after 3 months. Interested candidates are requested to walk-in directly to our office at the address mentioned below with the resume and ID proof. iSON Xperiences India Private Limited, 2nd Floor, Concord @ Manthri Building, No. 10, Richmond Road, Bangalore - 560 025 Landmark: Opposite Indiabulls Home Loans, Next to IIFL Building Interview Timing:- 10 am to 5 pm Contact:- Anju - 7907365351 Akhil - 7012940431 By any chance, if the call is not answered please text us on Whatsapp at 7012940431  ","location":"Bangalore","experience":"0-5Years"},{"date":"13 - Apr - 2021","skills":"Customer Service, Inbound Process, Customer Calling","qualification":"Diploma, B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Tech Mahindra Limited, No. 90/B-1, SBC Tech Park, Madras Thiruvallur High Road, Ambattur Industrial Estate, Chennai, Tamil Nadu - 600058.","phone":"9176985050","profile":" Customer Service Associate \nTech Mahindra Limited","description":"Role & Responsibilities: 1) Answering premium customer queries via call channel. 2) Establish a relationship and trust with customers by ensuring qualitative service. 3) Passion to work in a fast-paced, highly collaborative, and dynamic work environment Requirements: Required candidate with good English communication skills Speaking in one regional language i.e., Kannada is mandatory Qualification: Any Degree/ B.E/ B.TECH/ Diploma/ +2 Passed outs: - 2016 to 2019 only Interested candidates call or wahat's app to 9176985050 from 10:00 AM to 6:00 PM only to attend the interview or Walk-in directly to below given address- Tech Mahindra Limited No. 90/B-1, SBC Tech Park, Madras Thiruvallur High Road, Ambattur Industrial Estate, Chennai, Tamil Nadu - 600058. Walk-in Date/ Time: 13th April 2021, 9.30 AM - 1.00 PM Contact - Rakesh  ","location":"Chennai","experience":"0-4Years"},{"date":"13 - Apr - 2021","skills":"Backend Operations, Advanced Excel, Non Voice Operations","qualification":"Diploma, B.A., B.Com, B.B.A, B.Sc","address":"Matrix Business Services India Private Limited, Shree Mahamathi Towers No,17, Arulambal Street T. Nagar, Chennai - 600 017","phone":"Not Provided","profile":" Backend Process Executive \nMatrix Business Services India Pvt. Limited","description":"We are currently looking for candidates for the positions mention below for Chennai (T Nagar) Location. Key Requirements- a) Any UG Fresher/ 0-2 years experience in any backend operations b) Good Communication c) No Night shift d) Very Good in MS Office E) Looking for Immediate joiners Walk-in Date/ Time: 13th April 2021, 9.30 AM - 2.00 PM Venue Details- Matrix Business Services India Private Limited Shree Mahamathi Towers No,17, Arulambal Street T. Nagar, Chennai - 600 017. Near: Habibullha Road HDFC Bank) Contact - S.Prathap  ","location":"Chennai","experience":"0-2Years"},{"date":"12, 13, 14, 15, 16, 17, 18 - Apr - 2021","skills":"HR/ Recruitment, Talent Acquisition, Staffing","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Circle IT Solutions Private Limited, #501, Diamond Block, Lumbini Rockdale, Somajiguda, Hyderabad - 500 082.","phone":"9133366482","profile":" HR Recruiter & HR Staffing Analyst \nCircle IT Solutions Private Limited","description":"We are hiring HR Recruiter & HR Staffing Analyst (Junior level/ Mid-level/ Senior level) Educational Qualification: Any Graduate Work Experience: 1 to Years No freshers & No Remote Shift: Night Shift (6:30 PM IST to 3:30 AM IST Mon- Friday) Immediate Joinee Only need to apply Walk-in Date/ Time: 12th - 18th April 2021, 6.30 PM - 8.00 PM Venue Details- Circle IT Solutions Private Limited #501, Diamond Block, Lumbini Rockdale, Somajiguda, Hyderabad - 500 082. Contact - Mehaboob (9133366482) Please send your resumes to mehaboob@circleitsolutions.com Or call +91 9133366482  ","location":"Hyderabad","experience":"1-3Years"},{"date":"12, 13, 14, 15, 16, 17, 18 - Apr - 2021","skills":"US Staffing/ IT Recruitment","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Vegazva Engineering Private Limited, 411, Spaze I Tech Park, Tower A, Sector-49, Gurgaon - 122 018.","phone":"9354414708","profile":" US IT Recruiter (Fresher) \nVegazva Engineering Private Limited","description":"This is for those who are looking for a Great Opportunity to make a career in IT & Technology Recruitment/ HR ( US IT Recruiting) Looking for Graduated from 2018/ 2019/ 2020 Batches. MUST HAVE GREAT SPOKEN ENGLISH SKILLS Excellent Communication & Interpersonal skills Mandatory CAB FACILITIES WILL BE GIVEN TO EMPLOYEES LIVING IN GURGAON ONLY. Walk-in Date/ Time: 12th - 18th April 2021, 9.30 AM - 5.30 PM Venue Details- Vegazva Engineering Private Limited 411, Spaze I Tech Park, Tower A, Sector-49, Gurgaon - 122 018. Contact - Nitin Tyagi (9354414708)  ","location":"Gurgaon","experience":"0-1Years"},{"date":"12, 13, 14, 15, 16, 17, 18 - Apr - 2021","skills":"Data Entry, Back Office Operations, Banking Process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Cameo Corporate Services Limited, No.1, Subramanian Buliding, 5th Floor, Club House Road, Anna Salai, Chennai.","phone":"044-40020786","profile":" Data Entry Operators (Part Time) \nCameo Corporate Services Limited","description":"We have an Immediate Opening for Data Entry Operators for Banking Process at Chennai Location. Any Degree/ Diploma/ 10th/ 12th/ College Students Basic Typing Knowledge Male Candidate for Night Shift Work from Office, No Age Limits Job Responsibility: Bank Cheque Data Entry Typing speed and accuracy Flexible towards the working environment Adaptability towards the work culture Knowledge about banking industry Passion to achieve the Vision & Mission of company Office Days: Mon to Sat Sunday Holiday, 2nd and 4th Saturday Holiday Benefits for Employees: PF, ESIC, Bonus, Gratuity. Shift Timing: 9 PM to 1 AM (Night Shift Part Time) Working Hours: 4 Hours Walk-in Date/ Time: 12th - 18th April 2021, 10.00 AM - 3.00 PM Venue Details- Cameo Corporate Services Limited No.1, Subramanian Buliding, 5th Floor, Club House Road, Anna Salai, Chennai. Landmark:- Near Spencer Plaza, Opp. building to Senthur Hotel, Bank of Baroda Bank Contact - HR (044-40020786)  ","location":"Chennai","experience":"0-1Years"},{"date":"10 - Apr - 2021","skills":"MIS Preparation, Excel, MIS, VLOOKUP, MS Office","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Startek (Aegis Global Limited), Kudlu Gate, Bangalore - 560 068","phone":"7676470715","profile":" MIS Executive - Retail Operations \nAegis Customer Support Services Pvt. Limited","description":"Candidate should be Any Graduate with minimum 1 to 2 year of relevant experience Must have hands on experience working on Advance Excel & Google Sheets Hands on experience working on VBA Macros. Communication skills in English & Hindi are compulsory Complete Day shift Process. For those who are interested and eligible kindly walk-in for a F2F interview. Walk-in Date: 10th April 2021 Time: 10:30 AM- 5PM. Venue Details: Startek (Aegis Global Limited) Kudlu Gate, Bangalore - 560068 Contact Person: Likhith/ Sagar- 7676470715  ","location":"Bangalore","experience":"1-2Years"},{"date":"10 - Apr - 2021","skills":"HR/ Recruitment, Sourcing, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"HireWorks.in No. 3, Premalaya Building, 17th Street, Jai Nagar, Arumbakkam, Chennai - 600 106.","phone":"8248401569","profile":" HR Executive/ Recruiter \nSquare One Infosolutions Private Limited","description":"We Have huge Openings for HR Recruiter Only For Freshers Eligibility: Any Graduates can apply (2020 - 2021) MBA candidate would be preferable Candidates with Backlogs can also apply Complete Day Shift Salary : 12,000 CTC plus Incentives Job Responsibility- Sourcing candidates through Job portals, social platforms and other relevant resources End To End recruitment cycle Posting the job requirements on different portals Coordinating with the management on Profile feedbacks. Following up with the candidate till joining. Good communication skills. Should have a positive attitude and Analytical thinking Walk-in Date/ Time- 10th April 2021, 9.30 AM - 4.30 PM Venue Details HireWorks.in No. 3, Premalaya Building, 17th Street, Jai Nagar, Arumbakkam, Chennai - 600 106. Contact - Subash (8248401569)  ","location":"Chennai","experience":"0-1Years"},{"date":"10 - Apr - 2021","skills":"Claims Processing, Health Claims, General Insurance Claims, Motor Claims","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Bajaj Capital Limited, Bajaj House, 5th FLoor, Building No. 97, Nehru Place, New Delhi","phone":"9717957906","profile":" Back Office/ Claims Executive \nBajaj Capital Limited","description":"Urgently looking for candidates with more than 6 months of experience in Claims (Motor Claims, Health Claims) Roles and Responsibilities- Complaints Handling from all sources with proper records & interim updates to clients till resolution simultaneously working on retention of clients within the set resolution TAT. Handling misappropriation cases ; highlighting to HR and take required course to take it resolution & maintain records. Providing assistance to Legal team for facilitating info as required in coordination with principal companies. Notify & Discuss all critical complaints with channel heads; Using complaint information to improve service and sales standards where appropriate. Ensuring all relevant records received including ISO certification. Accountable & Ensuring for Vigilant monitoring & resolution - e mails & calls received at Customer Care Contact email ids & direct connects (calls) maintaining a proper record. Facilitating required reports on set frequency and as & when required. Adherence to Internal Protocols, Processes & Hygiene. Working on assignments which may be allotted time to time Walk-in Date/ Time: 10th April 2021, 10.30 AM - 4.30 PM Venue Details- Bajaj Capital Limited, Bajaj House, 5th FLoor, Building No. 97, Nehru Place, New Delhi Contact - Anshuman (9717957906)  ","location":"Delhi","experience":"1-6Years"},{"date":"10 - Apr - 2021","skills":"IT Recruitment, Sourcing, Relationship Management, Interviewing, Onboarding","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"HiringHut Solutions Private Limited, One Cowork, 2nd floor, Above KFC, Sony Signal, Koramangala, Bangalore - 34.","phone":"8951199357","profile":" IT Recruiter (Fresher) \nHiringHut Solutions Private Limited","description":"HiringHut Solutions Private Limited is looking for IT Recruiter-Fresher. Interested candidates can Walk-in to the mentioned address on the given date and time. Education: Any Bachelors Degree or MBA/ PGDM in HR Required Skills- Good command in verbal and written English communication skills Good Relationship Management skills with clients/ vendors Excellent analytical, presentation and interpersonal skills which includes email etiquettes Must have excellent Negotiation skills Roles & Responsibilities- Conversant with end-to-end recruitment process from sourcing to onboarding the candidates End to end recruitment; Includes, Sourcing the candidates from job portals, employee referrals, job postings in social media or job portals. And scheduling the candidates for interviews based on the panels availability and follow up for the feedback. Walk-in Date/ Time: 10th April 2021, 10.00 AM - 12.00 PM Venue Details- HiringHut Solutions Private Limited One Cowork, 2nd floor, Above KFC, Sony Signal, Koramangala, Bangalore - 34 Contact - Anju (8951199357)  ","location":"Bangalore","experience":"0-1Years"},{"date":"10 - Apr - 2021","skills":"IT Recruitment, Sourcing, Screening, Mass Mailing/ Job Posting","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"iSearch Consulting Services Pvt. Limited, Plot No. 26, 3rd Floor, 5th Main Road, Vijaya Nagar, Velachery, Chennai, Tamil Nadu - 600 042. Landmark - IDBI Bank Same Building - 3rd Floor","phone":"044-42122542","profile":" IT Recruiter/ HR Executive \niSearch Consulting Services Pvt. Limited","description":"Candidate must have strong Understanding of End to End Recruitment. Understanding of the Assessment of the Profile specific to the SDLC identifying the Candidates matching the Requirement fitment. Should be well versed with Mid Level - High Level Hiring. Good at sourcing and savy in Job Portals using the Features of the Same (Mass Mailing/ Job Posting) Should have excellent communication skills. Perks and Benefits - As Per Market Standards. Walk-in Date/ Time: 10th April 2021, 9.00 AM - 5.00 PM Venue Details- iSearch Consulting Services Pvt. Limited Plot No. 26, 3rd Floor, 5th Main Road, Vijaya Nagar, Velachery, Chennai, Tamil Nadu - 600 042. Landmark - IDBI Bank Same Building - 3rd Floor Contact No. 044-42122542  ","location":"Chennai","experience":"0-5Years"},{"date":"12, 13, 14, 15, 16 - Apr - 2021","skills":"C#, VB .Net, ASP .NET, HTML, AJAX, CSS, Web Services","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"CashLink Global Systems Private Limited, No. 5, Mezzanine Floor,Thapar House No. 37 (Old no., 43/44), Montieth Road, Chennai, Tamilnadu","phone":"Not Provided","profile":" .Net Developers \nCashLink Global Systems Private Limited","description":"Educational Qualification: BE/ B.Tech/ M.Tech or MCA Work Experience: Freshers/ 0 to 2 Years Location: Chennai (Egmore) Looking For Immediate Joinee (Male Freshers) Skills Required- Dotnet : C#, VB .Net Web Technology : ASP .NET, HTML, AJAX, CSS, Web Services Reporting Tools : Crystal Reports, SSRS Databases: SQL Server 2008 / 2012 / 2017, Oracle 11g Scripting, Markup Languages : JavaScript/ JQuery, XML, XAML Walk-in Date/ Time: 12th April - 16th April , 10.00 AM - 5.00 PM Venue Details- CashLink Global Systems Private Limited No. 5, Mezzanine Floor,Thapar House No. 37 (Old no., 43/44), Montieth Road, Chennai, Tamilnadu Contact - Sushma Yadav ( 8939875135 )  ","location":"Chennai","experience":"0-2Years"},{"date":"10 - Apr - 2021","skills":".Net, C# and/or ASP .NET, MVC, REST API, JSON, MS SQL/ SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Engro Technologies Private Limited, 4th Floor, Western Aqua Building, Opposite Tech Mahindra, Hitecth city, Hyderabad - 500 081","phone":"9121284559","profile":" .Net Developers \nEngro Technologies Private Limited","description":"Candidate must have strong working knowledge of .Net Proficient in {C# and/or ASP .NET}, with a good knowledge of their ecosystems Knowledge on Azure, MVC, REST API, JSON and knowledge on Hangfire and Autofac (optional) Knowledge on Redis and Solr HTML, CSS, JavaScript Strong understanding of object-oriented programming Skill for writing reusable libraries Experience with MS SQL/ SQL Server and MongoDB (optional) Experience with popular web application frameworks Familiarity with Windows Presentation Framework (optional) Knack for writing clean, readable, and easily maintainable code Understanding of fundamental design principles for building a scalable application Experience creating database schemas that represent and support business processes Basic understanding of Common Language Runtime (CLR), its limitations, weaknesses, and workarounds Experience implementing automated testing platforms and unit tests Knowledge on code versioning tools. Work Experience: 0 - 4 Years Notice period : Immediate - 15 days Walk-in Date/ Time: 10th April 2021, between 9.30 AM - 12.30 PM Venue Details- Engro Technologies Private Limited, 4th Floor, Western Aqua Building, Opposite Tech Mahindra, Hitecth city, Hyderabad - 500 081  ","location":"Hyderabad","experience":"0-4Years"},{"date":"8, 9, 10, 11, 12, 13, 14, 15, 16, 17 - Apr - 2021","skills":"Software Testing, Black Box Testing, Integration Testing, Manual Testing, Regression Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Srammram Technologies & Resources (OPC) Pvt. Limited, # 12/12A, C2, Second floor, Srinithi Apartments, Kandigai Street, Korattur, Chennai - 600 076.","phone":"9094102725","profile":" Software Testing Engineer \nSrammram Technologies & Resources (OPC) Pvt. Limited","description":"Candidate must have strong knowledge with hands on experience in software testing. Fair knowledge on Performance testing, Jmeter, Page speed/ load testing tools, Online emulators/ simulators. Knowledge on mobile App testing. Should understand the business flow as instructed to them and verify that the projects abide to the requirements. Ability to think of all scenarios that real users of the applications will face. To be able to analyze requirements from users perspectives. To be proactive to communicate the issues and get them resolved. To develop test cases and prioritize testing activities. Should have good interpersonal skill and problem solving skills. Should have excellent communication skills Should be Independent, self-motivated and problem-solving skills Capable of managing multiple complex tasks. Walk-in Date/ Time: 8th April - 17th April 2021, 9.30 AM - 5.30 PM Venue Details- Srammram Technologies & Resources (OPC) Pvt. Limited # 12/12A, C2, Second floor, Srinithi Apartments, Kandigai Street, Korattur, Chennai - 600 076. Landmark: Korattur DRJ Hospital - WAter Canal Road - 4th Left -Kandigai Street Contact- Rameshkannan ( 9094102725 )  ","location":"Chennai","experience":"2-5Years"},{"date":"8, 9, 10, 12, 13, 14, 15, 16 - Apr - 2021","skills":"Office Assistance, Front Desk, Office Administration, Front Office/ Receptionist Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"A-129/2, NIRANKARI COLONY, NEW DELHI, NORTH WEST DELHI, DELHI-110009","phone":"9311273580","profile":" Front Desk Executive (Female Only) \nCandid Optronix Private Limited","description":"We are looking for a pleasant Front Desk Executive to undertake all receptionist and clerical duties at the desk. You will be the face of the company for all visitors and will be responsible for the first impression we make. Roles and Responsibilities Greet and welcome guests as soon as they arrive at the office Answer, screen, forward and record incoming phone calls Ensure reception area is tidy and presentable, with all necessary stationery and material (e.g. pens, forms and brochures) Update calendars and schedule meetings Maintain the data on Excel of all the customers & visitors Kindly call in between 11:30 am to 4:30 pm for interview to be scheduled Contact Person: Ms. Anu (HR Head) Contact no- 9311273580 Please avoid calling on weekly off days  ","location":"Delhi","experience":"1-3Years"},{"date":"8 - Apr - 2021","skills":"Core Java, Multithreading, Arrays, Oops, Exceptions, Collections, Frameworks","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Sun Technology Integrators Pvt. Limited, No. 496, 5th Block,1st Stage, HBR Layout (a stop ahead from Nagawara towards to K. R. Puram) Bangalore - 560 043","phone":"8861722337","profile":" Trainee Java Developer \nSun Technology Integrators Private Limited","description":"We have openings for Trainee Java Developer position. Please share your updated CV to nandinis@suntechnologies.com and can attend the face to face interview on Thursday (8-4-2021) between 11:00 AM to 3:00 PM, if your candidature matches below the criteria's . Call letter is not mandatory. Carry your updated CV without fail. Please do not share your CV if you are out of Bangalore or unable to take up the interview or if your candidature does not suit's our requirement criteria's. Venue Details- Sun Technology Integrators Pvt. Limited No. 496, 5th Block,1st Stage, HBR Layout (a stop ahead from Nagawara towards to K. R. Puram) Bangalore - 560 043 Contact : Nandini S Tel: 8861722337 Qualification : BE/ B.Tech/ M.Tech/ ME/ M.Sc (ECE/ Telecommunications/ CSE/ ISE/ IT), MBA (IT) , MCA (2019 and 2020) Year of passing: 2019 and 2020 only. 60% or above marks only in Degree. We are not considering 10th or PUC marks. We will not consider Mechanical ,Electrical, Aeronautical and Civil branch and also who have done only Diploma freshers. 2016/ 2017/ 2018 passed out freshers are not allowed. Candidate should have knowledge in Core Java, Multithreading, Arrays, Oops, Exceptions, Collections, Frameworks, Data Structures, Design patterns etc. Java related course/ certification/ training/ internship is mandatory (who are already completed). We will not consider who are still undergoing/pursuing training. Must be able to join as soon as possible. Should have good communication skills Should be able to attend F2F interview. Male and Female candidates can attend the interview. Kindly ignore this mail who are already attended the interview with Sun Technologies for Java Developer position. If attended for other openings can attend on Thursday(8-4-2021) between 11:00AM to 3:00PM.We will not allow the candidates if they attend the interview second time for Java position. Please ensure to adhere to the below mentioned points considering the current pandemic: 1. Candidate with temp more than 99F or coughing will not be allowed. 2. Mask is mandatory throughout the exam. 3. Candidate should maintain social distancing throughout the interview process. 4. Candidate should not form groups out of office before or after the interview.  ","location":"Bangalore","experience":"0-1Years"},{"date":"7 - Apr - 2021","skills":"IT Recruitment, Sourcing, Screening, Shortlisting","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Aapro HR Solutions, 118A, Jaina Tower II, District Center, Janakpuri, New Delhi - 110 058","phone":"9310692491","profile":" HR Recruiter - IT \nAapro HR Solutions","description":"-Females preferred with at least Graduation -Must have prior experience of IT Recruitment -Must be aware of various IT Positions. -Must be from West Delhi, nearby to Janakpuri. -Freshers can also apply Job Responsibility- -Be responsible for handling full end-to-end recruitment process. -Understand JD of clients and draft it for the candidates, mass mail, post jobs, source, screen -Follow up with the prospective candidates from different job portals & social media. Walk-in Date/ Time: 7th April 2021, between 9.30 AM - 5.30 PM Venue Details- Aapro HR Solutions 118A, Jaina Tower II, District Center, Janakpuri, New Delhi - 110 058 Contact - Riya Mishra (9310692491) Email- riya@aapro.in  ","location":"Delhi","experience":"0-2Years"},{"date":"7 - Apr - 2021","skills":"Non Voice Process, Back Office Operations, Payments Posting","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Inventurus Knowledge Solutions Pvt. Limited, NSL Arena Tower-1, Habsiguda, Hyderabad, Telangana - 500 013.","phone":"8686273622","profile":" Non Voice Process - Backend Associate \nInventurus Knowledge Solutions Pvt. Limited","description":"Process Name: Revenue Cycle Management -PP (Payments Posting) Qualification: Any Graduate/ PG (Graduation certificate is mandatory) Salary: 1.90 Lakhs per annum Shifts: Dayshifts Walk-in Date/ Time: 7th April 2021, 9.30 AM - 1.00 PM Venue Details- Inventurus Knowledge Solutions Pvt. Limited NSL Arena Tower-1, Habsiguda, Hyderabad, Telangana - 500 013. Contact - Syed (8686273622) Basic requirements for the walk-in interview: Updated CV is mandatory. Please carry a copy of your Passing Certificate/ Degree Certificate/ All semester mark sheet hardcopies  ","location":"Hyderabad","experience":"0-1Years"},{"date":"7, 8 - Apr - 2021","skills":"Non Voice Process, Back Office Operations, Claims Process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Firstsource Solutions Limited, Floor 3, Tower 5A & B, Pritech II SEZ (Ecospace Park), Sarjapura Outer Ring Road, Varthur Hobli, Bangalore - 560 103","phone":"9080340763","profile":" Non Voice Process Associate (Fresher) \nFirstsource Solutions Limited","description":"A claims examiner needs to analyse multiple documents / contracts and decide to pay / deny the claim submitted by member or providers with respect to client specifications. The claims examiner should also route the claim to different department or provider / member for any missing information that required for claims adjudication. The claims needs to be completed adhering to required TAT and quality SLA. Minimum Eligibility: UG Graduation (Any discipline - 3 years) Exclude BE, B.Tech Required Key Skills: Good Communication Skills Listening & Comprehension Good typing knowledge/ Flexible to work any shifts and timings Walk-in Date/ Time: 7th, 8th April 2021, 10.30 AM - 1.30 PM Venue Details- Firstsource Solutions Limited Floor 3, Tower 5A & B, Pritech II SEZ (Ecospace Park), Sarjapura Outer Ring Road, Varthur Hobli, Bangalore - 560 103 Contact - Aarif HR ( 9080340763 ) Note: Bring your educational documents, Pan card, Aadhar card (both original and xerox)  ","location":"Bangalore","experience":"0-1Years"},{"date":"7 - Apr - 2021","skills":"Background Verification, Coordination, Documentation, HR Operations","qualification":"Diploma, B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Voltech HR Services Private Limited, No. 2/429, Voltech Eco Tower, Mount Poonamallee Road, Ayyappanthangal, Chennai, Tamil Nadu - 600 056","phone":"08939837005","profile":" Background Verification Executive \nVoltech HR Services Private Limited","description":"Looking for Fresher / Experienced candidates in BGV Process. Educational Qualification: Any Degree/ Diploma Work Experience: 1 to 3 Years BGV in education / employment department. Walk-in Date/ Time- 7th April 2021, 10.00 AM - 5.30 PM Venue Details: Voltech HR Services Private Limited No. 2/429, Voltech Eco Tower, Mount Poonamallee Road, Ayyappanthangal, Chennai, Tamil Nadu - 600 056. Email- careers@voltechgroup.com Contact - Praveen Kumar (08939837005)  ","location":"Chennai","experience":"1-3Years"}]}