{"Walkins":[{"date":"22, 23, 24, 25, 26, 27, 29, 30, 31 - Mar - 2021","skills":"Codeigniter, Core PHP, MySql, jQuery, Manual Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Softebizz Technologies Private Limited Office No. 401, 4th floor, Navle Icon (IT Park), Near Navle Bridge, Pune Maharashtra - 411041","phone":"7767925007","profile":" Web/ PHP Developer, Manual Tester \nSoftebizz Technologies Private Limited","description":"We are urgently hiring for the below-given position. If you are interested kindly share your resume with hr@softebizz.com. 1. Position: PHP Developer Work Experience: 2 to 3.5 Years Required Skills- Codeigniter, Core PHP, MySql, jQuery Able to Write clean and well-designed code Produce detailed specifications Troubleshoot, test, and maintain the core product software and databases to ensure strong optimization and functionality Contribute to all phases of the development life cycle Follow industry best practices Develop and deploy new features to facilitate related procedures and tools if necessary Experience in developing an eCommerce website will be added advantage. 2. Position: Manual Tester Work Experience: 1 to 2 Years Required Skills Sets: Functional Testing, Load Testing, Soak Testing, Stress, Testing, Smoke and Regression Testing, SDLC, STLC, and Bug Life cycle, Ecommerce website testing experience is preferred. Must have good communication skills 3. Position: Web Designer Work Experience: 1 to 2 Years Required Skills: HTML, CSS, Java Script, Jquery, Adobe Photoshop, Bootstrap, Responsive Web Design, UI Development Walk-in Date/ Time: 22nd - 31st March 2021, between 11.00 AM - 5.30 PM Venue Details- Softebizz Technologies Private Limited Office No. 401, 4th floor, Navle Icon (IT Park), Near Navle Bridge, Pune Maharashtra - 411041 Contact: Suman - 7767925007 EMail: hr@softebizz.com  ","location":"Pune","experience":"1-3Years"},{"date":"22, 23, 24, 25, 26, 27, 29, 30, 31 - Mar - 2021","skills":"Java, Dotnet, Mobile Application (Android, iOS), Python","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Appsource Services Private Limited, No. 12, Ramanuja Plaza 1st Floor Malleshwaram 5th Cross, Bangalore - 560 003.","phone":"9663863321","profile":" Software Engineers (Java/ .Net/ Mobile) \nAppsource Services Private Limited","description":"We at Appsource Services Private Limited are looking for candidates with below mentioned skills: Java Dotnet Mobile Application (Android, iOS) Python Walk-in Date/ Time: 22nd March - 1st April 2021, 10 AM onwards Venue Details- Appsource Services Private Limited No. 12, Ramanuja Plaza 1st Floor Malleshwaram 5th Cross, Bangalore - 560 003. Contact Person- Shwetha (9663863321)  ","location":"Bangalore","experience":"0-1Years"},{"date":"22 - Mar - 2021","skills":"Customer Service, Front Desk/ Front Office/ Receptionist Activities, Billing, Guest Handling","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Tenet Medcorp Private Limited, Plot# 51-54, Road No. 3, Journalist Colony, Venkateshwara Hills, Banjara Hills, Hyderabad","phone":"8886618039","profile":" Front Office Executive \nTenet Medcorp Private Limited","description":"Candidate should be Any Graduate with 1 to 3 years of experience in Customer Service, Front Desk/ Front Office/ Receptionist Activities, Billing, Guest Handling. Must have overachieving attitude with good Verbal & Written communication skills. Roles and Responsibilities- Front Office Tele calling General Administration Billing, PRE Walk-in Date/ Time: 22nd March 2021, 10.00 AM - 4.00 PM Venue Details: Tenet Medcorp Private Limited Plot# 51-54, Road No. 3, Journalist Colony, Venkateshwara Hills, Banjara Hills, Hyderabad Contact - Nagaraju (HR) Tel: 8886618039  ","location":"Hyderabad","experience":"1-3Years"},{"date":"20, 22, 23, 24, 25, 26, 27 - Mar - 2021","skills":"End to end Recruitment, Sourcing, Bulk Hiring, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Xponential Data & Business Services Pvt. Limited, World Trade center Tower 2, 3rd Floor Office no 312, Kharadi Pune - 411 014.","phone":"8446436826","profile":" Talent Acquisition/ Recruiter \nXponential Data & Business Services Pvt. Limited","description":"Candidate should have 1 to 6 years of experience in End to end Recruitment, Sourcing, Bulk Hiring, Talent Acquisition. Optimistic, Assertive & Pleasant Personality. Must have excellent verbal & written communication skills in English. Ability to manage pressure like situation in terms of recruitment target Proven ability to support a dynamic and fast-growth environment. Comfortable using recruiting and sourcing methods including: direct sourcing, professional networking tools, Internet based recruiting tools, search engines, etc. Roles and Responsibilities :- Understanding the Job Description for Manpower Requirement provided by each vertical. Searching Profiles through Online (Job portals & other search engines) / Personal Network / Employee reference and short listing the relevant profiles through initial screening rounds as per the Job Description. Scheduling the Final round of interview with the Vertical Head Keep a regular follow up with the selected candidates to stay updated with their joining schedule. Meeting the recruitment targets within the given time line. Should be able to take additional responsibilities of HR functions. Walk-in Date/ Time: 20th - 27 March 2021, 9.30 AM - 5.30 PM Venue Details- Xponential Data & Business Services Pvt. Limited World Trade center Tower 2, 3rd Floor Office no 312, Kharadi Pune - 411 014. Contact - HR Siona ( 8446436826 ) INTERESTED CANDIDATES KINDLY WALKIN OR SEND YOUR CV ON sbadges@xdbs.in  ","location":"Pune","experience":"1-6Years"},{"date":"22, 23, 24, 25, 26, 27 - Mar - 2021","skills":"End to End Recruitment, IT Staffing/ Recruitment","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Decent Jobs HR Solutions Private Limited, 608 6th Floor, Mansarovar Plaza, Mansarovar","phone":"9509988599","profile":" HR Executive \nDecent Jobs HR Solutions Private Limited","description":"Candidate must have strong knowledge on End to End Recruitment, IT Staffing/ Recruitment. Preferable in IT/ ITES recruitment-Team Handling/ People Management experience would be an added advantage Must have excellent communication skills MS Office exposure required Freshers can also apply Walk-in Date/ Time: 22nd March - 27 March , 11.00 AM - 4.00 PM Venue Details- Decent Jobs HR Solutions Private Limited, 608 6th Floor, Mansarovar Plaza, Mansarovar Contact - Teena (9509988599) You can also share CV on teena@decentjob.in  ","location":"Jaipur","experience":"0-2Years"},{"date":"20, 21, 22, 23, 24, 25, 26, 27 - Mar - 2021","skills":"US Staffing, Bench Sales, US IT Recruitment, US IT Staffing","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Simba Staffing Private Limited, D-No. 3-4-885/ 202/ 2ND Floor, Office No. 202, RuKkus & Yellu Arcade, Main Road, Barktpura Narayanguda, Hyderabad, Telangana - 500 027.","phone":"Not Provided","profile":" IT Recruiter/ US Staffing \nSimba Staffing Private Limited","description":"Candidate should have 0 to 3 years of experience in US Staffing, Bench Sales, US IT Recruitment, US IT Staffing. Must have excellent communication skills. Job Responsibility- \u0095Searching Resumes from US Job boards and Prime Vendors, Messengers. \u0095Interaction with Vendors and getting resumes from them. \u0095Submission of the eligible resumes to the Clients. \u0095Schedule in person/ Onsite/ phone) interviews with candidate and client. Walk-in Date/ Time: 18th - 27th March 2021, 10.30 AM - 5.30 PM Venue Detaails- Simba Staffing Private Limited D-No. 3-4-885/ 202/ 2ND Floor, Office No. 202, RuKkus & Yellu Arcade, Main Road, Barktpura Narayanguda, Hyderabad, Telangana - 500 027. Contact - RADHIKA (7330870865)  ","location":"Hyderabad","experience":"0-3Years"},{"date":"19 - Mar - 2021","skills":"Claims Processing, Non Voice Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"CXC Infotech Private Limited, 4th Floor, H 70, Sector 63, Noida. Near Electronic City, Metro Station.","phone":"Not Provided","profile":" Claim Processing Executive \nCXC Infotech Private Limited","description":"Urgent Requirement of Claim Associates with one of the largest US HEALTHCARE companies. Candidate should be Any Graduate/ Post Graduate with good English communication skills Must have Good English typing speed > 30 Words per Minute Day Shift. This is a NON VOICE PROCESS. Currently Working from Office only 5 Day Working Walk-in Date/ Time: 19th March 2021, 9.30 AM - 3.30 PM Venue Details- CXC Infotech Private Limited, 4th Floor, H 70, Sector 63, Noida. Near Electronic City, Metro Station.  ","location":"Chennai","experience":"0-2Years"},{"date":"19 - Mar - 2021","skills":"Backend Operations, Non Voice Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Matrix Business Services India Pvt. Limited, Shree Mahamathi Towers No,17, Arulambal Street T. Nagar, Chennai - 600 017.","phone":"Not Provided","profile":" Backend Process Executive \nMatrix Business Services (India) Pvt. Limited","description":"We are currently looking for candidates for the positions mention below for Chennai Location. a) Any UG Fresher / 0 to 2 years experience in any backend operations b) Good Communication c) No Night shift d) Very Good in MS Office E) Looking for Immediate joiners If you are interested you can directly walk-in to our below address on 19th March 2021 between 10.00 am to 2.00 pm. Matrix Business Services India Pvt. Limited Shree Mahamathi Towers, No.17, Arulambal Street T. Nagar, Chennai - 600 017 Near: Habibullha Road (HDFC Bank) Contact Person: S. Prathap  ","location":"Chennai","experience":"0-2Years"},{"date":"19 - Mar - 2021","skills":"End to end recruitment, Bulk hiring, portal hiring, Mass hiring.","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Spectrum Talent Management Pvt. Limited, C-142, Sector-63, Noida","phone":"9320875032","profile":" HR Executive/ Recruiter \nSpectrum Talent Management Pvt. Limited","description":"Candidate should be Graduate with excellent English communication Skills with basic computer knowledge. Should have good knowledge & relevant experience in hiring for various Non IT. Proficient on resume search through Job portals and using various search engines like Google, LinkedIn, headhunting, personal network. Must be able to work proactively to find candidates via various means including social media, referrals. Should possess strong follow-up skills till the candidate joins, maintain post offer follow-up and handle issues related to Offer/ Joining Date/ On Boarding/ CTC as applicable. Bulk hiring, portal hiring, Mass hiring. Freshers are most welcome. Perks and Benefits 1.50 LPA to 2.40 LPA Roles and Responsibilities End to end recruitment Accountable for the End to End RECRUITMENT: Right from acquiring profiles, conducting screening interview and Ensuring Candidate joins on stipulated time Walk-in Date- 19th March 2021 Interview Time:- 9:30 am to 2 pm Interview Venue:- Spectrum Talent Management Pvt. Limited C-142, Sector-63, Noida Contact Person- Mangal (9320875032)  ","location":"Noida","experience":"0-3Years"},{"date":"19 - Mar - 2021","skills":"End to end Recruitment, Sourcing, Bulk Hiring / BPO hiring","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"HCL Technologies Limited, HCL BPO Division, A-22, Sector 60, (Near Sector 59 Metro Station), Noida","phone":"Not Provided","profile":" Sr. Executive Talent Acquisition \nHCL Technologies Limited","description":"We are pleased to inform you about the opening in Noida with the No.1 employer in India, HCL Technologies for the profile of Sr. Executive Talent Acquisition. Job Responsibility- End to end recruitment (responsible for sourcing, screening, coordinating, negotiations, offer and BGV) Understand and learn the details of each job requisition and its requirements, project location, duration, etc. Understand the priority of the requisition and Identify qualified technical candidates utilizing various sources available resume database, employment web sites, referrals, own network, other recruiters, contractors, etc. Conduct preliminary interview to qualify the candidate - assess technical skill level, communication skills, Compensation negotiation, etc. The person should be capable of managing high volume demands while maintaining TAT and adhering to all process requirements. Candidate with exp. from ITES hiring background shall be preferred. Qualification Required- Freshers are not eligible for this opening. Graduate in any stream + MBA HR (Preferable) Min 2 Years of experience in bulk Hiring / BPO hiring is mandatory. Candidate must be residing in Delhi NCR. Skills Required:- Candidate should be flexible to work for 6 days also. Flexible for Travelling. Benefits & Compensation- Compensation Best in the industry. Opportunity for fast track career growth. International standard facility. Recreational activities and cultural programs. Walk-in Date/ Time: 18th March - 19th March, 11.00 AM - 4.00 PM Venue Details- HCL Technologies Limited HCL BPO Division, A-22, Sector 60, (Near Sector 59 Metro Station), Noida Contact Person- Atul Chopra Please Note- Read the job posting carefully before calling or applying, if you do not meet the given requirements then application will not be entertained.  ","location":"Noida","experience":"2-5Years"},{"date":"19 - Mar - 2021","skills":"Software Testing, Manual Testing, Functional, Regression, Integration, Smoke, Database Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"ENtrust Software & Services Pvt. Limited Level - 4, 6th Block, DLF IT Park, Mount Poonamalle Road, Manapakkam, Chennai - 600 089. Landmark : Near L&T.","phone":"8056804071","profile":" Software Testing Engineer \nENtrust Software & Services Pvt. Limited","description":"We are recruiting Software Testing Professionals for ongoing projects. (Immediate Joiners are highly preferred). Candidate should have 2.5 to 4 Years of solid experience in Manual Testing with strong knowledge in QA Concepts. Having experience is Automation is highly preferable Proven hands-on in Software Testing experience. Strong knowledge in web-application testing Basic knowledge in SQL Queries Experienced in doing test estimation, tests planning and designing. Experience with different testing types like Functional, Regression, Integration, Smoke, Database etc. Expert in identifying & writing Test Scenarios, Test Cases Sound knowledge of Defect Management Cycle and logging defects. Good in analytical and communication skills. Job Location : Chennai DLF, Porur Maximum Salary : Rs. 3.6 L/ Annnum Interested candidates, Call : 8056804071 (Suresh Narayansamy) for prior Appointment for Friday walk-in drive. Without Appointment we cant able to entertain open candidates, for Interview. Interview Date : 19th March 2021 (Friday) Time : 10.30 AM to 01.00 PM Venue : ENtrust Software & Services Pvt. Limited Level - 4, 6th Block, DLF IT Park, Mount Poonamalle Road, Manapakkam, Chennai - 600 089. Landmark : Near L&T. Phone : 044 - 42804450 Extn : 3113 Contact Person : Suresh N (HR) Procedure for Entry in DLF Main Gate : While coming for Interview please bring Resume & Original Govt. ID Proof (No color xerox) While Coming please wear Face Mask / Please follow Safety precautions.  ","location":"Chennai","experience":"2-4Years"},{"date":"25 - Mar - 2021","skills":"Technical Support, Email, Web and Voice based support","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Syncfusion Software Private Limited, New No-267, Old No-181, MATHURA TOWER, Poonamalle High Road, Kilpauk, Chennai - 600010.","phone":"Not Provided","profile":" Technical Support Associate \nSyncfusion Software Private Limited","description":"We are conducting Interview for Technical Support Associate (Email, Web and Voice) on March 25th, 2021 You will provide Email, Web and Voice based support. You will coordinate with customers and internal technical teams to provide support. We offer a professional work environment where you will be treated with respect and given every opportunity to grow. Eligibility Criteria: Any degree (Regular) No gaps of any kind. 2018 to 2020 Graduates with minimum of 60% in all academics. Well versed in MS-Office with good oral and written communication skills Work Experience: 0 - 1 year in relevant field. Technical Support (Email, Web and Voice) - Work from home. 3 shifts Monday through Friday. Saturday may be needed when applicable. Fresher's can apply Should be able to visit Syncfusion Software offices in Chennai when needed. Roles & Responsibility: Customer support coordination voice. Customer support coordination email and web Any other duties assigned. Working Hours: Three shifts. All shifts can be worked from home with no commute to the office. Saturday work (As needed) For any clarifications please contact the Recruitment team email id: recruitment@syncfusion.com  ","location":"Chennai","experience":"0-1Years"},{"date":"19, 20 - Mar - 2021","skills":"Manual software testing, Writing Test Plans, Cases and Scenarios","qualification":"B.E./B.Tech","address":"Electrolab India Private Limited, EL- 21, Electronic Zone, MIDC Industrial Area, Mahape, Navi Mumbai, Maharashtra - 400 705","phone":"9167839678","profile":" Software Testing Engineer \nElectrolab India Private Limited","description":"Candidate should be BE/ B.Tech in Electronics - Fresher Manual software testing, Software testing course (Not mandatory) Writing test plans, cases and scenarios. Well versed with functional and scalability testing. Excellent knowledge in preparing Test Cases, Bug reports Must have good communication skills Knowledge of micro controller Interview Date: 19th - 20th March 2021 Timings: 9.30 AM - 4.00 PM Interview Venue- Electrolab India Private Limited EL- 21, Electronic Zone, MIDC Industrial Area, Mahape, Navi Mumbai, Maharashtra - 400 705 Nearest Railway Station : Ghansoli Contact - Kavita (9167839678)  ","location":"Mumbai","experience":"0-1Years"},{"date":"22, 23, 24 - Mar - 2021","skills":".Net, ASP .Net, ADO .Net, C#, J-Query, OOPS Concepts, SQL, Javascript","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Saven Nova Technologies Private Limited, 301, Fortune Chambers Silicon Valley, Madhapur, Hyderabad - 500 081.","phone":"040-49493636","profile":" .Net Developer/ Freshers \nSaven Nova Technologies Private Limited","description":"Candidate must be trained .Net, ASP .Net, ADO .Net, C#, J-Query, OOPS Concepts, SQL, Javascript 2019, 2020 B.Tech, BCA, M.Tech, MCA Passouts Perks and Benefits: Location: Madhapur Working days: 5 (Saturday & Sunday off) Shift: Day Walk-in Date/ Time: 22nd - 24 March, 10.00 AM - 5.00 PM Venue Details- Saven Nova Technologies Private Limited 301, Fortune Chambers Silicon Valley, Madhapur, Hyderabad - 500 081. Contact - HR (040-49493636)  ","location":"Hyderabad","experience":"0-1Years"},{"date":"17 - Mar - 2021","skills":"Backend Operations, Advanced Excel, Non Voice Process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Matrix Business Services India Pvt. Limited, Shree Mahamathi Towers No.17, Arulambal Street T. Nagar, Chennai - 600 017.","phone":"Not Provided","profile":" Executive - Backend process \nMatrix Business Services India Pvt. Limited","description":"We are currently looking for candidates for the Backend Process Executive for Chennai Location. Key Requirements: a) Any UG Fresher / 0-2 years experience in any backend operations b) Good Communication Skills c) No Night shift d) Very Good in MS Office e) Looking for Immediate joiners If you are interested you can directly walk-in to our below address on 15th ,16th &17th Mar-2021 between 10.00 am to 2.00 pm. Matrix Business Services India Pvt. Limited Shree Mahamathi Towers No,17, Arulambal Street T. Nagar, Chennai - 600 017. Landmark- Near Habibullha Road HDFC Bank) Contact Person - Prathap  ","location":"Chennai","experience":"0-2Years"},{"date":"17 - Mar - 2021","skills":"HR/ Recruitment, Talent Acquisition, Volume and Bulk Hiring","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Allsec Technologies Limited, 46 C, Velachery Main Road, Velachery, Chennai- 42. (Next to Velachery EB Office)","phone":"Not Specified","profile":" HR Executive/ Recruiter \nAllsec Technologies Limited","description":"We are hiring for Fresher with MBA for Domestic Recruitment - Male Candidate (Malayalam or Hindi) Eligibility Criteria: Should possess Excellent communication skills in English and Malayalam or Hindi Work Experience: 0 - 1 Years Job Roles: Interested to work in Domestic recruitment for Volume and Bulk Hiring. Interested to Learn Hiring for Technical and non Technical Process. Willing to start career in Corporate Hiring Willing to work on Targets for closure of open positions. Immediate joiners preferred. Note: Candidates from MBA/ MA (HR)/ MSW (Regular) or Consultancy background will be preferable. Walk-in Date/ Time: 17th March 2021, 10 AM onwards Venue Details- Allsec Technologies Limited, 46 C, Velachery Main Road, Velachery, Chennai- 42. (Next to Velachery EB Office)  ","location":"Chennai","experience":"0-1Years"},{"date":"17 - Mar - 2021","skills":"HR, Performance Management, Talent Engagement, Succession Planning, Employee Relations","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"GlobalData Research Center Private Limited, 3rd Floor, Jyothi Pinnacle, Hitech City Road, Laxmi Cyber City, Whitefields, Kondapur, Telangana - 500 081","phone":"Not Specified","profile":" HR Generalist (Employee Relations) \nGlobalData Research Center Pvt. Limited","description":"We are on a hunt for an enthusiastic person for the role of HR Generalist (Employee Relations). The position is for Indian operations, The successful candidate will have to oversee operations of HR activities from start to finish. A go, know and solve is the right attitude for this role. If you possess these qualities apply now, we are eager to meet you. Candidate should have Masters in Human Resources/ Business with 3 to 6 years of HR experience including HR Generalist experience as a strategic business partner. Flexible and willing to roll sleeves, this role will personally partner with the leaders in the business [this role is not a management oversight role only]. Must have excellent communication skills and fluency in English Should be displaying high energy levels and a thrive to complete objectives Brings new creative thinking to problems and implement innovative solutions Experience in working with a multinational organization a plus or demonstrated ability to collaborate and incorporate multiple perspectives and needs into a combined solution Able to work in tight deadlines in HR operations particularly monthly payroll Stable and calm under pressure and maintain records in timely and accurate mode Strong decision - making skills with analytical and articulating mind-set Advance Excel and Strong MS office knowledge especially MS Word and Powerpoint Experience in setting up, communicating and implementing processes and policies that support business requirements Will hold strong communication skills and be committed to building firm relationships, especially with regards to key stakeholders. Walk-in Date/ Time: 17th March 2021, 9.30 AM - 2.00 PM Venue Details- GlobalData Research Center Private Limited 3rd Floor, Jyothi Pinnacle, Hitech City Road, Laxmi Cyber City, Whitefields, Kondapur, Telangana - 500 081  ","location":"Hyderabad","experience":"3-6Years"},{"date":"16 - Mar - 2021","skills":"Customer Service, Technical Support, Chat Support, Email Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"SpiceJet Limited, Building No. 321, Udyog Vihar, Phase 4, Gurgaon, Haryana - 120 016.","phone":"Not Provided","profile":" Customer Support Executive \nSpiceJet Limited","description":"We are conducting walk-in interviews for the position of Senior Executive in our Customer Experience Department on 16th March' 2021 from 10:00 am Till 11:00 am ( Tuesday) Educational Qualification: Graduate (Any Stream) Work Experience : 1- 5 Years Job Location: Gurugram Required Skill Sets: Excellent communication skills (verbal & written) Good working knowledge of Ms. Office (excel, PowerPoint, word) Strong decision making and problem solving ability Ability to work under pressure Qualities of being -Organized, Disciplined and Result Oriented Courtesy and professionalism to resolve customer issues with one call resolution Ability to be a change agent and bring about improvement in processes and procedures. Job Responsibilities: Handling mails from both internal & external customers Handling cases (Query / Request / Complaint / Appreciations) Handling billing inquiries Dealing with various internal departments Offering alternative solutions where appropriate with the objective of retaining customer's business Age Criteria - 23 Yrs - 30 Yrs Benefits - Pick-Up/ Drop Facility Kindly report at the below mentioned address and do carry your updated resume Dress Code - Formals Walk-in Date/ Time: 16th March 2021, 10 AM onwards Venue Details- SpiceJet Limited Building No. 321, Udyog Vihar, Phase 4, Gurgaon, Haryana - 120 016. Contact - SpiceJet Limited  ","location":"Gurgaon","experience":"1-5Years"},{"date":"17, 18 - Mar - 2021","skills":"Software Testing, Manual Testing, Quality Assurance, Functional Testing, Web Testing, UI Testing","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Artoon Solutions Private Limited, 301, Iscon Emporio, Jodhpur Cross Road, Satellite, Ahmedabad","phone":"9687685565","profile":" QA/ Manual Test Engineer (Freshers) \nArtoon Solutions Private Limited","description":"We at Artoon Solutions Private Limited are Hiring QA/ Manual Tester - Freshers Interested candidate can directly come for the interview at the below mentioned address- Artoon Solutions Private Limited, 301, Iscon Emporio, Jodhpur Cross Road, Satellite, Ahmedabad Interview Dates: 17th to 18th March 2021 Timings: 11 AM to 5 PM Email: janki.simariya@artoonsolutions.com Phone: 9687685565  ","location":"Ahmedabad","experience":"0-1Years"},{"date":"16 - Mar - 2021","skills":"HR/ Recruitment, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Tech Mahindra Limited, DLF 2, Tower B, 3rd Floor, Rajarhat New Town, Kolkata - 700156","phone":"9038019373","profile":" HR/ Management Trainee \nTech Mahindra Limited","description":"We are glad to inform you that we are offering you a great exposure to get hands on experience with HR team from a multinational organization. Roles and Responsibilities- Act as a single point of contact for associates for HR related requirements and associate queries Act as a facilitator in resolving associate's grievance. Management of Employee Lifecycle Provide feedback to the management on all HR issues and on company policies Handle unit specific data and reporting requirements Handle floor discipline and disciplinary requirements within the IBU Improved associate Relations through associate counseling and mentoring Facilitating associate development, motivation, engagement and retention through employee development programs and various HR initiatives Facilitating associate communication within the IBU and provides a platform to raise their concerns and opinions through regular HR Meetings, Skips and Coffee Meets Ensure adequate communication with associates to ensure adherence to HR policies and processes Implement various associate engagement initiatives within the IBU/Department Mandatory Criteria- MBA (HR) Must have excellent verbal English & Hindi communication skill Should have a decent knowledge of MS office. Ready to work from Office Initial 6 months contractual job Other requirement- People Management Ready to work in in a 9 HR shift in between 8 am to 8 pm No planned leave for upcoming 3 months after joining 9 hour of the day, 8 hrs. work and 1-hour break 6 days working PF & ESIC Documents Required- Education Mark sheet Aadhar Card Pan Card Interview Details - Only walk-in interview Date : 15th & 16th March'21 Venue : DLF 2, Tower B, 3rd Floor, Rajarhat New Town, Kolkata - 700156 Time : 11 am to 2 pm For more details call Santanu Guha 9038019373  ","location":"Kolkata","experience":"0-1Years"},{"date":"16 - Mar - 2021","skills":"IT Recruitment/ Staffing, US Staffing, Bench Sales, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Simba Staffing Private Limited, D-No. 3-4-885/202/ 2ND Floor, Office No. 202, RuKkus & Yellu Arcade, Main Road, Barktpura Narayanguda, Hyderabad, Telangana - 500 027.","phone":"7330870865","profile":" US IT Recruiter \nSimba Staffing Private Limited","description":"Candidate should have 0 to 3 years experience in IT Recruitment/ Staffing, US Staffing, Bench Sales, Talent Acquisition. Must have excellent communication skills. Job Responsibilities- \u0095Searching Resumes from US Job boards and Prime Vendors, Messengers. \u0095Interaction with Vendors and getting resumes from them. \u0095Submission of the eligible resumes to the Clients. \u0095Schedule in person/ Onsite/ Phone) interviews with candidate and client. Walk-in Date/ Time: 16th March 2021, 10.30 AM - 5.30 PM Venue Details- Simba Staffing Private Limited D-No. 3-4-885/202/ 2ND Floor, Office No. 202, RuKkus & Yellu Arcade, Main Road, Barktpura Narayanguda, Hyderabad, Telangana - 500 027. Contact - RADHIKA (7330870865)  ","location":"Hyderabad","experience":"0-3Years"},{"date":"16 - Mar - 2021","skills":"Software Testing, Manual Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"HCL Technologies Limited, ETA-1 Techno Park, Special Economic Zone 33 Rajiv Gandhi Saali, Navallur, Taluk, Chengalpattu, Tamil Nadu - 603103.","phone":"Not Provided","profile":" Manual Testing Engineer \nHCL Technologies Limited","description":"HCL Engineering and R&D Services division, ERS. We are the largest Indian Engineering service provider with 27000+ workforce and also the 4th largest ESP globally. We are also in phase of increasing the engineering base and are looking for Manual Testing Engineer. Qualification: BE/ B.Tech/ M.Tech/ MCA Job Experience : 1 to 5 Years Work Location: Chennai Skills Required: Software Testing Manual Testing Walk-in Date/ Time: 16th March 2021, 9.00 AM - 1.00 PM Venue Details- HCL Technologies Limited, ETA-1 Techno Park, Special Economic Zone 33 Rajiv Gandhi Saali, Navallur, Taluk, Chengalpattu, Tamil Nadu - 603103. Contact - Srinivasa  ","location":"Chennai","experience":"1-5Years"},{"date":"16 - Mar - 2021","skills":"International Voice/ Non Voice Process, Interviewing","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"IKS Health, NSL Arena, Block 1, 11th Floor, Uppal Hyderabad.","phone":"Not Provided","profile":" Customer Support Executive \nIKS Health","description":"Candidate should be Any Graduate with Any experience with international voice or non voice process. Fresher with good communication can also apply Candidate should hold all the Education documents, PAN, Aadhar in place Interested candidates can Walk-in to below Mentioned Venue on 16 Mar 2021 (Tuesday) from 10 AM to 1 PM Venue Details- IKS Health, NSL Arena, Block 1, 11th Floor, Uppal Hyderabad. Contact - Avinash Note : Carry updated CV and Pan and Aadhar Xerox and photo at the time of interview. *Candidates who have applied under 30 Days are not eligible to re-apply  ","location":"Hyderabad","experience":"0-2Years"},{"date":"16 - Mar - 2021","skills":"HR/ Recruitment, Talent Acquisition, End to end Recruitment","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"HCL Technologies Limited, A -22 Noida -60","phone":"Not Provided","profile":" HR Executive/ Sr. Recruiter \nHCL Technologies Limited","description":"We are pleased to inform you about the opening in Noida with the No.1 employer in India, HCL Technologies for the profile of Senior Executive Talent Acquisition. (Male candidates only) Qualification/ Skills Required- Freshers are not eligible for this opening. Graduate in any stream + MBA (HR) (Preferable) Min 2 Years of experience in bulk Hiring/ BPO hiring is mandatory. Candidate should be flexible to work for 6 days. Flexible for Travelling. Job Responsibility- End to end recruitment (responsible for sourcing, screening, coordinating, negotiations, offer and BGV) Understand and learn the details of each job requisition and its requirements, project location, duration, etc. Understand the priority of the requisition and Identify qualified technical candidates utilizing various sources available resume database, employment web sites, referrals, own network, other recruiters, contractors, etc. Conduct preliminary interview to qualify the candidate - assess technical skill level, communication skills, Compensation negotiation, etc. The person should be capable of managing high volume demands while maintaining TAT and adhering to all process requirements. Candidate with exp. from ITES hiring background shall be preferred. Benefits & Compensation- Compensation Best in the industry. Opportunity for fast track career growth. International standard facility. Recreational activities and cultural programs. Interview dates- 16th March 2021 Timing \u0096 12 PM to 5 PM Venue Details: - HCL Technologies Limited A -22 Noida -60 Contact Person: Chander Mohan Please Note- Read the job posting carefully before calling or applying, if you do not meet the given requirements then application will not be entertained. Also don\u0092t carry any electronics device.  ","location":"Noida","experience":"1-5Years"},{"date":"15, 16, 17, 18, 19, 20, 21 - Mar - 2021","skills":"Core Java, Spring/ Spring Boot, REST, Hibernate","qualification":"B.E./B.Tech, MCA/PGDCA","address":"DZ Fresh Foods Private Limited, 7th Floor, B Wing, BSEL Tech IT Park, Opp. Vashi Railway Station, Sector 30A, Vashi ,Navi Mumbai - 400 705.","phone":"8591309845","profile":" Senior Java Developer \nDZ Fresh Foods Private Limited","description":"Candidate must have proven hands-on Software Development experience Proven working experience in Java development Hands on experience in designing and developing applications using Java EE platforms Object Oriented analysis and design using common design patterns. Profound insight of Java and JEE internals (Class loading, Memory Management, Transaction management etc.) Excellent knowledge of Relational Databases, SQL and ORM technologies (JPA2, Hibernate) Experience in the Spring Framework Experience as a Sun Certified Java Developer Experience in developing web applications using Spring MVC Experience with test-driven development Mandatory Skills: Core Java, Spring/ Spring Boot, REST, Hibernate Work Experience: 3 to 7 Years Location: Vashi (Navi Mumbai) Walk-in Date/ Time: 15th to 21st March 2021, 9.30 AM - 6.00 PM Venue Details- DZ Fresh Foods Private Limited 7th Floor, B Wing, BSEL Tech IT Park, Opp. Vashi Railway Station, Sector 30A, Vashi ,Navi Mumbai - 400 705. Contact - Prachi ( 8591309845 )  ","location":"Mumbai","experience":"3-7Years"},{"date":"15, 16, 17, 18, 19, 20, 22, 23, 24 - Mar - 2021","skills":"Technical Support, IT Helpdesk/ Service Desk, System Administration","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS, Diploma","address":"Inspirisys Solutions Limited, G2 Vimalnath Complex, High Tension Cross Road, Shubhanpura, Vadodara, Gujrat","phone":"9998224867","profile":" Technical Support Engineer \nInspirisys Solutions Limited","description":"Candidate should be Any Graduate (BE/ B.Tech/ BCA/ MCA/ Diploma/ BA/ BCOM) with 2 to 3 years of experience into IT Desktop or Technical Support side. Should have good knowledge of computer hardware and software. Hands on experience in troubleshoot desktop and laptop problems. OS installation, change and repair computer hardware and other parts. Computer Hardware and Networking Knowledge. Outlook and mail configuration , Software installations Etc. Resolve LAN and network connectivity issues. Basic knowledge on printer connectivity and installation. Remote support and video conferencing Etc. Walk-in Interview from 15th March - 24 March , 9.30 AM - 5.30 PM at the below mentioned address- Inspirisys Solutions Limited, G2 Vimalnath Complex, High Tension Cross Road, Shubhanpura, Vadodara, Gujrat Contact - Manish Barot (9998224867)  ","location":"Vadodara","experience":"1-3Years"},{"date":"15, 16, 17, 18, 19, 20, 21 - Mar - 2021","skills":"Asp .Net, MVC, C#, .Net, JQuery, SQL Server","qualification":"B.E./B.Tech, B.Sc, BCA/BCS","address":"Ray Business Technologies Private Limited, Plot No. 204, Block - B, Kavuri Hills, Madhapur, Hyderabad, Telangana \u0096 500 033.","phone":"8309210157","profile":" Associate Software Engineer \nRay Business Technologies Private Limited","description":"Qualification: B.Tech (CSE/ IT)/ BSc (Maths/ Stats) Eligibility Criteria: 2019, 2020, - 60% and above Key Skills: Strong knowledge in Asp .Net, MVC, C#, .Net, JQuery, SQL Server. Good Analytical and logical skills. Knowledge of software development best practices, particularly for design, coding, and testing. Must be a team player, possess a good attitude & be self-disciplined. Must have a excellent written & verbal skills. Good communication skills. No. of open positions: 20 Job Location: Hyderabad Mode of Interview Written Test 2 Technical rounds( Virtual Interviews) HR Round Walk-in Date/ Time: 15th March - 21st March 2021, 10.00 AM - 2.00 PM Venue Details- Ray Business Technologies Private Limited Plot No. 204, Block - B, Kavuri Hills, Madhapur, Hyderabad, Telangana \u0096 500 033. Contact - Elizabeth Arland (8309210157)  ","location":"Hyderabad","experience":"0-1Years"},{"date":"15, 16, 17, 18, 19, 20, 21 - Mar - 2021","skills":"Technical Support, Desktop Support, Networking, Notebook Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Chamunda Tech-Net Services Pvt. Limited, 401 L Wing, Tex Center, Nr Narayan Plaza, Chandivali Andher (East), Mumbai.","phone":"022-2857821","profile":" Networking/ Support Engineer \nChamunda Tech-Net Services Pvt. Limited","description":"Candidate should be Any Graduate (Male Only) with 0 to 1 year experience in Technical Support, Desktop Support, Networking, Notebook Support. Must have excellent communication skills. Fresher Can Also Apply - It will be Field Job Job Responsibilities- Desktop Installation and Hardware Troubleshooting Office - Install, Email Configuration and Troubleshoot Windows Drivers Installation Printer Installation and Troubleshoot Basic LAN Troubleshooting Walk-in Date/ Time: 15th March - 21st March 2021, 10.30 AM - 5.30 PM Venue Details- Chamunda Tech-Net Services Pvt. Limited 401 L Wing, Tex Center, Nr Narayan Plaza, Chandivali Andher (East), Mumbai. Contact - Rupesh Patil (022-2857821)  ","location":"Mumbai","experience":"0-1Years"},{"date":"15, 16, 17, 18, 19 - Mar - 2021","skills":"US Insurance back office operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Polagoni Software Solutions Private Limited, #402, 4th Floor, Above Vijaya Diagnostic Center, Gurudwara Junction.","phone":"9573589307","profile":" Backend Process Associates \nPolagoni Software Solutions Pvt. Limited","description":"We are hiring Process Associates; Team Leads (US Insurance) - for our client IMash Technologies. Only Night Shifts. Immediate Requirement for Senior & Junior Process Associates and Team Leads. We are looking for the candidates who are experienced in any of the US Insurance back office processes mentioned here. Certificate of Issuance, Policy Checking, Policy Issuance, Policy Renewals, DBR, Quoting/Rating, Audits, Benefits, Claims Management, Doc Retrieval, Notice of Cancellations and Endorsements. Strong written and verbal communication skills. Work Location Visakhapatnam, Andhra Pradesh. Flexible in night shift. Salary not a constraint for the right candidate Minimum 1 Year of experience in US Insurance back office operations (Knowledge in multiple processes would be an added advantage) Candidate should be good in Excel Strong organizational skills. Good Attitude and High Aptitude Attention to detail. Collaborative and Team Player Experience on Quoting is highly preferred. Looking for immediate joinees without any notice period. Walk-in Date/ Time: 15th March - 19th March 2021, 6.00 PM - 8.00 PM Venue Details- Polagoni Software Solutions Private Limited #402, 4th Floor, Above Vijaya Diagnostic Center, Gurudwara Junction. Contact - Shan (9573589307) Walk-ins will be conducted daily (only Mon - Fri) from 6 PM IST - 11 PM IST You need to carry your resume and ID Proof.  ","location":"Visakhapatnam","experience":"1-5Years"},{"date":"16 - Mar - 2021","skills":"Automation Testing","qualification":"B.Sc, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Sun Technology Integrators Private Limited, No. 510, 5th Block,1st Stage HBR Layout (a stop ahead from Nagawara towards to K. R. Puram) Bangalore - 560043","phone":"Not Provided","profile":" Trainee Automation Tester \nSun Technology Integrators Pvt. Limited","description":"We have openings for Trainee Automation Tester position for Bangalore location. Please share your updated CV to nandinis@suntechnologies.com ASAP and Subject line should be Regarding Automation Testing drive interview. Note: Please attend the interview only if your candidature matches the below criteria's Kindly inform to your friends as well. Position: Trainee Automation Tester Work Experience: 0 to 6 Months F2F interview-Tuesday(16-3-2021) between 11:00AM to 1:00PM (Share your updated Cv to nandinis@suntechnologies.com ) (Please mention Referred by Nandini on top of your CV without fail) \u0095 B.E/ B.Tech/ M.E/ M.Tech/M.Sc (ECE/T elecommunication/CS/IS), BCA, MCA, MBA(IT) (2019 and 2020) We will strictly not consider Mechanical ,Electrical, Aeronautical and Civil branch freshers. Diploma candidates are not allowed. Only MALE candidates can attend the interview. Female candidates are not allowed. Year of passing:2019 and 2020 only. 55% or above marks in the recent degree . 2016/2017/2018 passed out freshers are not allowed. Must be able to join as soon as possible Testing related course/ certification/ training/ internship is mandatory. We will not consider who is still pursuing the course or under training on Testing. Kindly ignore this mail who are already attended the interview with Sun Technologies for automation Testing position. If attended for other openings can attend automation Testing position on Tuesday(16-3-2021) CTC:2.4 L/Annum Note: We will allow the candidates only those who meets the above criteria's.  ","location":"Bangalore","experience":"0-1Years"},{"date":"15, 16, 17, 18, 19, 20, 22, 23, 24 - Mar - 2021","skills":"Technical Support, IT Helpdesk/ Service Desk, Non Voice Process","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Wings International Group, D.No. 60-20-4, 1st floor, Twinkle Residency, Back side lane of Heritage Building, Sunnapubattila Centre, Vijayawada - 520008.","phone":"9989243344","profile":" Technical Support Engineer \nWings International Group","description":"Educational Qualification : B.Tech/ MCA/ BCA/ B.Sc.-IT 2018, 2019, 2020, 2021 with 60% in all academics. Job Location : Bangalore, Chennai Rotational Shift Ready to Relocate Package : 2.20 Lakhs P.A. Note : Communication Should be Good. Walk-in Interview from 15th March - 24 March, between 10.30 AM - 5.30 PM at the below mentioned address- Wings International Group, D.No. 60-20-4, 1st floor, Twinkle Residency, Back side lane of Heritage Building, Sunnapubattila Centre, Vijayawada - 520008. Contact - Suman Chandra For details contact : 9032233456, 9989243344 Mail your resumes to cmd@wingsinternational.in  ","location":"Vijayawada","experience":"2-9Years"},{"date":"15, 16 - Mar - 2021","skills":"JAVA, Python, Node JS, C++ ,C#, .Net","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Soft Suave Technologies Private Limited, 100, Lake View Estate, 3rd floor, Kundrathur Main Road, M. S. Nagar, Next to Rajan Tiles Building, Porur, Chennai, Tamilnadu - 600 116.","phone":"Not Provided","profile":" Software Engineer Trainee \nSoft Suave Technologies Private Limited","description":"Candidate should have Good knowledge in JAVA, Python, Node JS, C++ ,C#, .Net with Logical and analytical thinking towards the programming Eligibility: BE/ B.Tech/ ME/ M.Tech/ MCA - 2018, 2019, 2020 Passed outs only. Only male candidates can apply Immediate Joiners required Job Responsibility: Execute full software development life cycle (SDLC) Code, test and troubleshoot programs utilizing the appropriate framework, database, and programming technology. Write quality and clean code using prescribed specifications. Analyze performance of programs and take action to correct deficiencies . Rounds of Interview: Level 1: Walk-in directly to Company - MCQ Level 1 Level 2 & 3: Online Programming Test Level 4: Technical Interview Walk-in Date/ Time: 15th March - 16th March , 10.30 AM - 1.30 PM Venue Details- Soft Suave Technologies Private Limited 100, Lake View Estate, 3rd floor, Kundrathur Main Road, M. S. Nagar, Next to Rajan Tiles Building, Porur, Chennai, Tamilnadu - 600 116. Contact - Abirami Rajalingam, Jayasudha  ","location":"Chennai","experience":"0-2Years"},{"date":"13 - Mar - 2021","skills":"General Administration, Customer Service, Calling, Data Verification","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"BANKSHALL STREET 2 FAIRLY PLACE BBD BAG KOLKATA - 700 001","phone":"7044833096","profile":" Back Office Executive \nKrishna Finance Company Private Limited","description":"Candidate should be Any Graduate with 0 to 1 year experience in Back Office Operations, General Administration, Customer Service, Calling, Data Verification. Must have excellent communication skills. Walk-in Date/ Time: 13th March 2021, 9.30 AM - 11.00 AM VENUE- BANKSHALL STREET 2 FAIRLY PLACE BBD BAG KOLKATA - 700 001 Contact - BIPASA (7044833096)  ","location":"Kolkata","experience":"0-1Years"},{"date":"13 - Mar - 2021","skills":"HR/ Recruitment, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Medall Healthcare Private Limited, No.67,2nd Floor, TNPL Building, Anna Salai, Guindy, Chennai, Tamilnadu","phone":"Not Provided","profile":" HR Trainee Executive - Fresher \nMedall Healthcare Private Limited","description":"Candidate should have Any Degree in Business/ Human Resource Management/ Psychology or any other related field with strong interpersonal and listening skills. First practical experience advantageous. Ability to communicate effectively with people throughout the organization Motivation to constantly learn and develop the own knowledge and skills Self-assured manner, also towards people in rather high positions. Walk-in Date/ Time: 13th March 2021, 10.00 AM - 5.00 PM Venue Details- Medall Healthcare Private Limited No.67,2nd Floor, TNPL Building, Anna Salai, Guindy, Chennai, Tamilnadu Contact Person- Satheesh  ","location":"Chennai","experience":"0-1Years"},{"date":"13 - Mar - 2021","skills":"HR/ Recruitment, Vendo/ Vendor Management, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Insta Kart Private Limited, 1st phase,Yelahanka New Town, Yelahanka, Bangalore Karnataka - 560 064","phone":"9620078780","profile":" Talent Acquisition Executive \nFlipkart Internet Private Limited","description":"Candidate should be Any Graduate with good recruitment background. Minimum 3 to 5 years mandatory experience in recruiting profile Should be from Bangalore and have good knowledge on local geography. Kannada speaking is mandatory. Roles & Responsibilities- Source, solicit and screen candidates for contract roles Specialized in hiring Delivery executive for last mile logistics. Should be specialized in Hiring bulk numbers Leverage various recruiting resources Should be flexible and ready to work on field during critical times Target oriented Training coordination, vendor coordination, vendor management, Releasing offer letters. Retention Walk-in Date/ Time: 13th March 2021, 9.30 AM - 8.00 PM Venue Details- Insta Kart Private Limited 1st Phase,Yelahanka New Town, Yelahanka, Bangalore Karnataka - 560 064 Perks and Benefits AS per the company standards or basis current package. PLEASE CALL ON 9620078780  ","location":"Bangalore","experience":"3-5Years"},{"date":"13 - Mar - 2021","skills":"In Recruitment Process, Job Posting, Mass Mailing, Bulk Email","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Globex Digital Solutions Private Limited Plot No. 7-1-621/16 Lakshmi Sadan Building, 4th Floor, SR Nagar Hyderabad. Opposite Almas Restaurant, First Right-Side Lane Next to Rajeshwari Ladies Hostel","phone":"Not Provided","profile":" IT Recruiter/ Executive \nGlobex Digital Solutions Private Limited","description":"Educational Qualification: Any Graduation Work Experience: 2+ Years Location: SR Nagar, Hyderabad Working Days: 6 Days with Alternative week off (1st and 3rd Saturday Week off) Requirements: Excellent Communication Skills. Having In depth Understanding In Recruitment Process Good in Job Posting Scripting Including Mass Mailing, Bulk Email Maintaining a Good Communication with candidates form initial level to final level Preferred: Good analyzing in understanding Technical Requirement who are from non IT Background (B.Com, B.Sc) Notice Period : Immediate - 15 Days Walk-in Date/ Time: 13th March 2021, 10.00 AM - 5.30 PM Venue Details- Globex Digital Solutions Private Limited Plot No. 7-1-621/16 Lakshmi Sadan Building, 4th Floor, SR Nagar Hyderabad Opposite Almas Restaurant, First Right-Side Lane Next to Rajeshwari Ladies Hostel  ","location":"Hyderabad","experience":"2-3Years"},{"date":"12, 13, 14, 15, 16, 17, 18, 19, 20, 21 - Mar - 2021","skills":"Office Management, Back Office Support, Office Coordination, Vendor Relationship Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Rubixe (Think Ahead Innovations Pvt. Limited) 3rd Floor, No C-25, Bajrang House, 7th Mile, Kudlu Gate, Garvebhavi Palya, Bengaluru, Karnataka - 560 068.","phone":"6366422964","profile":" Office Coordinator \nRubixe (Think Ahead Innovations Pvt. Limited)","description":"An Associates/ College Degree; BSc/ BA in Business Administration or relevant field is a plus Must have proven experience as office coordinator or in a similar role Experience in customer service will be a plus Knowledge of basic bookkeeping principles and office management systems and procedures Outstanding knowledge of MS Office, back-office, and accounting software Working knowledge of office equipment (e.g. optical scanner) Excellent communication and interpersonal skills Organized with the ability to prioritize and multi-task Reliable with patience and professionalism Job Responsibilities: Follow office workflow procedures to ensure maximum efficiency Maintain files and records with effective filing systems Support other teams with various administrative tasks (redirecting calls, disseminating correspondence, scheduling meetings, etc.) Greet and assist visitors when they arrive at the office Monitor office expenditures and handle all office contracts (rent, service, etc.) Perform basic bookkeeping activities and update the accounting system Deal with customer complaints or issues Monitor office supplies inventory and place orders Assist in vendor relationship management Walk-in Date/ Time: 12th March - 21st March 2021, 9.30 AM - 5.30 PM Venue Details- Rubixe (Think Ahead Innovations Pvt. Limited) 3rd Floor, No C-25, Bajrang House, 7th Mile, Kudlu Gate, Garvebhavi Palya, Bengaluru, Karnataka - 560 068. Contact - Dhivya Palani (6366422964)  ","location":"Bangalore","experience":"0-2Years"},{"date":"10, 11, 12, 13, 15, 16, 17, 18 - Mar - 2021","skills":"Manual Testing, QA Fresher","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Lifeline Systech Solutions Private Limited, Level 3 Mrugank Building Rajpath Maharashtra, Paud Road, Shikshaknagar, Ramkrishna Paramhans Nagar, Kothrud, Pune - 411 038.","phone":"8554983314","profile":" Software Testing Engineer \nLifeline Systech Solutions Private Limited","description":"Candidate should have Strong Troubleshooting skills for reaching to root cause of customer reported issues. Should perform, re-testing, Regression testing. Basic Knowledge in database. Excellent verbal and written communication skills, and able to communicate very technical subject matter to non-technical users. Experience using industry standard Automation Tools Coded UI, Selenium Webdriver, AutoIT, and used C# as scripting language will be a Plus. Experience in integration and Performance testing using any Automated Tool will be a plus. Roles and Responsibilities- Interprets product design and requirements to engineer test approach and generates test plans and test cases. Executes complex test cases/ scripts and interprets/ analyzes results to report, communicate, and work through issues with software engineers. Active participation in testing cycle of the software development lifecycle (requirements gathering, prototyping, design review, test case reviews, Manual testing) using Agile Methodology. Working closely with Product Management, Development Team and Support teams to create and deliver a quality-focused QA deliverables. Develop functional, integration and E2E test cases to validate business, system and operational requirements.Work closely with different functional groups to resolve issues, ensure thorough testing from a business perspective, understand support issues and release high quality products to customers. Walk-in Date/ Time: 10th March - 18th March , 9.30 AM - 5.30 PM Venue Details- Lifeline Systech Solutions Private Limited Level 3 Mrugank Building Rajpath Maharashtra, Paud Road, Shikshaknagar, Ramkrishna Paramhans Nagar, Kothrud, Pune, Maharashtra - 411 038. Contact - Nikita ( 8554983314 )  ","location":"Pune","experience":"1-4Years"},{"date":"11, 12 - Mar - 2021","skills":"Back Office Operations, Data Entry, MIS Reporting, Team Operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"BIANCA HOME LLP, 915, Hubtown Solaris, N. S. Phadke Road Opposite.Telli Galli, Near Andheri Flyover, Andheri East, Mumbai - 400 069.","phone":"Not Provided","profile":" Back Office/ MIS Executive \nBianca Home LLP","description":"Candidate should be Any Graduate with good knowledge of Advance Excel Must have excellent communication skills. Preparation of MIS Reports Data Entries in the software/ Excel Ensure timely delivery of all orders Coordination with the vendors, warehouse team & operations team. Walk-in Date- 11th & 12th March 2021 Time- 11:00 am to 5:00 pm Venue Details- BIANCA HOME LLP, 915, Hubtown Solaris, N. S. Phadke Road Opposite.Telli Galli, Near Andheri Flyover, Andheri East, Mumbai - 400 069. Contact Person- Sameer Babar  ","location":"Mumbai","experience":"2-5Years"},{"date":"11 - Mar - 2021","skills":"Customer Relationship, Concept Selling, Sales Presentations, Customer Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Mahindra Holidays & Resorts India Limited, 1st Floor, Shikhar Tower, Plot No-323, Mangal Pandey Nagar, Meerut - 250004","phone":"9005364444","profile":" Relationship Manager \nMahindra Holidays & Resorts India Pvt. Limited","description":"Candidate should be Any Graduate with excellent communication skills Must have strong Results Orientation and Execution Excellence Strong Sales Experience High Energy and Passion High Customer Centricity High Perks & Incentives Vehicle is mandatory Job Purpose: To make powerful and successful sales presentations in different settings; to keep abreast with the organization's products and services; to crack profitable deals and referrals to achieve sales targets Job Responsibilities: Achieving stretched targets in a result-focused environment Preparing pre-sales proposals for prospective clients Delivering inspiring sales presentations to convert prospects to successful sales Handling objections and resolving member/ customer conflicts by constantly connecting with them through member meetings. Provide necessary support in booking first time holiday for new members and generate quality referrals from them. Provide necessary support in booking first time holiday for new members and generate quality referrals from them Identifying potential customers and new business opportunities Building and maintaining strong client relationship and high level of customer service Being updated on new products and services Walk-in Date/ Time: 11th March 2021, 10.30 AM - 3.00 PM Venue Details- Mahindra Holidays & Resorts India Limited, 1st Floor, Shikhar Tower, Plot No-323, Mangal Pandey Nagar, Meerut - 250004 Contact Person - Manish (9005364444) Interested Candidates can attend walk ins or share resumes on Manish.bajpai@mahindraholidays.com  ","location":"Meerut","experience":"3-7Years"}]}