{"Walkins":[{"date":"10, 11, 12 - Jun - 2019","skills":"Javascript JQuery MySQL Core PHP Web Development Rest Web Technologies","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Recenturesoft Infotech Pvt. Limited, 304, A-74, Sector 63, Noida","phone":"Not Provided","profile":"PHP Developers \nRecenturesoft Infotech Private Limited","description":"PHP DEVELOPERS: 2 to 4 years experience - 10 positions Salary - 2.4 lacs to 5 lacs pa LEAD PHP DEVELOPERS: 5 to 8 years experience - 5 positions Salary - 6 lacs to 12 lacs pa Required Skills: Strong experience in PHP web development Strong knowledge of Core PHP, Any framework. Understanding the fully synchronous behaviour of PHP. Knowledge on REST API Development. Working on Product based Development. Good understanding and knowledge on various database: 1) JavaScript 2) JQuery 3) Php 4) Opencart 5) MySQL 6) LAMP Environment Team Management experience for lead position Walk-in Date/ Time: 10th - 12th June , 10 AM onwards Interview Venue: Recenturesoft Infotech Pvt. Limited 304, A-74, Sector 63, Noida","location":"Noida","experience":"2 - 8 Years"},{"date":"10, 11 - Jun - 2019","skills":"PHP Web frameworks such as Laravel, MySQL Server","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Cogent E-Services Private Limited, C-121 Sector 63, Noida","phone":"9582987088","profile":"PHP Developer \nCogent E-Services Private Limited","description":"Candidate should be B-Tech/ MCA with strong knowledge of PHP Web frameworks such as Laravel, MySQL Server and its objects. Must have understanding of MVC Design Patterns. Basic understanding of front-end technologies, such as JavaScript, HTML5, and CSS3 Should have understanding of Ajax and Jquery Knowledge of object oriented PHP programming Integration of multiple data sources and databases into one system Proficient understanding of code versioning tools, such as SVN, Git Walk-in Date/ Time: 10th - 11th June , 9 AM onwards Interview Venue: Cogent E-Services Private Limited C-121 Sector 63, Noida","location":"Noida","experience":"1 - 4 Years"},{"date":"10, 11, 12, 13, 14, 15 - Jun - 2019","skills":"Web Application, Mobile Application, Java, PHP, UI/ UX, Sales force","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Marolix Technology Solutions Pvt. Limited, Nasuja Building, H No.1-89/G/36, Raheja Mindspace, Near Westin Hotel, Hyderabad - 500 081.","phone":"040-43464347","profile":"Software Developers (Web, Java, PHP) \nMarolix Technology Solutions Pvt. Limited","description":"We are looking for a Software Developers (Freshers) responsible for building applications. Candidates should have good levels of Logical Reasoning, Quantitative Aptitude and Computer fundamentals. Should be fluent in English with a learning attitude. Required Skills (Any One) Web Application, Mobile Application, Java, PHP, UI/ UX, Sales force, Python Word Press, Digital Marketing, Testing. Your primary responsibility will be to design and develop the applications, and to coordinate with the rest of the team working on different layers of the infrastructure. Thus, a commitment to collaborative problem solving, sophisticated design, and product quality is essential. Walk-in Date/ Time: 10th - 26th June , 10 AM onwards Interview Venue: Marolix Technology Solutions Pvt. Limited Nasuja Building, H No.1-89/G/36, Raheja Mindspace, Near Westin Hotel, Hyderabad - 500 081. Contact No: 040-43464347 Mobile No:9490000903 Note: Candidate who have attended the interview with Marolix Technology in the last 6 months not eligible.","location":"Hyderabad","experience":"0 - 2 Years"},{"date":"10, 11, 12, 13, 14, 15 - Jun - 2019","skills":"PHP, React.js, Laravel, Yii Codeigniter, Core PHP, Phalcon","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Remote Programmer Private Limited, 705 Kalikapur Road Kolkata - 700099","phone":"Not Provided","profile":"PHP Developers \nRemote Programmer Private Limited","description":"We need intelligent PHP Developers for overseas Agile projects in Yii2/ Phalcon with React and PgSQL. Good knowledge of HTML, PHP and SQL with 2 + years are must. Knowledge of Yii2 or Phalcon or React or PGSQL are not must. Walk-in Date/ Time: 10th June - 31st July , 10 AM onwards Interview Venue: Remote Programmer Private Limited 705 Kalikapur Road Kolkata - 700099","location":"Kolkata","experience":"2 - 5 Years"},{"date":"10 - Jun - 2019","skills":"PHP, Word Press, HTML and JQuery","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Info Edge India Limited, Express Trade Tower (ETT), B 36, 3rd Floor, Tower I, Sector 132, Noida","phone":"01203082090","profile":"PHP Developer \nInfo Edge India Limited","description":"Requirements: Any Graduate - Any Specialization Minimum 2 years experience in PHP, Word Press, HTML and JQuery. Good Knowledge of PHP and Word Press themes. Good Knowledge of Responsive Design, Bootstrap & Html5. Up to 3 years of experience in website landing page HTML Development Experience in Project Development to Deployment Solid background and knowledge of Adobe Photoshop, WordPress HTML5, CSS3, Jquery, Javascript, PHP. Competencies required to do this job well: Collaboration & Team Work People Leadership Focus on Results Customer Focus Execution Excellence Effective Communication Entrepreneurial Orientation Innovation and Openness to Learning Walk-in Date - 10th June 2019 (Monday) Time - 10 AM - 3 PM Interview Venue - Info Edge India Limited Express Trade Tower (ETT), B 36, 3rd Floor, Tower I, Sector 132, Noida Contact Person - Kuldeep Singh (Group Manager)","location":"Noida","experience":"2 - 6 Years"},{"date":"10, 11, 12, 13, 14, 15 - Jun - 2019","skills":"API, MySQL, Core PHP, AJAX, CSS, etc","qualification":"B.E./B.Tech","address":"Abchlor Investment Advisors Pvt. Limited, 409, Laxmi Mall, Link, Andheri West, Mumbai - 400 053","phone":"022-40713322","profile":"PHP Web Developer \nInvestOnline.in (Abchlor Investment Advisors)","description":"Candidates with minimum 2 years of relevant experience in API, MySQL, Core PHP, AJAX, CSS may apply. - Demonstrable knowledge of web technologies including HTML, CSS, Javascript, AJAX etc. - Good knowledge of MySQL. - Experience in integrating third-party APIs. - Passion for best design & coding practices. - Desire to develop new bold ideas. Job Responsbility: - Write clean, well designed code. - Troubleshoot, test and maintain the core product software and databases to ensure smooth functionality. Walk-in Date/ Time: 10th - 20th June , 10 AM onwards Interview Venue: InvestOnline.in Abchlor Investment Advisors Pvt. Limited 409, Laxmi Mall, Link, Andheri West, Mumbai - 400 053","location":"Mumbai","experience":"2 - 5 Years"},{"date":"15 - Jun - 2019","skills":"Core Java - Fresher","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Compass Systems Private Limited, E84 Sector 63 Noida","phone":"Not Provided","profile":"Java Developer - Fresher \nCompass Systems Private Limited","description":"Candidate should be BE/ B.Tech/ BCA or MCA with good communication skills. Must be an Innovative, creative & a fresh thinker. Job Responsibility- Core Java development and profiling using JVMPI/ JMTI/ BCI and other Java profiling tools. Performance monitoring, profiling, analysis and tuning of Java based applications, Monitor and Evaluate OS resource utilization, Monitor and Tune Garbage Collector performance, JVM, Java Applications, Examine and tune 64 bit JVMs, Optimize the JVM for Multi-core platforms Walk-in Date/ Time: 15th June 2019 from 11 AM onwards Interview Venue: Compass Systems Private Limited E84 Sector 63 Noida","location":"Noida","experience":"0 - 1 Years"},{"date":"15 - Jun - 2019","skills":"Core Java/ DotNet/ Python","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Prutech Solutions India Pvt. Limited, Location: 4th Floor, A Block Unit 1, MJR Magnifique, Khajaguda X Road, Hyderabad - 500 008","phone":"040-48144424","profile":"Software Developer (Java/ .Net/ Python) \nPruTech Solutions India Pvt. Limited","description":"Walk-in Drive for Freshers at PruTech CMMI Level 3 Company on Saturday (15.06.2019) , Hiring Freshers for the positions of Java Developers , DotNet Developers and Python Developers. Candidates should have undergone for the Training either on Core Java/ DotNet/ Python Eligibility Criteria : MCA/ BE/ B.Tech - 2017, 2018 and 2019 Pass Out Experience: 0 - 1 Years Job Location: Hyderabad Notice period: Immediate Should have good Knowledge on the Programming Lanaguages like Java/ DotNet/ Python Should have excellence in the Academins Should possess Good Communication Skills Interview Process: Written Test, Group Discussion and Technical Interview Venue Details : Prutech Solutions India Pvt. Limited, Location: 4th Floor, A Block Unit 1, MJR Magnifique, Khajaguda X Road, Hyderabad - 500 008 Contact Person Name : Keerthi Chekuri Walk-in Date: Saturday (15.06.2019)","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"10, 11, 12, 13, 14 - Jun - 2019","skills":"Keyskills general administration housekeeping electrical maintenance soft services event management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"nThrive Global Solutions Pvt. Limited, Unit 1-5-2, Block A - Eastern Front Wing TECCI Park No: 285, Old Mahabalipuram Road Sholinganallur, Chennai, TN - 600 119","phone":"8448999191","profile":"Administration Executive \nnThrive Global Solutions Pvt. Limited","description":"Educational Qualification: Any Graduate/ Post Graduate Experience: 6 to 9 Years in General Administration Industry: IT / ITES / FMS Skills Set Required: Soft Services pertaining to administration Handled physical Security & Process Housekeeping and cleaning Repairs & Maintenance Electrical, Plumbing etc. Event Management Printing & Stationery Travel & Accommodation Inventory Management Languages & Communication Skills: Good spoken and written communication skills. English, Tamil, (Hindi can be added advantage but not must) Technical Skills: Word, Excel, PPT, MIS and usage of various tools. If the above criteria is suitable kindly walk-in for an interview from 10th to 14th June' 2019 between 11am - 4pm at the below mentioned address- nThrive Global Solutions Pvt. Limited, Unit 1-5-2, Block A - Eastern Front Wing TECCI Park No: 285, Old Mahabalipuram Road Sholinganallur, Chennai, TN - 600 119","location":"Chennai","experience":"6 - 9 Years"},{"date":"6, 7 - Jun - 2019","skills":"Technical Support, IT Help desk, Service Desk, Incident Management","qualification":"B.Sc, BCA/BCS, B.E./B.Tech, Diploma, B.A., B.Com, B.B.A, B.Sc","address":"Precision Techserve Private Limited, Plot # 68, Syndicate Bank Colony, ICICI ATM Lane, West Marredpally, Secunderabad - 500 026","phone":"9121274475","profile":"IT Helpdesk/ Support Engineer \nPrecision Techserve Private Limited","description":"Immediate job opportunity for IT Help Desk/ IT service Desk Executive/ IT Help desk Engineer in Hyderabad and Guntur locations. Desired Skills/ Experience: Any Bachelors Degree/ Diploma or Equivalent ITIL certification is preferred but no mandatory Willing to work under 24/7 support Good verbal & written communication skills Should have 1 to 2 Years Experience. Only MALE candidates are required. Willing to relocate to Guntur or Hyderabad. Walk-in Date/ Time: 6th - 7th June , 9 AM onwards Interview Venue: Precision Techserve Private Limited Plot # 68, Syndicate Bank Colony, ICICI ATM Lane, West Marredpally, Secunderabad - 500 026 Landmark: Near West Marredpally Police Station. Note: Looking only IT Help desk role interested candidates can apply immediately.","location":"Hyderabad, Secunderabad","experience":"1 - 2 Years"},{"date":"7, 8, 10 - Jun - 2019","skills":"Technical Support, International Voice Process, Customer Support","qualification":"B.E./B.Tech, B.Sc, BCA/BCS","address":"Shining Stars IT Private Limited, Ist floor, Chanchal Complex, Cant Road, Lucknow","phone":"7905813124","profile":"Technical Support Associate \nShiningStars Institutions & Travels Pvt. Limited","description":"REQUIREMENT: Candidate must be Graduate (BCA, B.Tech, BE) We are looking for excellent communication skills Neutral accent Should have good pronunciation Comfortable with the night Shifts Salary :- Upto 3 LPA Job Location :- Noida /Gurugram Basic Incentives with no capping 24 x 7 security for all employees Cab facility available. Walk-in Date/ Time: 7th - 10th June , 11 AM onwards Interview Venue: Shining Stars IT Private Limited Ist floor, Chanchal Complex, Cant Road, Lucknow LandMark - Opp Medwell Hospital - Burlington Square Feel free to call us any time @ 7905813124 Alia (HR Recruiter) Whatsapp available on the same number 24*7","location":"Noida, Gurgaon, Lucknow","experience":"0 - 2 Years"},{"date":"7, 8 - Jun - 2019","skills":"Customer Service, Inbound/ Technical Support, Network troubleshooting","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"CSS Corp Private Limited, Ground Floor, 32A & 32B, Ground Floor, Ambit IT Park, Ambattur Industrial Estate, Ambattur, Chennai - 600 058","phone":"9789877694","profile":"Technical Support Engineer \nCSS Corp Private Limited","description":"We are looking for a Technical Support Engineer to provide resolution to our customers. Qualification/ Skills: Graduation is Mandatory, or 10+3 years of diploma is acceptable Good communication in English & excellent telephone etiquette. Experience with customer service environment preferred. Logical reasoning and analytical skills. Flexible to work in night shift. Roles & Responsibilities: Troubleshooting network related problems and diagnosing and solving software issues. Providing support, including procedural documentation and documenting relevant reports Handle inbound queries pertaining to the network & application issues. Working with Engineering on customer driven product requests & enhancements and improving product feature offerings by providing customer feedback to internal cross-functional teams. Interview Date: 7th & 8th June-2019 Time: between 11:00 am - 4:00 pm Interview Venue: CSS Corp Private Limited, Ground Floor, 32A & 32B, Ground Floor, Ambit IT Park, Ambattur Industrial Estate, Ambattur, Chennai - 600 058 HR Raghav (9789877694) Documents to Carry: 2 copies of resume. PAN Card or Aadhar Card Please mention HR name (Raghav) on top of your resume","location":"Chennai","experience":"0 - 3 Years"},{"date":"7, 8, 10, 11, 12, 13, 14 - Jun - 2019","skills":"Technical Support, Window Support, OS, Networking, Connectivity Troubleshooting","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Sutherland Global Services Private Limited, 45A, Sutherland, Vijayanagaram, Velachery Chennai - 42.","phone":"8939113038","profile":"Technical Support Executive \nSutherland Global Services Pvt. Limited","description":"Sutherland Global Services Pvt. Limited, is Hiring for International client for Technical support process. Candidate should have minimum of 6 months International call taking experience is mandate. Should have good knowledge on window support, OS, Networking, Connectivity issue knowledge. Looking for candidate who join immediately and 15 days of notice can apply. Candidate should be flexible to work for rotational night shift. Cab facility will be given for night shift. Salary range between 2.50L to 3.50L PA. Roles & Responsibility Resolving technical issue for the customer over the phone for product like computer, laptop and mobile support. International call taking process across the globe. Provide completed technical support to the customer. Interested candidate shall walk-in for interview from 7th - 14th June 2019 Interview timing - 1.00 AM to 5.00 PM Interview Venue: 45A, Sutherland, Velachery, Vijayanagaram, Chennai - 42. Interested candidate shall drop in mail- Pavithra.s2@sutherlandglobal.com HR - Pavithra.S Contact - 8939113038","location":"Chennai","experience":"1 - 6 Years"},{"date":"11 - Jun - 2019","skills":"Office Administration, Back Office Operations, General Administration, Front Office Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"ANAROCK Property Consultants Pvt. Limited (Formerly Jones Lang LaSalle Residential Pvt. Limited), 4th Floor, Rear Block, Chaitanya Imperial, Anna Salai, Teynampet, Chennai - 600 018","phone":"9840658963","profile":"Front Office/ Admin Executive \nAnarock Property Consultant Pvt. Limited","description":"Candidate should be Any Garduate with 3 to 6 years experience in Office Administration, Back Office Operations, General Administration, Front Office Management, Travel Arrangements, and Vendor Management. Job Responsbility- Attending Incoming & Outgoing calls with proper etiquettes and maintaining records for them and Greeting and assisting visitors and Guests. Ensure Visitor and Guest entry in register and Maintenance of Attendance Register. Being the mirror of the organization, to behave in a very professional manner and always acquiring the professional ethics. Taking care of dispatch, keeping records for incoming and outgoing couriers and further distribution to office employees. Monitor, respond to and distribute incoming communications. Interact with external clients. Walk-in Date/ Time: 11th June 2019, 11 AM onwards Interview Venue: ANAROCK Property Consultants Pvt. Limited (Formerly Jones Lang LaSalle Residential Pvt. Limited) 4th Floor, Rear Block, Chaitanya Imperial, Anna Salai, Teynampet, Chennai - 600 018","location":"Chennai","experience":"3 - 6 Years"},{"date":"6, 7, 8, 10 - Jun - 2019","skills":"LAN/ WAN Switches, Routing, Hardware/ Networking","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Vindhya e-Infomedia Private Limited, No. 3, 4th Main Road, 2nd Cross, 4th Stage, Industrial Town,Rajajinagar, Bangalore - 560 044","phone":"7020220355","profile":"Technical Support/ Team Leader \nVindhya e-Infomedia Private Limited","description":"We have excellent job opportunity with Technical Support/ Team Leader Qualification: Any Graduate Experience :- in TL 1-2 Years Required Skills :- LAN/ WAN Switches, Routing, Hardware/ Networking, Salary: INR 1,75,000 - 2,50,000 P.A No. of Openings: 2 Walk-in Date/ Time: 6th June - 10th June , 9 AM onwards Interview Venue: Vindhya e-Infomedia Private Limited No. 3, 4th Main Road, 2nd Cross, 4th Stage, Industrial Town,Rajajinagar, Bangalore - 560 044","location":"Bangalore","experience":"2 - 3 Years"},{"date":"7, 8 - Jun - 2019","skills":"Technical Support, Customer Support, International Voice Process","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Tech Mahindra Limited, Software Development Block -4 Ground Floor, ODC-1 602/3, Elcot SEZ, Sholinganallur Village Chennai - 600 119","phone":"Not Provided","profile":"Technical Support (Voice Process) \nTech Mahindra Limited","description":"Candidate should be Any Graduate having good communication skills Should be flexible to work in Rot night shifts (24/7) support. Should be good in Intracting. Fresher (2019 Pass out are most welcome) Should have basic understanding in Networking, Desktop 2018/2019 Freshers are most welcome (Any Graduates can apply // backlogs are accepted) Candidate should be flexible to work in 24*7 environments (Rotational Shift), Must be comfortable to work in night shifts. Walk-in with Resume and AADHAR on 7th - 8th June 2019 Entry Time: 10.00 AM-3.00 PM Interview Venue: Tech Mahindra Limited, Software Development Block -4 Ground Floor, ODC-1 602/3, Elcot SEZ, Sholinganallur Village Chennai - 600 119","location":"Chennai","experience":"1 - 5 Years"},{"date":"10, 11, 12, 13, 14 - Jun - 2019","skills":"Technical Support, Windows Support, Networking, Application Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Iron Mountain Services Private Limited, Level 10, Citrine Block, Bagmane World Technology Center (BWTC) Mahadevapura, Marathahalli Ring Road, Bangalore - 560 048","phone":"Not Provided","profile":"Systems/ Support Engineer \nIron Mountain Services Private Limited","description":"Must to Have Skills/ Qualification: - Excellent organizational skills and the ability to work on multiple concurrent tasks - Strong English written, verbal communication and presentation skills - Bachelor of Science or equivalent degree in a technical area - Minimum 2 years of related experience - Experience in managing the delivery of global enterprise software solutions (Hosted Service) - Experience with Enterprise File transfer applications like GlobalScape, Vandyke or other - Experience with SSL Certificate services - Experience in advanced TCP/ IP (WINS, DNS, DHCP) - Strong experience with FTP/ SFTP/ SCP - Knowledge of basic networking and firewall configuration - Strong experience with FTP/ SFTP/ SCP/ HTTP/ HTTPS - Exposure to SAN and NAS - Ability to work in a team environment as well as independently - Knowledge of database technical concepts - Knowledge of Virtual and VMWare concepts - Maintain current knowledge of the technology industry including leading tools and best practices - Ability to work in a team environment as well as independently Preferred Skills: Experience or knowledge on using any Managed File Transfer tool Experience in Windows Administration/ Support Walk-in Date/ Time: 10th - 14th June 2019, 3 PM onwards Interview Venue: Iron Mountain Services Private Limited Level 10, Citrine Block, Bagmane World Technology Center (BWTC) Mahadevapura, Marathahalli Ring Road, Bangalore - 560 048","location":"Bangalore","experience":"2 - 3 Years"},{"date":"8, 10, 11, 12, 13, 14, 15 - Jun - 2019","skills":"General Administration, Back Office Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"QualityKiosk Technologies Pvt. Limited, 419 A, Rupa Solitare MBP, Mahape, Navi Mumbai - 400709","phone":"7021684442","profile":"Admin Executive/ Assistant \nMalwal Solutions","description":"WE ARE LOOKING FOR ADMIN EX/ ASSISTANT FOR MANUFACTURING COMPANY. MIN GRADUATE WITH GOOD DRAFTING SKILL, COMPUTER KNOWLEDGE .. MALE FEMALE BOTHE CAN APPLY SHOULD KNOW ALL ADMIN WORK 1 to 6 - YEARS OF EXPERIENCE WALK-IN DATE: 8th - 30th JUNE 2019 TIME: 10 AM onwards MALWAL SOLUTIONS A WING , 4RTH FLOOR, VAIBHAV PATKAR BUILDING , OPPOSITE TO KASTURI PLAZA, MANPADA ROAD, DOMBIVLI (EAST), MUMBAI - 421 201 5 MINS WALING DISTANCE FROM DOMBIVLI STATION CONTACT No- 7021684442/ 9167765890","location":"Mumbai","experience":"1 - 6 Years"},{"date":"10, 11, 12 - Jun - 2019","skills":"General Administration, Facilities Management, Housekeeping, Canteen, Transportation","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Continuum Managed Solutions Pvt. Limited, Block Rhine, A Wing, 5th Floor, Embassy Tech Zone, Hinjawadi Phase II, Hinjewadi Rajiv Gandhi Infotech Park, Hinjawadi, Pune, Maharashtra - 411 057","phone":"7391055666","profile":"Administration Executive \nContinuum Managed Solutions Pvt. Limited","description":"Candidate should be Any Graduate having atleast 2 years of experience in Admin & Facilities Management. Should be good in communication skills. Must be comfortable to work in 24*7 shifts. Required Skills: Should have handled Housekeeping, Cafeteria, Security, Transport . General office administration. Working knowledge on HVAC, Fire alarm systems, Plumbing & Electricals supplies Roles & Responsibility: Ensuring Zero Downtime of business process and Office facility services to be made available 24*7. Providing Safe & smooth working conditions in the office premises. Monitoring Group/ Department Policies & Procedures Vendor Management and Statutory Compliances Planning ,Supervision & Controlling of Facility Management Team and personnel. Liaise and coordinate with Vendors & Consultants to ensure statutory compliance related to on-site vendor staff. Ensuring proper Maintenance & Upkeep of Critical Equipments Walk-in Date/ Time: 10th - 12th June , 11 AM onwards Interview Venue: Continuum Managed Solutions Pvt. Limited Block Rhine, A Wing, 5th Floor, Embassy Tech Zone, Hinjawadi Phase II, Hinjewadi Rajiv Gandhi Infotech Park, Hinjawadi, Pune, Maharashtra - 411 057","location":"Pune","experience":"2 - 7 Years"},{"date":"7, 8 - Jun - 2019","skills":"Java Coding, JSP. Linux OS, Unix OS, Windows OS,","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Manipal Technologies Limited, No: 10, 3rd Floor, Casa Brigitta, Brunton Road, Bangalore - 560 025","phone":"08202205613","profile":"Software Engineer - Java/ Support \nManipal Technologies Limited","description":"We are Conducting a walk-in for Software Engineers for Bangalore Location. please find the below details for your reference. Qualification: BE/ B.Tech/ MCA/ Diploma Skills Required: 1. 2-4 years of experience in software development/ support / implementation. 2. Excellent knowledge of Java Coding, JSP. Linux OS, Unix OS, Windows OS, Commands Shell Scripts. 3.Familiarity with Tomcat, JBOSS. 4. Good knowledge of SQL queries, familiarity with Oracle, MS, SQL DB2. 5. Knowledge and working experience in in Banking domain is must. Roles & Responsibilities: 1. High drive to learn new things. 2. Implement projects at client location 3. Follow-up and give timely feedback to the reporting authority 4. Interact in a pleasing and effective way with client and vendor personnel 5. Support and Implement product features and manage environment 6. Handling any additional responsibilities as and when given 7. Establish excellent relationships by providing service delivery with client Interested candidates can send your resume to madhukar.h@manipalgroup.info to confirm your availability. Walk-in Date: 07/ 08 June 2019 Time: 10:00 AM - 4:00 PM Interview Venue: Manipal Technologies Limited No: 10, 3rd Floor, Casa Brigitta, Brunton Road, Bangalore - 560 025 Interview Rounds: Written Test Personal interview","location":"Bangalore","experience":"2 - 4 Years"},{"date":"8 - Jun - 2019","skills":"Java, Microservices, Rest, Spring Boot, Hibernate","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"AgreeYa Mobility India Pvt. Limited, 401-402, Amar Apex, Baner Road, Pune, Maharashtra - 411 045. Landmark: Opposite Bata showroom","phone":"020-67278800","profile":"Java/ J2EE Developer \nAgreeYa Mobility India Pvt. Limited","description":"Looking for immediate joinee for Java/ J2ee position. Work Experience : 3 to 7 Years Job Location : Pune No. of Positions : 15 Notice Period : Not more then 30 days, unless serving. Key Responsibilities: Design and build J2EE / Spring . Analyse customer/internal requirements/specifications and translate these into software designs. Develop high quality software code based on designs. Perform extensive unit and system level testing to insure that all requirements are met and the highest software quality is achieved. Collaborate with cross-functional teams to analyse, design, and ship new applications Ensure the best possible performance, quality, and responsiveness of the application Identify and correct bottlenecks, fix bugs . Help maintain code quality, organization, and automatization. Walk-in Date/ Time: 8th June 2019, 9 AM onwards Interview Venue: AgreeYa Mobility India Pvt. Limited 401-402, Amar Apex, Baner Road, Pune, Maharashtra - 411 045 Landmark: Opposite Bata showroom Share your updated resume in below format : Total experience : Rel Experience CTC: Expected CTC: Notice period: Current location: Current employer: Contact No: F2F interview availability on 8th June (Y/ N) :","location":"Pune","experience":"3 - 7 Years"},{"date":"8 - Jun - 2019","skills":"Java /JEE, Spring 4.x/5.x, Spring Boot","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Sunera Technologies Private Limited, Block-2, 06th Floor, My Home Hub, Hi-Tech City, Hyderabad - 40","phone":"8247651181","profile":"JAVA Developer \nSunera Technologies Private Limited","description":"Experience Level: 6 Months to 3 Years Notice Period: Need resource who can join within 30 Days / immediate Work Location: Hitech city, Hyderabad Requirements : 1year of relevant object-oriented application building experience in a professional environment 1 years of experience in Java /JEE, Spring 4.x/5.x, Spring Boot and other Spring related technologies 1 year of experience designing and developing services for high volume, high transactions environment such as retail e-Commerce websites or real-time events processing 1+ years of experience in building REST services and/or micro-services If interested, kindly Walk-In to your convenient venue to have a right opportunity in your career Walk-in Date/ Time: 8th June 2019, 10 AM onwards Interview Venue: Sunera Technologies Private Limited Block-2, 06th Floor, My Home Hub, Hi-Tech City, Hyderabad - 40 Land Mark : Near Hi tech city circle. Contact : Swetha Mobile No -8247651181","location":"Hyderabad","experience":"0 - 3 Years"},{"date":"7 - Jun - 2019","skills":"Back Office, Administration, Data Analysis, Data Processing","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"3i Infotech Limited, Tower No. 6, 6 th Floor, Vashi Station Complex, Vashi Navi, Mumbai.","phone":"Not Provided","profile":"Interview for Back Office (only Male) \n3i Infotech Limited","description":"We are conducting a walk-in drive on 7th June 2019 (Friday) Experience - 2+ Years of Struts 1.2 Skills Required - Java with Struts (Struts 1.2 is must ) Interview Location: 3i Infotech Limited, Tower No. 6, 6 th Floor, Vashi Station Complex, Vashi Navi, Mumbai","location":"Mumbai","experience":"1 - 6 Years"},{"date":"8 - Jun - 2019","skills":"Java, J2ee","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"GSPANN Technologies Pvt. Limited 2nd Floor, N-Height, Plot No: 38, Hitech City, Phase-2, Kondapur, Hyderabad. Landmark: Opposite to Tech Mahindra","phone":"9100441118","profile":"Senior Java Developers \nGSPANN Technologies Pvt. Limited","description":"Walk-In Drive on 8th June 2019 for Senior Java Professionals @ Hyderabad location. Qualification: BE/ B.Tech/ M.Tech/ MCA Work Experience : 5 + Years Job Location : Hyderabad Required Skills : Excellent communication skills with confidence and clarity Experience of interacting with clients. Deliver quality tasks on time. Lead the team and provide technical guidance/mentor other team members. Should be a quick learner. Roles & Responsibilities: Understanding of object-oriented analysis and design (OOAD), software design patterns, and Java coding principles. Hands-on experience in Java, Spring, Spring Boot, Hibernate, RDBMS, NoSQL, Web Services (RESTful API's and SOAP). Experience of working in an Agile/Scrum environment. Experience in Solution Architecture would be a plus. Java (1.7 or higher), J2EE, Spring, Microservices, Spring Boot, and web services (RESTful and SOAP) Please register your self in below link is mandatory. Registration Link : https://bit.ly/2IKhazM Venue Details GSPANN Technologies Pvt. Limited 2nd Floor, N-Height, Plot No: 38, Hitech City, Phase-2, Kondapur, Hyderabad. Landmark: Opposite to Tech Mahindra Google Maps : https://goo.gl/maps/K6Xr8qVk2My","location":"Hyderabad","experience":"5 - 10 Years"},{"date":"9 - Jun - 2019","skills":"Python Django Javascript React.Js Angularjs Manual Testing Automation Testing","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Innofin Solutions Private Limited, LenDenClub 602, Quantum Towers, Rambagh Ln, Nadiyawala Colony 2, Malad West, Mumbai - 400 064","phone":"7066753043","profile":"Junior Software Developer \nInnofin Solutions Private Limited","description":"Candidate should have 0 to 3 years of relevant experience Coding knowledge or experience in using JavaScript frameworks such as React Native, ReactJS & AngularJS Coding knowledge or experience in using Python Framework- Django & Flask Immediate Joiners preferred Job Responsibility- Developing front end website architecture Designing user interactions on web pages Developing back end website applications Designing & developing APIs Walk-in Date/ Time: 9th June 2019, 11 AM onwards Interview Venue: Innofin Solutions Private Limited LenDenClub 602, Quantum Towers, Rambagh Ln, Nadiyawala Colony 2, Malad West, Mumbai - 400 064","location":"Mumbai","experience":"0 - 3 Years"},{"date":"8 - Jun - 2019","skills":"Java, J2EE: Spring, Hibernate, REST, JSP, Servlet","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"EliteEvince Technologies, C-706-708, Siddhivinayak Towers, Near Kataria House, B/h Jaguar Showroom, Makarba, Ahmedabad - 380 051.","phone":"8460499596","profile":"Java/ J2EE Developer \nEliteEvince Technologies","description":"Urgent opening for Sr. Java/ J2EE Developer Required Experience 2 to 4 Years Job Responsibilities & Duties Must have expertise in modeling and designing Java/ J2EE based solutions and should have familiarity with different design patterns Should have good communication skills Write well designed, testable, and efficient code Required Experience, Skills and Qualifications Java: OOPS Concepts J2EE: Spring, Hibernate, REST, JSP, Servlet Web Development: HTML, CSS, jQuery, Bootstrap Database: MySQL MEAN Stack Development skills will be a plus Benefits Professional Development Friendly Environment 5 days working Walk-in Date/ Time: 8th June 2019, 9 AM onwards Interview Venue: EliteEvince Technologies C-706-708, Siddhivinayak Towers, Near Kataria House, B/h Jaguar Showroom, Makarba, Ahmedabad - 380 051.","location":"Ahmedabad","experience":"2 - 4 Years"},{"date":"6, 7, 8 - Jun - 2019","skills":"Core Java, Web Services, Spring, Hybernate","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"IndusInd Bank Limited, IBL House, 3rd floor, Cross B Road, MIDC, J. B. Nagar Chakala, Off Andheri Kurla Road, Andheri (East), Mumbai - 400 059","phone":"Not Provided","profile":"Java Developer \nIndusInd Bank Limited","description":"Candidate should be BE/ B.Tech/ M.Tech or MCA with 1 to 5 years of experience in Software Development using Core Java-Web Services - Spring, Hybernate + Finacle, Internet Banking Walk-in Date/ Time: 6th - 8th June , 10 AM onwards Interview Venue: IndusInd Bank Limited IBL House, 3rd floor, Cross B Road, MIDC, J. B. Nagar Chakala, Off Andheri Kurla Road, Andheri (East), Mumbai - 400 059","location":"Mumbai","experience":"1 - 5 Years"},{"date":"6, 7, 8 - Jun - 2019","skills":"Java Trainee/ Fresher","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"iPRIMED Education Solutions Pvt. Limited, #62B, Electronics City, Phase-I, Opp EC PO, Bangalore - 560 100","phone":"080-40941642","profile":"Software Trainee (Java) \niPrimed Education Solutions Pvt. Limited","description":"Quinnox is hiring Trainee Software Engineer (Java) Freshers Eligibility Criteria: 60% aggregate only in B.E/ B.Tech/ MCA (CS/ IT/ IS) (No year gap in between education) - 2019 Pass outs Job Location: Bangalore Salary: INR 3,00,000 - 3,50,000 P.A Walk-in Date/ Time: 6th June - 8th June , 11 AM onwards Interview Venue: iPRIMED Education Solutions Pvt. Limited #62B, Electronics City, Phase-I, Opp EC PO, Bangalore - 560 100 Tel : +91-80-40941642, Cell: +91-9036011766","location":"Bangalore","experience":"1 - 5 Years"},{"date":"8 - Jun - 2019","skills":"Java J2EE, Spring, Hibernate, Databases","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"GAVS Technologies Private Limited, No: 11, Old Mahabalipuram Road, Sholinganallur, Chennai - 600 119","phone":"Not Provided","profile":"Java Fullstack Developer \nGAVS Technologies Private Limited","description":"We at Gavs are looking out for Java fullstack developers at various levels to work from our Chennai office. Experience/ Skill Sets: * Minimum 3 years of experience in Java Development * Good experience on Java J2EE, Spring, Hibernate, Databases * Experience in CSS, JavaScript [either AngularJS/ ReactJS/ NodeJS is must] Interested candidates can share their updated resume in MS word format to charanya.b@gavstech.com & come for a f2f interview on Saturday [8th June 2019], between 10 am & 1 pm at the below mentioned address- GAVS Technologies Private Limited No: 11, Old Mahabalipuram Road, Sholinganallur, Chennai - 600 119 Landmark: 1) Opp to Gateway Hotel 2) Dollar Bus Stop","location":"Chennai","experience":"3 - 8 Years"},{"date":"8 - Jun - 2019","skills":"spring framework core java design patterns multithreading javascript","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"QuEST Global Engineering Services Pvt. Limited, 2nd Floor, Primrose 7B, Embassy Tech Village, Near New Horizon College, Devarabisanahalli, Outer Ring road, Bellandur, Bengaluru - 560 103.","phone":"Not Provided","profile":"Java Professionals \nQuEST Global Engineering Services Pvt. Limited","description":"Desired Skills 3 - 4 years of experience in the design and development Java Applications 1 - 2 years of experience in REST Services and Spring framework. Experience in developing and deploying micro services. Working experience with Node JS Extensive knowledge and work experience in Angular 2 + Extensive experience in Unit Testing. Core Java with knowledge of data structures, multithreading, concurrency, collections, OOAD, design patterns, SOA Essential Job Functions: Responsible for programming a component, feature and or feature set. Works independently and contributes to the immediate team and work with Architects, PO and other team leads. Contributes to design discussions. Job Location: White field, Bangalore. Walk-in Date/ Time: 8th June 2019 from 9 AM onwards Interview Venue: QuEST Global Engineering Services Pvt. Limited 2nd Floor, Primrose 7B, Embassy Tech Village, Near New Horizon College, Devarabisanahalli, Outer Ring road, Bellandur, Bengaluru - 560 103.","location":"Bangalore","experience":"3 - 8 Years"},{"date":"8 - Jun - 2019","skills":"SQA Testing Manual Testing Java","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Ebix Software India Private Limited, 7th Floor, Building No: H6A, Phoenix Infocity, Advance Business Hub, Hitech City-2, Hyderabad","phone":"Not Provided","profile":"Java Developer & QA Tester (Freshers) \nEbix Software India Private Limited","description":"Ebix Software India Private Limited is hiring for Freshers - Java Developer & SQA Position 1: Trainee SQA Required Key skills- Basic Knowledge of Manual Testing Basic knowledge of Java Basic Knowledge of SQL Good communication skills Position 2 : Java Developer Required Key skills: Basic Knowledge of Java Good Communication skills Strong in aptitude, problem-solving and logical thinking skills. Quick learner with a great attitude. If interested please walk-in to the below details of the interview. Date : 08th June, 2019 (Saturday) Time: 10:00 AM to 4 PM Venue:- Ebix Software India Private Limited Address -7th Floor, Building No: H6A, Phoenix Infocity, Advance Business Hub, Hitech City-2, Hyderabad Contact Person- Unnatha (HR)","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"8 - Jun - 2019","skills":"Core Java, J2EE, Spring MVC framework","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Financial Software & Systems (P) Limited, 1st Floor, Kalpataru Prime IT Park, Plot No. D-3, Road No. 16, Wagle Industrial Estate, MIDC, Thane (West) - 400 604","phone":"Not Provided","profile":"Java Developers \nFinancial Software & Systems (P) Limited","description":"Core Competency Requirements: Experience in Core Java, J2EE Experience in Spring MVC framework Banking OR Non-Banking Other Requirements: Designs develops and implements web-based Java applications to support business requirements and projects Write well designed, testable, efficient code Design and develop features and functionality Proficient with APIs and service-oriented architectures Willing to learn new emerging technology Creates user information solutions by developing, implementing and maintaining Java based components and interfaces Contribute to team meetings, develop new applications that serve existing software systems and further develop current software. Explore opportunities to add value to job accomplishments Great verbal and written communication skills Enthusiastic when embracing new challenges A willingness to teach and help others Adaptable and flexible when new tasks or projects are given Work Experience - 1 to 6 Years Location - Thane, Mumbai Working day - 5 Days Interested candidates please walk-in for the interview on Saturday, 8th June 2019 between 10 AM to 3 PM along with below documents. Hard copy of the resume Last 3 months pay slip Current company offer letter or increment letter 2 Passport Size Photo Interview Venue: Financial Software & Systems (P) Limited 1st Floor, Kalpataru Prime IT Park, Plot No. D-3, Road No. 16, Wagle Industrial Estate, MIDC, Thane (West) - 400 604 Contact Person: - Suraj Singh / Akash Bhosale","location":"Mumbai","experience":"1 - 6 Years"},{"date":"8 - Jun - 2019","skills":"Automation Testing, Selenium Webdriver, Automation Framework, jMeter","qualification":"B.E./B.Tech","address":"SHL (India) Private Limited, 9th Floor, Building No. 10B, DLF Cyber City, Gurgaon - 122002","phone":"Not Provided","profile":"QA/ Automation Tester \nSHL (India) Private Limited","description":"Education/ Experience Requirements: B.E/ B. Tech in Computer Science, Information Technology or relevant professional experience 3-5 years of experience in an IT or Business environment testing highly scalable applications Excellent communications skills interacting with technical and business audiences Any testing certification is a plus. Candidate Attributes: Effective time management skills and ability to meet deadlines Exceptional communication skills, to both technical and non-technical audiences Excellent organization, multitasking, and prioritization skills Ability to work independently and with a team Good communication skills and ability to work with global teams to define and deliver on projects Intellectual curiosity, passion for technology and keeping up with new trends Walk-in Date: 8th June 2019 Time: 10 am to 5 pm Interview Venue: SHL (India) Private Limited 9th Floor, Building No. 10B, DLF Cyber City, Gurgaon - 122002","location":"Gurgaon","experience":"3 - 5 Years"},{"date":"4, 5, 6, 7 - Jun - 2019","skills":"General Administration, Front Office Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Harsha Toyota, (HY02A), Harsha Automotive Private Limited D.No. 2-40/5, Kothaguda, Near Hi-Tech City, Hyderabad - 84.","phone":"040-44374437","profile":"Administration Executive \nHarsha Automotive Private Limited","description":"We have requirement of Admin Executive in Administration Department Educational Qualification: B.Com/ BSc Freshers Should have Letter drop-ting and MS Office skills Excellent communication skills Walk-in Date/ Time: 4th - 7th June 2019, 10 AM onwards Interview Venue: Harsha Toyota, (HY02A), Harsha Automotive Private Limited D.No. 2-40/5, Kothaguda, Near Hi-Tech City, Hyderabad - 84. Tel: 040-44374437/ 23113555, Ext: 938 Fax:040-23113311, Mobile:+919959888676, eMail: hy02a_hrsales@harshaauto.com","location":"Hyderabad","experience":"0 - 2 Years"},{"date":"6, 7, 8, 9, 10 - Jun - 2019","skills":"General Administration, Front Office, Facility Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Lynks Logistics Limited, 2nd Floor, 108A, Venkatachalam Street, Dr. Radhakrishnan Salai, Mylapore, Chennai - 600 004.","phone":"044-66723400","profile":"Admin/ Front Office Executive \nLynk Logistics Limited","description":"Educational Qualification: Any Graduate Work Experience: 2+ years Job Location: Chennai Job Responsibility: Responsible for managing front desk operations Responsible for day to day Admin activities Supervision of other Admin and House Keeping staff Travel reservations for Office staff Walk-in Date: 6th - 10th June 2019 Timings: 9 AM onwards Interview Venue: Lynks Logistics Limited 2nd Floor, 108A, Venkatachalam Street, Dr. Radhakrishnan Salai, Mylapore, Chennai - 600 004. Tel No: 044-66723400","location":"Hyderabad","experience":"2 - 7 Years"},{"date":"4, 5, 6, 7, 10 - Jun - 2019","skills":"HR Policies, Induction, HR Administration, Leave Management, Onboarding/ Attendance","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Career Catalysts HRC Private Limited, 304-B Wing, Leo Bldg, 24th Road, Off. Linking Road, Behind KFC, Khar (West), Mumbai - 400 052.","phone":"9594619425","profile":"HR / Admin Executive \nCareer Catalysts HRC Private Limited","description":"Job Location: Bandra (West) Mumbai Work Timings: 09.30 AM - 06.30 PM, or 10.00 AM -07.00 PM Working Days: 5 Days (Monday - Friday) Job Responsibility:- Recruitment: Sourcing, screening and interviewing of desired candidates Maintain Database: Attendance & Leave management Joining formalities: Induction and on-boarding of the new recruits to the system and to explain them Hr policies and procedures Documentation: Creation of confirmation letters, experience, relieving letter , monitor contract expiry for renewals& Maintain employee records (soft and hard copies) Vendor management: Maintain relationships with vendors, keep a track of price data & comparison sheet of multiple vendors to get best pricing services. Record keeping of vendors list. Handling :-Petty cash management, insurance-related issues Handling the full and final settlement of the employees Taking care of entire admin activities. Walk-in Date: 4th - 10th June 2019 (Mon -Fri) Timings- 11:00 am to 5:00 pm Interview Venue: Career Catalysts HRC Private Limited 304-B Wing, Leo Bldg, 24th Road, Off. Linking Road, Behind KFC, Khar (West), Mumbai - 400 052.","location":"Mumbai","experience":"0 - 2 Years"},{"date":"4, 5, 6, 7, 8 - Jun - 2019","skills":"HR, Office Administration, Liaison, Vendor Management","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Zoom Car India Private Limited, 105/106, Suratwala Mark Plazzo, Opp. Fortune Inn Hotel, Hinjewadi, Pune -411 057","phone":"Not Provided","profile":"HR & Admin Executive \nZoom Car India Private Limited","description":"Candidate should be Any Graduate/ MBA (HR) with 2 to 6 years of experience in HR, Office Administration, Liaison, Vendor Management. Key Responsibility- 1. Recruitments 2. General Administrations 3. Legal & Liasoning 4. Vendor Management 5. Basic Idea of Car Operations Walk-in Date/ Time: 4th - 8th June 2019, 10 AM onwards Interview Venue: Zoom Car India Private Limited 105/106, Suratwala Mark Plazzo, Opp. Fortune Inn Hotel, Hinjewadi, Pune - 411 057","location":"Pune","experience":"2 - 6 Years"},{"date":"8 - Jun - 2019","skills":"Selenium Webdriver Test Scenarios Test Scripts SQL Test Cases SDLC","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Bitwise Solutions Private Limited, Bitwise TerraTower, Survey No. 61/1/1, Baner Adjoining Highway, Baner, Pune- 411 045","phone":"020-67181200","profile":"Automation Test Engineer \nBitwise Solutions Private Limited","description":"BITWISE SOLUTIONS WALK_IN FOR AUTOMATION TEST_SELENIUM Qualification: BE, B Tech, MCA Experience: 1 to 5 Years Mandatory Skills: Proficient in either Core Java and Selenium WebDriver or Node.js, Writing SQL statements Should be able to analyze requirements and identify test scenarios and write associated test cases Should be able to analyze existing scripts and design new test scripts using either Selenium or Node.js Should be proficient in compiling the test matrix and test results reporting Should have experience with test/defect management tools like Rally and qTest Exposure and experience of working in Agile SDLC methodology would be preferred Walk-in Date & Time : Saturday, 8th June, 9:00 AM onwards Interview Venue: Bitwise Solutions Private Limited Bitwise TerraTower, Survey No. 61/1/1, Baner Adjoining Highway, Baner, Pune- 411 045 Phone No: 020-67181200 *Candidates appeared in the last 6 months will not be considered .","location":"Pune","experience":"1 - 5 Years"},{"date":"8 - Jun - 2019","skills":"QTP Quick Test, UFT, Automation Testing","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Hexaware Technologies Limited, Plot No. H5 SIPCOT IT PARK, Navallur Post, Kanchipuram Dt, Siruseri - 603 103","phone":"Not Provided","profile":"Automation Testers - UFT/ QTP \nHexaware Technologies Limited","description":"Hexaware Technologies is hiring Automation Testing - QTP/ UFT Testers on 8th June 2019 at Chennai Work Experience: 3 - 9 years Skills: ETL Candidate must have strong knowledge in Test Automation using QTP Minimum 3.5 12 Years of exp in test automation and at least 2 - 4 years working with QTP tools Strong Knowledge in VB Script and SQL is required Should have experience in Agile Methodologies Practical Experience of implementing automation frameworks (Keyword and Hybrid) Good English and client communication skills Experience in creating Test plan/ Test Strategy Flexible enough to support on different situation and flexible hours Notice period: Immediate to 45 days Preferred Immediate Joiners (30 days Max) Shift: 1 PM to 10 PM Interested candidates please walk-in to the below venue Interview date: 8th June 2019 Time: 9am to 2pm Venue: Hexaware Technologies Limited, Plot No. H5 SIPCOT IT PARK, Navallur Post, Kanchipuram Dt, Siruseri - 603 103 Contact Person: Lokesh Kumaran","location":"Chennai","experience":"3 - 9 Years"},{"date":"8 - Jun - 2019","skills":"C Test Cases Software Testing Test Case Execution Test Scripts Test Case Review Black Box Bug Tracking","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Cyient Limited, Plot No. 2, IT Park, Nanakramguda, Manikonda, Hyderabad - 500 032. Land Mark : Near Continental Hospital","phone":"040-67489921","profile":"Software Testing Engineer \nCyient Limited","description":"Educational Qualification : BE/ B.Tech Years of Experience: 2 to 6 years Job Location : Hyderabad Essential Skills: At least 1 year of C / C++ / C# language experience to develop automation test scripts Must have black box software testing experience on any safety critical applications from any domain Should be able to understand Hardware and Software integration Working knowledge in requirement management, configuration management and defect tracking tools Proven ability to quickly understand existing system and develop system validation test procedures Create, maintain and execute test cases, develop test scripts in C# Review test cases, test specifications and reports generated by peers and give formal feedback Write and maintain clear, precise bug reports to submit to our bug tracking system Test execution on both PC and target environment Document and report status / progress Walk in Date : 8th June (Saturday) Time : 10.00 AM - 12.00 PM Walk-In Venue: Cyient Limited, Plot No. 2, IT Park, Nanakramguda, Manikonda, Hyderabad - 500 032. Land Mark : Near Continental Hospital Contact Person : Manohar Burri Tel: 040-67489921","location":"Hyderabad","experience":"2 - 6 Years"},{"date":"11 - Jun - 2019","skills":"C, OOPs, ASP .Net, C#","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Snap-on Business Solutions India Pvt. Limited, 1st floor, Tower C, Logix Techno Park Plot No. 5, Sector 127, Noida (U.P)","phone":"0120-4508462","profile":"ASP .Net/ C# Developer (Fresher) \nSnap-on Business Solutions India Pvt. Limited","description":"Snap-on Business Solutions India Pvt. Limited, is hiring for ASP .Net/ C# Developer (Fresher). C# knowledge is mandatory REQUIREMENTS: Must be B.Tech/ B.E/ M.Tech/MCA (CS/ IT Stream only) 18/19 batch with 60% overall and regular academic background. Good OOPs concept and its implementation. Good Asp.net and C# programming skills. Must have done any training/ internship/ project on Asp .Net Good communication skills in English. Good analytical skills. Interested candidates can directly walk in on Tuesday 11th June 2019 at 11.00 Am sharp. Candidates reaching after 11.30 Am, would not be entertained . Venue: Snap-on Business Solutions India Pvt. Limited 1st floor, Tower C, Logix Techno Park Plot No. 5, Sector 127, Noida (U.P) Rounds of Interviews: 1- Aptitude Test (Written) 2- Written English communication Test Please Note: 1. Candidate should be ready to sign a service agreement of 1.5 years. 2. Please do not apply those candidates who have already attended any interview process at our company in last 6 months.","location":"Noida","experience":"0 - 1 Years"},{"date":"15 - Jun - 2019","skills":"Application Testing Acceptance Testing Quality Assurance UAT QA Application Integration","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Trident Hotel, Hitech City Main Road, HITECH City, Near Cyber Towers, Madhapur, Hyderabad, Telangana - 500 081","phone":"7994250919","profile":"Manual Testers \nNavigant BPM (India) Private Limited","description":"Opening for Manual Testers: 1) Manual Tester (SQL) 2) Manual Tester (Scrum) 3) SQL + ETL Tester 4) Python Tester Develop and establish quality assurance measures and testing standards for new applications, products, and/or enhancements to existing applications throughout their development/product lifecycles. Adhere to established QA standards for software development, application integration, and information system performance, and corresponding documentation. Create and execute test plans and scripts that will determine optimal application performance according to specifications. Communicate test progress, test results, and other relevant information to manager. Coordinates on QA and UAT process within the team Reviews architecture and technical specifications for conflicts or issues that could affect quality Performs acceptance testing and manages user testing when needed Travel to meet teammates, partners, business owners, and users when required. Work Location: Trivandrum , Kerala Interview Location: Hyderabad Interested candidates may walkin on 15th June from 9 AM onwards to the below venue- Trident Hotel , Hitech City Main Road, HITECH City, Near Cyber Towers, Madhapur, Hyderabad, Telangana - 500 081 or can also ask your friends with similar profile to walkin.","location":"Hyderabad","experience":"2 - 7 Years"},{"date":"6, 7, 10, 11, 12, 13, 14 - Jun - 2019","skills":"Game Testing, Mobile application testing, Writing test cases.","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Indium Software (India) Limited, No. 100, 5th Floor, Kay ARR Royal Stone Tech Park, Swami Vivekananda Road, Pai Layout, Benniganahalli, Bengaluru, Karnataka - 560 016","phone":"Not Provided","profile":"Game Tester - QA \nIndium Software (India) Limited","description":"Candidate should have 0 to 6 years of experience into Game Testing Must be good in testing, debugging and analytical skills. Should have experience in Mobile application testing, Writing test cases. Should have experience with JIRA Should have knowledge on gaming domain Should be a Passionate Gamer with experience playing a wide range of Games Should have relevant work experience in Mobile,PC or Console Game testing Creating test cases for games Optimize testing procedure by identifying and eliminating redundancies. Walk-in Date/ Time: 6th - 14th June , 11 AM onwards Interview Venue: Indium Software (India) Limited No. 100, 5th Floor, Kay ARR Royal Stone Tech Park, Swami Vivekananda Road, Pai Layout, Benniganahalli, Bengaluru, Karnataka - 560 016 THIS DRIVE IS EXCLUDING SATURDAY AND SUNDAY","location":"Bangalore","experience":"0 - 5 Years"},{"date":"8 - Jun - 2019","skills":"PHP/ MySQL & various Open Source frameworks & CMSs","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"IndusInd Bank Limited, IBL House, Cross B Road, MIDC, J.B.Nagar chakala, Off Andheri Kurla Road, Andheri (East), Mumbai -400 059","phone":"Not Provided","profile":".Net Developer \nIndusInd Bank Limited","description":"Candidate should be BE/ B.Tech or MCA with 1 to 5 years of relevant experience. MVC- 3 Years Angular- 2 Years API Services- 1 Year Database- Sql Job Location- Chakala Walk-in Date/ Time: 8th June 2019, 10 AM onwards Interview Venue: IndusInd Bank Limited, IBL House, Cross B Road, MIDC, J.B.Nagar chakala, Off Andheri Kurla Road, Andheri (East), Mumbai -400 059","location":"Mumbai","experience":"1 - 5 Years"},{"date":"8 - Jun - 2019","skills":".Net, Java, Prism, Automation Tools, Process Automation","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Wipro Limited, SJP-2, Sarjapur Road, Bangalore","phone":"Not Provided","profile":"RPA Developers (Java/ .Net) \nWipro Limited","description":"Walk-in Drive at Wipro Limited for RPA Developers on 8th June 2019 | Location : Bangalore Candidate should have minimum 1.5 - 2 years of experience in Robotic Process Automation (RPA) Authorized external Certification in any one of the Automation tool would be an advantage Minimum 2 years of experience in programming (.NET, Java, etc.) Hands-on experience with one or more of the following robotics automation tools: - Blue Prism - Automation Anywhere - NICE - UI Path Experience Range: 2 to 12 years Work Location: Pune / Mumbai / Chennai / Delhi / Hyderabad [You can opt for your Preferred Work Location once selected] Walk-in Date: 8th June 2019 (Saturday) Time - 10 AM to 4 PM Interview Venue : Wipro Limited, SJP-2, Sarjapur Road, Bangalore Contact Person: Bharathkumar TG","location":"Bangalore","experience":"2 - 12 Years"},{"date":"3, 4, 5, 6, 7 - Jun - 2019","skills":"ASP .Net, HTML, MVC, C# Ajax, Web Development, SQL Server","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Path Infotech Limited, Lodha Supremus,604, 6th Floor, Opposite MTNL Sakivihar Road, Off. JVLR, Powai, Mumbai - 400 072.","phone":"Not Provided","profile":"ASP .Net Developer \nPath Infotech Limited","description":"Qualification: Any Stream of Graduation (Full-Time Qualification is mandatory) Experience: 2 to 4 years (Not less than 2 years; Not more than 4 years) Job Location: Mumbai(Sakivihar Road) Essentials: Experience in ASP.NET Experience in C# Experience in SQL Server preferred Clear OOPS Concepts Skills Required: .Net coding skills with rich experience in web development and database management using core Net 4 and 4.5 , MVC , AJAX,SQL server,HTML etc. Independently able to manage and create websites and product/Application development etc. Requisite Work Experience : Experience in using .NET development Experience in using ASP.NET for developing web applications A good understanding of T-SQL, MS SQL, OOP principles, N-tier and N-layered architecture Special Skills Required: Strong analytical skills Attention to detail Experience of working effectively as part of a team Good written and verbal communication skills Inter-personal skills A flexible approach and ability to adapt Ability to work under own initiative Walk-in Details: Date: 03 June, 2019-07 June, 2019 Time Slots: 10.00 AM to 04.00 PM Venue: Path Infotech Limited Lodha Supremus,604, 6th Floor, Opposite MTNL Sakivihar Road, Off. JVLR, Powai, Mumbai - 400 072. Contact Person: Darshana Bhoir If you are interested or have colleagues who suit the role kindly share a copy of your updated resume at darshana.bhoir@pathinfotech.com Note: Candidates who can either join immediately or within 15 days will be processed.","location":"Mumbai","experience":"2 - 4 Years"},{"date":"6, 7, 8 - Jun - 2019","skills":".Net, MVC, C++","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Muthoot Microfin Limited (IT Office), 2nd Floor, RKJ Tower, Kadavanthra, Cochin, Kerala","phone":"0484 4345666","profile":"Junior .Net Developer \nMuthoot Microfin Limited","description":"Candidate should be Any Graduate with 0 to 1 year experience in .Net, MVC, C++ Flexibility, Decisiveness, Tenacity, Independence, Risk taking, Personal integrity. Good Collaboration qualities. Good Interpersonal skills Resilience, Achievement orientation, Initiative, Quality Focus. Walk-in Date/ Time: 6th - 8th June , 10 AM onwards Interview Venue: Muthoot Microfin Limited (IT Office), 2nd Floor, RKJ Tower, Kadavanthra, Cochin, Kerala Landmark : Kotak Mahindra Bank, Kadavanthara Junction - Kaloor Kadavanthara Road Tel: 0484 4345666","location":"Kochi","experience":"0 - 1 Years"},{"date":"4, 5, 6, 7 - Jun - 2019","skills":"ASP .NET/ MVC and SQL Server","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"KodeCorp Technology Solutions Pvt. Limited V-Square Building, H.NO 1-98/90/25/p/50, 3rd floor Behind Big C, Madhapur, Hyderabad. LandMark: Opp to Fortune Towers, M.S.Challa Builder","phone":"6302684899","profile":"Asp .Net MVC Developer \nKodecorp Technology Solutions Pvt. Limited","description":"KodeCorp is seeking .NET Developers with good working experience in ASP .NET/ MVC and SQL Server to develop and deploy enterprise web applications. Candidates should have good communication skills and be a self starter and should take ownership of the product. Ideal Candidate should have * Good knowledge in ASP .NET programming * Good knowledge in C# programming * Should have good working knowledge of ASP .NET MVC * Should be well versed in HTTP, HTML, CSS, jQuery, Ajax and JavaScript * Hands-on with T-SQL programming with SQL Server 2008/ 2012/ 2016 * Should be experienced in database design fundamentals, constraints, relationships etc. Mandatory Skills: * Extensive knowledge in ASP .NET programming * Should have understanding of ASP .NET MVC models, Web API * Should have worked on MS SQL Server. * Should have good oral and written communication skills. Walk-in Date/ Time: 4th to 7th June , 10 AM onwards Interview Venue: KodeCorp Technology Solutions Pvt. Limited V-Square Building, H.NO 1-98/90/25/p/50, 3rd floor Behind Big C, Madhapur, Hyderabad. LandMark: Opp to Fortune Towers, M.S.Challa Builder","location":"Hyderabad","experience":"3 - 8 Years"},{"date":"4, 5, 6, 7 - Jun - 2019","skills":".NET framework, Java, PHP, JS, Python, RDBMS or no SQL Databases","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Daffodil Software Private Limited, 9th floor, Tower B1, SEZ DLF Silokhera, Sector 30, Gurugram, Haryana. Nearest Metro Station- Huda City Center Nearest","phone":"Not Provided","profile":"Associate/ Senior Associate (Java/ .Net) \nDaffodil Software Private Limited","description":"This self-motivated, professional member of the delivery team is responsible for design & development of web based application with rich user interfaces. The ability to gather, interpret and implement on technical requirements in a consistent and effective manner is critical to this team member's success. Key Responsibilities: Responsible for successfully designing, mapping, implementing and integrating complex applications Brainstorm for possible solutions of the problems in an optimised way Relies on experience and judgment to plan and accomplish goals Ability to prioritize and multitask Ability to work under pressure and deliver on time Troubleshooting issues with existing or developed systems and works with the appropriate resources to resolve them Participate in the testing process through test review and analysis, test witnessing Required Skills Understanding of best practices for architectural and design patterns. Should have excellent communication skills (both written and verbal) Constructive Attitude Should have work experience in any of the technologies based on .NET framework, Java, PHP, JS and Python. Understanding of DB concepts (RDBMS or no SQL databases) REST Conventions HTML/CSS Walk-in Date: 4 to June 7, 2019 Timings: 10.00 am to 1.00 pm Venue Details- Daffodil Software Private Limited 9th floor, Tower B1, SEZ DLF Silokhera, Sector 30, Gurugram, Haryana. Nearest Metro Station- Huda City Center Nearest Landmark-Star Mall, NH 8, Gurgaon Contact Person : Swati Chahar","location":"Gurgaon","experience":"1 - 5 Years"},{"date":"8 - Jun - 2019","skills":"ASP.Net WCF C# .Net SQL Queries","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"GadgEon Smart Systems Pvt. Limited, Unit O203, 2nd Floor, Building SCK-01, Block -A Smartcity, Kochi - 682 030","phone":"0484-2903000","profile":"Senior .Net Engineers \nGadgeon Smart Systems Pvt. Limited","description":"Eligibility Criteria: BE/ B.Tech or BCA/ MCA/ BSC/ MSC are only eligible to appear for the interviews Candidate pursuing Graduation or awaiting results will not be eligible to apply Candidates who have appeared for the same role in the last 6 months will not be eligible to reapply Immediate Joiners preferred Mandatory Skills: 2 years of experience as a C# , Asp .Net developer 2 years of experience with writing SQL queries Experience in developing services using WCF / Asmx Preferred Skills: Experience with .Net Core / Angular platform is a plus Experience with InstallShield a plus Able to work independently with minimal supervision Meticulous and detail-oriented, coupled with good attitude Good written and verbal communication skill in English Interview Date: 08 June 2019 Time: 10:00 AM to 5:00 PM Interview Venue: GadgEon Smart Systems Pvt. Limited, Unit O203, 2nd Floor, Building SCK-01, Block -A Smartcity, Kochi - 682 030 Contact No: 0484-2903000, 0484-2903160","location":"Kochi","experience":"2 - 6 Years"},{"date":"4, 5, 6, 7 - Jun - 2019","skills":"Asp .Net, C#, Jquery, Javascript, , WCF, WPF, HTML 5, CSS, XML, Ajax","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Techtilt Info Solutions Private Limited, #10,5th street, Sri Devi Karumari Amman Nagar, Velachery, Chennai - 600 042.","phone":"7823997199","profile":".Net Developers \nTechtilt Info Solutions Private Limited","description":"Urgent Openings for .Net Developers! Work Experience: 1 to 3 Years Required Skills: ASP.Net Web Applications, MVC, C#, AngularJS, Web API, Web Services, Xamarin, IIS, HTML5, Jquery and Javascript Walk-in Date/ Time: 4th - 7th June , 1 PM onwards Interview Venue: Techtilt Info Solutions Private Limited, #10,5th street, Sri Devi Karumari Amman Nagar, Velachery, Chennai - 600 042. Salary: Negotiable Contact No- 7823997199","location":"Chennai","experience":"1 - 3 Years"},{"date":"4, 5 - Jun - 2019","skills":"General Administration, Accounting/ Account Management, Budget Preparation, Event Planning","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Moglix Labs (India) Private Limited, D-188, Sector 10, Noida","phone":"Not Provided","profile":"Assistant Manager - Admin \nMoglix Labs (India) Private Limited","description":"Candidate should be Any Graduate/ Post Graduate with 2 to 5 years of experience in General Administration, Accounting/ Account Management, Budget Preparation, Event Planning, Payroll Processing and Vendor Development. Job Responsbility- Supervising day-to-day operations of the administrative department and staff members. Developing, reviewing, and improving administrative systems, policies, and procedures. Ensuring office is stocked with necessary supplies and all equipment is working and properly maintained. Working with accounting and management team to set budgets, monitor spending, and processing payroll and other expenses. Walk-in Date/ Time: 4th - 5th June , 1 PM onwards Interview Venue: Moglix Labs (India) Private Limited D-188, Sector 10, Noida","location":"Noida","experience":"2 - 5 Years"},{"date":"3, 4, 5, 6, 7 - Jun - 2019","skills":"Office administration, Front Office/ Receptionist Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Celite Tyre Private Limited, 902, 9th floor, Dev Plaza, S. V. Road, Above Vijay Sales, Andheri (West), Mumbai - 400 058","phone":"Not Provided","profile":"Receptionist cum Admin Executive \nCelite Tyre Private Limited","description":"Candidate must have Proven experience as a Financial Manager & CA preferred.Extensive understanding of Banking & financial trends both within the company.Proficient user of finance software-Tally,SAP. Strong interpersonal communication skills. Responsibilities- 1. Greeting and welcoming guests and guide them properly as per their requirement. 2. Maintain register for courier (Inward) & in Excel (Outward). 3. Send mails to concern person for receiving & dispatch of courier etc. Walk-in Date/ Time: 3rd - 7th June , 11 AM onwards Interview Venue: Celite Tyre Private Limited 902, 9th floor, Dev Plaza, S. V. Road, Above Vijay Sales, Andheri (West), Mumbai - 400 058 Landmark: Opposute to Fire Station","location":"Mumbai","experience":"0 - 3 Years"},{"date":"3, 4, 5, 6, 7, 8 - Jun - 2019","skills":"Software Testing, Test Engineering, Test Planning, Creating Test cases","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"NetEdge Computing Solutions Pvt. Limited, Tower C - 56/39, Sector - 62 Noida - 201 301.","phone":"70427-94831","profile":"Software Testing Engineer \nNetEdge Computing Solutions Pvt. Limited","description":"The person must have knowledge in: Test case design techniques (Equivalence class partitioning, Boundary value analysis, Test Planning). Carrying out manual testing of the software application & reporting the bugs. Should have good communication skills. The person will be responsible for: Analyzing Business requirements & creating Test cases for various Modules & Test Execution. Reporting bugs with severity & priority according to customer Requirement & project needs. Walk-in Date/ Time: 3rd - 8th June , 11 AM onwards Interview Venue: NetEdge Computing Solutions Pvt. Limited Tower C - 56/39, Sector - 62 Noida - 201 301.","location":"Noida","experience":"1 - 3 Years"},{"date":"3, 4, 5, 6, 7, 8 - Jun - 2019","skills":"PHP, HTML, Javascript, Angular JS, Tensor Flow","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Klixtech, H38/1400, 1st Floor, Kasturi Nivas, 15th Main Road, Anna Nagar West, Chennai - 600 040","phone":"044 43324600","profile":"PHP Developer (Fresher) \nKlixTech","description":"Excellent Opportunity for Freshers in Software Product Development. Candidates will work in Major Web Development Languages HTML, Javascript, Angular JS, Tensor Flow Training will be provided by our team for 4 Months with stipend Rs. 5000 Once Training completed, the salary will be revised with best in Industry Need Basic programming skills Minimum Bachelor Degree is required 2017/ 2018 Freshers only Candidate should be passionate on Product Development Interview Process: Basic Web Development Test (No Aptitude Test) Face to Face Salary: In 4 Month Training - Rs.5000/per month Walk-in Date/ Time: 3rd June - 26th June , 11 AM onwards Interview Venue: Klixtech, H38/1400, 1st Floor, Kasturi Nivas, 15th Main Road, Anna Nagar West, Chennai - 600 040 Tel: 044 43324600","location":"Chennai","experience":"0 - 1 Years"},{"date":"5, 6, 7 - Jun - 2019","skills":"HTML/ CSS, Bootstrap Java Script, PHP, AngularJs, Wordpress","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Orion Infra Realtors Private Limited, 804-805, JMD Megapolis, Sector -48, Gurgaon, Haryana","phone":"9971418513","profile":"Web Designer - PHP/ MySQL \nOrion Infra Realtors Private Limited","description":"Orion is looking for a Web designer for its Digital Marketing Team who can help them in below mentioned work. Develop new user-facing features Build reusable code and libraries for future use Ensure the technical feasibility of UI/ UX designs. Qualification: Any Graduate Work Experience: 1 to 5 Years Skills Needed: Language: HTML/ CSS, Bootstrap Java Script, PHP, AngularJs, Wordpress Tools: Photoshop, Illustrator, Adobe XD. Database: MySQL Walk-in Date/ Time: 5th - 7th June 2019, 10 AM onwards Interview Venue: Orion Infra Realtors Private Limited, 804-805, JMD Megapolis, Sector -48, Gurgaon, Haryana","location":"Gurgaon","experience":"1 - 5 Years"},{"date":"4, 5, 6, 7, 8 - Jun - 2019","skills":"PHP, JavaScript, Jquery, MySQL, HTML, CSS & Any MVC Framework","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Vanan Online Services Inc, Kosmo one Building, Tower B, 6th Floor, Opposite to Wabco/ Essar Petrol Bunk, Near Ambattur Telephone Exchange.","phone":"9941166363","profile":"Senior PHP Developer \nVanan Online Services Inc","description":"Educational Qualification: BE/ B.Tech/ M.Tech/ MCA Work Experience: 2 - 6 Years Notice Required: Immediate Day shift: 9 am to 6 pm Salary is not a constraint for the right candidate Skills Required: * PHP, JavaScript, Jquery, MySQL, HTML, CSS & Experience in any MVC Framework. * Knowledge of using SVN or GIT. Walk-in Date/ Time: 3rd - 30th June , 12 PM onwards Interview Venue: Vanan Online Services Inc, Kosmo one Building, Tower B, 6th Floor, Opposite to Wabco/ Essar Petrol Bunk, Near Ambattur Telephone Exchange. Contact No: 9941166363","location":"Chennai","experience":"2 - 6 Years"},{"date":"4, 5 - Jun - 2019","skills":"PHP MVC- yii MySQL, LAMP Stack JavaScript jQuery HTML5 CSS Git","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"For venue details share your resume","phone":"Not Provided","profile":"Php Programmer/ Lead \nSony India","description":"Primary Skills: PHP MVC- yii MySQL, LAMP Stack JavaScript jQuery HTML5 CSS Git APIs using REST/ SOAP TeamLead Secondary (Optional) Skills: Hybrid Mobile Development using Cordova/Ionic/ Angular/ TypeScript, Asp.Net/C# 4th June - 5th June , 9 AM onwards Interested can share your cv to hr5@copiousconsult.com","location":"Mumbai","experience":"4 - 9 Years"},{"date":"4 - Jun - 2019","skills":"PHP, Word Press, HTML and JQuery","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Info Edge India Limited (99acres.com), A-88 , Sector 2, Noida. Landmark: Near Sector 15 Metro Station","phone":"0120-3082090","profile":"UI/ PHP Developer \nInfo Edge India Limited (99acres.com)","description":"Requirements: Any Graduate - Any Specialization Up to 3 years of experience in website landing page HTML Development Experience in Project Development to Deployment Solid background and knowledge of Adobe Photoshop, WordPress HTML5, CSS3, Jquery, Javascript, PHP. Minimum 2 years experience in PHP, Word Press, HTML and JQuery. Good Knowledge of PHP and Word Press themes. Good Knowledge of Responsive Design, Bootstrap & Html5. Write clean, testable and scalable code for websites, landing pages, emailers and other web elements/applications Develop and test code across multiple browsers, platforms, and devices, ( including Smart Phones and tablets) Optimize page tags, headings, navigation, page performance and links, keeping security intact Take responsibility of maintaining and scaling the website Open to constructive criticism and willing to learn new technologies. Experience in JavaScript and JS frameworks Capable of finishing projects on time and flexible to work according to the urgency. Emailer design and Development (table base HTML) Walk-in Date: 4th June 2019 (Tuesday) Time - 10 AM - 3 PM Interview Venue- Info Edge India Limited (99acres.com) A-88 , Sector 2, Noida Landmark: Near Sector 15 Metro Station","location":"Noida","experience":"2 - 4 Years"},{"date":"3, 4, 5, 6, 7, 8 - Jun - 2019","skills":"Advance Oracle & PL/SQL Versions 9i,10G and 11G","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Transtreasure Services India Pvt. Limited, G-Block, Building No-1, 1st Floor, Sector- 11, Noida","phone":"7840096107","profile":"Administration Executive \nTranstreasure Services India Pvt. Limited","description":"Candidate should be Any Graduate with having good knowledge of Excel Able to Coordinate with vendors. Handling day to day operation Walk-in Date/ Time: 3rd - 8th June , 10 AM onwards Interview Venue: Transtreasure Services India Pvt. Limited G-Block, Building No-1, 1st Floor, Sector- 11, Noida","location":"Noida","experience":"1 - 3 Years"},{"date":"3, 4, 5, 6, 7, 8 - Jun - 2019","skills":"Php, MySQL, Drupal, Jhoomla & other open source technologies","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Netedge Computing Solutions Pvt. Limited, NetEdge Tower C - 56/39, Sector - 62 Noida - 201 301.","phone":"70427-94831","profile":"Software Engineer - PHP \nNetedge Computing Solutions Pvt. Limited","description":"The person must have : 1. Experience in Development using PHP based on Laravel or CodeIgniter Framework 2. Experience in MySQL, Drupal, Jhoomla & other open source technologies. 3. He/She must have orientation towards quality & customer satisfaction. The Person Will be Responsible for: -Coding & development of programs / modules -Timely delivery of programs & projects to customers -Ability to work in a team environment -Must meet tight deadlines & work on several projects simultaneously Walk-in Date/ Time: 3rd June - 8th June , 11 AM onwards Interview Venue: Netedge Computing Solutions Pvt. Limited NetEdge Tower C - 56/39, Sector - 62 Noida - 201 301","location":"Noida","experience":"2 - 3 Years"},{"date":"4, 5, 6, 7, 8 - Jun - 2019","skills":"PHP Codeigniter Laravel CakePHP Web Technologies","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Webguru Infosystems Pvt. Limited, Y8, Block - EP, Sector V Salt Lake, Kolkata - 700 091","phone":"7595064760","profile":"Senior PHP Developer \nWebguru Infosystems Pvt. Limited","description":"Candidate should have 2 to 7 years of experience in Codeigniter/ Cake PHP/ Laravel Must have experience in developing customized web applications, e-Commerce applications Should have experience in developing back end Rest API for Mobile apps & Web apps Walk-in Date/ Time: 1st June - 31st July , 11 AM onwards Interview Venue: Webguru Infosystems Pvt. Limited Y8, Block - EP, Sector V Salt Lake, Kolkata - 700 091 Stoppage: College More Crossing Please do send your resume to hr@webguru-india.com or call 7595064760 for Further details","location":"Kolkata","experience":"2 - 7 Years"},{"date":"4, 5, 6, 7, 8, 10, 11, 12, 13, 14, 15 - Jun - 2019","skills":"OOPS, MySQL, HTML, CSS, JavaScript, Jquery, Ajax, CorePHP, OOP's Concepts.","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Biz Technologies Private Limited, 412, Gundecha Industrial Complex, Akurli Road, Near Big Bazar, Kandivali (East) Mumbai - 400 101.","phone":"7506689297","profile":"PHP Developers (Fresher) \nBiz Technologies Private Limited","description":"We are looking for PHP Developer (Freshers) or with 0 to 6 months of experience. Candidate must have strong fundamentals in OOPS, MySQL, HTML, CSS, JavaScript, Jquery, Ajax, CorePHP. Strong OOP's Concepts. Walk-in Date: 4th June - 15th June Timing: 12 pm to 5:30 pm Interview Venue: Biz Technologies Private Limited 412, Gundecha Industrial Complex, Akurli Road, Near Big Bazar, Kandivali (East) Mumbai - 400 101.","location":"Mumbai","experience":"0 - 1 Years"},{"date":"4, 5, 6, 7, 8 - Jun - 2019","skills":"Web Application, Mobile Application, Java, PHP, UI/UX, Sales force, Python Word Press","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Marolix Technology Solutions Private Limited, Nasuja Building, H No.1-89/G/36, Raheja Mindspace, Near Westin Hotel, Hyderabad - 500 081.","phone":"040-43464347","profile":"Software Developer/ Freshers \nMarolix Technology Solutions Pvt. Limited","description":"IT We are looking for a software developers responsible for building applications. Your primary responsibility will be to design and develop the applications, and to coordinate with the rest of the team working on different layers of the infrastructure. Thus, a commitment to collaborative problem solving, sophisticated design, and product quality is essential. (Freshers) Web Application, Mobile Application, Java, PHP, UI/UX, Sales force, Python Word Press, Digital Marketing, Testing. Walk-in Date/ Time: 4th - 26th June , 10 AM onwards Interview Venue: Marolix Technology Solutions Private Limited Nasuja Building, H No.1-89/G/36, Raheja Mindspace, Near Westin Hotel, Hyderabad - 500 081. Contact No: 040-43464347 Mobile No: 9490000903","location":"Hyderabad","experience":"0 - 2 Years"},{"date":"4, 5, 6, 7 - Jun - 2019","skills":"MySQL PHP Node.Js OOPS Framework","qualification":"B.E./B.Tech","address":"Emart Solutions India Private Limited/ FirstHive, Address: Triguna Icon, No. 102, Mezzanine Floor, #21 Arekempanahalli, Hosur Road, Bangalore - 560 027","phone":"7498610042","profile":"PHP Developer & Lead \nEmart Solutions India Private Limited","description":"We have Multiple PHP Developer & Lead opening available with FirstHive (www.Firsthive.com). Interested relevant candidates please refer below mentioned details for attending a direct walk-in Interviews Qualification/ Desired Skills: B. Tech/ BE Degree in Computer Science Required mandatory skills: MYSQL, PHP, OOPs Concept, any framework Should have good knowledge on open source technologies Experience with test-driven development Job Responsibility: Design and develop high-volume, low-latency applications for mission-critical systems, Delivering high-availability and performance Walk-in Date: 3rd - 28th June (Monday - Friday) Time: 11am -5 pm Emart Solutions India Private Limited/ FirstHive Address: Triguna Icon, No. 102, Mezzanine Floor, #21 Arekempanahalli, Hosur Road, Bangalore - 560 027 Landmark Diagonally Opposite to Manjunath Hospital/ Near Abhaya Hospital Google Map Link - https://goo.gl/maps/56RWCGAGubR2 Contact Person - Namrata","location":"Bangalore","experience":"3 - 8 Years"},{"date":"4, 5 - Jun - 2019","skills":"PHP MVC framework (Laravel/ CodeIgniter), jQuery, Ajax, MySQL","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Ark InfoSolutions Private Limited, A11, 2nd floor, Sector-4, Noida","phone":"8860019951","profile":"PHP Developer \nArk InfoSolutions Private Limited","description":"Experience: 2-4 Years Skills Required: Excellent knowledge on PHP MVC framework (Laravel/ CodeIgniter) Good knowledge on MySQL/ Hans on experience on jQuery, Ajax Good communication skills required Roles & Responsibilities: Responsible for application design, code development, testing -and deployment and maintenance Write well designed and optimized code Contribute in all phases of development lifecycle Should be a team player. Interview Date: 4th & 5th June 2019 Time: 10 am to 3 pm Interview Location: Ark InfoSolutions Private Limited A11, 2nd floor, Sector-4, Noida Contact Person: Suchitra If interested please share your updated cv at suchitra.kumari@arkinfo.in","location":"Noida","experience":"2 - 4 Years"},{"date":"3, 4, 5, 6, 7 - Jun - 2019","skills":"PHP, Web Development, Web Technologies","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"InnoServ Digital (E2E Project), No.65/7, 1st floor, Sarjapur Road, Agra Village, Hobli, Bengaluru, Karnataka - 560 102,","phone":"Not Provided","profile":"PHP Web Developer \nInnoServ Solutions Private Limited","description":"We are looking for a Web Developer who is dedicated to the craft, writes code that they are proud of and can hit the ground running. Person will be a part of a full-stack creative team that is responsible for all aspects of the ongoing software. Walk-in Date/ Time; 3rd - 7th June , 9 AM onwards Interview Venue: InnoServ Digital (E2E Project) No. 65/7, 1st floor, Sarjapur Road, Agra Village, Hobli, Bengaluru, Karnataka - 560 102,","location":"Bangalore","experience":"2 - 4 Years"},{"date":"3 - Jun - 2019","skills":"Technical Support, IT Helpdesk, Customer Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech, B.A., B.Com, B.B.A, B.Sc","address":"Tech Mahindra Limited, Bahadurpally, SEZ, Gate-2, Hyderabad","phone":"9553581618","profile":"Technical Support Executive \nTech Mahindra Limited","description":"We are hiring for Technical Support Associate. Looking for candidates who can join us immediately and should have excellent communication skills. Shifts-24/7 Job Responsibilities: Initial point of contact for resolving customer raised network related requests specific to network equipment. Collaborate with other team members on a daily basis in order to achieve a satisfactory resolution to customer issues. Follow Support Center processes for effective management of assigned support requests. Understanding of computer networking - TCP/IP, routing, switching, N+ and CCNA is a plus. Thorough comprehension of fundamental networking protocols including TCP, STP, ARP, Ethernet, OSPF, etc. Diagnose and troubleshoot wireless, security, switching, and other various network-related issues reported by Cisco Meraki customers and partners. Walk-in Date/ Time: 3rd June 2019, 11 AM onwards Interview Venue: Tech Mahindra Limited Bahadurpally, SEZ, Gate-2, Hyderabad","location":"Hyderabad","experience":"1 - 2 Years"},{"date":"3, 4, 5, 6, 7 - Jun - 2019","skills":"Technical Support, IT Helpdesk, C, C++, Java, SQL Server","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"PRIMUS Techsystems Pvt. Limited, 501, 5th Floor, B-Junction, Above Kotak Bank, Paud Raod, Behind Karve Statue, Kothrud, Pune","phone":"Not Provided","profile":"Technical Support/ IT Freshers \nPRIMUS Techsystems Private Limited","description":"Walk-in for Technical Support/ IT Fresh - Graduates who are passing in the year 2019 The F2F Interview is base on C, C++, Java, SQL Sever Job Location: Mumbai, Pune Salary: INR 2,50,000 - 3,00,000 PA No. Openings: 25 Walk-in Date/ Time: 3rd - 7th June 2019, 10 AM Onwards Interview Venue: PRIMUS Techsystems Private Limited 501, 5th Floor, B-Junction, Above Kotak Bank, Paud Raod, Behind Karve Statue, Kothrud, Pune","location":"Pune, Mumbai","experience":"0 - 1 Years"},{"date":"2, 3, 4, 5, 6, 7 - Jun - 2019","skills":"Technical Support, Service Desk, International Voice Process","qualification":"B.Sc, BCA/BCS, B.E./B.Tech, Diploma, B.A., B.Com, B.B.A, B.Sc","address":"Mphasis Limited, Eon Cluster C: Wing 2, Ground Floor, Kharadi Infrastructure Pvt. Limited.: SEZ, Plot No. 1, Survey 77, MIDC, Kharadi| Pune - 411 014","phone":"8975910700","profile":"Customer Support Executive \nMphasis Limited","description":"Eligibility Criteria: Any Graduate/ Under Graduate 10+2+3 Diploma 1 to 3 years of experience in Service Desk/ International Voice Must have knowledge of CITRIX, Office 365 and VPN.. Knowledge of ticketing tool. Require Skills: Excellent Communication skills (Written & Verbal) Good Analytical, logical and reasoning skills Computer Fundamentals Good keyboard skills needs to be able to toggle between many screens with speed Needs to be able to type with speed and accuracy. Need Immediate joiners.. Walk-in Date/ Time: 31st May - 7th June from 9 AM onwards Interview Venue: Mphasis Limited Eon Cluster C: Wing 2, Ground Floor, Kharadi Infrastructure Pvt. Limited.: SEZ, Plot No. 1, Survey 77, MIDC, Kharadi| Pune - 411 014 You can also call on 8975910700 or email your resume on Suwartik.ramraje@mphasis.com","location":"Pune","experience":"1 - 3 Years"},{"date":"3, 4, 5, 6, 7 - Jun - 2019","skills":"Technical Support, International Voice Process, Customer Service","qualification":"B.Sc, BCA/BCS, B.E./B.Tech, B.A., B.Com, B.B.A, B.Sc","address":"Tech Mahindra Limited, Gate No: 1, Opp. Ananth Technologies, Hitech City, Hyderabad","phone":"Not Provided","profile":"Technical Support/ IT Service Desk \nTech Mahindra Limited","description":"Eligibility Criteria: Any Graduates,Freshers and Experienced Can Apply Should be Impeccable in Communication Skills Should be flexible to work with 24/7 shifts (Rotational shifts) Should have a decent knowledge on customer service/ Trouble shooting of PCs and Laptops. Candidate should be aware of basic technical knowledge in LAN, WAN and handling basic Internet issues. Troubleshooting of technical related issues and ensure to resolve the issues or queries over the call. Research, diagnose, troubleshoot and identify solutions to resolve customer issues Candidate should be flexible to work in 24*7 environments (Rotational Shift), comfortable to work in night shifts. 5 days working. Transportation Facilities: Both way Salary 2.2 to 4,50,000 LPA (Basis Experience & Last CTC) Interview Date : 3rd to 7th Jun 2019 (Monday-Friday) Timings: 12 PM onwards Venue Details : Tech Mahindra Limited Gate No: 1, Opp. Ananth Technologies, Hitech City, Hyderabad Contact Person: Pooja B Documents required for walk-in: - Copy of CV - Original ID proof (Aadhaar - Mandate)","location":"Hyderabad","experience":"0 - 5 Years"},{"date":"2, 3, 4, 5, 6, 7 - Jun - 2019","skills":"customer service non voice process international bpo customer care technical support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech, B.A., B.Com, B.B.A, B.Sc","address":"[24]7 Customer Private Limited, Ground Floor NSL Arena Town Centre, Behind Cricket Stadium, Ramanthapur Road, Uppal Hyderabad - 500 039","phone":"9949244441","profile":"Technical Support Executive \n[24]7 Customer Private Limited","description":"Skills Required: * Good Verbal and Written Communication skills. * Good logical reasoning &analytical skills. * Able to interact with customers via chat, should be able to answer servicing questions. * Able to work in rotational night shifts (US). Eligibility Criteria: * Undergraduate/ Graduate & Postgraduate Freshers & Experienced are eligible to apply. Interview Rounds: * Personal Introduction Round * Online Test * Operations Round Benefits: * Free Transport facility both Pick/ Drop * Life Insurance. * Medical Insurance. Job Designation: Associate and Senior Associate Walk-in Date: 2nd to 7th June 2019 Interview Time: 10 am to 1 pm Venue Address: [24]7 Customer Private Limited, Ground Floor NSL Arena Town Centre, Behind Cricket Stadium, Ramanthapur Road, Uppal Hyderabad - 500 039, Landmark: Next to Bhadra's Grand Contact Person: Srinivas Contact No: 9949244441 NOTE: * Kindly Carry copy of your Resume and ID proof Xerox Copy. * Candidates attended interview within 30 days are not eligible to apply.","location":"Hyderabad","experience":"0 - 3 Years"},{"date":"3 - Jun - 2019","skills":".Net, ASP .Net, C#, SQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Snap-on Business Solutions (India) Pvt. Limited, 1st floor, Tower C, Logix Techno Park Plot No. 5, Sector 127, Noida","phone":"0120-4508462","profile":"ASP .Net/ C# Developer (Fresher) \nSnap-on Business Solutions (India) Pvt. Limited","description":"REQUIREMENTS: Must be B.Tech/ B.E/ M.tech/ MCA (CS/ IT Stream only) 18/19 batch with 60% overall and regular academic background. Good OOPs concept and its implementation. Good Asp.net and C# programming skills. Must have done any training/internship/project on Asp.net. Good communication skills in English. Good analytical skills. Interested candidates can directly walk in on Tuesday 4th June 2019 at 11.00 Am sharp. Candidates reaching after 11.30 Am, would not be entertained . Venue: Snap-on Business Solutions (India) Pvt. Limited 1st floor, Tower C, Logix Techno Park Plot No. 5, Sector 127, Noida Rounds of Interviews: 1- Aptitude Test (Written) 2- Written English communication Test Please Note: 1. Candidate should be ready to sign a service agreement of 1.5 years. 2. Please do not apply those candidates who have already attended any interview process at our company in last 6 months.","location":"Noida","experience":"0 - 1 Years"},{"date":"2 - Jun - 2019","skills":"Core Java, J2EE, Spring / Hibernate","qualification":"B.E./B.Tech, M.Tech","address":"HCL Technologies Limited HCL Electronic City, Surya Sapphire","phone":"Not Provided","profile":"Java Professionals \nHCL Technologies Limited","description":"We have planed for a Weekend drive on 2nd Jun-2019 (Sunday) at Electronic city, surya sapphire,Bangalore location to close New positions from our Premium US banking customer, interested candidates are requested to share your profile along with below basic information. Experience: 1 to 2.5 Years Job Location : Bangalore No.of Position in Open : 50 Salary : Best in the Market Required Skills: Good Experience in Core Java Good Experience in J2EE Good Experience in Spring / Hibernate Excellent Communication and Attitude. Educational Qualification : UG should be only from BE &BTech Training will be provided for Java Full Stack Role Interview Process : Technical online test and 1 Rounds of Technical Interviews followed by a HR discussion. Venue : HCL Technologies Limited HCL Electronic City, Surya Sapphire SPOC : Bhavya Shree Kindly confirm whether you are available for this Face to face Interview on 2nd Jun-2019 (Sunday). Revert us with your updated CV if your Interested with the following details to Email ID: j-chaithra@hcl.com Name : Contact No : Email ID : Highest Qualification : Current Company : Contract or Permanent: If Contract Pls do mention Payroll company name : Total years of Experience : Relevant years of Experience in Java : Relevant Years of experience in J2EE : Relevant Years of experience in Spring : Relevant Years of experience in Hibernate : Relevant Years of experience in Webservices (if any) : Current CTC : Expected CTC : Notice period : Available for F2F interview on 2nd Jun-2019 ( Yes / No ) : Current Location : Please feel free to contact us if you have any doubt in the requirement. Email : j-chaithra@hcl.com Kindly Ignore this mail if you are not interested and not relevant to your profile. Also please refer your friends if they have same skill set. Documents to be carried: 2 Resume, 2 Photograph, Last month payslilp. 1 ID proof photocopy (mandate).","location":"Bangalore","experience":"1 - 3 Years"},{"date":"1 - Jun - 2019","skills":"UI/ Backend, HTML5/ CSS/ Angular 6/ Java 8/ Springboot / MySql","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Gati KWE Plot 20, Survey 12, Kothaguda, Kondapur, Hyderabad - 500 084. Landmark: Opposite CII, Opposite Google Office (Kondapur)","phone":"Not Provided","profile":"Java Developer \nGATI-KINTETSU Express Private Limited","description":"GATI-KINTETSU Express Private Limited, is looking for Java Full Stack Sr. Developer: Independently develop UI/ Backend code with HTML5/ CSS/ Angular 6/ Java 8/ Springboot / MySql Good understanding of design principles Write clean code compliant with best practices and standards Good Analytical, Problem Solving and Communication skills Have worked with tools like JIRA and worked in Agile Understands build, deployment process and DevOps process Good to have worked in Microservices architecture Walk-in Date/ Time: 1st June , 9 AM onwards Interview Venue: Gati KWE Plot 20, Survey 12, Kothaguda, Kondapur, Hyderabad - 500084 Landmark: Opposite CII, Opposite Google Office (Kondapur)","location":"Hyderabad","experience":"2 - 7 Years"},{"date":"1 - Jun - 2019","skills":"Core Java Android Application Development SQLite J2Me JSON","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Kellton Tech Solutions Limited, #1367, Road Number 45, Nandagiri Hills, Jubilee Hills, Hyderabad, Telangana 500033","phone":"9014204396","profile":"Android Developer \nKellton Tech Solutions Limited","description":"Work Experience: 2 to 6 Years Location: Jubilee Hills, Hyderabad Walk-In: 11 AM to 3 PM Work across all phases of app development requirement gathering, code, release, bug fixing. Creating user interface to support smart-phones and tablets of various density/resolutions. Good oral and written communication skills to work with various teams and client personnel, locally and internationally, with minimal supervision. Multitasking, task prioritization, timely completion of tasks and reporting to managers/leads. Essential Experience:- (Resume must have details for below) Good hands on experience in android application development Must have published few android applications on Play Store or other market. (Provide links) Good experience of using REST/JSON web-services, SQLite, Social SDKs in android apps. Use of various IDEs, versioning and tracking tools (e.g. Eclipse, SVN, GIT, JIRA etc.) Essential Skills:- Strong fundamentals in Core Java, OOPS and various Android Components and APIs. Must have good problem solving, debugging and optimization skills. Good understanding of DBMS, SQL, data structures, algorithms & complexity. Work with Services, Location, Animation, Fragments etc in android. Add On Experience and Skills:- Work with ProGuard, MAT(Memory Analyzer Tool) Experience with J2ME/ Blackberry mobile apps or with JEE bases web-services. Walk-in Date/ Time: 1st June , 11 AM onwards Interview Venue: Kellton Tech Solutions Limited #1367, Road Number 45, Nandagiri Hills, Jubilee Hills, Hyderabad, Telangana 500033 Interested Candidates can share their updated resume on hiring@kellton.com","location":"Hyderabad","experience":"2 - 6 Years"},{"date":"1 - Jun - 2019","skills":"Core JAVA, Spring, Hibernate, Web Services, Oracle & HTML 5","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"CenturyLink Technologies India Private Limited, Green Boulevard Block B, 5th Floor Plot No. B, 9A, Sector 62, Noida, Uttar Pradesh","phone":"Not Provided","profile":"Java/ J2EE Developer \nCenturyLink Technologies India Pvt. Limited","description":"Candidate should have solid work experience on Core JAVA, Spring, Hibernate, Web Services, Oracle & HTML 5. Must have exposure to JBOSS application server. Very strong problem solving and analytical skills. Knowledge of Telecom transport layer, IP networks is an added advantage Job Responsbility- Design and develop medium sized components based on requirement specification. Produce high quality, maintainable software components code to comply with project quality objectives and company standards. Demo of deliverables to Product Owner & other stake holders at end of each sprint. Exhibit thorough knowledge of agile SCRUM methodology. Experience: 2 to 8 Years Work Location: Bangalore This position requires following skills: ANGULAR 2,4 or 6 NODE JS Core Java 8 (OOPS, Threading, Collections, Streams) Spring Boot and Spring Data (or Hibernate) SQL Knowledge Microservices (REST) GIT And Branching Strategies Junits SonarQube Fundamentals of Microservice Deployments Maven or Gradle Interview Process: Java Online Test, Followed by technical Interviews & Manager Round Interested candidates kindly can walk in for interview on 1st June, 9 AM onwards at below mentioned venue- CenturyLink Technologies India Private Limited Green Boulevard Block B, 5th Floor Plot No. B, 9A, Sector 62, Noida, Uttar Pradesh","location":"Noida","experience":"2 - 7 Years"},{"date":"1 - Jun - 2019","skills":"Java","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Vyom Labs Private Limited Sunrise Business Park, Near Cummins Campus, Balewadi Pune.","phone":"Not Mentioned","profile":"Java Developers \nVyom Labs Private Limited","description":"Experience: 1-2 Years Java experience Job Profile: Selected candidates will be trained in Salesforce platform and applications for 1-2 months and then assigned to Salesforce implementation projects as developers /consultants. Skills Required: Very good programming skills in Java Very good English communication skills Good Aptitude, analytical and problem solving skills are necessary Experience combining analysis, design, development and implementation of object oriented (OO) concept based applications Base location would be Pune but willing to travel at short notice Ability to learn new skills and work independently at customer location Willing to work in shifts and projects based travel. Project duration can range from 3 months to year. Candidates who are willing to relocate and work in shifts according to project requirements can apply. Walk-in Date/ Time: 1st June , 9 AM onwards Interview Venue: Vyom Labs Private Limited Sunrise Business Park, Near Cummins Campus, Balewadi Pune. Mode of interview : Java test Technical interview Managerial interview","location":"Pune","experience":"1 - 2 Years"},{"date":"1 - Jun - 2019","skills":"Javascript Algorithms Node.Js Rest JSON IntelliJ Java","qualification":"B.E./B.Tech","address":"Riversand Technologies India Pvt. Limited, IBC Knowledge Park, Tower D, 8th Floor. 4/1, Bannerghatta Main Rd, Bengaluru - 560 029","phone":"Not Provided","profile":"Junior Java Developer \nRiversand Technologies India Pvt. Limited","description":"Required Education: B.E, B.Tech or higher in Computer Science or comparable discipline Required Experience: Minimum of 2 years in Java / C# / Scala development Required Skills & Knowledge: Strong analytical and logical skills Thorough knowledge of Data Structures & Algorithms Strong OO Programming and OO Design concepts knowledge Knowledge of Scala programming language concepts Experience developing REST / JSON applications Experience developing in Node.js & JavaScript Strong unit/integration testing experience Need to be a team player and work with minimum supervision Candidate must be a career-oriented individual with strong communications and organizational skills. Desired Skills & Knowledge: Working knowledge of following technologies Apache Spark, Azure Blob Storage, Databricks, Apache Kafka, Apache Storm, Elastic Search Hands-on experience of Intellij / Eclipse and Github. Worked for a product company solving business problems than IT products. Working knowledge of multi-threaded applications Walk-in Date: 1st June 2019 Time: Between 9:30am and 1pm only Venue: Riversand Technologies India Pvt. Limited, IBC Knowledge Park, Tower D, 8th Floor. 4/1, Bannerghatta Main Rd, Bengaluru - 560 029","location":"Bangalore","experience":"2 - 5 Years"},{"date":"1 - Jun - 2019","skills":"Core JAVA, Spring, Hibernate, Web Services, Oracle & HTML 5","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"CenturyLink Technologies India Private Limited, Salarpuria Touchstone, Fourth Floor, Survey no. 15/3 & 16, Kadubeesana Halli, Varthur Hobli, Outer Ring Road, Bangalore - 560 087","phone":"Not Provided","profile":"Java/ J2EE Developer \nCenturyLink Technologies India Pvt. Limited","description":"Candidate should have solid work experience on Core JAVA, Spring, Hibernate, Web Services, Oracle & HTML 5. Must have exposure to JBOSS application server. Very strong problem solving and analytical skills. Knowledge of Telecom transport layer, IP networks is an added advantage Job Responsbility- Design and develop medium sized components based on requirement specification. Produce high quality, maintainable software components code to comply with project quality objectives and company standards. Demo of deliverables to Product Owner & other stake holders at end of each sprint. Exhibit thorough knowledge of agile SCRUM methodology. Experience: 2 to 8 Years Work Location: Bangalore This position requires following skills: ANGULAR 2,4 or 6 NODE JS Core Java 8 (OOPS, Threading, Collections, Streams) Spring Boot and Spring Data (or Hibernate) SQL Knowledge Microservices (REST) GIT And Branching Strategies Junits SonarQube Fundamentals of Microservice Deployments Maven or Gradle Interview Process: Java Online Test, Followed by technical Interviews & Manager Round Interested candidates kindly can walk in for interview on 1st June, 9 AM onwards at below mentioned venue- CenturyLink Technologies India Private Limited. Salarpuria Touchstone, Fourth Floor, Survey no. 15/3 & 16, Kadubeesana Halli, Varthur Hobli, Outer Ring Road, Bangalore - 560 087 Contact Person: Kannan / Sabyasachi","location":"Bangalore","experience":"2 - 8 Years"}]}