{"Walkins":[{"date":"11 - Mar - 2021","skills":"Customer Relationship, Concept Selling, Sales Presentations, Customer Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Mahindra Holidays & Resorts India Limited, 1st Floor, Shikhar Tower, Plot No-323, Mangal Pandey Nagar, Meerut - 250004","phone":"9005364444","profile":" Relationship Manager \nMahindra Holidays & Resorts India Pvt. Limited","description":"Candidate should be Any Graduate with excellent communication skills Must have strong Results Orientation and Execution Excellence Strong Sales Experience High Energy and Passion High Customer Centricity High Perks & Incentives Vehicle is mandatory Job Purpose: To make powerful and successful sales presentations in different settings; to keep abreast with the organization's products and services; to crack profitable deals and referrals to achieve sales targets Job Responsibilities: Achieving stretched targets in a result-focused environment Preparing pre-sales proposals for prospective clients Delivering inspiring sales presentations to convert prospects to successful sales Handling objections and resolving member/ customer conflicts by constantly connecting with them through member meetings. Provide necessary support in booking first time holiday for new members and generate quality referrals from them. Provide necessary support in booking first time holiday for new members and generate quality referrals from them Identifying potential customers and new business opportunities Building and maintaining strong client relationship and high level of customer service Being updated on new products and services Walk-in Date/ Time: 11th March 2021, 10.30 AM - 3.00 PM Venue Details- Mahindra Holidays & Resorts India Limited, 1st Floor, Shikhar Tower, Plot No-323, Mangal Pandey Nagar, Meerut - 250004 Contact Person - Manish (9005364444) Interested Candidates can attend walk ins or share resumes on Manish.bajpai@mahindraholidays.com  ","location":"Meerut","experience":"3-7Years"},{"date":"10 - Mar - 2021","skills":"HR/ Recruitment, Talent Acquisition, End to end Recruitment","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Spectrum Talent Management Pvt. Limited, C-142, Sector -63, Noida","phone":"8929574268","profile":" HR Recruiter/ Freshers \nSpectrum Talent Management Pvt. Limited","description":"We are conducting WALK IN INTERVIEWS for FRESHERS. Below are the details : Company Name: Spectrum Talent Management Designation: HR Recruiter/ Management Trainee Good communication skills required Should be available for immediate joining and open for work from office Role & Responsibility- End to end Recruitment Screening resumes Shortlisting candidates basis the requirement Interview scheduling for clients Follow-ups & coordination with candidates till the joining. Achieve Targets Walk-in Date/ Time: 10th March 2021, 11.00 AM - 2.00 PM Venue Details- Spectrum Talent Management Pvt. Limited C-142, Sector -63, Noida Contact - Jasleen Kaur (8929574268)  ","location":"Noida","experience":"0-1Years"},{"date":"10 - Mar - 2021","skills":"Warehouse operations, Courier operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"DTDC Express Limited, No B14, Thiruvika Industrial Estate, Guindy, Chennai - 600 032.","phone":"Not Provided","profile":" Operation Executive \nDTDC Express Limited","description":"Candidate should be Graduated from a reputed University with 2+ years of experience in Warehouse operations, Courier operations. Must have good communication and mail drafting skills. Job Location: Ekkattuthangal Salary: Upto 18k gross Roles & Responsibilities- Planning of day to day dispatch activities with respect to the respective department. Good communication Skills & Knowledge in Warehouse Operations Looking out for Quick Joiners those can join ASAP Ability to manage high-volume environments E.g. Big Billion Day Sales Walk-in Date/ Time: 10th March 2021, 10.00 AM - 2.00 PM Venue Details- DTDC Express Limited No B14, Thiruvika Indstl Estate, Guindy , Chennai - 600 032. Contact Person- Viji  ","location":"Chennai","experience":"2-4Years"},{"date":"11, 12 - Mar - 2021","skills":"Back Office Operations, Data Entry, MIS Reporting, Team Operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"BIANCA HOME LLP, 915, Hubtown Solaris, N. S. Phadke Road Opposite.Telli Galli, Near Andheri Flyover, Andheri East, Mumbai - 400 069.","phone":"Not Provided","profile":" Back Office/ MIS Executive \nBianca Home LLP","description":"Candidate should be Any Graduate with good knowledge of Advance Excel Must have excellent communication skills. Preparation of MIS Reports Data Entries in the software/ Excel Ensure timely delivery of all orders Coordination with the vendors, warehouse team & operations team. Walk-in Date- 11th & 12th March 2021 Time- 11:00 am to 5:00 pm Venue Details- BIANCA HOME LLP, 915, Hubtown Solaris, N. S. Phadke Road Opposite.Telli Galli, Near Andheri Flyover, Andheri East, Mumbai - 400 069. Contact Person- Sameer Babar  ","location":"Mumbai","experience":"2-5Years"},{"date":"8, 9, 10, 11, 12, 13, 15, 16, 17 - Mar - 2021","skills":"Blended Process, Email Support, Customer Support, Chat Process/ Email Writing","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Tech Mahindra Limited, 2nd Floor Delta One Giga Space IT Park Internal Road, Viman Nagar Pune, Maharashtra - 411 014.","phone":"9096561522","profile":" Email Support Executive \nTech Mahindra Limited","description":"Candidate must have proven customer support experience or experience as a client service representative Should have excellent English communications skills Ability to listen and active problem solving skills Must have good interpersonal skills Ability to handle pressure Ability to multi-task, prioritize, and manage time effectively Duties & Responsibilities- The primary responsibilities of a Customer Service specialist would be: Handling escalations and complex queries. Manage large amounts of emails & chats Answer calls professionally to provide information about products and services, take/ or obtain details of complaints. Identify and assess customers needs to achieve satisfaction Build sustainable relationships and trust with customer accounts through open and interactive communication Walk-in- 8th - 17th March 2021 (Monday to Saturday) Time - 11am - 4pm Address - Tech Mahindra Limited 2nd Floor Delta One Giga Space IT Park Internal Road, Viman Nagar Pune, Maharashtra - 411 014. Contact Shabana Mulla - +91 9096561522 (Call/ WhatsApp) Mention 'Shabana' on top of the resume Email ID- SM00719332@techmahindra.com  ","location":"Pune","experience":"1-5Years"},{"date":"8, 9, 10, 11, 12, 13, 15 - Mar - 2021","skills":"IT Recruitment, MIS/ Back Office","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Disha HR Services Private Limited, Bldg No. 5, Flat No. 004, Varad Vinayak Society, Sambhaji Nagar, Sahar Road, Andheri East, Mumbai - 400 069.","phone":"9920589123","profile":" HR Executive/ Recruiter \nDisha HR Services Private Limited","description":"Candidate should be Any Graduate with 0 to 2 Years experience having expertise in Recruitments and should posses excellent communications Skills. Preferring Candidates from Western Suburbs. Freshers with Exceptional Skills and Desire to Make Career in HR are welcomed. Must have expertise in Recruitments Should posses excellent communications Skills Candidates Staying within Andheri and VileParle are Preferred Walk-in Date/ Time: 8th March - 15th March 2021, 11 AM onwards Venue Details- Disha HR Services Private Limited, Bldg No. 5, Flat No. 004, Varad Vinayak Society, Sambhaji Nagar, Sahar Road, Andheri East, Mumbai - 400 069. LandMark:- Near HDIL Tower, Opposite DMart Contact - Mahendra (9920589123)  ","location":"Mumbai","experience":"0-2Years"},{"date":"8, 9, 10, 11, 12, 13, 15 - Mar - 2021","skills":"Customer Support/ Customer Care/ E-commerce/ Voice Process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Teleperformance (Intelenet Global Services Pvt. Limited) DSR Techno Cube, Kundanahalli Gate, Varthur Road, 3rd floor, Next to SKR Kalyan Mandap, Bengaluru - 560 037.","phone":"6363739626","profile":" Customer Support Executive \nIntelenet Global Services Private Limited","description":"Teleperformance (Intelenet Global Services Private Limited) is hiring for 'Customer Support Executive' for one of its leading Ecommerce client in Bangalore. Prerequisites : Any Graduation Experience: minimum 1 year in call center Necessary Skills: Excellent English & Hindi fluency Nature of the job: You will be given an opportunity to interact and resolve the queries of the customers of a leading Ecommerce client Should be flexible with shifts Provide world class Customer Service End to end transaction of reports CTC - 2.75 LPA Interested candidates can directly walk-in to the given address below: Walk-in Date/ Time: 8th to 15th March 2021, 10.00 AM - 3.00 PM Venue Details- Teleperformance (Intelenet Global Services Pvt. Limited) DSR Techno Cube, Kundanahalli Gate, Varthur Road, 3rd floor, Next to SKR Kalyan Mandap, Bengaluru - 560 037. Contact Person- Shilpa (6363739626)  ","location":"Bangalore","experience":"1-5Years"},{"date":"8, 9, 10, 11, 12, 13, 15, 16, 17 - Mar - 2021","skills":"Software Testing, Manual Testing, Implementation, Technical Support","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Suvarna Technosoft Private Limited, Plot No. 8, Durga Nagar, Ameerpet, Hyderabad, Telangana - 500 016.","phone":"7569739410","profile":" Software Testing/ Support Engineer \nSuvarna Technosoft Private Limited","description":"Candidate should be BE/ B.Tech/ BCA/ MCA Fresher or with 0 to 1 year experience in Software Testing, Manual Testing, Implementation and Technical Support. Must have excellent communication skills. Walk-in Date: 8th - 17th March 2021 Timings: 10.30 AM - 5.30 PM Venue Details- Suvarna Technosoft Private Limited Plot No. 8, Durga Nagar, Ameerpet, Hyderabad, Telangana - 500 016. Contact Person- Susmitha Tel- 7569739410  ","location":"Hyderabad","experience":"0-1Years"},{"date":"8, 9, 10, 11, 12, 13, 14 - Mar - 2021","skills":"Technical Support, Software Support, IT Hepdesk","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Manabh Software, 106, First Floor, Olympia, Mumbai Bangalore Highway, Near Supreme HQ, Baner, Pune - 411 021.","phone":"Not Provided","profile":" Technical Support Engineer \nManabh Software","description":"Candidate should be BE/ B.Tech/ M.Tech or MCA with 0 to 1 year experience in Technical Support, Software Support Must have excellent communication skills. Roles and Responsibilities : SQL & MS Access Database query handling. ERP Product questioner & Handling Address Technical Query of client To forward the core problem of software to the development team. Researching and identifying solutions to software issues Diagnosing technical issues of ERP product & report same to Development team Properly escalating unresolved issues to appropriate internal teams Referring to internal database or external resources to provide accurate tech solutions Walk-in Date/ Time: 8th - 14th March 2021, 10.30 AM - 4.30 PM Venue Details- Manabh Software, 106, First Floor, Olympia, Mumbai Bangalore Highway, Near Supreme HQ, Baner, Pune - 411 021. Note: Please carry your passport size photo.  ","location":"Pune","experience":"0-1Years"},{"date":"6 - Mar - 2021","skills":"Software testing (Manual and Automation), Java programming and SQL/ Database","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Zee Entertainment Enterprises Limited, Engro,4th Floor, Western Aqua, White Fields (Tech Mahindra Lane), Hitech City Hyderabad \u0096 81.","phone":"040-42426128","profile":" Software Testing Engineer \nZee Entertainment Enterprises Limited","description":"Candidate must be well trained in Software testing (Manual and Automation) Should have good knowledge in Java programming and SQL/ Database Must be Good Team player and time-management skills Great interpersonal and communication skills Develop test cases and prioritize testing activities. Inform the test lead about what all resources will be required for software testing. Execute all the test cases and report defects, define severity and priority for each defect. Work Experience: 0 to 2 Years Interested candidates can directly walk-in for a Face to Face interview on 6th March 2021, between 9.30 AM - 3.00 PM at the below mentioned address- Zee Entertainment Enterprises Limited Engro,4th Floor, Western Aqua, White Fields (Tech Mahindra Lane), Hitech City Hyderabad \u0096 81. Google Maps Location: https://goo.gl/maps/sQxKxLYxrSghbvx46 Contact - Heena ( 9121284559 ) Phone: 040-42426128  ","location":"Hyderabad","experience":"0-2Years"},{"date":"6 - Mar - 2021","skills":".Net, C# and/ or ASP .Net, Azure, MVC, REST API, JSON, HTML, CSS, JavaScript, MS SQL/ SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Zee Entertainment Enterprises Limited, Engro,4th Floor, Western Aqua, White Fields (Tech Mahindra Lane), Hitech City Hyderabad \u0096 81.","phone":"Not Provided","profile":" .Net Developers \nZee Entertainment Enterprises Limited","description":"Candidate must have strong working knowledge of .Net and Proficient in {C# and/ or ASP .Net}, with a good knowledge of their ecosystems. Knowledge on Azure, MVC, REST API, JSON and knowledge on Hangfire and Autofac (optional) Knowledge on Redis and Solr HTML, CSS, JavaScript Strong understanding of object-oriented programming Skill for writing reusable libraries Experience with MS SQL/ SQL Server and MongoDB (optional) Experience with popular web application frameworks Familiarity with Windows Presentation Framework (optional) Knack for writing clean, readable, and easily maintainable code Understanding of fundamental design principles for building a scalable application Experience creating database schemas that represent and support business processes Basic understanding of Common Language Runtime (CLR), its limitations, weaknesses, and workarounds Experience implementing automated testing platforms and unit tests Knowledge on code versioning tools. Candidates with Immediate - 15 Days notice are preferred. No Work From Home Interested candidate can directly walk-in for a Face to Face interview on 6th March 2021, between 9.30 AM - 3.00 PM at the below mentioned address- Zee Entertainment Enterprises Limited Engro,4th Floor, Western Aqua, White Fields (Tech Mahindra Lane), Hitech City Hyderabad \u0096 81. Google Maps Location: https://goo.gl/maps/sQxKxLYxrSghbvx46 Contact - Heena ( 9121284559 ) Phone: 040- 42426128  ","location":"Hyderabad","experience":"0-3Years"},{"date":"8, 9, 10, 11, 12 - Mar - 2021","skills":"Customer Relationship, Supply Chain Management, Logistic/ Warehouse Management, Client Satisfaction","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"YCH Logistics (India) Private Limited, Plot No. D VI, SIPCOT HI-TECH SEZ, Phase II,Srimangadu Village, Sriperambudur Taluk, Kancheepuram District, Tamilnadu \u0096 602 105","phone":"9944214256","profile":" Logistics Operation/ Assistant Manager \nYCH Logistics (India) Private Limited","description":"Educational Qualification: Any Graduate/ Post Graduate Minimum Experience (6 - 12 Years or more) Experience in Handling Electronic based Customers like mobiles, Laptop etc Good in Hindi (Must) Good rapport building with the Customers Customer Handling Excellent Communication Skills Salary Based on the Previous Experience & Interview Performance Walk-in Date- Date : 8th - 12th March 2021 Time: 10:00 AM - 4:00 PM Venue Details- YCH Logistics (India) Private Limited Plot No. D VI, SIPCOT HI-TECH SEZ, Phase II,Srimangadu Village, Sriperambudur Taluk, Kancheepuram District, Tamilnadu \u0096 602 105 Contact Person- Gladson S (9944214256)  ","location":"Chennai","experience":"6-12Years"},{"date":"5, 6, 7, 8, 9, 10, 11, 12 - Mar - 2021","skills":"Team Handling, MIS Preparation, MIS Operations/ Formulas","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Tech Mahindra Limited, Shardha Centre, Kothrud, Near Null Stop, Pune. Opposite of Persistent Company.","phone":"9168637999","profile":" MIS/ Support Executive \nTech Mahindra Limited","description":"Tech Mahindra Limited is hiring Lead MIS Executive (BPO Background Preferred) at Pune Kothrud location Eligibility Criteria: Educational Qualification: Any Graduate Experience should be 1 to 2 years in MIS executive profile Should have Good English Communication Skills. Candidate should from BPO background Salary: 2 Lac PA to 3.5 Lac PA Job Location: Pune Duties & Responsibilities: Handling database management by using Advanced Excel tools. Should be proficient with Advanced Excel Formulas such as, Pivot Table, Lookups, Conditional formatting, count IF, Sum IF. Good analytical skills for MIS, number crunching & reporting to internal & external customers. Ensure accuracy and timeliness of reports sent. Organization skills, with an ability to stay focused on assigned tasks. Team Handling Looking for Immediate joiner* Walk-in Date/ Time: 5th - 12th March 2021, 9.30 AM - 5.30 PM Venue Details- Tech Mahindra Limited Shardha Centre, Kothrud, Near Null Stop, Opposite of Persistent Company Contact Person Mayuresh J (mj00642401@techmahindra.com) No - +91 9168637999 (Call/ WhatsApp )  ","location":"Pune","experience":"1-5Years"},{"date":"5, 6, 7, 8, 9, 10, 11, 12, 13, 14 - Mar - 2021","skills":"Java, J2EE, Spring MVC, IOC, Hibernate/ JPA, JSP, HTML5, Web-Service, JSON","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Arraign Technologies Private Limited, #22, Gopalan Company Works, 5th Floor, Gopalan Innovation Mall, Banerghatta Road, JP Nagar 3rd Phase, Bangalore.","phone":"8688325293","profile":" Junior Java Developer \nArraign Technologies Private Limited","description":"Candidate must have extensive experience with web applications using Java, J2EE, Spring MVC, IOC, Hibernate/ JPA, JSP, HTML5, Web-Service, JSON, JavaScript, AJAX, Angular-JS, Windows/ Linux, XML, JSON, Framework, database, and OOP Concept. Should have experience in the Spring Framework. Experience in developing web applications using at least one popular web framework (JSF, Wicket, GWT, and Spring MVC) Proven hands-on Software Development experience Profound insight of Java and J2EE internals. Good Experience in JSP, AJAX using Spring MVC, JSON, and JQuery. Experience in Databases like SQL, MySQL, Maria DB, Maria DB, and Oracle Should be aware of SDLC cycle Good Communication skills and self-motivated Good analytical and problem solving skills Should have good debugging skills Expertise in developing object-oriented software with a strong background in Java development. Expert knowledge of object-oriented programming, Architecture and Design Patterns. Strong development and debugging experience with Java/ J2EE technologies, including Spring (Spring Framework and Spring Boot), Hibernate, Web Application/Web Services with JBoss & WebSphere, Restful Webservices, etc. Experience troubleshooting technologically challenging customer issues. Able to use advanced debugging techniques including analysis of heap/ thread dump files, tracing, and performance tuning and monitoring Walk-in Interview from 5th March - 14th March , 11.00 AM - 5.30 PM at the below address- Arraign Technologies Private Limited #22, Gopalan Company Works, 5th Floor, Gopalan Innovation Mall, Banerghatta Road, JP Nagar 3rd Phase, Bangalore. Contact - Sarat Chandra (8688325293)  ","location":"Bangalore","experience":"2-4Years"},{"date":"5 - Mar - 2021","skills":"Php, Java, Oracle Forms and Reports, Jasper Reports, Oracle, MySQL Database","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Allin Info Systems Private Limited, B75 Sector 6, Noida.","phone":"8249718725","profile":" PHP Developer/ Fresher \nAllin Info Systems Private Limited","description":"Candidate should have good knowledge of Php, Java, Oracle Forms and Reports, Jasper Reports Database: RDBMS- Oracle, My SQL, Completed educational project in PHP, MYSQL, Java Scripting, AJAX and CSS Must have basic knowledge of HTML 5, CSS 3 and XHTML Should have knowledge of WordPress, Magento Walk-in Date/ Time: 5th March 2021, 10.00 AM - 5.30 PM Venue Details- Allin Info Systems Private Limited B75 Sector 6, Noida. Contact- Smita, HR (8249718725)  ","location":"Noida","experience":"0-1Years"},{"date":"4, 5, 6, 7, 8, 9, 10, 11 - Mar - 2021","skills":"HR/ Recruitment, Talent Management, Sourcing to Selection","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Volantis Technologies Private Limited, 3rd Floor, No.3, Valpra House, 17th Main Service Road, BTM Layout 1st Stage, Bangalore \u0096 560 068","phone":"7899322225","profile":" HR Recruiter/ Lead/ Manager \nVolantis Technologies Private Limited","description":"Role : Recruiter/Sr. Recruiter/ Lead Recruiter/Manager (IT Recruitment/Technical Recruitment) Work Experience : 0 - 8 years Location : Bangalore (BTM Layout) Industry : Recruitment/Staffing Required Skills- Good Exposure to Recruitment Process. Experience/Knowledge in Recruitment Life Cycle from Sourcing to Selection. Experience in Sourcing profiles through Job Portals, Networking, Headhunting & Social Networking Sites. Good Communication and Presentation Skills Must be target driven and must be able to thrive in a time pressured environment. Must possess strong presentation skills and be able to communicate professionally. Note : We prefer candidates having experience in Recruitment Consulting Firm background and from Domestic Staffing Experience. If you are interested for the above role, share your profile with me at deepak.b@volantis.com Or you can come for F2F Interview to our BTM office mentioned below: Walk-in Date/ Time: 2nd March - 11th March , 9.30 AM - 6.00 PM Venue Details- Volantis Technologies Private Limited 3rd Floor, No.3, Valpra House, 17th Main Service Road, BTM Layout 1st Stage, Bangalore \u0096 560 068 Landmark: Near Udupi Garden Signal (Above KTM Bike Showroom) Contact Person : Deepak B (7899322225)  ","location":"Bangalore","experience":"0-5Years"},{"date":"4, 5, 6, 7, 8, 9, 10, 11 - Mar - 2021","skills":"Banking Data Entry Work, Banking Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Cameo Corporate Service Limited, No. 1, Subramanian Buliding, 5th Floor, Club House Road, Anna Salai, Chennai. Landmark:- Near Spencer Plaza, Opp. building to Senthur Hotel, Bank of Baroda Bank.","phone":"8056501264","profile":" Data Entry Executive (Banking Process) \nCameo Corporate Services Limited","description":"We have an Immediate Opening for Data Entry at Chennai location for leading Banking Process. Educational Qualification: Any Degree Work Experience: Fresher or 0 to 1 Year Immediate Joiners Preferred. Banking Data Entry Work Salary Package : RS:7000/- Take Home Shift Timing : 9.30 AM to 6.30 PM Walk-in Date/ Time: 2nd March - 11th March , 9.30 AM - 2.00 PM Venue Details- Cameo Corporate Service Limited No. 1, Subramanian Buliding, 5th Floor, Club House Road, Anna Salai, Chennai. Landmark:- Near Spencer Plaza, Opp. building to Senthur Hotel, Bank of Baroda Bank. Contact - Sultan (8056501264)  ","location":"Chennai","experience":"0-1Years"},{"date":"4, 5, 6, 7, 8, 9, 10, 11 - Mar - 2021","skills":"TPA, Claim Coordination, Medical Insurance Claims Processig","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"4/112, Mount Poonamalle High Road Manapakkam, Mount Poonamalle High Rd, Sathya Nagar, Manapakkam, Chennai, Tamil Nadu - 600089","phone":"7299068401","profile":" Insurance Coordinator \nMIOT Hospitals Private Limited","description":"Candidate should be Any Graduate with 1 to 3 years of experience in Hospital insurance Must have Pleasant Personality with good communication skills. Should have good knowledge about TPA Must have handled Insurance Pre Authorise and final billing enhancement Preparing daily report Daily patient visit Walk-in Date/ Time: 1st March - 11th March , 10 AM onwards Venue Details- 4/112, Mount Poonamalle High Road Manapakkam, Mount Poonamalle High Rd, Sathya Nagar, Manapakkam, Chennai, Tamil Nadu - 600089 Contact - Divya ( 7299068401 )  ","location":"Chennai","experience":"1-4Years"},{"date":"6 - Mar - 2021","skills":"Core Java, Spring, Mvc, Spring Boot, Angular JS","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Dream Tekis Software Private Limited, Plot No 411, #302, Sri Nivasam, Mathrusri Nagar, Miyapur, Hyderabad, Telangana - 500 081.","phone":"Not Provided","profile":" Java Developers \nDream Tekis Software Private Limited","description":"Candidate should have good knowledge in below mentioned skills sets: Core Java Spring boot Spring MVC Spring data JPA Sound knowledge in Angular. Ability to work in team environment Roles and Responsibilities- Contribute in all phases of the development lifecycle Write well designed, testable, efficient code Ensure designs are in compliance with specifications Prepare and produce releases of software components Support continuous improvement by investigating alternatives and technologies and presenting these for architectural review Walk-in Date/ Time: 6th March 2021, 9.30 AM - 5.30 PM Venue Details- Dream Tekis Software Private Limited Plot No 411, #302, Sri Nivasam, Mathrusri Nagar, Miyapur, Hyderabad, Telangana - 500 081.  ","location":"Hyderabad","experience":"0-1Years"},{"date":"4 - Mar - 2021","skills":"Python and Java","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Future Focus Infotech Private Limited, Opp F&F Mart chikoti Gardens Beside SBI BANK lane Opposite To Shoppers Stop road Begumpet - 500016.","phone":"Not Provided","profile":" Python and Java Developers \nFuture Focus Infotech Private Limited","description":"Hiring for a Level 3 Company with offices in Hyderabad/India, US, UK and Dubai. Freshers openings Job Role: Candidate should have Bachelor's degree in (B.Tech with CSC, IT, ECE,2019 or before and M.Tech MCA with 2020 or before with Good Communication skills and Technical Skills. Should be ready to relocate across PAN India. Interview process Technical Round code test Manager round Ready To sign bond with company Salary First 10 months in training 10,000 will be provided after internship 11 month salary will be increased to 15000 to 2000 Note: Need to Register with registration fee 250/- Interested candidates can contact 7075761864 Walk-in Date/ Time: 4th March 2021, 8.00 AM - 1.00 PM Venue Details- Future Focus Infotech Private Limited Opp F&F Mart chikoti Gardens Beside SBI BANK lane Opposite To Shoppers Stop road Begumpet - 500016. Contact - Heena ( 7569210167 )  ","location":"Hyderabad","experience":"0-1Years"},{"date":"4, 5, 6 - Mar - 2021","skills":"Core JAVA, Advance Java, Oracle, MySQL, SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Velox Solutions Private Limited, No- 901, 902, 905, 906 & 908, 9th Floor, Vashi Infotech Park, Sector-30A, Vashi, Navi Mumbai - 400 705.","phone":"8591400251","profile":" Java Developer/ Fresher \nVelox Solutions Private Limited","description":"Educational Qualification: BCA, BSc-IT, BE, MCA, MCM Work Experience: Fresher Job Location: Vashi, Navi Mumbai Required Key Skills: Core JAVA, Advance Java, Oracle, MySQL, SQL Server, Frameworks (Struts 2.0, Hibernate, Spring, Java Script, jQuery, Ajax, Bootstrap) Should have excellent communication skills. No. of Positions: 3 Walk-in Date/ Time: 4th - 6th March 2021, 9.30 AM - 5.30 PM Venue Details- Velox Solutions Private Limited No- 901, 902, 905, 906 & 908, 9th Floor, Vashi Infotech Park, Sector-30A, Vashi, Navi Mumbai - 400 705. Contact - Vivek Kadam (8591400251) Interested candidates can share their resume on career@velox.co.in  ","location":"Mumbai","experience":"0-1Years"},{"date":"3, 4, 5, 6 - Mar - 2021","skills":"Core PHP, CodeIgniter Framework, PHP5, MySQL, jQuery, JavaScript, HTML5, CSS3, XML","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Vidya Online Services Pune Private Limited, Third Floor, Navale IT Zone, Above Union Bank, Mumbai-Bangalore bypass Highway, Phase 2, Narhe Road, Pune, Maharashtra - 411 041.","phone":"Not Provided","profile":" PHP Developer \nVidya Online Services Pune Private Limited","description":"Candidate should be BE-IT, BE (Computer Science), MCA or any Computer Graduate with good hands on experience in string Core PHP. Strong Expertise in CodeIgniter Framework with Good Knowledge of PHP5, MySQL, jQuery, JavaScript, HTML5, CSS3, XML. Sound knowledge of database designing and application architecture planning for Core PHP projects. Must have good debugging skills. Expertise in PHP, MVC Frameworks and good technology exposure of CodeIgniter. Assure that all user input is validated before submitting to back-end. Good understanding of asynchronous request handling, partial page updates, and AJAX will be preferred. Basic understanding of front-end technologies, such as JavaScript, HTML5, and CSS3 Proficient understanding of code versioning tools, such as Git. Excellent Communication & Client Interaction Skills. Understanding of session management in a distributed server environment. Walk-in Date/ Time: 3rd March - 6th March , 12.30 PM - 5.30 PM Venue Details- Vidya Online Services Pune Private Limited Third Floor, Navale IT Zone, Above Union Bank, Mumbai-Bangalore bypass Highway, Phase 2, Narhe Road, Pune, Maharashtra - 411 041. Contact - Parish Mhatre  ","location":"Pune","experience":"2-3Years"},{"date":"2, 3, 4, 5, 6, 7, 8, 9, 10, 11 - Mar - 2021","skills":"Software Testing, Manual Testing, Mobile Application Testing, SQL","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Avani Infosoft Private Limited, 1st Floor, NHBCS Layout, Near Kamakshipalya Police Station, Basaveshwara Nagar , Bangalore - 560 079.","phone":"6366939247","profile":" Software Testing Engineer \nAvani Infosoft Private Limited","description":"Candidate should be BE/ B.Tech/ BCA or MCA with 1 or 1+ year experience in Software Testing, Manual Testing, SQL. Must have excellent communication skills. Looking for male candidate only. Walk-in Date/ Time: 2nd - 11th March 2021, 9.30 AM - 5.30 PM Venue Details- Avani Infosoft Private Limited 1st Floor, NHBCS Layout, Near Kamakshipalya Police Station, Basaveshwara Nagar, Bangalore - 560 079. Contact - Usha (6366939247)  ","location":"Bangalore","experience":"1-3Years"},{"date":"1, 2, 3 - Mar - 2021","skills":"HR/ Recruitment, Sourcing, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Uolo Edtech Private Limited, 91 Springboard, 5th Floor, Plot No. 145, Sector 44, Near Punjab and Sindh Bank, Gurgaon, Haryana - 122 002.","phone":"7060092639","profile":" HR Executive \nUolo Edtech Private Limited","description":"Uolo Edtech Private Limited is currently looking for HR Executive. Skills required: Partnering with team/ Function heads to determine staffing needs Screening resumes and conducting telephonic interviews with candidates Develop a pool of qualified candidates in advance of need Research and recommend new sources for active and passive candidate recruiting Walk-in Date/ Time: 1st March - 3rd March 2021, 10.00 AM - 6.30 PM Venue Details- Uolo Edtech Private Limited 91 Springboard, 5th Floor, Plot No. 145, Sector 44, Near Punjab and Sindh Bank, Gurgaon, Haryana - 122 002. Contact - Bharti Pundir (7060092639)  ","location":"Gurgaon","experience":"1-4Years"},{"date":"2, 3, 4, 5, 6, 8, 9, 10, 11 - Mar - 2021","skills":"Office Administration, Front Office Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"iService Center, Unit 1, Rajnigandha Building No. 14, New Link Road, Oshiwara, Andheri West, Mumbai","phone":"9987635470","profile":" Front Office Administrator \niService Center","description":"Candidate should be Any Graduate with 0 to 2 years of experience in Office Administration, Front Office Management. Should have excellent communication skills. Roles and Responsibilities- 1. Engage with the Client to accept Devices for high level diagnostics to provide accurate estimates for smartphones and tablet issues. 2. Creation of Work Orders on CRM to track the device repair life-cycle from Estimate up to Invoicing and Sales Receipt. 3. Assist the Branch Manager with procurement of Spare Parts and Accessories and creating proper Debit Vouchers for the same 4 Creating Debit Vouchers for Company related petty cash expenses and maintaining records in the CRM system. 5. Follow-up with clients and providing status updates to Clients on the current status of their device, right from work complete to Pick up. 6. Handles Pre-Repair and Post-Repair warranty customer requests for technical assistance and support. 7. Assists in Service Center workshop maintenance to ensure a clean and healthy workshop environment along with safety measures. Walk-in Date/ Time: 2nd March - 11th March , 11.30 AM - 6.00 PM Venue Details- iService Center Unit 1, Rajnigandha Building No. 14, New Link Road, Oshiwara, Andheri West, Mumbai Landmark: Near Shreeji Restaurant Contact - Sana ( 9987635470 )  ","location":"Mumbai","experience":"0-2Years"},{"date":"1 - Mar - 2021","skills":"Inbound Process, Email Support, Customer Service, Customer Support","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Adecco India Private Limited, Summit B, 13th Floor, Brigade Metropolis, Whitefield Road City, Bangalore - 560 048.","phone":"7892003170","profile":" Customer Relations Executive \nAdecco India Private Limited","description":"Person would be required to maintain customer relationship by responding to inquiries; documenting actions within given timeframe and endorse the Adeccos brand name while servicing a hassle free associate employer interface Key Responsibilities- Determines requirements by working with associates Answers inquiries by clarifying desired information; researching, locating, and providing information. Resolves problems by clarifying issues; researching and exploring answers and alternative solutions; implementing solutions; escalating unresolved problems. Fulfils requests by clarifying desired information; completing transactions; forwarding requests. Maintains associate support centres database by entering information. Walk-in Date/ Time: 1st March 2021, 10.00 AM - 5.00 PM Venue Details- Adecco India Private Limited Summit B, 13th Floor, Brigade Metropolis, Whitefield Road City, Bangalore - 560 048. Contact Person- Nakul Pai (7892003170)  ","location":"Bangalore","experience":"0-3Years"},{"date":"1 - Mar - 2021","skills":"Education Counseling/ Career Counselling","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"SNVA Ventures Private Limited, SEO 75, Sector-15, Part 2, Urban Estate, Gurugram, Haryana","phone":"8447379398","profile":" Education/ Career Counselor \nSNVA Ventures Private Limited","description":"Candidate with good selling skills will be highly preferred. Job will involve taking follow-ups, explaining training to professionals etc. Relevant experience in the Education industry in a mandate Person must be good in convincing Good Spoken English Unlimited Incentive plan Immediate joiner Walk-in Date/ Time- 1st March 2021, 9.30 AM - 5.30 PM Venue Details- SNVA Ventures Private Limited SEO 75, Sector-15, Part 2, Urban Estate, Gurugram, Haryana Contact - HR Dept (8447379398)  ","location":"Gurgaon","experience":"2-4Years"},{"date":"1 - Mar - 2021","skills":"Customer Service, Calling, Data Verification","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"BANKSHALL STREET 2 FAIRLY PLACE BBD BAG KOLKATA - 700 001","phone":"7044833096","profile":" Back Office Executive \nKrishna Finance Company Private Limited","description":"Candidate should be Any Graduate with 0 to 1 year experience in Customer Service, Calling, Data Verification. Must have excellent communication skills Freshers can also apply Walk-in Date/ Time: 1st March 2021, Between 9.30 AM - 11.00 AM Venue Details- Krishna Finance Company Private Limited BANKSHALL STREET 2 FAIRLY PLACE BBD BAG KOLKATA - 700 001 Contact - BIPASA ( 7044833096 )  ","location":"Kolkata","experience":"0-1Years"},{"date":"1 - Mar - 2021","skills":"HR Intern, Sourcing, Apprenticeship Trainee","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Ample Technologies Private Limited, Ncc Urban - Windsor, 4th Floor, HAL Old Airport Road, Bengaluru, Karnataka - 560 064.","phone":"Not Provided","profile":" HR Executive/ Interns \nAmple Technologies Private Limited","description":"We are looking for 3 months HR interns. We provide HR internship certificate. The internship will not be paid. If you are interested please share your resume to ashwini.prasad@ample.co.in or Watsapp on 9686685448. Walk-in Date/ Time: 1st March 2021, 10.30 AM - 5.00 PM Venue Details- Ample Technologies Private Limited Ncc Urban - Windsor, 4th Floor, HAL Old Airport Road, Bengaluru, Karnataka - 560 064. Contact Person- Ashwini  ","location":"Bangalore","experience":"0-1Years"},{"date":"1, 2, 3 - Mar - 2021","skills":"HR Generalist Activities, Talent Management, Interviewing, Recruitment and Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"DTDC Regional Office, H No - 1-11-249/A, Opposite Pantaloons, Shyamlal Building, Begumpet, Hyderabad - 500 016.","phone":"Not Provided","profile":" Senior HR Executive \nDTDC Express Limited","description":"Candidate should have 2 to 7 years of experience in HR Generalist Activities, Talent Management, Interviewing, Recruitment and Talent Acquisition. Must have excellent communication skills. Job Responsibility- Responsible for handling recruitment and providing regional hiring support by connecting with internal stakeholders across teams Handling training for HR portal and providing relevant support for Regional employees of DTDC on a regular basis Handling internal recruitment communication (FACE) in the form of daily newsletters for internal stakeholders and franchisees Responsible for handling dashboards and critical trackers to ensure effective recruitment monitoring Providing hiring support to regional e-commerce operations (temporary staff), along with handling trackers and vendor communication for the same Enabling temporary and permanent identification and onboarding (complete end to end process) for external vendors Providing support for the Product management of the DTDC Careers Page, which includes being responsible for launch of new features and initiatives pertaining to that in the regions Providing support in handling other engagement activities across India, and monitoring small projects pertaining to the same Providing support for any other hiring/recruitment-related process or sub-process for teams across regions. Ensure timely closure of Leadership positions in the region by liaising with all stakeholders and senior leaders. Partner with regional souring platforms in order to hire all temporary and ground staffs in the regions. Ensure joining formalities and on boarding of hired employees on the HRMS platform Maintain Background verifications records and biometric mapping of all employees on the central platform. Support the Regional HR team with other HR related operations in the region. Walk-in Date/ Time: 1st March - 3rd March 2021, 10.00 AM - 4.00 PM Venue Details- DTDC Regional Office, H No - 1-11-249/A, Opposite Pantaloons, Shyamlal Building, Begumpet, Hyderabad - 500 016. Contact - Mohammed  ","location":"Hyderabad","experience":"2-7Years"},{"date":"1, 2, 3, 4, 5 - Mar - 2021","skills":"Core Java, J2EE, Angular JS, HTML5, Spring, SQL and Database","qualification":"B.E./B.Tech, M.Tech","address":"Vertilink Technologies, 203, 3RD Floor, Moghal Emami Mansion, Opposite Shadan College, Khairtabad, Hyderabad, Telangana - 500 004.","phone":"9581022022","profile":" Software Developers (Java/ Python) \nVertilink Technologies","description":"We have multiple openings for Training and Development. JAVA DEVELOPER Candidate must have strong knowledge in Core Java and J2EE Strong knowledge of Database and SQL Knowledge of Angular JS, HTML5, Spring PYTHON DEVELOPER Candidate must have strong knowledge in Python Programming Strong knowledge in Algorithm Development, R-Language, Anaconda, Python 3.0 and 2.7, Must Knowledge in Deep Learning (TensorFlow), Keres, OpenCV, SKLearn, DJango Knowledge of Artificial Intelligence, Machine Learning, and Other Classification based concepts EMBEDDED DEVELOPER Hands-on development experience of Hardware Based Design using MCU (89S52, 89C52), PIC Controller, Arduino UNO, Arduino Mega, ARM Controller. Added knowledge of working with Raspberry Pi. Knowledge of Sensors, Development Boards, Windows/ Linux OS. Professional Requirements: Need for Development and Training A strong desire to collaborate and work within a team. Ability to define requirements and work in a concept-to-design model Good Communication & Interpersonal Skills. Qualification: BE/ B.Tech, ME/ M.Tech Work Experience: 0 to 3 Years Job Location: Hyderabad If interested, Please apply with your Updated profile & the below mentioned details to info@vertilinktech.com Name: Mail-ID: Phone No: Current Organization: Current CTC: Expected CTC: Mail ID:  ","location":"Hyderabad","experience":"0-3Years"},{"date":"1, 2, 3, 4, 5, 6, 7 - Mar - 2021","skills":"Administration Management, Liaison, Personnel Management, Human Resource Management","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Bombay Intelligence Security India Pvt. Limited, BIS House, Plot No.507/10 Center Point, Near GIDC Police Station, GIDC, Ankleshwar, Bharuch, Gujarat - 393 002.","phone":"Not Provided","profile":" HR Officer - Personnel \nBombay Intelligence Security (India) Limited","description":"Candidate should have 2 to 5 years relevant work experience & knowledge of record keeping in respect of PF, ESIC, P.Tax, MLWF, Security Guard Board, HR Audit & Labour Act. Must be having excellent Laisoning with statutory authorities for successfully carrying out inspections and settlement of queries. Core Responsibilities:- Person would be mainly responsible for PF, ESIC, and other compliance Related matters.. To prepare the monthly PF statement, PF Challan & process the PF withdrawals. To prepare the remittance statement, submission of monthly & Annual return To maintain the Salary, Attendance, Deduction & OT Register To maintain the Form No. F & Process gratuity application form Managing & taking care of Shop & establishment compliance's as per the various Acts & maintaining register. Creates & execute administrative management work plans. Maintain & update all Personnel record time to time. Interested candidate can share there profile on ankleshwar@bombayintelligence.com/ hrd@bombayintelligence.com Or can walk in with updated CV from 1st to 7th March 2021, between 9.30 AM - 5.30 PM Venue Details- Bombay Intelligence Security India Pvt. Limited BIS House, Plot No.507/10 Center Point, Near GIDC Police Station, GIDC, Ankleshwar, Bharuch, Gujarat - 393 002. Contact Person- Amarjeet Singh  ","location":"Bharuch","experience":"2-5Years"},{"date":"1, 2, 3, 4, 5, 6, 7 - Mar - 2021","skills":"Customer Service, International Voice Process, Customer Care","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Colossal Infotech Private Limited, 11Th Floor, Suit - 1109. Godrej Genesis Building, EN - 34, EN Block, Sector - 5, Kolkata, West Bengal - 700091.","phone":"6289360825","profile":" Customer Support Executive \nColossal Infotech Private Limited","description":"Candidate should be Any Graduate with 0 to 3 years of experience in International voice process, solving customer queries over the phone, must be fluent in English. Walk-in Date/ Time: 1st - 7th March 2021, 3.30 PM - 6.30 PM Venue Details- Colossal Infotech Private Limited 11Th Floor, Suit - 1109. Godrej Genesis Building, EN - 34, EN Block, Sector - 5, Kolkata, West Bengal - 700091. Contact - Suchismita Das (6289360825)  ","location":"Kolkata","experience":"0-3Years"},{"date":"1, 2, 3, 4, 5, 6, 7 - Mar - 2021","skills":"Customer Support, Domestic/ Tele calling, Voice Process, Customer Handling","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Tech Mahindra Limited, Delta 1, 2nd floor, GIGA SPACE IT Park, Viman Nagar, Pune.","phone":"9096561522","profile":" Customer Support (Voice Process) \nTech Mahindra Limited","description":"Educational Qualification Required: Any Graduate Work Experience : Minimum 1 Year of Voice process Experience Skills Required : Good Communication skills and basic computer knowledge Shift- Day Shift (One Week off-rotational) Job Responsibility- 1) Voice process, professionally to provide information about products and services, take/cancel orders or obtain details of complaints. 2) Keep records of customer interactions, details of inquiries, complaints and comments as well as actions taken. 3) Follow up to ensure that appropriate actions were taken on customers' requests. 4) Refer unresolved customer grievances or special requests to designated departments for further investigation. Walk-in Date/ Time: 1st to 7th March 2021, 9.30 AM - 4.00 PM Venue Details- Tech Mahindra Limited, Delta 1, 2nd floor, GIGA SPACE IT Park, Viman Nagar, Pune. Contact Person : Nilesh: 9893224757 Shabana: 9096561522 Abhishek: 7066444670 Email : NV00703098@techmahindra.com (interested candidates can send their resume for Interview)  ","location":"Pune","experience":"1-3Years"},{"date":"1, 2, 3, 4, 5, 6, 7 - Mar - 2021","skills":"Customer Support, Customer Service, Customer Care, Email Process, Chat Process","qualification":"Diploma, B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"[24]7 Customer Private Limited, Prestige Tech Platina, Kadubeesanahalli, Marathahalli Outer Ring Road, Bangalore - 560 087.","phone":"Not Provided","profile":" Customer Support Executive \n[24]7 Customer Private Limited","description":"[24]7 Customer Private Limited is hiring Customer Support Executive for International Voice and Non Voice Process at Bangalore. Qualifications: PUC (12th)/ Diploma/ Undergraduates/ BE/ B.Tech and Graduates from any stream are eligible to apply. Freshers & candidates with prior relevant (BPO) and non-relevant (other domain) experience are eligible to apply. Master Graduates should have at least 1 year experience in BPO sector. Required Skills- Excellent Verbal and Written Communication skills with 25 WPM/85% accuracy in Typing, Able to interact with customers via chat, should be able to answer servicing questions. Must have good logical reasoning & analytical skills, excellent customer service skills, Perks and Benefits- Salary Range : INR 2,50,000 - 3,50,000 P.A (13,000 - 19,000) Take Home Salary) Incentives Minimum of Rs.1400 eligible from 4th month onwards Broadband Reimbursement Rs.1300 (if own Broadband connection is chosen) Self to work (STW) Rs.2200 if choosing own mode of travel to work) Walk-in Date/ Time: 1st March - 7th March from 9.30 AM onwards Venue Details- [24]7 Customer Private Limited Prestige Tech Platina, Kadubeesanahalli, Marathahalli Outer Ring Road, Bangalore - 560 087.  ","location":"Bangalore","experience":"0-3Years"},{"date":"1, 2 - Mar - 2021","skills":"Java/ J2Ee, Spring, Hibernate, Multithreading, Collections","qualification":"Diploma, B.A., B.Com, B.B.A, B.Sc","address":"Zebronics India Private Limited, No. 118 Ponnamallee High Road, Vepery, Chennai - 60084","phone":"Not Provided","profile":" Front Office Executive (Female) \nZebronics India Private Limited","description":"We are looking for Receptionist / Front Office Executive Educational Qualification: Any Graduate/ Diploma Work Experience: 0 to 3 Years Age: Below 35 Years Languages: English, Tamil & Hindi (Preferred) Location: Chennai (residing close to office) Salary: Best In Industry Fluency & Communication skills in English & Hindi Must. Female candidate preferred. Immediate joiners only will be considered. Duties & Responsibilities- Responsible for attending all the incoming calls, responding to them and transferring the call to the appropriate department. Responsible for greeting the visitors at the office, registering their names and contact details. Providing assistance to the heads in the administration department Responsible for supervising the housekeeping department and ensuring that all the items are there in the stock Walk-in Date/ Time: 1st March - 2nd March 2021, 9 AM onwards Venue Details- Zebronics India Private Limited No. 118 Ponnamallee High Road, Vepery, Chennai - 60084 Landmark: Opposite to Sudha Hotel Contact - Khushboo / Ashwini  ","location":"Chennai","experience":"0-3Years"},{"date":"27 - Feb - 2021","skills":"BPO Recruitment, Bulk Hiring","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Policybazaar Insurance Brokers Pvt. Limited, Policy Bazaar, Plot 110 Sector 44, Gurgaon, Haryana. Landmark: Near Ramada Hotel","phone":"Not Provided","profile":" HR Recruiter/ Executive \nPolicybazaar Insurance Brokers Pvt. Limited","description":"Candidate should be Any Graduate/ HR with minimum 1 year of experience in BPO Recruitment, Bulk Hiring. Must have excellent communication skills. What do we offer? Amazing work culture Complete Day shift 6 Days working Shift Timing - 10:00 AM to 07:00 PM Job Responsibilities- To achieve the target assigned within agreed quality & timelines. Independently manage recruitment for all positions across all verticals. Co-ordinate / liaison with placement consultants / institutions etc. Conducting skill testing & interviews Planning & Sourcing for specific recruitment within defined time frames Ensuring that documentation and salary fitment is as per agreed guidelines, to maintain Green status in compliance front Contribute to creating an organizational image, which would help in attracting and recruiting the best talent Seek to expand the talent pool by evaluating new employee profiles and assess their suitability Stakeholder management Walk-in Date/ Time: 27th February 2021, 11.00 AM - 4.00 PM Venue Details- Policybazaar Insurance Brokers Pvt. Limited Policy Bazaar, Plot 110 Sector 44, Gurgaon, Haryana Landmark: Near Ramada Hotel  ","location":"Gurgaon","experience":"1-3Years"},{"date":"27 - Feb - 2021","skills":"Demat Account Opening, Broking, Banking, Third Party Products","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"SBICAP Securities Limited, C/o Seva Sadan Branch, C.A. Road, Nagpur- 440 013.","phone":"Not Provided","profile":" Relationship Officer- Demat \nSBICAP Securities Limited","description":"We have job opening for Relationship Officer- Demat with SBICAP Securities Limited Candidate should be Any Graduate/ Post Graduate with 0 to 2 years of experience in Demat Account Opening, Broking, Banking, Third Party Products. Must have excellent communication skills. Freshers can also apply Job Responsibility- To source the business via allotted bank branches. Key focus areas Acquiring broking clients (primarily on line) Activating clients for trading post acquisition Greet and Re-direct customers to the appropriate counters based on their service needs Providing clients with Demo & handhold to initiate trading activities after account opening. Maintain a list of FAQ by customers and proactively seek clarification Promote Demat & Trading account. Selling of third party products. Walk-in Date/ Time: 27th February 2021, 10.30 AM - 3.30 PM Venue Details- SBICAP Securities Limited C/o Seva Sadan Branch, C.A. Road, Nagpur- 440 013. Contact - Nikhil Agarwal  ","location":"Nagpur","experience":"0-2Years"},{"date":"27 - Feb - 2021","skills":"Government Liaisoning, Real Estate Conveyance & Redevelopment","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Accord Selection Services, 402, 4th Floor, Centre Square, Opp. Bharat Petrol Pump, S.V. Road, Near Station, Andheri (West), Mumbai - 58","phone":"022-40144716","profile":" Liaisoning Assistant \nAccord Selection Services","description":"Candidate should be Any Graduate with 1 year experience as a Liaisoning Assistant Knowledge of Real Estate Conveyance & Redevelopment Must have good communication skills in English Knowledge of Marathi must Field Job - Visiting Govt. Offices Place of work- Andheri West - Near Station Salary- Rs. 12000 per month Candidates staying between Khar to Malad will be preferred Walk-in Date/ Time: 27th February 2021, 11.00 AM - 4.00 PM Venue Details- Accord Selection Services 402, 4th Floor, Centre Square, Opp. Bharat Petrol Pump, S.V. Road, Near Station, Andheri (West), Mumbai - 58 Tel no. : 40144716 / 26283616 / 26287682  ","location":"Mumbai","experience":"1-2Years"},{"date":"26 - Feb - 2021","skills":"Recruitment, Talent Acquisition, Talent Engagement, Mass Recruitment/ Hiring","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Symmetrical Global Search Private Limited, 69/ 375, VT Road, Mansarovar, Jaipur - 302 020","phone":"9928177444","profile":" Recruitment Executive \nSymmetrical Global Search Private Limited","description":"We have Urgent Opening for IT Recruiter/ Executive role for Jaipur Experience: 0 to 2 Years Working Day: 5 Days in a week Salary: Best in industry Candidate must have strong knowledge on End to End recruitment. Should have excellent communication skills. Preferable in IT/ ITE recruitment. MS office exposure required. Freshers can also apply. Walk-in Date/ Time: 26 February , 11.00 AM - 5.30 PM Venue Details- Symmetrical Global Search Private Limited 69/ 375, VT Road, Mansarovar, Jaipur - 302 020 Contact - Divya Sharma (M) +91 9928177444  ","location":"Jaipur","experience":"0-2Years"}]}