{"Walkins":[{"date":"16 - Mar - 2021","skills":"Automation Testing","qualification":"B.Sc, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Sun Technology Integrators Private Limited, No. 510, 5th Block,1st Stage HBR Layout (a stop ahead from Nagawara towards to K. R. Puram) Bangalore - 560043","phone":"Not Provided","profile":" Trainee Automation Tester \nSun Technology Integrators Pvt. Limited","description":"We have openings for Trainee Automation Tester position for Bangalore location. Please share your updated CV to nandinis@suntechnologies.com ASAP and Subject line should be Regarding Automation Testing drive interview. Note: Please attend the interview only if your candidature matches the below criteria's Kindly inform to your friends as well. Position: Trainee Automation Tester Work Experience: 0 to 6 Months F2F interview-Tuesday(16-3-2021) between 11:00AM to 1:00PM (Share your updated Cv to nandinis@suntechnologies.com ) (Please mention Referred by Nandini on top of your CV without fail) \u0095 B.E/ B.Tech/ M.E/ M.Tech/M.Sc (ECE/T elecommunication/CS/IS), BCA, MCA, MBA(IT) (2019 and 2020) We will strictly not consider Mechanical ,Electrical, Aeronautical and Civil branch freshers. Diploma candidates are not allowed. Only MALE candidates can attend the interview. Female candidates are not allowed. Year of passing:2019 and 2020 only. 55% or above marks in the recent degree . 2016/2017/2018 passed out freshers are not allowed. Must be able to join as soon as possible Testing related course/ certification/ training/ internship is mandatory. We will not consider who is still pursuing the course or under training on Testing. Kindly ignore this mail who are already attended the interview with Sun Technologies for automation Testing position. If attended for other openings can attend automation Testing position on Tuesday(16-3-2021) CTC:2.4 L/Annum Note: We will allow the candidates only those who meets the above criteria's.  ","location":"Bangalore","experience":"0-1Years"},{"date":"15, 16, 17, 18, 19 - Mar - 2021","skills":"US Insurance back office operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Polagoni Software Solutions Private Limited, #402, 4th Floor, Above Vijaya Diagnostic Center, Gurudwara Junction.","phone":"9573589307","profile":" Backend Process Associates \nPolagoni Software Solutions Pvt. Limited","description":"We are hiring Process Associates; Team Leads (US Insurance) - for our client IMash Technologies. Only Night Shifts. Immediate Requirement for Senior & Junior Process Associates and Team Leads. We are looking for the candidates who are experienced in any of the US Insurance back office processes mentioned here. Certificate of Issuance, Policy Checking, Policy Issuance, Policy Renewals, DBR, Quoting/Rating, Audits, Benefits, Claims Management, Doc Retrieval, Notice of Cancellations and Endorsements. Strong written and verbal communication skills. Work Location Visakhapatnam, Andhra Pradesh. Flexible in night shift. Salary not a constraint for the right candidate Minimum 1 Year of experience in US Insurance back office operations (Knowledge in multiple processes would be an added advantage) Candidate should be good in Excel Strong organizational skills. Good Attitude and High Aptitude Attention to detail. Collaborative and Team Player Experience on Quoting is highly preferred. Looking for immediate joinees without any notice period. Walk-in Date/ Time: 15th March - 19th March 2021, 6.00 PM - 8.00 PM Venue Details- Polagoni Software Solutions Private Limited #402, 4th Floor, Above Vijaya Diagnostic Center, Gurudwara Junction. Contact - Shan (9573589307) Walk-ins will be conducted daily (only Mon - Fri) from 6 PM IST - 11 PM IST You need to carry your resume and ID Proof.  ","location":"Visakhapatnam","experience":"1-5Years"},{"date":"15, 16, 17, 18, 19, 20, 21 - Mar - 2021","skills":"Technical Support, Desktop Support, Networking, Notebook Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Chamunda Tech-Net Services Pvt. Limited, 401 L Wing, Tex Center, Nr Narayan Plaza, Chandivali Andher (East), Mumbai.","phone":"022-2857821","profile":" Networking/ Support Engineer \nChamunda Tech-Net Services Pvt. Limited","description":"Candidate should be Any Graduate (Male Only) with 0 to 1 year experience in Technical Support, Desktop Support, Networking, Notebook Support. Must have excellent communication skills. Fresher Can Also Apply - It will be Field Job Job Responsibilities- Desktop Installation and Hardware Troubleshooting Office - Install, Email Configuration and Troubleshoot Windows Drivers Installation Printer Installation and Troubleshoot Basic LAN Troubleshooting Walk-in Date/ Time: 15th March - 21st March 2021, 10.30 AM - 5.30 PM Venue Details- Chamunda Tech-Net Services Pvt. Limited 401 L Wing, Tex Center, Nr Narayan Plaza, Chandivali Andher (East), Mumbai. Contact - Rupesh Patil (022-2857821)  ","location":"Mumbai","experience":"0-1Years"},{"date":"15, 16, 17, 18, 19, 20, 21 - Mar - 2021","skills":"Core Java, Spring/ Spring Boot, REST, Hibernate","qualification":"B.E./B.Tech, MCA/PGDCA","address":"DZ Fresh Foods Private Limited, 7th Floor, B Wing, BSEL Tech IT Park, Opp. Vashi Railway Station, Sector 30A, Vashi ,Navi Mumbai - 400 705.","phone":"8591309845","profile":" Senior Java Developer \nDZ Fresh Foods Private Limited","description":"Candidate must have proven hands-on Software Development experience Proven working experience in Java development Hands on experience in designing and developing applications using Java EE platforms Object Oriented analysis and design using common design patterns. Profound insight of Java and JEE internals (Class loading, Memory Management, Transaction management etc.) Excellent knowledge of Relational Databases, SQL and ORM technologies (JPA2, Hibernate) Experience in the Spring Framework Experience as a Sun Certified Java Developer Experience in developing web applications using Spring MVC Experience with test-driven development Mandatory Skills: Core Java, Spring/ Spring Boot, REST, Hibernate Work Experience: 3 to 7 Years Location: Vashi (Navi Mumbai) Walk-in Date/ Time: 15th to 21st March 2021, 9.30 AM - 6.00 PM Venue Details- DZ Fresh Foods Private Limited 7th Floor, B Wing, BSEL Tech IT Park, Opp. Vashi Railway Station, Sector 30A, Vashi ,Navi Mumbai - 400 705. Contact - Prachi ( 8591309845 )  ","location":"Mumbai","experience":"3-7Years"},{"date":"15, 16, 17, 18, 19, 20, 21 - Mar - 2021","skills":"Asp .Net, MVC, C#, .Net, JQuery, SQL Server","qualification":"B.E./B.Tech, B.Sc, BCA/BCS","address":"Ray Business Technologies Private Limited, Plot No. 204, Block - B, Kavuri Hills, Madhapur, Hyderabad, Telangana \u0096 500 033.","phone":"8309210157","profile":" Associate Software Engineer \nRay Business Technologies Private Limited","description":"Qualification: B.Tech (CSE/ IT)/ BSc (Maths/ Stats) Eligibility Criteria: 2019, 2020, - 60% and above Key Skills: Strong knowledge in Asp .Net, MVC, C#, .Net, JQuery, SQL Server. Good Analytical and logical skills. Knowledge of software development best practices, particularly for design, coding, and testing. Must be a team player, possess a good attitude & be self-disciplined. Must have a excellent written & verbal skills. Good communication skills. No. of open positions: 20 Job Location: Hyderabad Mode of Interview Written Test 2 Technical rounds( Virtual Interviews) HR Round Walk-in Date/ Time: 15th March - 21st March 2021, 10.00 AM - 2.00 PM Venue Details- Ray Business Technologies Private Limited Plot No. 204, Block - B, Kavuri Hills, Madhapur, Hyderabad, Telangana \u0096 500 033. Contact - Elizabeth Arland (8309210157)  ","location":"Hyderabad","experience":"0-1Years"},{"date":"15, 16 - Mar - 2021","skills":"JAVA, Python, Node JS, C++ ,C#, .Net","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Soft Suave Technologies Private Limited, 100, Lake View Estate, 3rd floor, Kundrathur Main Road, M. S. Nagar, Next to Rajan Tiles Building, Porur, Chennai, Tamilnadu - 600 116.","phone":"Not Provided","profile":" Software Engineer Trainee \nSoft Suave Technologies Private Limited","description":"Candidate should have Good knowledge in JAVA, Python, Node JS, C++ ,C#, .Net with Logical and analytical thinking towards the programming Eligibility: BE/ B.Tech/ ME/ M.Tech/ MCA - 2018, 2019, 2020 Passed outs only. Only male candidates can apply Immediate Joiners required Job Responsibility: Execute full software development life cycle (SDLC) Code, test and troubleshoot programs utilizing the appropriate framework, database, and programming technology. Write quality and clean code using prescribed specifications. Analyze performance of programs and take action to correct deficiencies . Rounds of Interview: Level 1: Walk-in directly to Company - MCQ Level 1 Level 2 & 3: Online Programming Test Level 4: Technical Interview Walk-in Date/ Time: 15th March - 16th March , 10.30 AM - 1.30 PM Venue Details- Soft Suave Technologies Private Limited 100, Lake View Estate, 3rd floor, Kundrathur Main Road, M. S. Nagar, Next to Rajan Tiles Building, Porur, Chennai, Tamilnadu - 600 116. Contact - Abirami Rajalingam, Jayasudha  ","location":"Chennai","experience":"0-2Years"},{"date":"15, 16, 17, 18, 19, 20, 22, 23, 24 - Mar - 2021","skills":"Technical Support, IT Helpdesk/ Service Desk, System Administration","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS, Diploma","address":"Inspirisys Solutions Limited, G2 Vimalnath Complex, High Tension Cross Road, Shubhanpura, Vadodara, Gujrat","phone":"9998224867","profile":" Technical Support Engineer \nInspirisys Solutions Limited","description":"Candidate should be Any Graduate (BE/ B.Tech/ BCA/ MCA/ Diploma/ BA/ BCOM) with 2 to 3 years of experience into IT Desktop or Technical Support side. Should have good knowledge of computer hardware and software. Hands on experience in troubleshoot desktop and laptop problems. OS installation, change and repair computer hardware and other parts. Computer Hardware and Networking Knowledge. Outlook and mail configuration , Software installations Etc. Resolve LAN and network connectivity issues. Basic knowledge on printer connectivity and installation. Remote support and video conferencing Etc. Walk-in Interview from 15th March - 24 March , 9.30 AM - 5.30 PM at the below mentioned address- Inspirisys Solutions Limited, G2 Vimalnath Complex, High Tension Cross Road, Shubhanpura, Vadodara, Gujrat Contact - Manish Barot (9998224867)  ","location":"Vadodara","experience":"1-3Years"},{"date":"15, 16, 17, 18, 19, 20, 22, 23, 24 - Mar - 2021","skills":"Technical Support, IT Helpdesk/ Service Desk, Non Voice Process","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Wings International Group, D.No. 60-20-4, 1st floor, Twinkle Residency, Back side lane of Heritage Building, Sunnapubattila Centre, Vijayawada - 520008.","phone":"9989243344","profile":" Technical Support Engineer \nWings International Group","description":"Educational Qualification : B.Tech/ MCA/ BCA/ B.Sc.-IT 2018, 2019, 2020, 2021 with 60% in all academics. Job Location : Bangalore, Chennai Rotational Shift Ready to Relocate Package : 2.20 Lakhs P.A. Note : Communication Should be Good. Walk-in Interview from 15th March - 24 March, between 10.30 AM - 5.30 PM at the below mentioned address- Wings International Group, D.No. 60-20-4, 1st floor, Twinkle Residency, Back side lane of Heritage Building, Sunnapubattila Centre, Vijayawada - 520008. Contact - Suman Chandra For details contact : 9032233456, 9989243344 Mail your resumes to cmd@wingsinternational.in  ","location":"Vijayawada","experience":"2-9Years"},{"date":"13 - Mar - 2021","skills":"In Recruitment Process, Job Posting, Mass Mailing, Bulk Email","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Globex Digital Solutions Private Limited Plot No. 7-1-621/16 Lakshmi Sadan Building, 4th Floor, SR Nagar Hyderabad. Opposite Almas Restaurant, First Right-Side Lane Next to Rajeshwari Ladies Hostel","phone":"Not Provided","profile":" IT Recruiter/ Executive \nGlobex Digital Solutions Private Limited","description":"Educational Qualification: Any Graduation Work Experience: 2+ Years Location: SR Nagar, Hyderabad Working Days: 6 Days with Alternative week off (1st and 3rd Saturday Week off) Requirements: Excellent Communication Skills. Having In depth Understanding In Recruitment Process Good in Job Posting Scripting Including Mass Mailing, Bulk Email Maintaining a Good Communication with candidates form initial level to final level Preferred: Good analyzing in understanding Technical Requirement who are from non IT Background (B.Com, B.Sc) Notice Period : Immediate - 15 Days Walk-in Date/ Time: 13th March 2021, 10.00 AM - 5.30 PM Venue Details- Globex Digital Solutions Private Limited Plot No. 7-1-621/16 Lakshmi Sadan Building, 4th Floor, SR Nagar Hyderabad Opposite Almas Restaurant, First Right-Side Lane Next to Rajeshwari Ladies Hostel  ","location":"Hyderabad","experience":"2-3Years"},{"date":"13 - Mar - 2021","skills":"General Administration, Customer Service, Calling, Data Verification","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"BANKSHALL STREET 2 FAIRLY PLACE BBD BAG KOLKATA - 700 001","phone":"7044833096","profile":" Back Office Executive \nKrishna Finance Company Private Limited","description":"Candidate should be Any Graduate with 0 to 1 year experience in Back Office Operations, General Administration, Customer Service, Calling, Data Verification. Must have excellent communication skills. Walk-in Date/ Time: 13th March 2021, 9.30 AM - 11.00 AM VENUE- BANKSHALL STREET 2 FAIRLY PLACE BBD BAG KOLKATA - 700 001 Contact - BIPASA (7044833096)  ","location":"Kolkata","experience":"0-1Years"},{"date":"13 - Mar - 2021","skills":"HR/ Recruitment, Vendo/ Vendor Management, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Insta Kart Private Limited, 1st phase,Yelahanka New Town, Yelahanka, Bangalore Karnataka - 560 064","phone":"9620078780","profile":" Talent Acquisition Executive \nFlipkart Internet Private Limited","description":"Candidate should be Any Graduate with good recruitment background. Minimum 3 to 5 years mandatory experience in recruiting profile Should be from Bangalore and have good knowledge on local geography. Kannada speaking is mandatory. Roles & Responsibilities- Source, solicit and screen candidates for contract roles Specialized in hiring Delivery executive for last mile logistics. Should be specialized in Hiring bulk numbers Leverage various recruiting resources Should be flexible and ready to work on field during critical times Target oriented Training coordination, vendor coordination, vendor management, Releasing offer letters. Retention Walk-in Date/ Time: 13th March 2021, 9.30 AM - 8.00 PM Venue Details- Insta Kart Private Limited 1st Phase,Yelahanka New Town, Yelahanka, Bangalore Karnataka - 560 064 Perks and Benefits AS per the company standards or basis current package. PLEASE CALL ON 9620078780  ","location":"Bangalore","experience":"3-5Years"},{"date":"13 - Mar - 2021","skills":"HR/ Recruitment, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Medall Healthcare Private Limited, No.67,2nd Floor, TNPL Building, Anna Salai, Guindy, Chennai, Tamilnadu","phone":"Not Provided","profile":" HR Trainee Executive - Fresher \nMedall Healthcare Private Limited","description":"Candidate should have Any Degree in Business/ Human Resource Management/ Psychology or any other related field with strong interpersonal and listening skills. First practical experience advantageous. Ability to communicate effectively with people throughout the organization Motivation to constantly learn and develop the own knowledge and skills Self-assured manner, also towards people in rather high positions. Walk-in Date/ Time: 13th March 2021, 10.00 AM - 5.00 PM Venue Details- Medall Healthcare Private Limited No.67,2nd Floor, TNPL Building, Anna Salai, Guindy, Chennai, Tamilnadu Contact Person- Satheesh  ","location":"Chennai","experience":"0-1Years"},{"date":"12, 13, 14, 15, 16, 17, 18, 19, 20, 21 - Mar - 2021","skills":"Office Management, Back Office Support, Office Coordination, Vendor Relationship Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Rubixe (Think Ahead Innovations Pvt. Limited) 3rd Floor, No C-25, Bajrang House, 7th Mile, Kudlu Gate, Garvebhavi Palya, Bengaluru, Karnataka - 560 068.","phone":"6366422964","profile":" Office Coordinator \nRubixe (Think Ahead Innovations Pvt. Limited)","description":"An Associates/ College Degree; BSc/ BA in Business Administration or relevant field is a plus Must have proven experience as office coordinator or in a similar role Experience in customer service will be a plus Knowledge of basic bookkeeping principles and office management systems and procedures Outstanding knowledge of MS Office, back-office, and accounting software Working knowledge of office equipment (e.g. optical scanner) Excellent communication and interpersonal skills Organized with the ability to prioritize and multi-task Reliable with patience and professionalism Job Responsibilities: Follow office workflow procedures to ensure maximum efficiency Maintain files and records with effective filing systems Support other teams with various administrative tasks (redirecting calls, disseminating correspondence, scheduling meetings, etc.) Greet and assist visitors when they arrive at the office Monitor office expenditures and handle all office contracts (rent, service, etc.) Perform basic bookkeeping activities and update the accounting system Deal with customer complaints or issues Monitor office supplies inventory and place orders Assist in vendor relationship management Walk-in Date/ Time: 12th March - 21st March 2021, 9.30 AM - 5.30 PM Venue Details- Rubixe (Think Ahead Innovations Pvt. Limited) 3rd Floor, No C-25, Bajrang House, 7th Mile, Kudlu Gate, Garvebhavi Palya, Bengaluru, Karnataka - 560 068. Contact - Dhivya Palani (6366422964)  ","location":"Bangalore","experience":"0-2Years"},{"date":"10, 11, 12, 13, 15, 16, 17, 18 - Mar - 2021","skills":"Manual Testing, QA Fresher","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Lifeline Systech Solutions Private Limited, Level 3 Mrugank Building Rajpath Maharashtra, Paud Road, Shikshaknagar, Ramkrishna Paramhans Nagar, Kothrud, Pune - 411 038.","phone":"8554983314","profile":" Software Testing Engineer \nLifeline Systech Solutions Private Limited","description":"Candidate should have Strong Troubleshooting skills for reaching to root cause of customer reported issues. Should perform, re-testing, Regression testing. Basic Knowledge in database. Excellent verbal and written communication skills, and able to communicate very technical subject matter to non-technical users. Experience using industry standard Automation Tools Coded UI, Selenium Webdriver, AutoIT, and used C# as scripting language will be a Plus. Experience in integration and Performance testing using any Automated Tool will be a plus. Roles and Responsibilities- Interprets product design and requirements to engineer test approach and generates test plans and test cases. Executes complex test cases/ scripts and interprets/ analyzes results to report, communicate, and work through issues with software engineers. Active participation in testing cycle of the software development lifecycle (requirements gathering, prototyping, design review, test case reviews, Manual testing) using Agile Methodology. Working closely with Product Management, Development Team and Support teams to create and deliver a quality-focused QA deliverables. Develop functional, integration and E2E test cases to validate business, system and operational requirements.Work closely with different functional groups to resolve issues, ensure thorough testing from a business perspective, understand support issues and release high quality products to customers. Walk-in Date/ Time: 10th March - 18th March , 9.30 AM - 5.30 PM Venue Details- Lifeline Systech Solutions Private Limited Level 3 Mrugank Building Rajpath Maharashtra, Paud Road, Shikshaknagar, Ramkrishna Paramhans Nagar, Kothrud, Pune, Maharashtra - 411 038. Contact - Nikita ( 8554983314 )  ","location":"Pune","experience":"1-4Years"},{"date":"11, 12 - Mar - 2021","skills":"Back Office Operations, Data Entry, MIS Reporting, Team Operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"BIANCA HOME LLP, 915, Hubtown Solaris, N. S. Phadke Road Opposite.Telli Galli, Near Andheri Flyover, Andheri East, Mumbai - 400 069.","phone":"Not Provided","profile":" Back Office/ MIS Executive \nBianca Home LLP","description":"Candidate should be Any Graduate with good knowledge of Advance Excel Must have excellent communication skills. Preparation of MIS Reports Data Entries in the software/ Excel Ensure timely delivery of all orders Coordination with the vendors, warehouse team & operations team. Walk-in Date- 11th & 12th March 2021 Time- 11:00 am to 5:00 pm Venue Details- BIANCA HOME LLP, 915, Hubtown Solaris, N. S. Phadke Road Opposite.Telli Galli, Near Andheri Flyover, Andheri East, Mumbai - 400 069. Contact Person- Sameer Babar  ","location":"Mumbai","experience":"2-5Years"},{"date":"11 - Mar - 2021","skills":"Customer Relationship, Concept Selling, Sales Presentations, Customer Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Mahindra Holidays & Resorts India Limited, 1st Floor, Shikhar Tower, Plot No-323, Mangal Pandey Nagar, Meerut - 250004","phone":"9005364444","profile":" Relationship Manager \nMahindra Holidays & Resorts India Pvt. Limited","description":"Candidate should be Any Graduate with excellent communication skills Must have strong Results Orientation and Execution Excellence Strong Sales Experience High Energy and Passion High Customer Centricity High Perks & Incentives Vehicle is mandatory Job Purpose: To make powerful and successful sales presentations in different settings; to keep abreast with the organization's products and services; to crack profitable deals and referrals to achieve sales targets Job Responsibilities: Achieving stretched targets in a result-focused environment Preparing pre-sales proposals for prospective clients Delivering inspiring sales presentations to convert prospects to successful sales Handling objections and resolving member/ customer conflicts by constantly connecting with them through member meetings. Provide necessary support in booking first time holiday for new members and generate quality referrals from them. Provide necessary support in booking first time holiday for new members and generate quality referrals from them Identifying potential customers and new business opportunities Building and maintaining strong client relationship and high level of customer service Being updated on new products and services Walk-in Date/ Time: 11th March 2021, 10.30 AM - 3.00 PM Venue Details- Mahindra Holidays & Resorts India Limited, 1st Floor, Shikhar Tower, Plot No-323, Mangal Pandey Nagar, Meerut - 250004 Contact Person - Manish (9005364444) Interested Candidates can attend walk ins or share resumes on Manish.bajpai@mahindraholidays.com  ","location":"Meerut","experience":"3-7Years"},{"date":"10 - Mar - 2021","skills":"HR/ Recruitment, Talent Acquisition, End to end Recruitment","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Spectrum Talent Management Pvt. Limited, C-142, Sector -63, Noida","phone":"8929574268","profile":" HR Recruiter/ Freshers \nSpectrum Talent Management Pvt. Limited","description":"We are conducting WALK IN INTERVIEWS for FRESHERS. Below are the details : Company Name: Spectrum Talent Management Designation: HR Recruiter/ Management Trainee Good communication skills required Should be available for immediate joining and open for work from office Role & Responsibility- End to end Recruitment Screening resumes Shortlisting candidates basis the requirement Interview scheduling for clients Follow-ups & coordination with candidates till the joining. Achieve Targets Walk-in Date/ Time: 10th March 2021, 11.00 AM - 2.00 PM Venue Details- Spectrum Talent Management Pvt. Limited C-142, Sector -63, Noida Contact - Jasleen Kaur (8929574268)  ","location":"Noida","experience":"0-1Years"},{"date":"10 - Mar - 2021","skills":"Warehouse operations, Courier operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"DTDC Express Limited, No B14, Thiruvika Industrial Estate, Guindy, Chennai - 600 032.","phone":"Not Provided","profile":" Operation Executive \nDTDC Express Limited","description":"Candidate should be Graduated from a reputed University with 2+ years of experience in Warehouse operations, Courier operations. Must have good communication and mail drafting skills. Job Location: Ekkattuthangal Salary: Upto 18k gross Roles & Responsibilities- Planning of day to day dispatch activities with respect to the respective department. Good communication Skills & Knowledge in Warehouse Operations Looking out for Quick Joiners those can join ASAP Ability to manage high-volume environments E.g. Big Billion Day Sales Walk-in Date/ Time: 10th March 2021, 10.00 AM - 2.00 PM Venue Details- DTDC Express Limited No B14, Thiruvika Indstl Estate, Guindy , Chennai - 600 032. Contact Person- Viji  ","location":"Chennai","experience":"2-4Years"},{"date":"8, 9, 10, 11, 12, 13, 15, 16, 17 - Mar - 2021","skills":"Software Testing, Manual Testing, Implementation, Technical Support","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Suvarna Technosoft Private Limited, Plot No. 8, Durga Nagar, Ameerpet, Hyderabad, Telangana - 500 016.","phone":"7569739410","profile":" Software Testing/ Support Engineer \nSuvarna Technosoft Private Limited","description":"Candidate should be BE/ B.Tech/ BCA/ MCA Fresher or with 0 to 1 year experience in Software Testing, Manual Testing, Implementation and Technical Support. Must have excellent communication skills. Walk-in Date: 8th - 17th March 2021 Timings: 10.30 AM - 5.30 PM Venue Details- Suvarna Technosoft Private Limited Plot No. 8, Durga Nagar, Ameerpet, Hyderabad, Telangana - 500 016. Contact Person- Susmitha Tel- 7569739410  ","location":"Hyderabad","experience":"0-1Years"},{"date":"8, 9, 10, 11, 12, 13, 15, 16, 17 - Mar - 2021","skills":"Blended Process, Email Support, Customer Support, Chat Process/ Email Writing","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Tech Mahindra Limited, 2nd Floor Delta One Giga Space IT Park Internal Road, Viman Nagar Pune, Maharashtra - 411 014.","phone":"9096561522","profile":" Email Support Executive \nTech Mahindra Limited","description":"Candidate must have proven customer support experience or experience as a client service representative Should have excellent English communications skills Ability to listen and active problem solving skills Must have good interpersonal skills Ability to handle pressure Ability to multi-task, prioritize, and manage time effectively Duties & Responsibilities- The primary responsibilities of a Customer Service specialist would be: Handling escalations and complex queries. Manage large amounts of emails & chats Answer calls professionally to provide information about products and services, take/ or obtain details of complaints. Identify and assess customers needs to achieve satisfaction Build sustainable relationships and trust with customer accounts through open and interactive communication Walk-in- 8th - 17th March 2021 (Monday to Saturday) Time - 11am - 4pm Address - Tech Mahindra Limited 2nd Floor Delta One Giga Space IT Park Internal Road, Viman Nagar Pune, Maharashtra - 411 014. Contact Shabana Mulla - +91 9096561522 (Call/ WhatsApp) Mention 'Shabana' on top of the resume Email ID- SM00719332@techmahindra.com  ","location":"Pune","experience":"1-5Years"},{"date":"8, 9, 10, 11, 12, 13, 15 - Mar - 2021","skills":"IT Recruitment, MIS/ Back Office","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Disha HR Services Private Limited, Bldg No. 5, Flat No. 004, Varad Vinayak Society, Sambhaji Nagar, Sahar Road, Andheri East, Mumbai - 400 069.","phone":"9920589123","profile":" HR Executive/ Recruiter \nDisha HR Services Private Limited","description":"Candidate should be Any Graduate with 0 to 2 Years experience having expertise in Recruitments and should posses excellent communications Skills. Preferring Candidates from Western Suburbs. Freshers with Exceptional Skills and Desire to Make Career in HR are welcomed. Must have expertise in Recruitments Should posses excellent communications Skills Candidates Staying within Andheri and VileParle are Preferred Walk-in Date/ Time: 8th March - 15th March 2021, 11 AM onwards Venue Details- Disha HR Services Private Limited, Bldg No. 5, Flat No. 004, Varad Vinayak Society, Sambhaji Nagar, Sahar Road, Andheri East, Mumbai - 400 069. LandMark:- Near HDIL Tower, Opposite DMart Contact - Mahendra (9920589123)  ","location":"Mumbai","experience":"0-2Years"},{"date":"8, 9, 10, 11, 12, 13, 15 - Mar - 2021","skills":"Customer Support/ Customer Care/ E-commerce/ Voice Process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Teleperformance (Intelenet Global Services Pvt. Limited) DSR Techno Cube, Kundanahalli Gate, Varthur Road, 3rd floor, Next to SKR Kalyan Mandap, Bengaluru - 560 037.","phone":"6363739626","profile":" Customer Support Executive \nIntelenet Global Services Private Limited","description":"Teleperformance (Intelenet Global Services Private Limited) is hiring for 'Customer Support Executive' for one of its leading Ecommerce client in Bangalore. Prerequisites : Any Graduation Experience: minimum 1 year in call center Necessary Skills: Excellent English & Hindi fluency Nature of the job: You will be given an opportunity to interact and resolve the queries of the customers of a leading Ecommerce client Should be flexible with shifts Provide world class Customer Service End to end transaction of reports CTC - 2.75 LPA Interested candidates can directly walk-in to the given address below: Walk-in Date/ Time: 8th to 15th March 2021, 10.00 AM - 3.00 PM Venue Details- Teleperformance (Intelenet Global Services Pvt. Limited) DSR Techno Cube, Kundanahalli Gate, Varthur Road, 3rd floor, Next to SKR Kalyan Mandap, Bengaluru - 560 037. Contact Person- Shilpa (6363739626)  ","location":"Bangalore","experience":"1-5Years"},{"date":"6 - Mar - 2021","skills":".Net, C# and/ or ASP .Net, Azure, MVC, REST API, JSON, HTML, CSS, JavaScript, MS SQL/ SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Zee Entertainment Enterprises Limited, Engro,4th Floor, Western Aqua, White Fields (Tech Mahindra Lane), Hitech City Hyderabad \u0096 81.","phone":"Not Provided","profile":" .Net Developers \nZee Entertainment Enterprises Limited","description":"Candidate must have strong working knowledge of .Net and Proficient in {C# and/ or ASP .Net}, with a good knowledge of their ecosystems. Knowledge on Azure, MVC, REST API, JSON and knowledge on Hangfire and Autofac (optional) Knowledge on Redis and Solr HTML, CSS, JavaScript Strong understanding of object-oriented programming Skill for writing reusable libraries Experience with MS SQL/ SQL Server and MongoDB (optional) Experience with popular web application frameworks Familiarity with Windows Presentation Framework (optional) Knack for writing clean, readable, and easily maintainable code Understanding of fundamental design principles for building a scalable application Experience creating database schemas that represent and support business processes Basic understanding of Common Language Runtime (CLR), its limitations, weaknesses, and workarounds Experience implementing automated testing platforms and unit tests Knowledge on code versioning tools. Candidates with Immediate - 15 Days notice are preferred. No Work From Home Interested candidate can directly walk-in for a Face to Face interview on 6th March 2021, between 9.30 AM - 3.00 PM at the below mentioned address- Zee Entertainment Enterprises Limited Engro,4th Floor, Western Aqua, White Fields (Tech Mahindra Lane), Hitech City Hyderabad \u0096 81. Google Maps Location: https://goo.gl/maps/sQxKxLYxrSghbvx46 Contact - Heena ( 9121284559 ) Phone: 040- 42426128  ","location":"Hyderabad","experience":"0-3Years"},{"date":"8, 9, 10, 11, 12, 13, 14 - Mar - 2021","skills":"Technical Support, Software Support, IT Hepdesk","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Manabh Software, 106, First Floor, Olympia, Mumbai Bangalore Highway, Near Supreme HQ, Baner, Pune - 411 021.","phone":"Not Provided","profile":" Technical Support Engineer \nManabh Software","description":"Candidate should be BE/ B.Tech/ M.Tech or MCA with 0 to 1 year experience in Technical Support, Software Support Must have excellent communication skills. Roles and Responsibilities : SQL & MS Access Database query handling. ERP Product questioner & Handling Address Technical Query of client To forward the core problem of software to the development team. Researching and identifying solutions to software issues Diagnosing technical issues of ERP product & report same to Development team Properly escalating unresolved issues to appropriate internal teams Referring to internal database or external resources to provide accurate tech solutions Walk-in Date/ Time: 8th - 14th March 2021, 10.30 AM - 4.30 PM Venue Details- Manabh Software, 106, First Floor, Olympia, Mumbai Bangalore Highway, Near Supreme HQ, Baner, Pune - 411 021. Note: Please carry your passport size photo.  ","location":"Pune","experience":"0-1Years"},{"date":"6 - Mar - 2021","skills":"Software testing (Manual and Automation), Java programming and SQL/ Database","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Zee Entertainment Enterprises Limited, Engro,4th Floor, Western Aqua, White Fields (Tech Mahindra Lane), Hitech City Hyderabad \u0096 81.","phone":"040-42426128","profile":" Software Testing Engineer \nZee Entertainment Enterprises Limited","description":"Candidate must be well trained in Software testing (Manual and Automation) Should have good knowledge in Java programming and SQL/ Database Must be Good Team player and time-management skills Great interpersonal and communication skills Develop test cases and prioritize testing activities. Inform the test lead about what all resources will be required for software testing. Execute all the test cases and report defects, define severity and priority for each defect. Work Experience: 0 to 2 Years Interested candidates can directly walk-in for a Face to Face interview on 6th March 2021, between 9.30 AM - 3.00 PM at the below mentioned address- Zee Entertainment Enterprises Limited Engro,4th Floor, Western Aqua, White Fields (Tech Mahindra Lane), Hitech City Hyderabad \u0096 81. Google Maps Location: https://goo.gl/maps/sQxKxLYxrSghbvx46 Contact - Heena ( 9121284559 ) Phone: 040-42426128  ","location":"Hyderabad","experience":"0-2Years"},{"date":"8, 9, 10, 11, 12 - Mar - 2021","skills":"Customer Relationship, Supply Chain Management, Logistic/ Warehouse Management, Client Satisfaction","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"YCH Logistics (India) Private Limited, Plot No. D VI, SIPCOT HI-TECH SEZ, Phase II,Srimangadu Village, Sriperambudur Taluk, Kancheepuram District, Tamilnadu \u0096 602 105","phone":"9944214256","profile":" Logistics Operation/ Assistant Manager \nYCH Logistics (India) Private Limited","description":"Educational Qualification: Any Graduate/ Post Graduate Minimum Experience (6 - 12 Years or more) Experience in Handling Electronic based Customers like mobiles, Laptop etc Good in Hindi (Must) Good rapport building with the Customers Customer Handling Excellent Communication Skills Salary Based on the Previous Experience & Interview Performance Walk-in Date- Date : 8th - 12th March 2021 Time: 10:00 AM - 4:00 PM Venue Details- YCH Logistics (India) Private Limited Plot No. D VI, SIPCOT HI-TECH SEZ, Phase II,Srimangadu Village, Sriperambudur Taluk, Kancheepuram District, Tamilnadu \u0096 602 105 Contact Person- Gladson S (9944214256)  ","location":"Chennai","experience":"6-12Years"},{"date":"5, 6, 7, 8, 9, 10, 11, 12 - Mar - 2021","skills":"Team Handling, MIS Preparation, MIS Operations/ Formulas","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Tech Mahindra Limited, Shardha Centre, Kothrud, Near Null Stop, Pune. Opposite of Persistent Company.","phone":"9168637999","profile":" MIS/ Support Executive \nTech Mahindra Limited","description":"Tech Mahindra Limited is hiring Lead MIS Executive (BPO Background Preferred) at Pune Kothrud location Eligibility Criteria: Educational Qualification: Any Graduate Experience should be 1 to 2 years in MIS executive profile Should have Good English Communication Skills. Candidate should from BPO background Salary: 2 Lac PA to 3.5 Lac PA Job Location: Pune Duties & Responsibilities: Handling database management by using Advanced Excel tools. Should be proficient with Advanced Excel Formulas such as, Pivot Table, Lookups, Conditional formatting, count IF, Sum IF. Good analytical skills for MIS, number crunching & reporting to internal & external customers. Ensure accuracy and timeliness of reports sent. Organization skills, with an ability to stay focused on assigned tasks. Team Handling Looking for Immediate joiner* Walk-in Date/ Time: 5th - 12th March 2021, 9.30 AM - 5.30 PM Venue Details- Tech Mahindra Limited Shardha Centre, Kothrud, Near Null Stop, Opposite of Persistent Company Contact Person Mayuresh J (mj00642401@techmahindra.com) No - +91 9168637999 (Call/ WhatsApp )  ","location":"Pune","experience":"1-5Years"},{"date":"5, 6, 7, 8, 9, 10, 11, 12, 13, 14 - Mar - 2021","skills":"Java, J2EE, Spring MVC, IOC, Hibernate/ JPA, JSP, HTML5, Web-Service, JSON","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Arraign Technologies Private Limited, #22, Gopalan Company Works, 5th Floor, Gopalan Innovation Mall, Banerghatta Road, JP Nagar 3rd Phase, Bangalore.","phone":"8688325293","profile":" Junior Java Developer \nArraign Technologies Private Limited","description":"Candidate must have extensive experience with web applications using Java, J2EE, Spring MVC, IOC, Hibernate/ JPA, JSP, HTML5, Web-Service, JSON, JavaScript, AJAX, Angular-JS, Windows/ Linux, XML, JSON, Framework, database, and OOP Concept. Should have experience in the Spring Framework. Experience in developing web applications using at least one popular web framework (JSF, Wicket, GWT, and Spring MVC) Proven hands-on Software Development experience Profound insight of Java and J2EE internals. Good Experience in JSP, AJAX using Spring MVC, JSON, and JQuery. Experience in Databases like SQL, MySQL, Maria DB, Maria DB, and Oracle Should be aware of SDLC cycle Good Communication skills and self-motivated Good analytical and problem solving skills Should have good debugging skills Expertise in developing object-oriented software with a strong background in Java development. Expert knowledge of object-oriented programming, Architecture and Design Patterns. Strong development and debugging experience with Java/ J2EE technologies, including Spring (Spring Framework and Spring Boot), Hibernate, Web Application/Web Services with JBoss & WebSphere, Restful Webservices, etc. Experience troubleshooting technologically challenging customer issues. Able to use advanced debugging techniques including analysis of heap/ thread dump files, tracing, and performance tuning and monitoring Walk-in Interview from 5th March - 14th March , 11.00 AM - 5.30 PM at the below address- Arraign Technologies Private Limited #22, Gopalan Company Works, 5th Floor, Gopalan Innovation Mall, Banerghatta Road, JP Nagar 3rd Phase, Bangalore. Contact - Sarat Chandra (8688325293)  ","location":"Bangalore","experience":"2-4Years"},{"date":"6 - Mar - 2021","skills":"Core Java, Spring, Mvc, Spring Boot, Angular JS","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Dream Tekis Software Private Limited, Plot No 411, #302, Sri Nivasam, Mathrusri Nagar, Miyapur, Hyderabad, Telangana - 500 081.","phone":"Not Provided","profile":" Java Developers \nDream Tekis Software Private Limited","description":"Candidate should have good knowledge in below mentioned skills sets: Core Java Spring boot Spring MVC Spring data JPA Sound knowledge in Angular. Ability to work in team environment Roles and Responsibilities- Contribute in all phases of the development lifecycle Write well designed, testable, efficient code Ensure designs are in compliance with specifications Prepare and produce releases of software components Support continuous improvement by investigating alternatives and technologies and presenting these for architectural review Walk-in Date/ Time: 6th March 2021, 9.30 AM - 5.30 PM Venue Details- Dream Tekis Software Private Limited Plot No 411, #302, Sri Nivasam, Mathrusri Nagar, Miyapur, Hyderabad, Telangana - 500 081.  ","location":"Hyderabad","experience":"0-1Years"},{"date":"4 - Mar - 2021","skills":"Python and Java","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Future Focus Infotech Private Limited, Opp F&F Mart chikoti Gardens Beside SBI BANK lane Opposite To Shoppers Stop road Begumpet - 500016.","phone":"Not Provided","profile":" Python and Java Developers \nFuture Focus Infotech Private Limited","description":"Hiring for a Level 3 Company with offices in Hyderabad/India, US, UK and Dubai. Freshers openings Job Role: Candidate should have Bachelor's degree in (B.Tech with CSC, IT, ECE,2019 or before and M.Tech MCA with 2020 or before with Good Communication skills and Technical Skills. Should be ready to relocate across PAN India. Interview process Technical Round code test Manager round Ready To sign bond with company Salary First 10 months in training 10,000 will be provided after internship 11 month salary will be increased to 15000 to 2000 Note: Need to Register with registration fee 250/- Interested candidates can contact 7075761864 Walk-in Date/ Time: 4th March 2021, 8.00 AM - 1.00 PM Venue Details- Future Focus Infotech Private Limited Opp F&F Mart chikoti Gardens Beside SBI BANK lane Opposite To Shoppers Stop road Begumpet - 500016. Contact - Heena ( 7569210167 )  ","location":"Hyderabad","experience":"0-1Years"},{"date":"4, 5, 6, 7, 8, 9, 10, 11 - Mar - 2021","skills":"TPA, Claim Coordination, Medical Insurance Claims Processig","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"4/112, Mount Poonamalle High Road Manapakkam, Mount Poonamalle High Rd, Sathya Nagar, Manapakkam, Chennai, Tamil Nadu - 600089","phone":"7299068401","profile":" Insurance Coordinator \nMIOT Hospitals Private Limited","description":"Candidate should be Any Graduate with 1 to 3 years of experience in Hospital insurance Must have Pleasant Personality with good communication skills. Should have good knowledge about TPA Must have handled Insurance Pre Authorise and final billing enhancement Preparing daily report Daily patient visit Walk-in Date/ Time: 1st March - 11th March , 10 AM onwards Venue Details- 4/112, Mount Poonamalle High Road Manapakkam, Mount Poonamalle High Rd, Sathya Nagar, Manapakkam, Chennai, Tamil Nadu - 600089 Contact - Divya ( 7299068401 )  ","location":"Chennai","experience":"1-4Years"},{"date":"4, 5, 6, 7, 8, 9, 10, 11 - Mar - 2021","skills":"Banking Data Entry Work, Banking Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Cameo Corporate Service Limited, No. 1, Subramanian Buliding, 5th Floor, Club House Road, Anna Salai, Chennai. Landmark:- Near Spencer Plaza, Opp. building to Senthur Hotel, Bank of Baroda Bank.","phone":"8056501264","profile":" Data Entry Executive (Banking Process) \nCameo Corporate Services Limited","description":"We have an Immediate Opening for Data Entry at Chennai location for leading Banking Process. Educational Qualification: Any Degree Work Experience: Fresher or 0 to 1 Year Immediate Joiners Preferred. Banking Data Entry Work Salary Package : RS:7000/- Take Home Shift Timing : 9.30 AM to 6.30 PM Walk-in Date/ Time: 2nd March - 11th March , 9.30 AM - 2.00 PM Venue Details- Cameo Corporate Service Limited No. 1, Subramanian Buliding, 5th Floor, Club House Road, Anna Salai, Chennai. Landmark:- Near Spencer Plaza, Opp. building to Senthur Hotel, Bank of Baroda Bank. Contact - Sultan (8056501264)  ","location":"Chennai","experience":"0-1Years"},{"date":"4, 5, 6, 7, 8, 9, 10, 11 - Mar - 2021","skills":"HR/ Recruitment, Talent Management, Sourcing to Selection","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Volantis Technologies Private Limited, 3rd Floor, No.3, Valpra House, 17th Main Service Road, BTM Layout 1st Stage, Bangalore \u0096 560 068","phone":"7899322225","profile":" HR Recruiter/ Lead/ Manager \nVolantis Technologies Private Limited","description":"Role : Recruiter/Sr. Recruiter/ Lead Recruiter/Manager (IT Recruitment/Technical Recruitment) Work Experience : 0 - 8 years Location : Bangalore (BTM Layout) Industry : Recruitment/Staffing Required Skills- Good Exposure to Recruitment Process. Experience/Knowledge in Recruitment Life Cycle from Sourcing to Selection. Experience in Sourcing profiles through Job Portals, Networking, Headhunting & Social Networking Sites. Good Communication and Presentation Skills Must be target driven and must be able to thrive in a time pressured environment. Must possess strong presentation skills and be able to communicate professionally. Note : We prefer candidates having experience in Recruitment Consulting Firm background and from Domestic Staffing Experience. If you are interested for the above role, share your profile with me at deepak.b@volantis.com Or you can come for F2F Interview to our BTM office mentioned below: Walk-in Date/ Time: 2nd March - 11th March , 9.30 AM - 6.00 PM Venue Details- Volantis Technologies Private Limited 3rd Floor, No.3, Valpra House, 17th Main Service Road, BTM Layout 1st Stage, Bangalore \u0096 560 068 Landmark: Near Udupi Garden Signal (Above KTM Bike Showroom) Contact Person : Deepak B (7899322225)  ","location":"Bangalore","experience":"0-5Years"},{"date":"5 - Mar - 2021","skills":"Php, Java, Oracle Forms and Reports, Jasper Reports, Oracle, MySQL Database","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Allin Info Systems Private Limited, B75 Sector 6, Noida.","phone":"8249718725","profile":" PHP Developer/ Fresher \nAllin Info Systems Private Limited","description":"Candidate should have good knowledge of Php, Java, Oracle Forms and Reports, Jasper Reports Database: RDBMS- Oracle, My SQL, Completed educational project in PHP, MYSQL, Java Scripting, AJAX and CSS Must have basic knowledge of HTML 5, CSS 3 and XHTML Should have knowledge of WordPress, Magento Walk-in Date/ Time: 5th March 2021, 10.00 AM - 5.30 PM Venue Details- Allin Info Systems Private Limited B75 Sector 6, Noida. Contact- Smita, HR (8249718725)  ","location":"Noida","experience":"0-1Years"},{"date":"4, 5, 6 - Mar - 2021","skills":"Core JAVA, Advance Java, Oracle, MySQL, SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Velox Solutions Private Limited, No- 901, 902, 905, 906 & 908, 9th Floor, Vashi Infotech Park, Sector-30A, Vashi, Navi Mumbai - 400 705.","phone":"8591400251","profile":" Java Developer/ Fresher \nVelox Solutions Private Limited","description":"Educational Qualification: BCA, BSc-IT, BE, MCA, MCM Work Experience: Fresher Job Location: Vashi, Navi Mumbai Required Key Skills: Core JAVA, Advance Java, Oracle, MySQL, SQL Server, Frameworks (Struts 2.0, Hibernate, Spring, Java Script, jQuery, Ajax, Bootstrap) Should have excellent communication skills. No. of Positions: 3 Walk-in Date/ Time: 4th - 6th March 2021, 9.30 AM - 5.30 PM Venue Details- Velox Solutions Private Limited No- 901, 902, 905, 906 & 908, 9th Floor, Vashi Infotech Park, Sector-30A, Vashi, Navi Mumbai - 400 705. Contact - Vivek Kadam (8591400251) Interested candidates can share their resume on career@velox.co.in  ","location":"Mumbai","experience":"0-1Years"},{"date":"3, 4, 5, 6 - Mar - 2021","skills":"Core PHP, CodeIgniter Framework, PHP5, MySQL, jQuery, JavaScript, HTML5, CSS3, XML","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Vidya Online Services Pune Private Limited, Third Floor, Navale IT Zone, Above Union Bank, Mumbai-Bangalore bypass Highway, Phase 2, Narhe Road, Pune, Maharashtra - 411 041.","phone":"Not Provided","profile":" PHP Developer \nVidya Online Services Pune Private Limited","description":"Candidate should be BE-IT, BE (Computer Science), MCA or any Computer Graduate with good hands on experience in string Core PHP. Strong Expertise in CodeIgniter Framework with Good Knowledge of PHP5, MySQL, jQuery, JavaScript, HTML5, CSS3, XML. Sound knowledge of database designing and application architecture planning for Core PHP projects. Must have good debugging skills. Expertise in PHP, MVC Frameworks and good technology exposure of CodeIgniter. Assure that all user input is validated before submitting to back-end. Good understanding of asynchronous request handling, partial page updates, and AJAX will be preferred. Basic understanding of front-end technologies, such as JavaScript, HTML5, and CSS3 Proficient understanding of code versioning tools, such as Git. Excellent Communication & Client Interaction Skills. Understanding of session management in a distributed server environment. Walk-in Date/ Time: 3rd March - 6th March , 12.30 PM - 5.30 PM Venue Details- Vidya Online Services Pune Private Limited Third Floor, Navale IT Zone, Above Union Bank, Mumbai-Bangalore bypass Highway, Phase 2, Narhe Road, Pune, Maharashtra - 411 041. Contact - Parish Mhatre  ","location":"Pune","experience":"2-3Years"},{"date":"2, 3, 4, 5, 6, 8, 9, 10, 11 - Mar - 2021","skills":"Office Administration, Front Office Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"iService Center, Unit 1, Rajnigandha Building No. 14, New Link Road, Oshiwara, Andheri West, Mumbai","phone":"9987635470","profile":" Front Office Administrator \niService Center","description":"Candidate should be Any Graduate with 0 to 2 years of experience in Office Administration, Front Office Management. Should have excellent communication skills. Roles and Responsibilities- 1. Engage with the Client to accept Devices for high level diagnostics to provide accurate estimates for smartphones and tablet issues. 2. Creation of Work Orders on CRM to track the device repair life-cycle from Estimate up to Invoicing and Sales Receipt. 3. Assist the Branch Manager with procurement of Spare Parts and Accessories and creating proper Debit Vouchers for the same 4 Creating Debit Vouchers for Company related petty cash expenses and maintaining records in the CRM system. 5. Follow-up with clients and providing status updates to Clients on the current status of their device, right from work complete to Pick up. 6. Handles Pre-Repair and Post-Repair warranty customer requests for technical assistance and support. 7. Assists in Service Center workshop maintenance to ensure a clean and healthy workshop environment along with safety measures. Walk-in Date/ Time: 2nd March - 11th March , 11.30 AM - 6.00 PM Venue Details- iService Center Unit 1, Rajnigandha Building No. 14, New Link Road, Oshiwara, Andheri West, Mumbai Landmark: Near Shreeji Restaurant Contact - Sana ( 9987635470 )  ","location":"Mumbai","experience":"0-2Years"},{"date":"2, 3, 4, 5, 6, 7, 8, 9, 10, 11 - Mar - 2021","skills":"Software Testing, Manual Testing, Mobile Application Testing, SQL","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Avani Infosoft Private Limited, 1st Floor, NHBCS Layout, Near Kamakshipalya Police Station, Basaveshwara Nagar , Bangalore - 560 079.","phone":"6366939247","profile":" Software Testing Engineer \nAvani Infosoft Private Limited","description":"Candidate should be BE/ B.Tech/ BCA or MCA with 1 or 1+ year experience in Software Testing, Manual Testing, SQL. Must have excellent communication skills. Looking for male candidate only. Walk-in Date/ Time: 2nd - 11th March 2021, 9.30 AM - 5.30 PM Venue Details- Avani Infosoft Private Limited 1st Floor, NHBCS Layout, Near Kamakshipalya Police Station, Basaveshwara Nagar, Bangalore - 560 079. Contact - Usha (6366939247)  ","location":"Bangalore","experience":"1-3Years"},{"date":"1, 2, 3 - Mar - 2021","skills":"HR/ Recruitment, Sourcing, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Uolo Edtech Private Limited, 91 Springboard, 5th Floor, Plot No. 145, Sector 44, Near Punjab and Sindh Bank, Gurgaon, Haryana - 122 002.","phone":"7060092639","profile":" HR Executive \nUolo Edtech Private Limited","description":"Uolo Edtech Private Limited is currently looking for HR Executive. Skills required: Partnering with team/ Function heads to determine staffing needs Screening resumes and conducting telephonic interviews with candidates Develop a pool of qualified candidates in advance of need Research and recommend new sources for active and passive candidate recruiting Walk-in Date/ Time: 1st March - 3rd March 2021, 10.00 AM - 6.30 PM Venue Details- Uolo Edtech Private Limited 91 Springboard, 5th Floor, Plot No. 145, Sector 44, Near Punjab and Sindh Bank, Gurgaon, Haryana - 122 002. Contact - Bharti Pundir (7060092639)  ","location":"Gurgaon","experience":"1-4Years"},{"date":"1 - Mar - 2021","skills":"HR Intern, Sourcing, Apprenticeship Trainee","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Ample Technologies Private Limited, Ncc Urban - Windsor, 4th Floor, HAL Old Airport Road, Bengaluru, Karnataka - 560 064.","phone":"Not Provided","profile":" HR Executive/ Interns \nAmple Technologies Private Limited","description":"We are looking for 3 months HR interns. We provide HR internship certificate. The internship will not be paid. If you are interested please share your resume to ashwini.prasad@ample.co.in or Watsapp on 9686685448. Walk-in Date/ Time: 1st March 2021, 10.30 AM - 5.00 PM Venue Details- Ample Technologies Private Limited Ncc Urban - Windsor, 4th Floor, HAL Old Airport Road, Bengaluru, Karnataka - 560 064. Contact Person- Ashwini  ","location":"Bangalore","experience":"0-1Years"}]}