{"Walkins":[{"date":"26, 27, 28 - Jun - 2019","skills":".NET, ASP .NET, C#, MVC and SQL Server","qualification":"B.E./B.Tech","address":"Halcyon Technologies Private Limited, Plot No 56/8, 2nd Floor, Power Mech Infra Building, Jubilee Enclave Road, Opp to HITEX Arch Road, Madhapur, Hyderabad, Telangana - 500 081.","phone":"040-23115591","profile":".Net Developer/ Fresher \nHalcyon Technologies Private Limited","description":"Halcyon Technologies Private Limited, is looking for .NET Developer to join its close-knit and extremely talented technical team. We're looking for people who are ambitious about building a quality service. Candidate should be B.Tech (2018/ 2019 Pass outs only) with good knowledge on .NET, ASP .NET, C#, MVC and SQL Server. Subject knowledge on MVC is Must. Should have good communication skills. Willing to join on immediate Basis. Interested candidates can Walk inn at the venue below- Walk-in Drive on 26th / 27th / 28th June 2019 Timings : Wednesday to Friday 10:00 am to 4:30 pm Interview Venue: Halcyon Technologies Private Limited Plot No 56/8, 2nd Floor, Power Mech Infra Building, Jubilee Enclave Road, Opp to HITEX Arch Road, Madhapur, Hyderabad, Telangana - 500 081.","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"28 - Jun - 2019","skills":"Technical Support, International Voice Process, Troubleshooting","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Dell International Services India Pvt. Limited, Vipul Tech Square, Sector - 43, Gurgaon - 122002 Near Sector 42-43 Rapid Metro Station","phone":"Not Provided","profile":"Technical Support Associate \nDell International Services India Pvt. Limited","description":"Educational Qualifications: Any Graduate with 0-2 year of relevant work experience required Undergrad with 1 year of relevant work experience required Should be willing to work in shifts in a 24 x7 work environment Should be residing within Transport Boundaries Excellent telephone soft skills, thorough telephone functional skills & email etiquettes Excellent spoken and written English Ability to handle stressful situations. Goal/ Career oriented and self-motivated Essential Requirements : Fluent communication & Time management skills Knowledge of job associated database, software and documentation Results driven with Problem-solving skills Strong technical aptitude and troubleshooting skills Benefits: We offer highly competitive salaries, bonus programs, world-class benefits, and unparalleled growth and development opportunities all to create a compelling and rewarding work environment. Interview Date : 28th June 2019 Timings : 12:00 pm to 3:00 pm Interview Venue: Dell International Services India Pvt. Limited Vipul Tech Square, Sector - 43, Gurgaon - 122002 Near Sector 42-43 Rapid Metro Station *Note - Please carry a resume & valid Govt. ID proof","location":"Gurgaon","experience":"0 - 2 Years"},{"date":"27, 28 - Jun - 2019","skills":"General Administration, Facilities/ Maintenance, Team Management, Security Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Concentrix Daksh Services India Pvt. Limited, 1st Floor, D4, Manyata Embassy Business Park, Nagawara Outer Ring Road Bangalore, Karnataka - 560 045","phone":"7686839463","profile":"Facilities/ Admin Executive \nConcentrix Daksh Services India Pvt. Limited","description":"Walk-in drive for Facilities Admin, Team Lead experience with our organisation on Thursday and Friday (27th and 28th June 2019) Qualification: Degree/ Diploma Holder 3 Years Work Experience: 3 - 5 Years Location: Bengaluru (Hebbal) Key Skills & Knowledge: Analytical skills - To understand and apply research and statistics in decision-making Critical Thinking Using logic and reasoning to identify the strengths and weaknesses of alternative solutions, conclusions or approaches to problems Organizational skills Role & Responsibility- The candidate required to handle facility operation, Cafeteria and security management, Site Engineering, Project Management. Responsible for general maintenance of plumbing, Carpentry and electrical equipments. Plan and manage facility central services such as reception, security, medical staff, cleaning, catering, waste disposal and parking Maintenance and facility operations Managing resources including budget, staff, contractors & procurement functions. Safety inspections: ensure compliance with health and safety standards and industry codes. Asset Management. Walk-in Date: 27th - 28th June 2019 Time- 11 AM-3 PM Interview Venue: Concentrix Daksh Services India Pvt. Limited 1st Floor, D4, Manyata Embassy Business Park, Nagawara Outer Ring Road Bangalore, Karnataka - 560 045 Interested candidates may directly walk-in at the mentioned venue","location":"Bangalore","experience":"3 - 5 Years"},{"date":"26 - Jun - 2019","skills":"HR Administration, Recruitment, Joining Formalities/ Exit Formalities, Office Administration","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Nuctech India Private Limited (Formerly Known as Nucetech Security Solutions Pvt. Limited), 505/ 506, 5th Floor, Palm Spring Plaza, Sector 54, Golf Course Road, Gurugram, Haryana - 122 003.","phone":"9899609400","profile":"Asst. Manager - HR & Admin \nNuctech India Private Limited","description":"Candidate should be Any Graduate/ MBA (HR) with 2 to 5 years of strong experience in HR Administration, Recruitment, Joining Formalities/ Exit Formalities, Office Administration. Must have excellent communication skills. Job Responsbility- Handling profile of front desk executive. Update the employee records in the master sheet. Take care of the in-house recruitment. Follow end to end recruitment process. Taking care of new joiners joining, exit formalities and Full and Final Settlement. Explaining Sales Travel Policy, HR Policy and Organization Structure to New Joiners. Issues of Offer Letter & Explain the CTC Break up. Managing advance Salary & Preparation of Different Reports. Handling Induction. handling petty cash. Maintain records of new employees to track status of joining formalities & also checked background verifications of employees before the date of joining Supervise and manage Day to Day office administrative activities. Walk-in Date/ Time: 26th June 2019, 9 AM onwards Interview Venue: Nuctech India Private Limited (Formerly Known as Nucetech Security Solutions Pvt. Limited) 505/506, 5th Floor, Palm Spring Plaza, Sector 54, Golf Course Road, Gurugram, Haryana - 122 003.","location":"Bangalore","experience":"2 - 5 Years"},{"date":"29 - Jun - 2019","skills":"Manual Testing/ Fresher","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"QualityKiosk Technologies Pvt. Limited, A Wing - 419, Rupa Solitaire, Millennium Business Park, Mahape, Navi Mumbai - 400 709","phone":"Not Provided","profile":"Manual Tester/ Freshers \nQualityKiosk Technologies Pvt. Limited","description":"Qualification: BE/ B.Tech/ MCA/ B.Sc/ BCA/ M.Sc/ M.Tech Passing Year- 2017 or 2018 (Education gap not more than 1 Year) Percentage Criteria- 2 academics 60%+ AND 1 academic 55%-60% Required Skills- Java knowledge added advantage Should be willing to work in Manual Testing Open to travel anywhere in Mumbai (Western, Central, Navi Mumbai) Candidates are requested to be prepared on manual testing before coming for the interview Good Analytical approach & Logical reasoning skills Good Communication Skills 2 year bond required Walk-in Date: 29 June 2019- Saturday Time: 11:00 A.M till 2:00 P.M Venue Details: QualityKiosk Technologies Pvt. Limited A Wing - 419, Rupa Solitaire, Millennium Business Park, Mahape, Navi Mumbai - 400 709 (Directions: next to Mastek, take a right from the main entrance) Lift Number 24 & 25 Contact Person: Mausimi Sardar/Leena Bhor Please Note:- Should have completed or pursuing course in Manual Testing & Flexible to travel anywhere in Mumbai","location":"Mumbai","experience":"0 - 1 Years"},{"date":"29 - Jun - 2019","skills":"ASP .Net, ASP .NET","qualification":"B.E./B.Tech, MCA/PGDCA","address":"HCL Technologies Limited, (AMB-4), 94, South Phase, Ambattur Industrial Estate Rd, Ambattur, Chennai - 600058. Landmark: Near Vaavin Bus Stop","phone":"Not Provided","profile":"ASP .NET Developer \nHCL Technologies Limited","description":"HCL Technologies Limited, Chennai, is looking for candidates who satisfy the criteria given below: Skill Set Required: 1. Excellent Knowledge of ASP .NET 2. Good at MS-Excel Qualification: BE / BTech / MCA Experience Required: 1 to 5 years Work Location: Chennai WALK-IN VENUE: HCL Technologies Limited, (AMB-4), 94, South Phase, Ambattur Industrial Estate Rd, Ambattur, Chennai - 600058 Landmark: Near Vaavin Bus Stop WALK-IN DATE: 29th June 2019 (Saturday) TIME: 11 AM To 5 PM Rounds of Interview: Written & Online Test and Interview Contact Person : Hemamalini / Sangeetha / Kiruba CANDIDATES MUST BRING THE FOLLOWING DOCUMENTS: 1. Resume 2. Naukri Invite Letter 3. Government ID Proof","location":"Chennai","experience":"1 - 5 Years"},{"date":"1, 2, 3 - Jun - 2019","skills":"Technical Support, Customer Service, International Voice Process","qualification":"B.Sc, BCA/BCS, B.E./B.Tech, B.A., B.Com, B.B.A, B.Sc","address":"Vodafone House, Building B, Ground Floor, Corporate Road, Off. S. G. Highway, Prahllad Nagar, Ahmedabad - 380 051","phone":"Not Provided","profile":"Technical Support (Voice Process) \nVodafone India Services Private Limited","description":"Candidate should be Any Graduate with excellent communication skills Must have willingness to work in 24*7 environment Job Responsibility- Rotational Shifts Voice Process Customer Service International Call Center International Voice Process Walk-in Date/ Time: 1st - 3rd July 2109, 10 AM onwards Interview Venue: Vodafone House, Building B, Ground Floor, Corporate Road, Off. S. G. Highway, Prahllad Nagar, Ahmedabad - 380 051","location":"Ahmedabad","experience":"0 - 5 Years"},{"date":"27, 28 - Jun - 2019","skills":"Technical Support, Voice Process, Customer Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Tech Mahindra Limited, A20 (Basement) Sector 60 Noida","phone":"9568145170","profile":"Technical/ Customer Support (Voice) \nTech Mahindra Limited","description":"Eligibility Criteria: Any Graduates Freshers and Experienced Can Apply Should be Impeccable in Communication Skills Should be flexible to work with 24/7 shifts (Rotational shifts) Basic knowledge on customer service/ Trouble shooting of PCs and Laptops. Candidate should be aware of basic technical knowledge in LAN, WAN and handling basic Internet issues. Troubleshooting of technical related issues and ensure to resolve the issues or queries over the call. Research, diagnose, troubleshoot and identify solutions to resolve customer issues Candidate should be flexible to work in 24*7 environments (Rotational Shift), comfortable to work in night shifts. 5 days working. Transportation Facilities: Both way Interview Date : 27th to 29th Jun 2019 Timing : 11 AM - 5 PM Venue Details : Tech Mahindra Limited, A20 (Basement) Sector 60 Noida Documents required for walk-in: Copy of CV Original ID proof (Aadhaar - Mandate) Contact Person: Prachi Tiwari","location":"Noida","experience":"0 - 5 Years"},{"date":"29 - Jun - 2019","skills":"Technical Support, Application Support, Incident Management","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"MphRx Plot-115, Sector-44, Gurugram Nearest metro-Huda city center","phone":"Not Provided","profile":"Technical Support Engineer \nMy Personal Health Record Express (India) Pvt. Limited","description":"Candidate should be Any Graduate with good knowledge of Unix operating system, MySQL queries, monitoring/management systems, troubleshooting & support for customer escalation & incident tickets. Have worked closely with Client related issues, answer calls & support them for technical issues. Only Male Candidates need to apply Walk-in Date/ Time: 29th June 2019, 9 AM onwards Interview Venue: MphRx Plot-115, Sector-44, Gurugram Nearest metro-Huda city center","location":"Gurgaon","experience":"0 - 4 Years"},{"date":"27 - Jun - 2019","skills":"Manual Testing Integration Testing Regression Testing Web Services Testing System Testing","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Techila Global Services Private Limited, 601, 602 6th Floor, P 3 Pentagon, Magarpatta City, Hadapsar, Pune, Maharashtra - 411 013","phone":"020844608402","profile":"Junior Testing Engineer \nTechila Global Services Pvt. Limited","description":"Minimum 6 months to 1 year experience is a must. Immediate joiners preferred. Candidate should have already been trained on Manual, Performance and Selenium, Webservices Testing. Responsibilities- Preparation of test cases. Update existing test case in the Manual test suite. Collect and create test data for functional and non-functional testing. Run functional and non-functional tests Excellent in regression testing, integration testing, system testing. Knowledge on Testing Concepts and Scripting Languages Responsible for Test Plans, Analyze Functional Requirements, Writing Manual Test Scripts, Mining test data & Execute manual test scripts. Follow best QA practices/design techniques for creating/updating test cases. Walk-in Date/ Time: 27th June 2019, 3 PM onwards Interview Venue: Techila Global Services Private Limited 601, 602 6th Floor, P 3 Pentagon, Magarpatta City, Hadapsar, Pune, Maharashtra - 411 013","location":"Pune","experience":"0 - 1 Years"},{"date":"30 - Jun - 2019","skills":"Service Desk/ Technical Support (Voice Process)","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Rajagiri College of Management and Applied Sciences, Rajagiri Valley Road, Rajagiri Valley, Kakkanad, Kochi","phone":"Not Provided","profile":"Technical Support/ Service Desk \nAllianz Technology SE","description":"Candidate should be Any Graduate with 0 to 3 years of experience in Service Desk/ Technical Support (Voice) Technical Skills- Excellent written and verbal communication skills Provision of remote desktop support to all customers IT Support of all office, overseas and home based customers who use a broad variety of mainstream and bespoke applications on Windows 10, Windows 7 operating system Delivery of excellent customer service Support of Home Workers with experience of home routers/modems Call, Incident, Request and Desktop Management through logging, escalation and resolution using Service Now and remote support tools Raising accurate tickets In the CRM Tool (Service Now) Maintenance of 75% first line fix rate Assignment of calls/ requests/ incidents to internal and external support teams where calls cannot be fixed by the Service Desk Incident management encompassing incidents assigned to other support teams Setting customer expectation by allocating an appropriate priority to an incident Walk-in Date: 30th June 2019, Sunday Time: 9.30 AM to 2 PM Interview Venue: Rajagiri College of Management and Applied Sciences, Rajagiri Valley Road, Rajagiri Valley, Kakkanad, Kochi","location":"Kochi","experience":"0 - 3 Years"},{"date":"27, 28 - Jun - 2019","skills":"Customer Service, Blended Process, Semi Voice Technical Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech, B.A., B.Com, B.B.A, B.Sc","address":"HCL Technologies Limited, A 22, Sector 60, Noida","phone":"Not Provided","profile":"Customer Support (Blended Process) \nHCL Technologies Limited","description":"Education Qualification: Any Graduate Technical/ Non-Technical Work Experience: 1 - 4 Years Shifts: Fixed night shifts only Skill Set Required- Industry benchmark customer service skills required candidates are provided with strong opportunities to influence customer opinion and direction. Demonstrated ability to utilize MS Office software to document issues/ concerns/ and areas of opportunity for effective communication. Advanced oral and written communication standards in the English language. Roles & Responsibilities- Monitor and balance call activity and workload of Service Providers (SP) using Service Edge and Siebel software Identify & communicate barriers that impede Service Provider workload optimization and effective call queue management. Collaborate with field management to resolve or overcome these barriers Identify, assign, and monitor successful completion of calls, Walk-in Date: 27th & 28th June 2019 Time: 12 to 4 PM Interview Venue: HCL Technologies Limited A 22, Sector 60, Noida Contact Person: Ankit/ Niharika","location":"Noida","experience":"1 - 4 Years"},{"date":"1, 2, 3, 4, 5 - Jul - 2019","skills":"Technical Support, IT Helpdesk, Customer Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Digital Minds Software Solutions Pvt. Limited, 2nd Floor, A-Wing, Softsol Building,, #4 Infocity, Beside Mindspace, Hi-tech City, Madhapur, Hyderabad, Telangana - 500 081","phone":"040 66885669","profile":"Technical Support Executives \nDigital Minds Software Solution Pvt. Limited","description":"Digital Minds Software Solution Pvt. Limited, is conducting Walk in Drive for Technical Support Executives. Educational Qualification: Any Degree Work Experience: 3 - 6 Years Job Location: Hyderabad Shift Timings (IST): Australian Voice Process (2:30 Am to 11:30 Am or 4:00 Am to 1:00 Pm or 6:00 Am to 03:00 Pm) (Shifts can change depending on Roster or Day light saving (Rotational) Required Skills- Excellent Comm Skills / Technical Skills / Trouble shooting skills / Customer Handling Skills Good in Active Directory, Basic Exchange Server or Office 365 administration, DHCP & DNS Excellent Knowledge of desktop OS Windows 8.1 / 10 and Trouble Shooting. Support hardware issues related to PC desktops, laptops, networking and Cisco phones. Able to work effectively with vendors and suppliers by logging tickets and service requests. Hands on experience with Ticketing tools is essentials(Jira / Alloy Navigator etc ) Knowledge of VMware(VSphere 5.5) and Citrix Xen Server. Knowledge of Cisco CUCM / Unity/ PLM - Not mandatory Knowledge on Backup (Veritas Backup, Veeam Backup, etc...) Walk-in Date: 1st to 5th July 2019 Timings: 10 AM -1 PM & 2 PM - 4 PM Interview Venue: Digital Minds Software Solution Private Limited 2nd Floor, A-Wing, Softsol Building,, #4 Infocity, Beside Mindspace,Hi-tech City, Madhapur, Hyderabad, Telangana - 500 081 Phone No: 9063610208/ 040 6688 5669 Note: Those attended the interview with in Six Months, Kindly Ignore. Salary:","location":"Hyderabad","experience":"3 - 6 Years"},{"date":"26, 27, 28 - Jun - 2019","skills":"PL/ SQL, Procedure Debugging, Extract build, Datafixes","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Datamatics Global Services Limited, Knowledge Centre, Plot No. 58, Street No. 17, Near Akruti Trade Center, Opposite to Ranbaxy Laboratory MIDC, Andheri (East), Mumbai - 400 093","phone":"Not Provided","profile":"Technical Support - Freshers \nDatamatics Global Services Limited","description":"Education Qualification: BSc-IT/ CS, BCA, BE/ B.Tech -IT/CS, MSc- IT/CS or MCA 2018, 2019 Passed out (2019 Pass out without any KT) Technology Skills: PL/ SQL, Procedure Debugging, Extract build, Datafixes (DML statement), LINUX/ UNIX Job Responsibility: Regular client communication via ticketing system and calls. Organize, schedule and liaise with the Development and QA teams Provide timely responses and resolutions as per the SLA Prioritize work based on client and business needs Document and maintain records of customer interactions, transactions, comments and complaints Maintain good service understanding to resolve customer queries Availability as per project requirements Shift Timings: Rotational shifts (including night shift) Note: Only male candidates required Interview Date: 26th - 28th June 2019 Time: 11am - 2 pm Interview Venue: Datamatics Global Services Limited Knowledge Centre, Plot No. 58, Street No. 17, Near Akruti Trade Center, Opposite to Ranbaxy Laboratory MIDC, Andheri (East), Mumbai - 400 093 Contact Person: Neha Vora","location":"Mumbai","experience":"0 - 1 Years"},{"date":"25, 26, 27, 28 - Jun - 2019","skills":"Android Studio, Java, Android SDK, SQLite","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Smart Energy Water, Logic Cyber Park (Tower A), C-28 & 29, 6th Floor, Sector-62, Noida","phone":"7428505400","profile":"Android Developer - Java \nSmart Energy Water (SEW) Private Limited","description":"Candidate should have 2 - 4 years of experience developing mobile apps. Have an experience in developing native Android apps (depth knowledge of Android SDK, NDK) Depth knowledge of SQLite Excellent in Java development and debugging skills Expert in using Eclipse SDE, Ant and ADB shell. Developing universal application, which can run on most of available android devices. Must have good understanding of Object-Oriented Programming Good eye for mobile app design and product sense Experience in cross platform Tools like Appcelerator/ Sencha/ PhoneGap would be a plus Internally motivated, able to work proficiently both independently and in a team environment. Good communication skills with both internal team members and external business stakeholders. Strong initiative to find ways to improve solutions, systems, and processes. Walk-in Date/ Time: 25th - 28th June from 10 AM onwards Interview Venue: Smart Energy Water Logic Cyber Park (Tower A), C-28 & 29, 6th Floor, Sector-62, Noida","location":"Noida","experience":"2 - 4 Years"},{"date":"24, 25, 26, 27, 28, 29 - Jun - 2019","skills":"Technical Support, IT Helpdesk, Networking, IT Support","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Option Matrix InfoTech Pvt. Limited, 4 B UPTOWN Cyberabad Building, 100 Feet Road, Ayyappa Society, Madhapur, Hyderabad - 500 081","phone":"040-40020730","profile":"Android Application Developer \nOption Matrix InfoTech Pvt. Limited","description":"OptionMatrix looking for Android Programmer with 1 to 2 years of experience Suitable for programmers who have at least 1-2 years experience in building applications using Java in object-oriented architecture (MVC pattern) for Google Android platform. Deep knowledge of object-oriented architecture and good programming practices is expected. Excellent communication skills required, This role is expected to understand and deliver as per organization standards. Walk-in Date/ Time: 24th June - 29th June , 9 AM onwards Interview Venue: Option Matrix InfoTech Pvt. Limited 4 B UPTOWN Cyberabad Building, 100 Feet Road, Ayyappa Society, Madhapur, Hyderabad - 500 081","location":"Hyderabad","experience":"1 - 2 Years"},{"date":"25, 26, 27 - Jun - 2019","skills":"Java, J2ee, Struts, Spring, Hibernate and Tomcat CSS, HTML","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Spoors Technology Solutions India Pvt. Limited, 4th Floor, Sai Prithvi - Cyber Arcades, Above Bata Showroom, Indian Oil Petrol Bunk, Madhapur, Hyderabad","phone":"Not Provided","profile":"Java Developer \nSpoors Technology Solutions Pvt. Limited","description":"Looking for recent Pass-outs 2018, 2019 for Freshers. Experience candidate should have 2 to 4 years experience as a Java/ J2EE developer. Should have experience with Struts, Spring, Hibernate and Tomcat CSS, HTML, JavaScript, XML, JSON, AJAX and JSP Candidate must be good in Core JAVA, JavaScript, Spring Framework. Knowledge of Java script and HTML is desirable. Database design and modelling skills (preferably in MySQL) Walk-in Date/ Time: 25th - 27th June , 10 AM onwards Interview Venue: Spoors Technology Solutions India Pvt. Limited, 4th Floor, Sai Prithvi - Cyber Arcades, Above Bata Showroom, Indian Oil Petrol Bunk, Madhapur, Hyderabad","location":"Hyderabad","experience":"0 - 4 Years"},{"date":"24, 25, 26, 27, 28 - Jun - 2019","skills":"Core Java, Servlets, JSP, Spring MVC, Spring Boot, MySQL, Javascript, Angular JS","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"BancTec India Private Limited, (Now a part of Exela Technologies), 9th Floor, ICC Tech Park Tower A, Senapati Bapat Road, Pune - 411 016","phone":"020-67437690","profile":"Java Developer (with Angular) \nExela Technologies","description":"Graduate in B.E/ B.Tech/ ME/ M.Tech/ MCA or equivalent with Profound insight of Java and JEE internals (Class loading, Memory Management, Multithreading, Transaction management etc.). Hands on experience in Apache Tomcat / JBoss. Should have excellent verbal and written communication skills Secondary Skills: Good knowledge of Relational Databases, SQL and PSQL ORM technologies like Hibernate Hands on JMS ( Java Messaging Service ) Hands on GIT, Maven, Ant and Jenkins or equivalent Hands on experience in Angular is a must Notice Period: Immediate-45 Days only If you hold similar experience as per our requirement then please walk in to the below address: BancTec India Private Limited (Now a part of Exela Technologies), 9th Floor, ICC Tech Park Tower A, Senapati Bapat Road, Pune - 411 016 Walk-in Date: 24th - 28th June 2019 Time: 11.00 am - 4.00 pm Contact Number: 020-67437690/ 020-67437573","location":"Pune","experience":"2 - 7 Years"},{"date":"28 - Jun - 2019","skills":"Core Java, Spring, Front End Technologies, Web Services","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"SunTec Business Solutions Pvt. Limited, Citi Tower 7, 3rd Cross Street, Kasturibai Nagar, Adyar Chennai - 600 020","phone":"Not Provided","profile":"Java Developers \nSunTec Business Solutions Pvt. Limited","description":"We are looking for Java Developers to join Immediately Work Experience: 2 to 5 Years Should have strong experience in Core Java Should have good experience in Spring Good understanding on Front End Technologies Should be good in Web Services Walk-in Date/ Time: 28th June from 10 AM onwards Interview Venue: SunTec Business Solutions Pvt. Limited Citi Tower 7, 3rd Cross Street, Kasturibai Nagar, Adyar Chennai - 600 020 If Interested please share your resume to tinut@suntecgroup.com","location":"Chennai","experience":"2 - 5 Years"},{"date":"24, 25, 26 - Jun - 2019","skills":"Java, Javascript, Web Technologies, HTML, CSS","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Virtusa Consulting Services Pvt. Limited, Foundation Building, No 34 IT Highway, Rajiv Gandhi Salai, Navallur, Chennai - 600 130","phone":"Not Provided","profile":"Java Developers \nVirtusa Consulting Services Pvt. Limited","description":"We have urgent requirement for Java Developers with working knowledge on Framework, Collections & Design Patterns. Experience: 2 to 4 Years Job Location: Chennai - Navalur Required Skills: Should have strong work Experience on Core Java, Collections & Design Patterns. Hands on experience in Struts, Spring & Hibernate Good to have project experience on Multi-Threading. Hands on experience in oracle database. Candidate should have development project experience. Self-starter and good communicator. Should have handled teams with end to end ownership of design and delivery. Candidate who suffice the above skills please drop into below address- Date: 24th June - 26th June from 10 AM onwards Venue Details: Virtusa Consulting Services Pvt. Limited Foundation Building, No 34 IT Highway, Rajiv Gandhi Salai, Navallur, Chennai - 600 130 Please bring your updated resume, photo ID proofs, Eductaional docs, Employment Docs , print of this e-mail and Passport size photo. Note:- Looking only for Immediate to 30 Days Joiners.","location":"Chennai","experience":"2 - 4 Years"},{"date":"29 - Jun - 2019","skills":"Core JAVA, Spring or Spring boot, Hibernate","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Panamax Infotech Limited, Panamax House-1, Next to Dinner Bell -2 / ICICI Bank, Subhas Chowk, Memnagar, Ahmedabad - 380 052","phone":"Not Provided","profile":"Software Engineer - Java \nPanamax Infotech Limited","description":"We have arranged a Walk-in Interview for Java Developers on June 29 from 10:00 AM to 4 PM KEY RESPONSIBILITY AREAS: Excellent at carrying out R&Ds independently Able to work in cross technologies team environments Able to contribute in technical discussions Able to implement and support enterprise-scale applications REQUIRED SKILLS/ EXPERIENCE: At least 1 years of software development experience in J2EE Experience with Core Java ,Collection and Multithreading Experience with Frameworks: Hibernate, Spring or Spring boot Experience in working with Webservices (SOAP, Restful) Database skills (at least one): MySQL or Oracle Java application servers: Tomcat Version control system : SVN Strong Unit Test writing skills Preferred Area of Expertise: Core JAVA, Spring or Spring boot, Hibernate Functional Competencies: Carry out assigned code implementation Active participation product design and testing Should be able to lead module if assigned General Competencies/Soft Skills: - Good at technical communication with team mates (written and oral) Educational Qualification: BE or MCA or MSc (IT)","location":"Ahmedabad","experience":"1 - 5 Years"},{"date":"29 - Jun - 2019","skills":"Core Java/ J2EE/ Servlets/ JSP/ JavaScript, OOPS, Struts Framework/Spring Framework","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Centre for Good Governance, Dr. MCR HRD Campus, Road No. 25, Jubilee Hills, Hyderabad - 500 033","phone":"Not Provided","profile":"Software Developer - Java \nCentre for Good Governance","description":"We are Looking for candidates with more than 3+ years of experience. Qualification: Should have acquired - a) BE/ B.Tech/ MCA with specialization in Computers/ Electronics/ IT OR b) M.Sc in Computer Science/ IT with One year experience in Software Development/Implementation OR c) MasterS Degree in Physics/ Mathematics/Statistics/ Operational Research/Electronics with i) Either with Post Graduate Diploma in Computer Science/DOESEC(A level) certification with One year experience in Software Development Projects OR ii) Two year Experience in Software Development/Implementation Projects OR d) M. Tech/M.E/MS in Computer Science/IT/Electronics. with 60% of marks or above. Experience: Minimum 3 years of experience out of which 2 years in Software Development. Skill Set: Core Java/ J2EE/ Servlets/ JSP/ JavaScript, OOPS, Struts Framework/Spring Framework, Hibernate technologies Process methodologies - MVC, SOA Architecture Good working knowledge on Tomcat/ JBoss servers Developing software using Eclipse/ MyEclipse IDE Should have contributed in all phases of the development life cycle Strong communication skills Roles and Responsibilities: Should involve and be responsible for all the stages of Software Development Life Cycle. Working closely with Project leader, business analysts, designers and other team members throughout the SDLC Actively participate in discussions with team members in design, development and implementation Evaluate and increase the program effectiveness Document the tasks assigned Testing the application in real situations Walk-in Date/ Time: 29th June 2019, 11 AM onwards Interview Venue: Centre for Good Governance, Dr. MCR HRD Campus, Road No. 25, Jubilee Hills, Hyderabad - 500 033 I am Inter","location":"Hyderabad","experience":"3 - 5 Years"},{"date":"24, 25, 26, 27, 28 - Jun - 2019","skills":"Core Java Struts J2Ee Javascript Web Services Design Patterns MySQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Virinchi Limited, Moon Road No:1, Illayas Mohammed Khan Estate, 5th Floor - Beside Bajaj Electronics, Banjara Hills Hyderabad - 500 034","phone":"7337362432","profile":"Full Stack Developer - Java \nVirinchi Limited","description":"Candidate must have strong knowledge in Core Java, J2EE, SQL and Javascript Should have good knowledge in design patterns Experience in MVC frameworks like Struts/ Springs Should have good knowledge of Restful Services and Web Services Experience with databases like MySQL, SQL-Server is preferred. Ensure optimum performance and stability of the code developed and deployed Should have good verbal and written communication skills Walk-in Date/ Time: 24th June - 28th June , 11 AM onwards Interview Venue: Virinchi Limited Moon Road No:1, Illayas Mohammed Khan Estate, 5th Floor - Beside Bajaj Electronics, Banjara Hills Hyderabad - 500 034 Near Virinchi Hospital & Pension Office Mobile : 7337362432","location":"Hyderabad","experience":"3 - 8 Years"},{"date":"25, 26, 27, 28, 29, 30 - Jun - 2019","skills":"C#, Asp .Net, MVC, .Net, SQL Server","qualification":"B.E./B.Tech","address":"MBR Informatics Private Limited, Plot No. 658, 3rd Floor, Ayyappa Socitey, Madhapur, Hyderabad, Telangana - 500 081","phone":"Not Provided","profile":"Senior Java Developer \nMBR Informatics Private Limited","description":"Bachelor's Degree - Computer Science/ Engineering, preferred. Candidate should have 3+ years Java development experience Experience with Spring framework Should have 2+ years experience must include at least four (4) of the following: HTML, CSS, JavaScript, RESTful Api developmen Walk-in Date/ Time: 25th - 30th June , 11 AM onwards Interview Venue: MBR Informatics Private Limited Plot No. 658, 3rd Floor, Ayyappa Socitey, Madhapur, Hyderabad, Telangana - 500 081","location":"Hyderabad","experience":"3 - 5 Years"},{"date":"24, 25, 26, 27, 28 - Jun - 2019","skills":".NET framework 3.5 / 4.x, RDBMS, Oracle / MS SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA","address":"In-Solutions Global Limited, 14-B, R-Tech Park, Nirlon Knowledge Park, Off Western Express Highway, Goregaon East, Mumbai - 400 063","phone":"Not Provided","profile":"Software Developer (.Net) \nIn-Solutions Global Limited","description":"Required Skills: Knowledge of .NET framework 3.5 / 4.x Knowledge on RDBMS, Oracle / MS SQL Server Job Responsbility: Analysis of new change request / Project Development of new change request / Project Unit testing QA support Implementation Production support Technical Documentation Walk-in Date/ Time: 24th - 28th June , 10 AM onwards Interview Venue: In-Solutions Global Limited 14-B, R-Tech Park, Nirlon Knowledge Park, Off Western Express Highway, Goregaon East, Mumbai - 400 063 Contact Person: Priyanka Kadam","location":"Mumbai","experience":"0 - 2 Years"},{"date":"24, 25, 26, 27 - Jun - 2019","skills":"ASP .NET framework, SQL Server and Design/ Architectural Patterns","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Spigot Software Private Limited, 531/144, 3rd Floor, Outer Ring Road, Agara Village, 1st Sector, HSR Layout, Bengaluru, Karnataka - 560 102","phone":"9036016263","profile":".Net Developer \nSpigot Software Private Limited","description":"Required Skills/ Experience: 1 to 4 years knowledge of .NET web framework. Familiarity with the ASP .NET framework, SQL Server and Design/ Architectural Patterns (e.g. Model-View-Controller (MVC)) Knowledge of at least one of the .NET languages (e.g. C#, Visual Basic .NET) and HTML5/ CSS3. Strong understanding of object-oriented programming. Experience creating database schemas that represent and support business processes. Knack for writing clean, readable, and easily maintainable code. Experience advocating for and using new technology to build applications of the future. Job Responsibilities: Assist in the design, development, and support of an enterprise web hosting plat formand related components. Translate application storyboards and use cases into functional applications. Design, build, and maintain efficient, reusable, and reliable code. Integrate data storage solutions in SQL server. Ensure the best possible performance, quality, and responsiveness of applications. Participate in all phases of the lifecycle of software application development with an emphasis on design, quality and implementation. Contact: Subburaj P Mobile: 9036016263 Interested Candidates, Please mail your updated cv to subburaj.p@spigotsoft.com","location":"Bangalore","experience":"1 - 4 Years"},{"date":"19, 20, 21, 22, 24, 25 - Jun - 2019","skills":"Personnel Administration, Vendor Management, Route Planning","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Transtreasure Services India Pvt. Limited, G-Block, Building No-1, 1st Floor, Sector- 11, Noida","phone":"7840096107","profile":"Personnel/ Admin Manager \nTranstreasure Services India Pvt. Limited","description":"Candidate should be Any Graduate with 8 to 12 years of experience in General Administration, Office Management, Personnel Administration, Vendor Management, Route Planning. Having excellent experience of Vendor Management Ability to Manage Fleet of more than 200 vehicles Route Planning etc. Walk-in Date/ Time: 18th - 25th June , 9 AM onwards Interview Venue: Transtreasure Services India Pvt. Limited G-Block, Building No-1, 1st Floor, Sector- 11, Noida","location":"Noida","experience":"8 - 12 Years"},{"date":"24, 25 - Jun - 2019","skills":"General Administration, Back Office Activities, Customer Support","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"WNS Global Services Private Limited, 11th FL Block A2 & A3 Building, DLF IT SEZ, Sec30 NH8 Gurgaon (Near Star Mall)","phone":"Not Provided","profile":"Backend/ Admin Support Executive \nWNS Global Services Private Limited","description":"WNS Global Services Private Limited, is looking for Backend/ Admin Support Executive at Gurgaon Educational Qualification: Any Graduate Years of Experience: 1 to 3 Years Joining on Immediate basis Skill Required- Ability to multi-task and to work within a framework of standard processes Good communication skills (both written and verbal) Ability to grasp requirement and deliver as per understanding Proactive team oriented, flexible approach. Job Responsbility: The role involves B2B interaction, providing Administrative support (arranging, travel, filing expenses, data entry) using the client tools remotely. Candidate should be flexible with the shift Timings. Walk In Details: 24th to 25th June 2019 Timings: 11:00 AM to 4:00 PM Venue Details: WNS Global Services Private Limited 11th FL Block A2 & A3 Building, DLF IT SEZ, Sec30 NH8 Gurgaon (Near Star Mall) Contact Person: Shalini","location":"Gurgaon","experience":"1 - 3 Years"},{"date":"24, 25, 26 - Jun - 2019","skills":"General Administration, Stationery/ Facilities Management, Staff Welfare, Vendor Management, Housekeeping Administration and Event Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Ample Technologies Private Limited, 4th Floor,NCC Urban Windsor Opposite Jakkur Aero Drome Bangalore International Airport Road. Jakkur - 560 064","phone":"9686685466","profile":"Administrative Execuitve \nAmple Technologies Private Limited","description":"Candidate should be Any Graduate with 1 to 5 years of experience in General Administration, Stationery/ Facilities Management, Staff Welfare, Vendor Management, Housekeeping Administration and Event Management. Must have excellent communication skills & Flexible in travelling Administrative: Petty Cash Maintenance Printing & Stationery, order, issue and maintain stock Meeting Rooms booking Keeping the record of Calls, courier, bills and cheques. Office key management. Food and cab arrangement for employees. Vendor management. Staff welfare and event management Upkeep of safety system. Manage Housekeeping and security staffs. Purchase: Purchase items as per reqeust from various departments. Purchase order and goods receivable creation Price negotiaion Vendor management Bills processing and expense control Liaisoning work Esugam Creation Customs clearance Maintaining of PPL & Trade licence. Travel Desk: Air and Rail ticket booking Hotel booking Walk-in Date/ Time: 24th - 25th June , 10 AM onwards Interview Venue: Ample Technologies Private Limited 4th Floor,NCC Urban Windsor Opposite Jakkur Aero Drome Bangalore International Airport Road. Jakkur - 560 064","location":"Bangalore","experience":"1 - 5 Years"},{"date":"24, 25, 26 - Jun - 2019","skills":"Office Administration, Facility Management/ Facility Administration","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Kadamba Technologies Private Limited. 1st Floor, Citadel, 117, Dr Radha Krishnan Salai, Mylapore, Chennai, Tamil Nadu - 600004","phone":"044 28476020","profile":"Admin Executive (Male) \nKadamba Technologies Private Ltd.","description":"Walk-in drive for Admin Executive (Male) @ Kadamba Technologies, Chennai on 20th June to 26th June 2019 Handle complete facility department, allocate and monitor the work done by Electricians, House Keeping Staff, Front Office Executive and Office Assistant, Responsible for handling Canteen and Transportation Facilities. -Ensuring continuous supply of power to production. -Allocation of jobs to electrical/civil vendors. -Scheduling of preventive maintenance of utilities. -To take backups as per schedule. -Ensure physical security is as per guidelines and ensure training of new security person. -Evaluation of vendors and service providers. If interested, Please revert back with your updated CV along with the below mentioned details.. Full Name (As on Passport): Date of Birth: Total Experience: Relevant Experience: Current location: Preferred location: Current CTC: Expected CTC: Notice period (Short Notice is highly preferred): Reason for change:","location":"Chennai","experience":"1 - 3 Years"},{"date":"29 - Jun - 2019","skills":"QA Testing, Automation Testing, Bugzilla, Test Cases, Test Planning","qualification":"B.E./B.Tech, B.Sc, BCA/BCS, MCA/PGDCA","address":"Compass Systems Private Limited, E84 Sector 63 Noida","phone":"Not Provided","profile":"Software Testing Engineer \nCompass Systems Private Limited","description":"PERFORMANCE TESTING :- Performance Testing is upcoming and very hot Field. Cavissons Products are surrounding this Area. The person required to do performance testing using our product which are best in the world. QUALITY ASSURANCE / TESTING / Client Support (QA): All phases of QA testing of software product which is for performance testing of Web Applications. Requirement document reviews, test plan and test cases documentation, manual and automated testing Bug tracking using Bugzilla and detailed analysis of bugs. Candidate should have good communication skills Must be an Innovative Creative & a fresh thinker. WALK-IN DATE/ TIME: 29th June 2019 from 11 AM onwards Interview Venue: Compass Systems Private Limited E84 Sector 63 Noida Note - Students from those colleges where Cavisson did campus drive and those students who has already appeared in walk in drive. kindly excuse","location":"Noida","experience":"0 - 1 Years"},{"date":"24, 25, 26, 27, 28, 29 - Jun - 2019","skills":"Manual testing, Automation Testing and Security testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Awapal Solutions Private Limited, E-38, First Floor, Sector-63, Noida - 201 301","phone":"9911886563","profile":"Manual Testing Engineer \nAwapal Solutions Private Limited","description":"Candidate should have 6 months to 1 year of relevant experience. Must be having good Knowledge of Manual testing, Automation Testing and Security testing. Must comfortable in client support & software training to clients. Walk-in Date/ Time: 24th June - 15th July, 11 AM onwards Interview Venue: Awapal Solutions Private Limited E-38, First Floor, Sector-63, Noida - 201 301","location":"Noida","experience":"1 - 2 Years"},{"date":"24, 25, 26 - Jul - 2019","skills":"C# ASP.Net SQL Server ASP","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Kerry Indev Express, 5085, 5th FLOOR, OBEROI GARDEN, CHANDIVALI FARM ROAD, CHANDIVALI, MUMBAI - 400 072. Contact Person : Krithiga","phone":"Not Provided","profile":".Net Developers \nKerry Indev Express","description":"Required Skills: C# Asp .Net SQL Server Walk-in Date/ Time: 24th June - 26th June , 9 AM onwards Interview Venue: Kerry Indev Express 5085, 5th FLOOR, OBEROI GARDEN, CHANDIVALI FARM ROAD, CHANDIVALI, MUMBAI - 400 072.","location":"Mumbai","experience":"2 - 4 Years"},{"date":"26, 27, 28 - Jun - 2019","skills":"Manual & Functional Testing, Test Engineering, Selenium, Java Script","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Episource India Private Limited, Prince Infocity, 2, 141, Old Mahabalipuram Road, Kandanchavadi, Chennai, Tamil Nadu - 600 096","phone":"Not Provided","profile":"Software Testing Engineer \nEpisource India Private Limited","description":"Candidate should have strong experience in Manual & Functional testing with various techniques, Identifying regression test cases from existing pool of functional test cases or create them if they are not available, Hands-on experience in writing test cases for complex projects, test data preparation and test execution. TypeScript / Javascript language and Protractor test automation background Experience using Web API Testing-(Rest Assured, Postman), Selenium Web driver (Java / Python),Java script, TestNG/JUnit framework, Jenkins, Developing and maintenance of scripts Knowledge in DB concepts like SQL and PL/SQL Note : EDI knowledge, JMeter and Experience in Healthcare domain is added advantage We prefer shorter notice or immediate joiners. Please share your resumes to padmavathy.murugan@episource.com Walk-in Date: 26th - 28th June 2019 Time: 10 am - 2 pm Interview Venue: Episource India Private Limited, Prince Infocity, 2, 141, Old Mahabalipuram Road, Kandanchavadi, Chennai, Tamil Nadu - 600 096","location":"Chennai","experience":"4 - 7 Years"},{"date":"24, 25, 26, 27, 28, 29 - Jun - 2019","skills":"Software Testing, Manual Testing, Software Implementation","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Suvarna Technosoft Pvt. Limited, Plot No. 8, Durga Nagar Colony, Hyderabad, Telangana - 500 016. Landmark: Opposite Lane Chandana Bro's, Ameerpet","phone":"9963426420","profile":"Software Testing Engineer \nSuvarna Technosoft Pvt. Limited","description":"Qualification: Any Graduate/B.E/ B.Tech/ MCA Experience: Fresher's / 0 year of experience Job Location: Hyderabad 3.6 years of agreement / Bond mandatory Needs to provide Original Certificates Male Candidates only. Direct payroll with 'Suvarna Technosoft Pvt. Limited' Walk-in Date/ Time: 24th - 30th June , 10 AM onwards Interview Venue: Suvarna Technosoft Pvt. Limited Plot No. 8, Durga Nagar Colony, Hyderabad, Telangana - 500 016 Landmark: Opposite Lane Chandana Bro's, Ameerpet","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"29 - Jun - 2019","skills":"Asp .Net, MVC / MVVM, C#, SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Colan Infotech Private Limited, No. 84, Murugesan Nayakar Complex, 4th Floor, Unit-2, B Block, Greams Road, Thousand Lights, Chennai - 06","phone":"90420 55 706","profile":".Net Developer \nColan Infotech Private Limited","description":"Required Skills: Good knowledge in Asp .Net, MVC / MVVM Knowledge of C#, SQL Server Good communication & positive attitude Walk-in Date: 29th June 2019, Saturday Time: 10:00 AM to 6:00 PM Interview Venue: Colan Infotech Private Limited, No. 84, Murugesan Nayakar Complex, 4th Floor, Unit-2, B Block, Greams Road, Thousand Lights, Chennai - 06 Landmark: Opp road to Seashell Restaurant","location":"Chennai","experience":"1 - 5 Years"},{"date":"24, 25, 26, 27, 28, 29 - Jun - 2019","skills":"ASP .Net, C#, MS Sql, MySql, MVC HTML & Java Script, ADO.Net","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Cevious Technologies (Pvt) Limited, Plot No 11A, 2nd Floor, Savitri Nagar, New Delhi - 110017 (Nearest Metro: Pancheela Park)","phone":"Not Provided","profile":"Software Developer (.Net/ SQL) \nCevious Technologies (Pvt) Limited","description":".NET Developer required with good command over SQL and Database To work on ERP& CRM application on .NET/ SQL for window based modules and ASP.NET with C# for ASP .Net, .Net Core API Integration & Development with Other Application, Business Intelligence Developement, Crystal Report/ Dashboard Designing, Data Minning. Expertise in ASP .Net, C#, MS Sql, MySql, MVC HTML & Java Script, ADO .Net JQuery ,Windows Application, Web/ Web service, WCF, MVC, WPF, Web forms Fresher also Apply Must have strong knowledge of OOPs Good knowledge of SQL server Ajax & Controls, XML ERP/CRM exp. would be added advantage. Data Warehousing Analysis & Minning Walk-in Date/ Time: 24th June - 29th June , 10 AM onwards Interview Venue: Cevious Technologies (Pvt) Limited Plot No 11A, 2nd Floor, Savitri Nagar, New Delhi - 110017 (Nearest Metro: Pancheela Park)","location":"Delhi","experience":"0 - 2 Years"},{"date":"25, 26 - Jun - 2019","skills":"ASP .Net, MVC, WCF, JQuery, HTML, Ajax, Javascript, NUnit","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Service Master Clean Limited, Plot no. 11, 1st floor, DDA Community Center, Okhla Phase 1, New Delhi","phone":"9555666997","profile":"Software Developer (.Net) \nSecurity & Intelligence Services (India) Ltd.","description":"Candidate should have 3 to 8 years of strong experience in Software Development using .Net, VB.Net, C#, SQL Server 2008 R2, Crystal report , AJAX, Boot Strap, J-Query, Rest API. Should have excellent analytical skills and be process oriented. Good Communications skills and conversant with development and Change Request methodologies. It is expected that the candidate also has reasonable knowledge on common business processes mainly invoicing, payroll, Emp data management etc. Walk-in Date/ Time: 25th June - 26th June , 11 AM onwards Interview Venue: Service Master Clean Limited, Plot no. 11, 1st floor, DDA Community Center, Okhla Phase 1, New Delhi","location":"Delhi","experience":"3 - 8 Years"},{"date":"24, 25, 26, 27, 28 - Jun - 2019","skills":".Net, .NET Framework, ASP .Net, WPF","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"AppExpert Technology Private Limited, 509, 5th Floor, The Business Hub, Plot No 2C, Sector-14, Seemant Vihar, Kaushambi, Ghaziabad - 201 010","phone":"Not Provided","profile":"Junior .Net Programmer \nAppExpert Technology Pvt. Limited","description":"# Candidate must have done training from any institute of dot net of 3-6 months. # Knowledge of C# and Dot net Framework. # Should have strong analytical ,logical thinking and problem solving skills # Freshers can apply Walk-in Date/ Time: 24th June - 28th June , 11 AM onwards Interview Venue: AppExpert Technology Private Limited 509, 5th Floor, The Business Hub, Plot No 2C, Sector-14, Seemant Vihar, Kaushambi, Ghaziabad - 201 010","location":"Delhi, Ghaziabad","experience":"0 - 2 Years"},{"date":"24, 25, 26 - Jun - 2019","skills":"Java, J2EE, Spring, Hibernate, Struts, SDLC phases","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Adjetter Media Network Private Limited, Sas Veer' Building, 3 M-123/A, East of NGEF Layout Kasturi Nagar, Bangalore - 560 043","phone":"9538299910","profile":"PHP/ WEB Developers \nAdjetter Media Network Private Limited","description":"Candidates with minimum 2 Years will be preferred. (Hands on experience for below technologies is important) In depth knowledge in LAMP technology. Technical proficiency required with the following: Linux / Apache web servers, PHP, MySQL Hands on experience with PHP frameworks such as Laravel, Codeigniter & Magento Basic proficiency with Front-end technologies such as JavaScript/jQuery, HTML and CSS Self-starter and should be able to learn new techniques/platforms quickly Responsibilities and Duties: Strong understanding of semantic HTML / HTML5, CSS / CSS3. Know the ins and outs of jQuery/Javascript. Experience in frameworks like Bootstrap. Someone who visits sites like siteinspire, CSS tricks, smashing magazine, codrops on daily basis. Knowledge of PHP, Wordpress and MySQL. Should collaborate with design team to come up with UI/ UX design. Walk-in Date/ Time: 24th - 26th June , 11 AM onwards Interview Venue: Adjetter Media Network Private Limited, Sas Veer' Building, 3 M-123/A, East of NGEF Layout Kasturi Nagar, Bangalore - 560 043","location":"Bangalore","experience":"2 - 5 Years"},{"date":"27, 28 - Jun - 2019","skills":"PHP, MySQL, HTML, CSS, JavaScript, AJAX, and JQuery etc","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Top Office Pros Business Services Pvt. Limited, 17th Floor, Greenscape Cyber One, Sector 30 A, Behind Odisha Bhavan, Vashi, Navi Mumbai - 400 703","phone":"7045135737","profile":"Senior PHP Developer \nTop Office Pros Business Services Pvt. Limited","description":"Candidate should have 4+ years of experience in developing web application on Magento And Shopify Expert in the LAMP platform (PHP, MySQL) and well versed with HTML, CSS, JavaScript, AJAX, and JQuery etc. Pro-Active and good analytical skills Adapt and integrate new and upcoming methods/ framework in web development Integrate various releases of APIs Create/ Customize WordPress themes and plugins Develop full-fledged LAMP Stack web applications -JS, PHP, CSS3/ HTML5 Lead custom WordPress Walk-in Date: 27th - 28th June 2019 Time: 11:00 AM to 5:00 PM Interview Venue: Top Office Pros Business Services Pvt. Limited 17th Floor, Greenscape Cyber One, Sector 30 A, Behind Odisha Bhavan, Vashi, Navi Mumbai - 400 703 Contact Person: Swati Awasthi (HR Manager) Tel: 7045135737","location":"Mumbai","experience":"4 - 8 Years"},{"date":"23, 24, 25, 26, 27, 28 - Jun - 2019","skills":"PHP, MySQL, HTML, CSS, Javascript etc.","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Vega Moon Technologies, 111, 112, 112 (B), Vishal Tower, District Centre, Janak Puri, New Delhi - 110 058","phone":"011-49879877","profile":"PHP Developer \nVega Moon Technologies","description":"We are looking for PHP Developers with a zeal of writing code. We are hiring for multiple vacancies from experiences 1 to 5 years. Requirements: 1. Strong programming and technical PHP, MySQL skills. 2. Proven software development experience in PHP 3. Experience with web services and MVC frameworks. 4. Demonstrable knowledge of web technologies including HTML, CSS, Javascript etc. 5. Good knowledge of relational databases, version control tools and of developing web services 6. Extensive Knowledge in Payment Gateway APIs 7. Knowledge of Magento and Zend Framework an added bonus. Walk-in Date/Time: 22nd June - 30th June , 10 AM onwards Interview Venue: Vega Moon Technologies 111-12 Vishal Tower, District Centre, Janakpuri, New Delhi - 110 058","location":"Delhi","experience":"1 - 5 Years"},{"date":"29 - Jun - 2019","skills":"PHP web frameworks Laravel, CodeIgniter, Zend, Javascript, CakePHP","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Impiger Technologies Private Limited, Sudhama Commercial Building 2nd Floor, No. 36, Vijayaraghava Road, T-Nagar, Chennai - 600 017","phone":"Not Provided","profile":"PHP Developer \nImpiger Technologies Private Limited","description":"Impiger Technologies Private Limited is looking for candidates with following skills: Strong knowledge of PHP web frameworks Laravel, CodeIgniter, Zend, Javascript, CakePHP Advanced level of knowledge in PHP, exposure to a database MySQL or equivalent Expert level HTML, CSS. Walk-in Date/ Time: 29th June 2019, 8 AM onwards Interview Venue: Impiger Technologies Private Limited Sudhama Commercial Building 2nd Floor, No. 36, Vijayaraghava Road, T-Nagar, Chennai - 600 017","location":"Chennai","experience":"2 - 4 Years"},{"date":"24, 25, 26, 27, 28 - Jun - 2019","skills":"Core PHP, MySQL, Bootstrap, MVC Architecture","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Digi Style, D-244,Second Floor, Sector-10, Noida. Near Swani Furniture","phone":"Not Provided","profile":"PHP Developer \nDigi Style","description":"Experience: 2 to 4 Years Strong understanding and hold on working with Core PHP. Excellent knowledge about Core PHP, MySQL, Bootstrap Excellent command on PHP and MySQL using MVC Architecture. Expertise on PHP based framework like: codeigniter, laravel, etc Required Skills: Ability to adjust schedules to meet deadlines will be crucial. Must be self-motivated and take responsibilities for his/her own deliverables. Excellent written and verbal communication skills Ability to manage multiple projects & lead the development effort while meeting deadlines and maintaining high-quality results Good analytical, reasoning, logical and troubleshooting skills Walk-in Date/ Time: 24th - 28th June , 11 AM onwards Interview Venue: Digi Style D-244,2nd Floor Sector 10 Noida - 201 301 (Near Swani Furniture) Nearest Metro Station sector 16","location":"Noida","experience":"2 - 4 Years"},{"date":"25, 26, 27, 28, 29 - Jun - 2019","skills":"PHP, WordPress/ Joomla/ Drupal","qualification":"B.E./B.Tech, B.Sc, BCA/BCS","address":"AISCOR Private Limited, Office No. 202, Suratwala Mark Plazzo, Opposite Hinjewadi Reliance Digital, Hinjewadi, Pune - 411 057","phone":"8555884622","profile":"Web/ PHP Developer \nAISCOR Private Limited","description":"Candidate should have Experience working with WordPress/ Joomla/ Drupal is must Extensive strong working knowledge and experience in PHP and CMS Application Developments and Responsive Designs. Theme development and plugin implementation is a plus Knowledge of Shopify, Wix, Squarespace and Weebly is a plus Good skills and knowledge of Ajax, JScript, Jquery, Json and HTML 5 & CSS3 Better to have Experience/ Knowledge working in Agile Methodology/ Environments Knowledge in MVC Frameworks is a plus Extensive experience writing high quality code or programming and development while applying new techniques to meet business and project goals is crucial Good Documentation skills and matching code with design solutions that are easy to manage, maintain, customize (themes/ layouts) and configure Ensuring overall responsibilities: reliability, security, availability and high-performance code of solutions Walk-in Date: 25th - 18th July 2019 Timing: 11AM to 4PM Interview Venue: Office No. 202, Suratwala Mark Plazzo, Opposite Hinjewadi Reliance Digital, Hinjewadi, Pune - 411 057 Contact No. +91 8555884622","location":"Pune","experience":"1 - 2 Years"},{"date":"24, 25, 26, 27, 28, 29 - Jun - 2019","skills":"PHP/ MySQL, OOPS, HTML, Javascript, CSS, Ajax, JQuery","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Biz Technologies Private Limited, 412, Gundecha Industrial Complex, Akurli Road Near Big Bazar, Kandivali (East) Mumbai - 400 101","phone":"7506689297","profile":"PHP/ Hybrid Developers (Fresher) \nBiz Technologies Private Limited","description":"We are looking for Strong fundamentals in OOPS, MySQL, HTML, CSS, JavaScript, Jquery, Ajax, CorePHP. using ionic and React.js, Angular JS. Walk-in Date/ Time: 24th - 29th June, 12 PM onwards Interview Venue: Biz Technologies Private Limited 412, Gundecha Industrial Complex, Akurli Road Near Big Bazar, Kandivali (East) Mumbai - 400 101","location":"Mumbai","experience":"0 - 2 Years"},{"date":"23 - Jun - 2019","skills":"C# .NET, WinForms .NET and or ASP .NET, ASP .Net Web Services, WCF, ADO.Net, .Net console apps","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Veridic Technologies Private Limited, Ground Floor, Plot No J7, Rajiv Gandhi IT Park, Chandigarh","phone":"7517727101","profile":"Senior .Net Developer \nVeridic Technologies Private Limited","description":"We are looking for Project Leads professionals. Candidate should have Minimum 5 years of software development experience in all or most of the following technologies: C# .NET, WinForms .NET and or ASP .NET, ASP .Net Web Services, WCF, ADO.Net, .Net console apps, HTML, AJAX, JavaScript, XML. Exceptionally talented people with less experience may be considered. Experience in .Net design patterns preferred. Knowledge of MVC, Node.Js, Jquery, WebAPI & MySQL will be a big plus. Experience with designing relational databases, programming SQL queries in SQL Server. Experience in SSRS will be a big plus. In-depth knowledge of object oriented programming. Good verbal and written communication skills. Should be experienced in client communication (Both verbal and written) Should be experience in handling and mentoring teams. Should be sufficiently hands on in programming. Walk-in Date/ Time: 23rd June 2019, 9 AM onwards Interview venue: Veridic Technologies Private Limited Ground Floor, Plot No J7, Rajiv Gandhi IT Park, Chandigarh Tel: 7307968008 7307968009 7517727101","location":"Chandigarh","experience":"5 - 7 Years"},{"date":"20, 21, 22, 24, 25, 26 - Jun - 2019","skills":"Office Management, General Administration, Facility Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Kadamba Technologies Private Limited, 2nd Floor, Citadle, Dr. Radhakrishnan Salai, Mylapore,Chennai - 600 004","phone":"044 28476020","profile":"Administration Executive \nKadamba Technologies Private Ltd","description":"Walk-in drive for Admin Executive (Male) @ Kadamba Technologies, Chennai from 20th to 26th June 2019. Handle complete facility department, allocate and monitor the work done by Electricians, House Keeping Staff, Front Office Executive and Office Assistant, Responsible for handling Canteen and Transportation Facilities. -Ensuring continuous supply of power to production. -Allocation of jobs to electrical/ civil vendors. -Scheduling of preventive maintenance of utilities. -To take backups as per schedule. -Ensure physical security is as per guidelines and ensure training of new security person. -Evaluation of vendors and service providers. If interested, Please revert back with your updated CV along with the below mentioned details on jobs@kadamba.com Full Name (As on Passport): Date of Birth: Total Experience: Relevant Experience: Current location: Preferred location: Current CTC: Expected CTC: Notice period (Short Notice is highly preferred): Reason for change:","location":"Chennai","experience":"1 - 3 Years"},{"date":"22 - Jun - 2019","skills":"Core Java Spring, Hibernate Framework, Java J2EE, Maven, JSP, Web Services","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Tieto India Private Limited, Wing 1, Cluster D, EON Free Zone, Plot No. 1, Survery # 77, MIDC, Kharadi Knowledge Park, Pune - 411 014","phone":"Not Provided","profile":"Java Developers \nTieto India Private Limited","description":"Candidate should be BE/ B.Tech (CS/ IT) with very strong knolwdge/ experience on Core Java Spring, Hibernate Framework, Java J2EE, Maven, JSP, Web Services (SOAP), JavaScript, XML. Muts have good hold on SQL queries & working knowledge on Junit Walk-in Date/ Time: 22nd June 2019, 9 AM onwards Interview Venue: Tieto India Private Limited Wing 1, Cluster D, EON Free Zone, Plot No. 1, Survery # 77, MIDC, Kharadi Knowledge Park, Pune - 411 014","location":"Pune","experience":"3 - 6 Years"},{"date":"20, 21 - Jun - 2019","skills":"Android Studio, Java, Ndk Android SDK, SQLite, Appcelerator, Sencha, Eclipse","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Smart Energy Water Private Limited, Logic Cyber Park (Tower A), C-28 & 29, 6th Floor, Sector-62, Noida","phone":"9315367835","profile":"Android Developer - Java \nSmart Energy Water Private Limited","description":"Candidate should have 2 to 4 years of experience developing mobile apps. Have an Experience in developing native Android apps (depth knowledge of Android SDK, NDK). Must have indepth knowledge of SQLite. Excellent in Java development and debugging skills. Expert in using Eclipse SDE, Ant and ADB shell. Developing universal application, which can run on most of available android devices. Must have good understanding of Object-Oriented Programming Good eye for mobile app design and product sense Experience in cross platform Tools like Appcelerator/ Sencha/ PhoneGap would be a plus Internally motivated, able to work proficiently both independently and in a team environment. Good communication skills with both internal team members and external business stakeholders. Strong initiative to find ways to improve solutions, systems, and processes. Experience of working on Android Studio. Good in data structure and Algorithms. Walk-in Date/ Time: 20th - 21st June from 10 AM onwards Venue: Smart Energy Water Private Limited Logic Cyber Park (Tower A), C-28 & 29, 6th Floor, Sector-62, Noida","location":"Noida","experience":"2 - 4 Years"},{"date":"20, 21 - Jun - 2019","skills":"Telecalling calling, Business Development, Lead Generation, Office Coordination, Administration","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"BSE Institute Limited, 19th Floor, P.J. Towers, Dalal Street, Fort, Mumbai - 400 001","phone":"Not Provided","profile":"Admin/ Course Coordinator \nBSE Institute Limited","description":"Currently we have an excellent opportunity with BSE Institute Limited 1) Course Coordinator - Schedule batch Students handling Arrange faculty for batches (co-ordinate) Batch file tracking Exam coordination Certificate arrangement Coordinate for student activities 2) Counsellor - Counsel Students, Understand their Profile offering/suggesting courses to them. Achieving Targets. MIS preparation Students relation & Rapport building. To maintain Records. Handling walk-in enquiries, telephonic enquiries & email enquiries. Responsible for academic counselling for prospective learners and their parents. Capture student profile. 3) Telecaller - Making inbound and outbound calls, handling customer queries and ability to provide information verbally, clearly and effectively. Making outbound calls guiding the students for admission Counseling students for the International courses available in various universities abroad. Preparing daily reports and MIS Candidate should be Any Graduate with 1-3 years experience. Candidate with good communication skills can apply. Freshers are also welcomed. Interviews on 20th & 21st June 2019. Address: BSE Institute Limited, 19th Floor, P.J. Towers, Dalal Street, Fort, Mumbai - 400 001 Kindly carry your resume and govt Id proof.","location":"Mumbai","experience":"0 - 3 Years"},{"date":"20, 21, 22 - Jun - 2019","skills":"Technical Support, Customer Service, Customer Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Spider Software Private Limited, 4th Floor, Ojas International Business Center, West Patel Nagar, near Shadipur Metro Pillar No. 231, New Delhi - 110 008","phone":"Not Provided","profile":"Technical Support Executive \nSpider Software Private Limited","description":"Candidate should be Any Graduate (Compulsory) Age limit is upto 28 years Only male can apply Good communication required Fresher's & Experienced both can apply Job Responsbility- Responsible for giving training to the clients Diagnose and troubleshoot technical issues Help in Query building Solve client issues and doubts Candidates will get an opportunity to understand about Stock Market & Technical Analysis Software Walk-in Date/ Time: 20th - 22nd June , 10 AM onwards Interview Venue: Spider Software Private Limited 4th Floor, Ojas International Business Center, West Patel Nagar, near Shadipur Metro Pillar No. 231, New Delhi - 110 008","location":"Delhi","experience":"0 - 2 Years"},{"date":"22 - Jun - 2019","skills":"Service Desk/ Technical Support (Voice)","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Allianz Technology SE, Thejaswini Building, Technopark, Trivandrum, Kerala - 695 581","phone":"Not Provided","profile":"Technical Support/ Service Desk \nAllianz Technology SE","description":"Candidate should have 2-4 years of experience in Service Desk/ Technical Support (Voice) Excellent written and verbal communication skills Provision of remote desktop support to all customers Must be a good team player Customer Centric Job Responsbility- IT Support of all office, overseas and home based customers who use a broad variety of mainstream and bespoke applications on Windows 10, Windows 7 operating system. Assignment of calls/ requests/ incidents to internal and external support teams where calls cannot be fixed by the Service Desk Maintenance of 75% first line fix rate Call, Incident, Request and Desktop Management through logging, escalation and resolution using Service Now and remote support tools Raising accurate tickets In the CRM Tool (Service Now) Incident management encompassing incidents assigned to other support teams Setting customer expectation by allocating an appropriate priority to an incident Walk-in Date/ Time: 22nd June 2019, 9 AM onwards Interview Venue: Allianz Technology SE, Thejaswini Building, Technopark, Trivandrum, Kerala - 695 581","location":"Trivandrum","experience":"2 - 4 Years"},{"date":"22, 23 - Jun - 2019","skills":"Technical Support, Service Desk, Desktop Support, End User Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Microland Limited, (Ground Floor, No. 6 & 7, Palm Court, Bata Chowk, Sector 14, GURGAON, Haryana - 122 001","phone":"Not Provided","profile":"Technical Support Engineer \nMicroland Limited","description":"Candidate should have at least 4 year experience in team handling of Service Desk. To respond to the incidents /problem/ change reported by Customer predominantly through Voice Interaction and also through email, chat and web portal. Log Tickets in the call-logging tool on behalf of users Experience in the domain of voice technical support/ Service Desk is must Knowledge in International service delivery standards such as ITIL, eSCM or CMMi Excellent verbal & written communication - Interpersonal skills Should be able to drive customer experience via HD support Walk-in Date : 22nd & 23rd June 2019 Time: 10:00 AM - 2:00 PM Interview Venue: Microland Limited, (Ground Floor, No. 6 & 7, Palm Court, Bata Chowk, Sector 14, GURGAON, Haryana - 122 001","location":"Gurgaon","experience":"4 - 7 Years"},{"date":"22 - Jun - 2019","skills":"Technical Support, Application Server / Webserver.","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Financial Software & Systems Pvt. Limited, 1st Floor, Plot No. D 1, Kalpataru Prime IT Park, Road No. 16, Wagle Industrial Estate-Thane West, Thane - 400 604, Midc","phone":"Not Provided","profile":"Technical Support Engineer \nFinancial Software & Systems Pvt. Limited","description":"Qualification: Any Graduate Work Experience: 1 to 6 years Location - Mumbai (Central & Harbour location) Good to have worked on Application Server/ Webserver Good communication and Analytical skills Knowledge of basic either of the languages JSP, ASP .Net, PHP and Java. Preferably Has good functional knowledge PG. Job Responsbility- L1 & L2 Support: Manage support for Merchant Integration end to end with PG application and track the issues to closure. Responsible for communication with Merchant for Integration queries.Responsible for resolving escalated Merchant Integration issues to closure. Responsible for analyzing the Integration issues on different platforms. Interested candidates please walk-in for the interview on Saturday, 22 June 2019 between 9 AM to 3 PM along with below documents. Hard copy of the resume Last 3 months pay slip Current company offer letter or increment letter 2 Passport Size Photo Address- Financial Software & Systems Pvt. Limited 1st Floor, Plot No. D 1, Kalpataru Prime IT Park, Road No. 16, Wagle Industrial Estate-Thane West, Thane - 400 604, Midc Contact Person: Gagandeep","location":"Mumbai","experience":"1 - 6 Years"},{"date":"22 - Jun - 2019","skills":"Software Testing Automation Testing Test Engineering Web Application Testing","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Kefi Tech Solutions Private Limited, Module D1, Ground Floor, Periyar Building, Phase 1, Technopark Campus Trivandrum, Kerala","phone":"Not Provided","profile":"Testing Engineer - Freshers \nKefi Tech Solutions Private Limited","description":"We invite freshers those who have good programming skills and interest in doing mobile and web application testing. Diagnose issues, report defects, and perform regression tests to discover recurrences. Demonstrate a can-do attitude and should handle all tasks assigned to him/ her effectively Must have done any course in Software testing. Knowledge in both manual and Automation testing. Should have knowledge of SDLC/STLC Graduates who can join immediately will be preferred. Willing to work in flexible shift Walk-in Date/ Time: 22nd June 2019, 9 AM onwards Interview Venue: Kefi Tech Solutions Private Limited, Module D1, Ground Floor, Periyar Building, Phase 1, Technopark Campus Trivandrum, Kerala NB: Those who had gone through any kind of interview process in Kefi Tech Solutions within 6 months are not eligible for this post.","location":"Trivandrum","experience":"0 - 1 Years"},{"date":"20, 21, 22 - Jun - 2019","skills":"Technical Support, International Voice Process, Customer Service","qualification":"B.Sc, BCA/BCS, B.E./B.Tech, B.A., B.Com, B.B.A, B.Sc","address":"Sutherland Global Services Pvt. Limited, No. 45 A, Velachery Main Road, Vijayanagaram, Chennai 600 042. Landmark : Vijayanagar bus stop & Opposite to Prasanth Hospital","phone":"9384013608","profile":"Technical Support (Voice Process) \nSutherland Global Services Pvt. Limited","description":"We have exciting opportunities for Candidates with Experience for International Voice Process (Technical Support ) Roles & Responsibilities: Assist customers with any Malware, Virus, Hardware related issues. Answer Phone to respond to customer inquires and troubleshoot for any Malware issues Assist customers with installation / uninstallation of antivirus products. Assist customers with product configuration, error messages & / or common issues Project a professional company image through phone interaction Provide customers with product and service information Transfer the customer appropriate department if required Eligibility: Candidates with minimum 6 months of Technical support International voice experience can apply Required Skills: Must be able to communicate fluently in English . Looking for both UG/PG .(in any discipline). Candidates with experience in Customer support / Technical Support can apply. Aspirants with good Tech knowledge and basic windows concept. Benefits : Cab facilities (Within the boundary limits) Excellent Growth Huge Incentives Looking for people who are flexible to work in any shift timings (pre-dominantely nights) Age not above 32 years Walk-in directly or call me @ 9384013608 (Reshma HR) Walkin Dates : 20th to 22nd June 2019 Interview Time : 12 pm to 4 pm Interview Venue: Sutherland Global Services Pvt. Limited No : 45 A, Velachery Main Road, Vijayanagaram, Chennai 600 042. Landmark : Vijayanagar bus stop & Opposite to Prasanth Hospital Reference ID : Reshma -HR [Write on top of your resume] Carry your ID proof for security clearance and don't carry any gadgets like Laptop, pendrive, etc","location":"Chennai","experience":"0 - 5 Years"},{"date":"22 - Jun - 2019","skills":"Manual Testing, Automation Testing, Selenium, SDET, Bug Life Cycle, Functional Testing","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Ness Digital Engineering, I & II Floor, Maximus 2A, Raheja MindSpace, Hitech City, Madhapur, Hyderabad.","phone":"Not Provided","profile":"Software Testing Engineer \nNess Technologies (India) Pvt. Limited","description":"3-8 years experience in Automation Testing using Selenium Java & Cucumber framework (mandatory) Extensively involved in Manual Testing and Automated Testing Experience in Functional Testing, Back-end Testing, Regression Testing, and Installation Testing Experience in Design, development and executing Test Cases Good Exposure to Testing Life Cycle and Bug Life Cycle Good knowledge in Software Development Life Cycle (SDLC) and Software Testing Life Cycle (STLC) Skill in understanding Requirement Specification and identifying all possible Scenarios Experience in Designing and executing the automation scripts using Selenium Coordinating the Testing activities with Development Team Team player with Good communication and inter personal skills Interested please share updated resume to ragapujitha.vayigandla@ness.com with the below details: Current CTC: Expected CTC:","location":"Hyderabad","experience":"3 - 8 Years"},{"date":"21, 22, 24, 25, 26, 27, 28 - Jun - 2019","skills":"Technical Support, Service Desk, International Voice","qualification":"B.Sc, BCA/BCS, B.E./B.Tech, Diploma, B.A., B.Com, B.B.A, B.Sc","address":"Mphasis Limited, Eon Cluster C: Wing 2, Ground Floor, Kharadi Infrastructure Pvt. Ltd.: SEZ, Plot No. 1, Survey 77, MIDC, Kharadi, Pune - 411 014","phone":"8975910700","profile":"Technical Support Engineer \nMphasis Limited","description":"Eligibility Criteria: Any Graduate / Under Graduate 10+2+3 Diploma 1 to 3 years of experience in service desk/International voice Knowledge of ticketing tool.Must have knowledge of CITRIX, Office 365 and VPN.. Required Skills: Excellent Communication skills (Written & Verbal) Good Analytical, logical and reasoning skills Computer Fundamentals Good keyboard skills needs to be able to toggle between many screens with speed and needs to be able to type with speed and accuracy. Need Immediate joiners.. Walk-in Date/ Time: 18th June - 28th June from 9 AM onwards Interview Venue: Eon Cluster C: Wing 2, Ground Floor, Kharadi Infrastructure Pvt. Ltd.: SEZ, Plot No. 1, Survey 77, MIDC, Kharadi, Pune - 411 014 You can also call on 8975910700 or email your resume on Suwartik.ramraje@mphasis.com","location":"Pune","experience":"1 - 3 Years"},{"date":"21, 22, 24, 25, 26, 27, 28, 29 - Jun - 2019","skills":"technical support service desk networking itil remote desktop","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Tech Mahindra Campus, Plot- 45-47, Gate 1, ITC-4, (Abdul Kalam Building) KIADB Industrial Area, Electronic city, Phase -2 Bangalore - 560 100","phone":"9663588011","profile":"Technical Support Engineer \nTech Mahindra Limited","description":"Qualification: Any Graduate/ Post Graduate Work Experience: 0.6 to 2 Years Location: Electronic City Phase 2 Joining: Immediate (7 days 15 days) Responsibilities Act as a single point of contact for phone calls, emails and tickets from end users regarding IT issues and queries Receiving, logging and managing queries/issues from end users via telephone and emails Incident logging, categorization, prioritization, assignment, coordination and communication until resolution for low priority incidents affecting a single user (P3 P4) Incident communication and notification for high priority incidents (P1 P2) Coordination with application and infrastructure support teams Provide accurate Incident resolution and Service Request management, within established Service Level Agreement (SLA) and Operating Level Agreement (OLA) time frames, meeting or exceeding customers requirements and expectations Walk-in Date/ Time: 21st June - 31st July , 10 AM onwards Interview Venue: Tech Mahindra Campus, Plot- 45-47, Gate 1, ITC-4, (Abdul Kalam Building) KIADB Industrial Area, Electronic city, Phase -2 Bangalore - 560 100 Contact No: 9663588011","location":"Bangalore","experience":"1 - 2 Years"},{"date":"21, 22 - Jun - 2019","skills":"General Administration, HR Generalist, Human Resource/ Recruitment, Staffing","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Ina Elite Hospitality Private Limited, Sasya Homes, HSR Layout Sector No. 6, 9th Main, 13th Cross Bangalore","phone":"9742848880","profile":"HR & Admin Executive \nIna Elite Hospitality Private Limited","description":"Candidate should be Any Graduate/ MBA (HR) with 1 to 3 years of experience in General Administration, HR Generalist, Human Resource/ Recruitment, Staffing. Must have excellent communication skills Walk-in Date/ Time: 21st - 22nd June , 9 AM onwards Interview Venue: Ina Elite Hospitality Private Limited Sasya Homes, HSR Layout Sector No. 6, 9th Main, 13th Cross Bangalore Landmark: Indigo XP HSR Layout Same building 3rd floor","location":"Bangalore","experience":"1 - 3 Years"},{"date":"22 - Jun - 2019","skills":"Java, Spring & SQL / Oracle Database","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"GAVS Technologies Private Limited, Old No. 11, New No.13, Rajiv Gandhi Salai (OMR) Sholinganallur Chennai, Tamilnadu - 600 119","phone":"Not Provided","profile":"Java Developer \nGAVS Technologies Private Limited","description":"We at Gavs are looking out for Java Developers with good experience in Java, Spring & SQL / Oracle Database. Interested candidates can come for a f2f discussion on 22 June [Saturday], anytime between 10 am & 1 pm. Experience: 3 -10 years Should have minimum 2+ years of experience in Java Development Good experience on Java J2EE, Spring, Hibernate, Databases Knowledge in CSS, JavaScript [either AngularJS / ReactJS / NodeJS] Walk-in Date/ Time: 22nd June 2019, 10 AM onwards Interview Venue: GAVS Technologies Private Limited No: 11, Old Mahabalipuram Road, Sholinganallur, Chennai - 600 119 Landmark: Opp to Gateway Hotel/ Dollar Bus Stop","location":"Chennai","experience":"3 - 8 Years"},{"date":"22 - Jun - 2019","skills":"Java, J2EE, Collections, Spring MVC, Spring Boot, Hibernate, JSP, AJAX, Jquery, MySQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Oodles Technologies Private Limited, Unit no. 951, 9th Floor, Tower B1 Spaze I-tech Park, Sector 49, Gurugram.","phone":"8851333875","profile":"Java Developer/ Freshers \nOodles Technologies Private Limited","description":"Oodles Technologies Private Limited, is Looking for candidates who got trained in Java, J2EE, Spring, Hibernate. Qualification: B.Tech, M.Tech, MCA 2017, 2018, 2019 Pass outs Work Experience: Fresher Job Location: Gurgaon Technical Skills: Java, J2EE, Collections, Spring MVC, Spring Boot, Hibernate, JSP, AJAX, Jquery, MySQL Candidate should have good knowledge of Java Fundamentals, Operators, Data Types, OOPs Concept, Collection, Data structure, Design Patterns, Exception Handling, Threads, Graph, REST. Should have knowledge of Spring and Hibernate. Knowledge of Designing Spring boot Microservices. Walk-in Date/ Time: 22nd June , 9 AM onwards Interview Venue: Oodles Technologies Private Limited Unit no. 951, 9th Floor, Tower B1 Spaze I-tech Park, Sector 49, Gurugram. Nearest Metro Station- Huda City Centre","location":"Gurgaon","experience":"0 - 1 Years"},{"date":"22 - Jun - 2019","skills":"javascript spring css jsp servlets html junit maven jquery","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Coditas Technologies Pvt. Limited, 3rd Floor, Gaia Apex, S. No. 33/2D, Clover Park, Viman Nagar, Pune, Maharashtra - 411 014","phone":"Not Provided","profile":"Java Developers \nCoditas Technologies Pvt. Limited","description":"Mandatory Skills: Excellent in OOPS concepts, system design Strong knowledge of Core Java, Spring and Hibernate Hands on experience in DB design, SQL, UI Technologies like HTML/CSS, JavaScript, jQuery etc. Good knowledge of design patterns Preferred Skills: Excellent knowledge of JSP, Servlets, WebServices, JUnit Experience in Agile software development Familiarity with JIRA, GIT, Maven Role & Responsibilities: Design and develop features using Java, Spring and Hibernate Ability to design database schema, develop views and stored procedures Participate in user story grooming, design discussions and propose solutions Maintain existing software systems by identifying and correcting software defects Practice standard development process leveraging agile methodologies such as SCRUM and TDD Review and analyse business requirements and provide technical feasibility and estimates Manage development / support functions Mentor junior team members, perform code reviews, technical guidance etc. Desired: Experience in working directly with the client Involvement in Requirements gathering, analysis and designing Soft Skills: Excellent written and verbal communication and client facing skills. Exceptionally good in analytical and problem-solving skills. Ability to quickly grasp new concepts, learn new technologies Should be a self-motivated, independent, detail oriented, responsible team player. Walk-in Date/ Time: 22nd June 2019, 10 AM onwards Interview Venue: Coditas Technologies Pvt. Limited 3rd Floor, Gaia Apex, S. No. 33/2D, Clover Park, Viman Nagar, Pune, Maharashtra - 411 014","location":"Pune","experience":"1 - 6 Years"},{"date":"22 - Jun - 2019","skills":"Core Java, Advanced Java, (Springs, Struts, Hibernate, Web Services)","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Avila IT Solutions Private Limited, indiqube Plot # 19/4 & 27, Junction, Village, Varthur Hobli, Outer Ring Rd, Kadubeesanahalli, Panathur, Bengaluru - 560 103","phone":"7019050383","profile":"Java Developers \nAvila IT Solutions Private Limited","description":"Walk-In Drive for 2 to 8 with Java Developers on 22nd June 2019 Employment Type: Permanent Job, Full Time Company : Avila It Solution Pvt Ltd Job Location : Bangalore Education : BE/ B.TECH/ MCA/ M.TECH (2017/ 2018 Passout only) Eligibility : Above 60% in UG, PG, 12th and 10th Key Skills Core Java, Advanced Java, (Springs, Struts, Hibernate, Web Services are preferable) Date of Interview : 15th 16th JUne 2019 Time : 10.00 AM to 5.00 PM Interview Venue: Avila IT Solutions Private Limited indiqube Plot # 19/4 & 27, Junction, Village, Varthur Hobli, Outer Ring Rd, Kadubeesanahalli, Panathur, Bengaluru - 560 103 Landmark: Kadubisanahalli Stop, Near Nagarjuna Suits Hotel . Interested candidates can walk-in directly with a hard copy of your resume For further clarification, please contact 7019050383 ,7989172527.","location":"Bangalore","experience":"2 - 8 Years"},{"date":"22 - Jun - 2019","skills":"ASP .NET, C#, MS SQL and JQUERY","qualification":"B.E./B.Tech, MCA/PGDCA","address":"UHG Phoenix Infocity Private Limited, SEZ, Building No. H06, First Floor, Hitech City 2 Gachibowli (V), Hyderabad - 500 032","phone":"Not Provided","profile":"Big Data/ Java Developer \nOptum Global Solutions (India) Pvt. Limited","description":"Candidate meeting below eligibility criteria may appear for the selection process as per mentioned schedule Qualification : BE/ B.Tech/ MCA Experience : 3 -10 Years Job Location : Hyderabad/ Gurgaon Mandatory Skills: Experience with Big Data technologies such as Hadoop (HDFS), Hive, Spark, and Kafka Should have development experience with Java/ Scala Must Map Reduce, Spark/scala, streaming (Kafka/ Spark etc.), hive, Hbase, no SQL DB Casandra, MySQL etc, scheduling Oozie, Hue etc. Preferred Skills: Kibana, Cloud (AWS, Azure etc.), Kubernetes, Openshift Experience in using modern product development tools and CI/CD, and / or DevOps Interview Date : 22nd June 2019 (Saturday) Timings : 10:00 AM - 1:00 PM Interview Venue : UHG Phoenix Infocity Private Limited SEZ, Building No. H06, First Floor, Hitech City 2 Gachibowli (V), Hyderabad - 500 032 Contact Person : Jyoti Devi (HR Team) Terms and Conditions: Please carry hard copy of resume and Govt ID prooof.","location":"Hyderabad","experience":"3 - 10 Years"},{"date":"22 - Jun - 2019","skills":"Core Java, Hibernate Spring Mvc, JSF Wicket GWT, Spring Framework","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Vyom Labs Private Limited, Sunrise Business Park, Near Cummins Campus, Balewadi Pune.","phone":"Not Provided","profile":"Core Java Developer \nVyom Labs Private Limited","description":"Candidate should have minimum 2 years experience in analysis, design and hands-on development of Core Java, Spring frame work. Hands on experience in designing and developing applications using Java EE platforms. Object Oriented analysis and design using common design patterns. Profound insight of Java and JEE internals (Classloading, Memory Management, Transaction management etc). Excellent knowledge of Relational Databases, SQL and ORM technologies (JPA2, Hibernate) Job Responsbility- Designing and developing high-volume, low-latency applications for mission-critical systems and delivering high-availability and performance Contributing in all phases of the development lifecycle Writing well designed, testable, efficient code Contribute in all phases of the development lifecycle Write well designed, testable, efficient code Ensure designs are in compliance with specifications Prepare and produce releases of software components Support continuous improvement by investigating alternatives and technologies and presenting these for architectural review Walk-in Date/ Time: 22nd June 2019, 9 AM onwards Interview Venue: Vyom Labs Private Limited Sunrise Business Park, Near Cummins Campus, Balewadi Pune.","location":"Pune","experience":"2 - 5 Years"},{"date":"22 - Jun - 2019","skills":"Core Java/ NodeJS/ AngularJS","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Maveric Systems Limited, Anchorage, #100, 5th Floor, Richmond Road, Bangalore - 560 025","phone":"Not Provided","profile":"Core Java Developer \nMaveric Systems Limited","description":"Hands on experience in Core Java/ NodeJS/ AngularJS Years of Experience - 1.8 - 2.3 Years Work Location : Richmond Road, Bangalore Walk-In Date: 22nd June 2019 Time: 9 AM to 12 PM Interview Venue: Maveric Systems Limited Anchorage, #100, 5th Floor, Richmond Road, Bangalore - 560 025 Landmark - Opposite Neelkanth Jewellers or Next building of Oriental bank of Commerce or Right next to start of fly over","location":"Bangalore","experience":"1 - 3 Years"},{"date":"21 - Jun - 2019","skills":"Core Java, JSP/ Servlet, Maven, Spring Framework, SQL Queries & Stored Procedures","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Godrej Infotech Limited, Plant 19A, 2nd floor, Pirojshanagar, Vikhroli (West), Mumbai","phone":"022-67966192","profile":"Java Developer \nGodrej Infotech Limited","description":"We have walk-in for Java Developer on 21st June 2019 position. Qualification: Any Graduation (Full time; No Diploma) Experience Required:- Within 2 to 5 Years (Not less than 2 years and not 5 or more than 5 years) Job Location: Mumbai(Vikhroli) Requisite experience: 1) Need to have good experience in PLSQL/SQL 2) Need to have good experience on JSP 3) Need to have good experience in core Java Primary Skills: 1) Must have knowledge in Core Java, JSP/ Servlet, Maven, Spring Framework. 2) MS SQl database design and writing SQL Queries & Stored Procedures. 3) Sound knowledge in HTML, CSS, AJAX and JavaScript. 4) Should be capable of doing Code Review and testing for team members. 5) Should have sound knowledge of Software Development 6) Life cycle and should be able to lead a module with 3-4 team members. Secondary Skills:- 1) Should know deployment process on application servers like Apache Tomcat/JBOSS 6 2) Have Good knowledge of Angular 2 or above. Key result areas: 1) Requirement Analysis and Design 2) Preparation of Technical specification documents Software development as per technical specifications 3) Software Testing to ensure defect-free software Following ISO procedures Walk-in details:- Date: 21st June 2019 (Friday) Timings: 9:00 am to 2:00 pm Venue: Godrej Infotech Limited Plant 19A, 2nd floor, Pirojshanagar, Vikhroli (West), Mumbai Entry from: Gate No. 4 , Godrej Petroleum, LBS Road Entry from: ( by Vehicle ) From Gate No. 7 - Eastern Express Highway Vikhroli ( East ) or Gate No. 1 - Opposite R city Mall. Vikhroli ( West ) Note: Candidates who can join immediately or within a month can be preferred","location":"Mumbai","experience":"2 - 5 Years"},{"date":"20 - Jun - 2019","skills":"Administration, Front Office Management, Reception/ Travel Desk","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Kotak Mahindra Life Insurance Company Limited, AL Samad Complex, 3rd Floor, No.3-6-12 & 13, Liberty Road, Opp. TTD Bhavan, Himayatnagar, Hyderabad - 500 029","phone":"022-66057050","profile":"Administration Executive \nKotak Life Insurance Company Limited","description":"Person should be a Graduate with minimum 6 months of work-experience Age should not be more than 28 Knowledge of Admin role is a must Must be Aware of Local language Preferences -(Only Female Candidates can apply) Candidates with experience in the below profiles will not be suitable - (Tele calling or customer care profiles (Insurance, Credit card, Holiday Selling etc), Sales background, Account Assistant/Purchase Assistant, Secretaries/Receptionists, Telephone Operators and Admin profiles from educational institutions.) Walk-in Date: 20th June 2019 Time: 11 AM - 3 PM Interview Venue: Kotak Mahindra Life Insurance Company Limited AL Samad Complex, 3rd Floor, No.3-6-12 & 13, Liberty Road, Opp. TTD Bhavan, Himayatnagar, Hyderabad - 500 029 Interviewer: Aparna Yadav Email ID- kli.jayshree-bhati@kotak.com Contact No. 022-66057050","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"21 - Jun - 2019","skills":"Administration activities like ticket booking","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Amway India Enterprises Pvt. Limited, Plot No. 84, Sector 32, Gurgaon","phone":"Not Provided","profile":"Office\\ Department Coordinator \nAmway India Enterprises Pvt. Limited","description":"Candidate should be Any Graduate with good communication skills Must be Presentable Good with Excel, PPT Job Responsbility- Administration activities like ticket booking, expense claim and other department activities Walk-in Date/ Time: 21st June 2019, 10 AM onwards Interview Venue: Amway India Enterprises Pvt. Limited Plot No. 84, Sector 32, Gurgaon Contact Person :Rishu","location":"Gurgaon","experience":"0 - 5 Years"},{"date":"19, 20, 21 - Jun - 2019","skills":"Office Administration, Front Office Management, Vendor Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Vmoksha Technologies Pvt. Limited #2799 & 2800, Srinidhi, Sector-1, 27th Main, HSR Layout, Bangalore - 560 102. Land Mark: Near Agara Flyover and Above Sony Center","phone":"080-41376325","profile":"Administration Executive \nVmoksha Technologies Pvt. Limited","description":"Qualifications: Any degree preferred. Work Experience: 2 to 4 Year Notice Period : Should be ready to join within a short notice. Behavioral Competencies: Should be presentable. Should have good interpersonal skills. Should have good communication skills Roles & Responsibilities: * Indulge in ticket booking (Airways/ Roadways etc) * Maintaining different register (For eg: courier, food coupons etc..) * Issuance of Access/ Photo id for all employees/ New Joinees * Managing the team of house keeping guys. * Vendor Management. * Drinking water procurement and follow up with the vendor. * Take quotations for various facility requirements. * Issuance and tracking first aid kit / Medicines * Gate pass issuance * Bank Account opening for new joinees and current employees * Asset checking and numbering * Other activities on an adhoc basis. Walk-in details Date & Time : June 18 - 21, 2019 between 11.00 AM to 2.00 PM Interview Venue: Vmoksha Technologies Pvt. Limited #2799 & 2800, Srinidhi, Sector-1, 27th Main, HSR Layout, Bangalore - 560 102 Land Mark: Near Agara Flyover and Above Sony Center","location":"Bangalore","experience":"2 - 4 Years"},{"date":"19, 20, 21 - Jun - 2019","skills":"General Administration, Housekeeping, Vendor Mgmt/ Bill processing, Inventory Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"RAMTeCH Software Solutions Pvt. Limited, A-6, Sector 67 Noida","phone":"Not Provided","profile":"Admin Executive (Male Only) \nRamtech Software Solutions Pvt. Limited","description":"Ramtech Software Solutions Pvt. Limited, is looking for Admin Executive profile (ONLY MALE):- Educational Qualification: Any Graduate Work Experience: 2- 4 Years Must have bike Job Responsibility- General Administration Housekeeping Vendor Mgmt/ Bill processing Inventory Management Procurement Security Management Travel Arrangement Visa Management AMC Management Walk-in Date: 18th - 21st June 2019 Timings: 10 AM - 4 PM Interview Venue: RAMTeCH Software Solutions Pvt. Limited A-6, Sector 67 Noida If interested for above position share your CV at hrd@ramtech-corp.com or please walk in for direct interview at the above mentioned venue","location":"Noida","experience":"2 - 4 Years"},{"date":"21, 22 - Jun - 2019","skills":"Back Office Assistance, General Administration","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Bharat Degree PG College for Women, Opposite Tourist Tiffin, Near Kachiguda Railway station, Kachiguda, Hyderabad.","phone":"Not Provided","profile":"Back Office Assistant \nBharat Institutions- Division of Chinta Reddy","description":"Qualification: Any Degree Age: 21-35 Years Experience: 0 to 8 Years Candidate should have good communication skills Should be well versed with MS word and MS Excel Should be proficient in typing Screening phone calls, emails, letters and personal visits Ability to communicate effectively in English, both orally and in writing Should have the knowledge & able to perform the office related activities Salary: 8,000/- to 15,000/- Job Locations: 1. Bharat Institute of Engineering & Technology (BIET) Mangalpally (V), Ibrahimpatnam (M) Hyderabad - 501510, Telengana State. 2. Bharat Institute for Degree & PG college for Women Address: 3-4-781,Opposite Tourist Hotel, Kachiguda Station Rd, Barkatpura, Kachiguda, Hyderabad, Telangana - 500 027 Please bring your updated resume with one passport size photo for Interview. Interested candidates can send your resume to mbapgrec@gmail.com Note: 1) The selected candidates should execute an Service Agreement for Min 1 year. 2) Academic Original Certificates submission is mandatory; for which an Acknowledgment receipt will be issued. Candidates who have attended Interview in last 6 months need not to Apply.","location":"Hyderabad","experience":"0 - 8 Years"},{"date":"20 - Jun - 2019","skills":"Software Testing, Test Case Execution, Test Cases","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Amazon Development Center, Taurus Bagmane Constellation Business Park (BCBP), 3rd Floor, K.R. Puram- Marathalli Ring Road, Mahadevpura, Bangalore - 560 037","phone":"Not Provided","profile":"Testing Engineer/ Fresher \nAmazon Development Centre (India) Pvt. Limited","description":"Amazon is hiring Content Test Associate for Bangalore location, this is a Full Time Role. Please find the below Job Description for the same and criteria to apply for this role. You may appear for the interview if you find yourself matching the below criteria. Eligibility: BE/ B Tech or BCA/ MCA/ BSc/ MSc are only eligible to appear for the interviews Candidate pursuing Graduation or awaiting results will not be eligible to apply Freshers / candidates with less than one year of experience into Testing Immediate Joiners preferred Interview Date: 20th June 2019 Walk-in Time: 10:30 AM - 2:00 PM Interview Venue: Amazon Development Center Taurus Bagmane Constellation Business Park (BCBP), 3rd Floor, K.R. Puram- Marathalli Ring Road, Mahadevpura, Bangalore - 560 037 Documents to Carry: 2 copies of Resume (Mandatory) Pan Card (Mandatory) Photo Copies Provisional Certificate and/or Degree Certificate (Mandatory) Photo Copies 2019 Passouts Please carry all semester mark sheets along with the internet copy of your final semester results attested by your college (Mandatory) Photo Copies Note: Candidates who have appeared for the same role in the last 6 months will not be eligible to reapply","location":"Bangalore","experience":"0 - 1 Years"},{"date":"19, 20, 21 - Jun - 2019","skills":"HR Administration","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"CZAR Technologies, No. 7C 2nd Floor, Mandi Street, Alandhur, Chennai-16","phone":"Not Provided","profile":"HR/ Admin Executive \nCzar Technologies","description":"Educational Qualification :BBA/ MBA Experience: Freshers are more preferable Should have good communication skills Preferred in consultancy Field Walk-in Date: 19th - 21st June 2109 Timing : 10.00 am to 4.00 pm Interview Venue: CZAR Technologies No. 7C 2nd Floor, Mandi Street, Alandhur, Chennai-16","location":"Chennai","experience":"0 - 1 Years"},{"date":"19, 20, 21 - Jun - 2019","skills":"Accessibility Testing, Software Testing, Manual Testing","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Mobikasa Private Limited, 354, Jagat Complex, 2nd Floor, 100 Feet Road, Ghitorni, New Delhi - 110 030","phone":"Not Specified","profile":"Accessibility Testing - Fresher \nMobikasa Private Limited","description":"Person must have good knowledge of accessibility. Knowledge of any accessibility testing tool would be considered a plus. Should have basic knowledge of software testing ethics. Good know-how of and familiar with e-commerce websites and apps. Must have excellent communication skills Understand & Analyze Business, Functional & Technical requirements of the project Must be open to work in night shift Openings: 7 Walk-in Date: 19th - 21st June 2019 Time: 3 pm to 5 pm Interview Venue: Mobikasa Private Limited 354, Jagat Complex, 2nd floor, 100 Feet Road, Ghitorni, New Delhi - 110 030","location":"Delhi","experience":"0 - 1 Years"},{"date":"22 - Jun - 2019","skills":"Core Java, Collections & Multithreading, JSF, JBoss, XML, Web Services","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"The Capital, B-301, Next to Nano Space IT Park & Rolling Hills, Baner Pashan link Road, Baner, Pune - 411 021","phone":"Not Provided","profile":"Junior Product Engineer (.Net) \nCactus Communications Pvt. Limited","description":"We are looking for a Junior Product Engineer who will implement Kolabtree's technology and product roadmap with a primarily .Net stack. Must have a passion for providing superior user experience and a passion for building a world-class product. Bachelors degree or higher. Prior experience with coding a major plus Demonstrable self-learning capabilities Must be willing to put user experience above all else, display agility and approach challenges with a can-do attitude Ability to work and solve problems independently Be comfortable working in an early stage startup with an informal working environment Must be able to speak and write fluently in English Be extremely attentive to detail Critical Responsibilities: Rapidly implement features on the product roadmap Quickly evaluate and learn new technologies, libraries, concepts Independently drive features from concept and design through to completion Work remotely with a small, distributed team developing a full-stack application using primarily .Net technologies Plan and manage integrations with third-party software (e.g., invoice management software and payment processing apps Independently learn new coding methods and techniques needed to implement assigned features Walk-in Date/ Time: 22nd June 2109 from 9 AM onwards Interview Venue: The Capital, B-301, Next to Nano Space IT Park & Rolling Hills, Baner Pashan link Road, Baner, Pune - 411 021","location":"Pune","experience":"0 - 2 Years"},{"date":"20 - Jun - 2019","skills":"Software Testing Manual Testing test cases Test Scenarios Software Quality","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Prometric Testing Private Limited, 2nd Floor, Infinity Tower A, DLF Cyber City, Gurgaon - 122 002","phone":"0124-4517145","profile":"Manual Testing Engineer \nPrometric Testing Private Limited","description":"Bachelors / Masters Degree in Computer Science, Engineering or a related subject Proven work experience in manual quality assurance. Strong knowledge of Manual Testing. Experience in writing clear, concise and comprehensive test plans and test cases Hands-on experience with manual testing. Experience with performance and/or security testing is a plus Excellent communication skills Good analytical skills Work Experience: 1 to 3 Years Age Limit: Between 24 - 30 Years Job Hoppers please avoid to come for the interview Shift Timings: 9:00 am - 5:30 pm / 11:30 am - 8:00 pm Saturdays & Sunday Fixed Weekly Off Interview Details: Date: 20th June, 2019 (i.e. Thursday) Timings: 11:30 am - 4:00 pm Interview Venue: Prometric Testing Private Limited 2nd Floor, Infinity Tower A, DLF Cyber City, Gurgaon - 122 002","location":"Gurgaon","experience":"1 - 3 Years"},{"date":"22 - Jun - 2019","skills":"C# .Net 6.0, ASP .NET 4.5, ASP .NET MVC 5","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Teletext India Limited, 4th floor, Melange Tower, Patrika Nagar, Lane Next to Pride Honda Showroom, Madhapur, Hitech City, Hyderabad.","phone":"9908638114","profile":".Net/ Fullstack Developer \nTeletext India Limited","description":"Weekend Drive for Dotnet Fullstack Developer @ Teletext India Experience: 3 to 6 Years Extensive programming experience using C# .Net 6.0, ASP .NET 4.5, ASP .NET MVC 5. Experience in client side framework Angular 2 and Angular 5. Having good knowledge and experience in Web Services, WCF RESTful Services and WEB APIs. Experience in developing applications using ASP.NET Core and Angular 5. Experience in Object Oriented Programming concepts. Implemented front end part by using HTML and client side validation by using Java Script, JQuery, JQuery plugins. Experience in Agile methodologies, Continuous Integration and Continuous Deployment and Test Driven Development. Instant problem solving capability, Good communication skills to coordinate with customer. Coordinate with architects and business analysts to determine functionalities Walk-in Date/ Time: 22nd June from 10 AM onwards Interview Venue: Teletext India Limited 4th floor, Melange Tower, Patrika Nagar, Lane Next to Pride Honda Showroom, Madhapur, Hitech City, Hyderabad.","location":"Hyderabad","experience":"3 - 6 Years"}]}