{"Walkins":[{"date":"23, 24, 25, 26 - Oct - 2020","skills":"Java, .Net, PHP","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Net Creative Mind Solutions Pvt. Limited, 133, GF, Katwaria Sarai, New Delhi - 110 016","phone":"9315174188","profile":"Software Developer (Trainee) \nNet Creative Mind Solutions Pvt. Limited","description":"Candidate Should be first Division in Graduation/ Post Graduation (B.Tech (CS), B.Tech (IT), BCA, MCA, B.Sc (IT)). Should be Pass out in 2019-20 & 2020-21. Candidate must be Regular pass out in any stream Should be interested to work in Katwaria Saria location. Walk-in Date/ Time: 23rd - 26th October 2020, 11.00 AM - 3.30 PM Venue Details- Net Creative Mind Solutions Pvt. Limited 133, GF, Katwaria Sarai, New Delhi - 110016 Contact Person- Rainu Tiwari Phone- 9315174188","location":"Delhi","experience":"0 - 1 Years"},{"date":"23 - Oct - 2020","skills":"Induction, MIS, Joining Formalities, School Administration, Email Writing","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Orchids - The International School, Ram Nagar-Survey No. 9, 1, Next to HP Petrol Pump, Tathawade- Ravet BRT Road, Tathawade, Pune - 41103.","phone":"Not Provided","profile":"Executive Assistant (HR) \nOrchids International School","description":"Candidate should be Graduate/ HR with good communication & writing skills Must have excellent interpersonal skills Female Candidates Only need to apply! Job Responsibility- Maintain Principal\u0092s Calendar Serve as a single point of contact between principal, branch, staff and parents Office Operations & MIS Payroll, Attendance Maintenance, Leave Management Walk-in Date/ Time: 23 October 2020, 10.00 AM - 1.00 PM Venue Details- Orchids - The International School, Ram Nagar-Survey No. 9, 1, Next to HP Petrol Pump, Tathawade- Ravet BRT Road, Tathawade, Pune - 41103. Contact Person - Akshay","location":"Pune","experience":"1 - 3 Years"},{"date":"22, 23 - Oct - 2020","skills":"Java/ .Net/ Testing Certification","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Changepond Technologies Pvt. Limited, H-2, SIPCOT IT Park, OMR, Siruseri, Chennai - 603 103.","phone":"Not Provided","profile":"IT Freshers - Java/ .Net/ Testing \nChangepond Technologies Private Limited","description":"Changepond Technologies Private Limited, is hiring Engineering Graduates - Freshers for Chennai location. Eligibility Criteria- 2017/2018 & 2019 Passed out freshers only. BE/ B Tech / MCA Graduates with an aggregate of minimum 60% in Academics Mandate: Java/ .Net/ Testing Certification from any Training Institutes Good communication Skills Drive Details: Interview Date : 22nd/ 23rd October 2020 (Thu/ Fri) Timings : 09:30 AM to 12:00 PM Venue Details: Changepond Technologies Pvt. Limited H-2, SIPCOT IT Park, OMR, Siruseri, Chennai - 603 103. Contact Person: Arvind (HR), Kalaiselvan (HR) Contact Email : arvind.r@changepond.com, kalaiselvan.r@changepond.com","location":"Chennai","experience":"0 - 1 Years"},{"date":"22, 23 - Oct - 2020","skills":"Customer Support, Customer Service, Semi Voice, Outbound Process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Apollo Hospitals Enterprise Private Limited, 9th Floor, Krishe Sapphire Building, Near Durgam Cheruvu Metro Station, Madhapur, Hyderabad.","phone":"Not Provided","profile":"Customer Support Executive \nApollo Hospitals Enterprise Private Limited","description":"Educational Qualification : Any Graduate Knowledge of BPO Voice/ Non Voice 0 to 2 years , 2 to 4 years mix. Exposure to work in Third party set up in Voice and Semi Voice environment. Current Role should be in BPO/ KPO in MNC. Language as per business need. Skill Set: Should be proficient in English, Hindi (Mandatory) Plus and Telugu/ Kannada/ Malayalam/ Bengali/ Gujarati/ Odia (Optional - Anyone out these languages) Job Responsibility: Data uploading from Client Portal to in-house Portal and creation of Unique ID. Calling Customer and Booking Appointment for client visit/ any other requirement. Following up with location SPOC to ensure smooth Customer Experience. Closelooping back with Customer post completion of tests. Maintaining data in excel/ web application as per Client Requirement Ensuring Client requirements are met. Should be flexible to work in shifts. Should have strong communication and typing skills. Ensuring business KPIs are being met. Maintaining Quality standards as per agreed protocols. No. of Vacancies: Bengali -15 Oriya 03 Gujrati 01 Hindi 25 Kannada, Malayalam - 05 Walk-in Date/ Time: 22nd - 23rd October 2020, 12.00 PM - 3.00 PM Venue Details- Apollo Hospitals Enterprise Private Limited 9th Floor, Krishe Sapphire Building, Near Durgam Cheruvu Metro Station, Madhapur, Hyderabad. Contact Person- Nazia Devi","location":"Hyderabad","experience":"0 - 4 Years"},{"date":"23 - Oct - 2020","skills":"ASP .NET. MVC, OOP, C#, Javascript, Jquery, Angular, SQL Server Programming","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Kotak Mahindra Bank Limited, C 330, Vivek Vihar, Phase 1, New Delhi - 110 095","phone":"Not Provided","profile":"Assistant Acquisition Manager \nKotak Mahindra Bank Limited","description":"We have Urgent openings for Assistant Acquisition Manager- CASA -Sales for Delhi-NCR location. Designation: Assistant Acquisition Manager- CASA (Sales) Grade: M1 - Assistant Manager (On a roll of Kotak Mahindra Bank) CTC Offered- Upto 2.7 LPA Candidate must be a Graduate with Fair English communication skills Must have Field Sales Exposure and willing to hunt in the open market Preferred candidate From banking, Insurance, Stockbroking & NBFC Maximum Age Limit- 27 Years Note- Candidate Must have basic knowledge of Banking products & Role which he applied for. Job profile : To source customers for Current Account & Saving Account. Customers to be sourced from individuals, small businesses, trusts, associations, societies, corporates. Revenue Generation, Customer Acquisition, Customer Retention, Cost Efficiency Through Process Hardcore sales mentality. Primary motivation from the achievement of targets. A hunter by orientation. Should be well-groomed and presentable with ambassadorship qualities Interview Date: 23rd October 2020 Timing: 11:00 AM to 3:30 pm Venue: Kotak Mahindra Bank Limited C 330, Vivek Vihar, Phase 1, New Delhi - 110 095. Contact Person: Japneet Singh Walia (Regional Sales Manager)","location":"Delhi","experience":"1 - 5 Years"},{"date":"22, 23 - Oct - 2020","skills":"Customer Service, Voice Process, Customer Support, Problem Resolution","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Easy Trip Planners Private Limited, 223, Patparganj Industrial Area, New Delhi - 110 092.","phone":"Not Provided","profile":"Freshers - Flight Support (Inbound Process) \nEasy Trip Planners Private Limited","description":"Candidate should be Any Graduate/ Freshers with good communication skills. Freshers from travel domain with good communication skills Experienced customer support candidates in travel domain Experience form BPO background can also be consider Ready to work in rotational shifts (No Night Shifts for females) Knowledge -international/ domestic travel voice process Knowledge of world map & geography will be required. Be enthusiastic & have zeal to perform. Be flexible to work in 24*7 rotational shifts days working environment. Candidates should be able to join ASAP. Excellent communication skills required. There is no night shift for female. Provide best-in-class customer service and problem resolution to customer queries over the voice based phone service. Support customers across Telecommunication/E- mail/Chat, Meet customer requirements through first contact resolution. Clarify customer requirements; probe for and confirm understanding of requirements or problem. Greet customers in a courteous, friendly, and professional manner using agreed upon procedures. Listen attentively to customer needs and concerns; demonstrate empathy. Confirm customer understanding of the solution and provide additional customer education as needed. Prepare complete and accurate work and update customer file. Walk-in Date/ Time: 20th October - 23 October , 11.30 AM - 3.30 PM Venue Details- Easy Trip Planners Private Limited 223, Patparganj Industrial Area, New Delhi - 110 092. Contact Person - Alisha Only interested candidates can share their CV's on hr@easemytrip.com","location":"Delhi","experience":"0 - 2 Years"},{"date":"22, 23, 24 - Oct - 2020","skills":"Good Analytical and Communication Skills","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"FedEx Express TSCS (India) Private Limited, Times of India Compound, Kankarbagh Patna","phone":"9626299979","profile":"Operations Support Executive/ Agent \nFedEX Express Transportation Supply Chain Services","description":"Urgently looking for Operations Support Executive/ Agent. We would invite you for a walk-in interview from 22nd to 24th Oct, 2020. The details of the same is mentioned below :- 22nd October, 2020 - 1100 hours to 1200 hours 23rd October, 2020 - 1100 hours to 1200 hours 24th October, 2020 - 1000 hours to 1400 hours Venue Details- FedEx Express TSCS (India) Private Limited Times of India Compound, Kankarbagh Patna You are requested to contact Mr. E. R. Pirabhu Raaj at 9626299979 only at the above mentioned scheduled time.","location":"Patna","experience":"0 - 5 Years"},{"date":"22, 23, 24 - Oct - 2020","skills":"Technical Support, Voice Process, Chat Process, Troubleshooting","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"[24]7.ai Customer Private Limited, Ground Floor NSL Arena Town Centre, Behind Cricket Stadium, Ramanthapur Road, Uppal, Hyderabad - 500 039","phone":"9676338009","profile":"Support Executive (Chat Process) \n24/7 Customer Private Limited","description":"Candidate should be Any Graduate with excellent Verbal and Written Communication skills. Should possess excellent knowledge in troubleshooting of computers or any electronic devices (Voice Process). Must have good logical reasoning & analytical skills. Able to interact with customers via chat or voice, should be able to answer servicing questions. Able to work in rotational night shifts (US) Should have typing speed of 26 WPM, 90% accuracy Eligibility Criteria: Undergraduate/ Graduate and Postgraduate freshers and experienced can apply. Immediate joiners Benefits- Transport facility both Pick/ Drop. Life Insurance. Medical Insurance Interview Rounds: Personal Introduction Round Online Test (Chat process) Versant Test and Technical test (Voice Process) Operations Round Walk-in Date/ Time- 20th - 24th October from 10.00 AM onwards Venue Details- [24]7.ai Customer Private Limited Ground Floor NSL Arena Town Centre, Behind Cricket Stadium, Ramanthapur Road, Uppal, Hyderabad - 500 039 Contact Person: Raaga Sudha Contact No: 9676338009 Note: * Write HR name on the resume * Carry xerox copies of all academic and experience(if applicable) certificates, resume, ID proof and wear a face mask * Request you to carry snacks as the waiting time may extend in the interview. * Candidates attended interview within 30 days are not eligible to attend.","location":"Hyderabad","experience":"0 - 5 Years"},{"date":"22, 23, 24 - Oct - 2020","skills":"General Administration, Bidding, Tender Preparation/ Registration, e-Tendering","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Alankit House, 4E/2 Jhandewalan Extension, New Delhi -110 055. Nearest Metro Station:- Jhandewalan Metro Station Gate No. 2","phone":"7290012325","profile":"Senior Tender Executive \nAlankit Limited","description":"Person must have minimum 3 years of experience in General Administration, Bidding, Tender Preparation/ Registration, e-Tendering. Follow up Tender Registration & Payments in various Govt. Department. Should be responsible to handle tenders published on GEM Portal. Prepare documents for e-Tendering, Studying tender documents, qualification criteria, scope of work, Floating RFQ to various vendors/ contractors, collecting quotations, preparing comparative statements, meeting deadlines for the tenders received from public sector undertaking Govt. and other organizations. Prepare Bills of All Departments Follow ups from client regarding order. Convert inquiries into order. Preparing MIS weekly/ Monthly Reports. Walk-in Date & Timing:- 19th to 24th October 2020 @ 10:00 AM to 1:00 PM Venue Details:- Alankit House, 4E/2 Jhandewalan Extension, New Delhi -110 055 Nearest Metro Station:- Jhandewalan Metro Station Gate No. 2 Landmark:- Near Post Office Contact Person:- Ms. Usha Contact details:- 7290012325 Note:- Interested candidate can share their resume on ushar@alankit.com OR call on 7290012325.","location":"Delhi","experience":"3 - 7 Years"},{"date":"22, 23, 24, 25 - Oct - 2020","skills":"Customer Relationship, Sales/ Business Development Activities","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Propin Properties Private Limited, 5th Floor, Vasundhara Plaza, Vishal Nagar, Pimple Nilakh, Pune - 411 027.","phone":"8669656560","profile":"Relationship Manager \nPropin Properties Private Limited","description":"Candidate should have access to a smart phone with internet and a vehicle which they will be using to travel to office and projects Good English communication skills and fluency in Hindi and/or Kannada. Sales Executive sales officer/ executive Required Qualifications. Candidate should be minimum graduation in any stream Should have 0 to 2 years of experience in sales Must have excellent communication skills They must be able to work independently and with little supervision, and sometimes they are even required to work remotely. We are hiring energetic and enthusiastic people for our residential real estate sales team. Roles and Responsibilities- Generate Business, Meet personal and team sales target, Create awareness of your brand, Communicate the target Audience and build and develop customer relationships. Responsible for generating sales with existing customers and developing New Leads, Clients and Customers. Immediate hiring and joining at our Marketing offices as we have an urgent job opening for the position of sales representatives. This position will help the individual to increase the skills in manpower handling, negotiation on price, better understanding on sales, to handle potential territory in a supervisory roles as a Sales Executive Responsible to achieve sales target by closing deals. Job Benefits & Perks- PF & ESIC Walk-in Date/ Time: 22nd October - 25th October , 9.30 AM - 5.30 PM Venue Details- Propin Properties Private Limited 5th Floor, Vasundhara Plaza, Vishal Nagar, Pimple Nilakh, Pune - 411 027. Note: Interested candidate can send their updated resume on hr@propinn.in if you are interested call me on my number 8669656560","location":"Pune","experience":"0 - 2 Years"},{"date":"22, 23 - Oct - 2020","skills":"ASP .Net MVC, C#, Entity Framework, Database Concepts, Stored Procedure, MS SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Brickwork Ratings, Bannerghatta Road, Near to Meenakshi Mall, Bangalore","phone":"080-40409940","profile":"Web/ ASP .Net Developer \nBrickwork Ratings","description":"Brickwork Ratings, a SEBI Registered and RBI accredited Credit Rating Agency is looking for a suitable candidate for the position of Web Developer. In sync with our rapid expansion phase and to keep our website updated all the time, we have an immediate requirement for a Web Developer for a position at our Corporate Office at Bannerghatta road, Bangalore. Education - B.E., B.TECH, BCA, MCA ( CS or IT ), Any Computer Science Graduate. Minimum 3 years of relevant work experience Work Experience - 2 to 5 years The job responsibilities will be as described below but not limited to:- Strong ASP .Net web form programming, ASP .Net MVC, C#, Entity Framework with good communication skills Good in Database Concepts, Stored Procedure, MS SQL Server Working experience in Jquery, Ajax, Javascript, HTML, CSS Proficiency in SDLC and Agile methodologies Good to have Angular JS knowledge Task Description: Need to maintain existing websites, Adding new functionalities, bug fixing, writing UI programming, SQL queries to generate the reports. The existing sites are is in ASP.net webforms / MVC and with MSMSQL server as back end. The ideal candidate must have - Fair understanding of JavaScript programming Deep expertise and hands-on experience with Web Applications and programming languages such as HTML, CSS, JavaScript, JQuery, and APIs.Good team player within a target-driven environment The knack for adhering to accessibility standards Walk-in Date: 22nd and 23rd October 2020 Timings - 10:30 AM to 4:30 PM Venue Details: Brickwork Ratings Bannerghatta Road, Near to Meenakshi Mall, Bangalore Note - Preference will be given to the immediate joiners. Important Note - Every Individual must wear mask always. Every Individual should have their personal hand sanitiser. Every Individual needs do the temperature screening at reception. Every Individual needs to declare their travel history and other relevant information","location":"Bangalore","experience":"2 - 5 Years"},{"date":"22 - Oct - 2020","skills":"Java/ J2ee, (Core Java, J2ee, JSP, Servlet, Spring/ Hibernate/ Struts), MySQL or PostgreSQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Ojas Softech Private Limited, A-139, Sector-63, Noida-201301","phone":"8447131703","profile":"Java Developer/ Team Lead \nOjas Softech Private Limited","description":"Candidate must have strong hands on experience on the following technology. Java/ J2ee, (Core Java, J2ee, JSP, Servlet, Spring/ Hibernate/ Struts) Should have hands on Experience on Developing Java Application Have worked on like MySQL or PostgreSQL Experience in leading a team Candidate must have strong coding and logical skills Should be proactive & smart with strong analytical skills Open to work in a challenging environment Walk-in Date/ Time: 22nd October 2020, 9.30 AM - 5.30 PM Venue Details- Ojas Softech Private Limited A-139, Sector-63, Noida-201301 Contact Person- Pooja Sinha Phone No. 8447131703","location":"Noida","experience":"5 - 10 Years"},{"date":"21, 22, 23, 24 - Oct - 2020","skills":"ASP .Net MVC SQL OOPS Concept","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Chetu (India) Private Limited, H-6, Sector 63, Noida.","phone":"8130330519","profile":".Net Developers \nChetu (India) Private Limited","description":"We at Chetu (India) Private Limited are hiring .Net Developers. Candidate should have 2 to 7 years of experience in Software Development using the following technologies- ASP .Net MVC SQL OOPS Concept 1.6 Experience + 6 Months Internship or training also Work. 2 Year Experience in .Net role. Perks and Benefits- Cab Facilities On Site Placement Opportunity (Depend On Performance) Medical Insurance 6 Months Appraisal Interview Walk-in Date/ Time: 21st October - 24th October from 3.30 PM onwards Venue Details- Chetu (India) Private Limited H-6, Sector 63, Noida. Contact Person : Pranav (8130330519)","location":"Noida","experience":"2 - 7 Years"},{"date":"22, 23 - Oct - 2020","skills":"ASP .NET framework, SQL Server, and Design/ Architectural Patterns","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Brickwork Ratings India Private Limited, 3rd Floor, Raj Alkaa Park, 29/3 & 32/2, Bannerghatta Main Rd, Kalena Agrahara, Near Meenakshi Temple and Mall, Bengaluru, Karnataka - 560 076","phone":"Not Provided","profile":".Net Developer \nBrickwork Ratings India Private Limited","description":"Candidate must have proven experience of 6 to 8 years as a .NET Developer or Application Developer. Familiarity with the ASP .NET framework, SQL Server, and Design/ Architectural Patterns (e.g. Model-View-Controller (MVC)). Knowledge and experience in written code in C# and HTML5/ CSS3. Worked on SQL Server (Handling database, Stored Procedure, Function, View, etc.) Must have excellent troubleshooting and communication skills Attention to detail Roles and Responsibilities - Participate in requirements analysis Write clean, scalable code using .NET programming languages Test and deploy applications and systems Revise, update, and debug code Improve existing software Serve as an expert on applications and provide technical support Walk-in Date/ Time: 22nd - 23rd October , 10.30 AM - 4.30 PM Venue Details- Brickwork Ratings India Private Limited 3rd Floor, Raj Alkaa Park, 29/3 & 32/2, Bannerghatta Main Rd, Kalena Agrahara, Near Meenakshi Temple and Mall, Bengaluru, Karnataka - 560 076 Contact Person - Seemab","location":"Bangalore","experience":"6 - 8 Years"},{"date":"19 - Oct - 2020","skills":"IT Helpdesk, Technical Support, Telecalling, Software Support, Troubleshooting","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Bits N Bytes Soft Private Limited, 3rd floor, Building No-113, Sector-44, Gurgaon, Haryana","phone":"Not Provided","profile":"Technical Support Engineer \nBits N Bytes Soft Private Limited","description":"Candidate should be Any Graduate with 1 to 5 years of experience in IT Helpdesk, Technical Support, Telecalling, Software Support, Troubleshooting. Must have excellent communication skills Job Responsibility- Research and identify solutions to software and hardware issues. Ask customers targeted questions to quickly understand the root of the problem. Talk clients through phone, email or chat, until they- ve solved a technical issue Walk-in Date/ Time: 19th October 2020, 9.30 AM - 3.30 PM Venue Details- Bits N Bytes Soft Private Limited 3rd floor, Building No-113, Sector-44, Gurgaon, Haryana, India Contact Person - Rakesh Ray","location":"Gurgaon","experience":"1 - 5 Years"},{"date":"19, 20 - Oct - 2020","skills":"Front Desk, General Administration, Front Office Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Savitri Telecom Services, 101-110 A, Somdutt Chamber -1, 1st Floor, Bhikaji Cama Place, New Delhi - 110 066.","phone":"011-26700549","profile":"Admin/ Front Office Executive \nSavitri Telecom Services","description":"Candidate should have proven experience as front desk representative, agent or relevant position. Telephone Skills, Verbal Communication, Microsoft Office skills. Must be well versed with MS Office & Excel. Perceptive and disciplined Roles & Responsibilities- Keep front desk tidy and presentable with all necessary material (pens, forms, paper etc). Supervision on office maintenance, neat and clean office environment and ensuring that the conference is ready for meetings. Planning and coordinating administrative procedures and systems and devising ways to streamline processes. Answer all incoming calls and redirect them or keep messages. Take the Customers details and direct them to the available Sales Executive. Handle and prioritize all outgoing or incoming correspondence (e-mail, letters, packages etc.). Take up other duties as assigned (travel arrangements, schedules etc.) Interview Date: 19th October - 20th October Time: 11.00 AM - 1.00 PM Interview Venue- Savitri Telecom Services 101-110 A, Somdutt Chamber -1, 1st Floor, Bhikaji Cama Place, New Delhi - 110 066. Contact Person- Neha Sharma (011-26700549) Interested candidates may send their profile to hr@savitritelecom.com","location":"Delhi","experience":"0 - 2 Years"},{"date":"19 - Oct - 2020","skills":"HR Operations, Countif, Induction, Formulas, Conditional Formatting","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Visionet Systems Private Limited, Bommanahalli, AMR Tech Park, Ground Floor, # 23 & 24, Hosur Main Road, Next to Oxford College of Engineering, Bengaluru, Karnataka - 560 068.","phone":"8707253872","profile":"HR Executive \nVisionet Systems Private Limited","description":"Candidate must proficient in advanced Excel (Vlookup, Hlookup, Pivot table, Macros, Countif, Formule) Should have good knowledge in HR Operations. Should have excellent communication skills. Must be strong in Excel. Immediate joiners would e preferred. (NOTE: LOOKING FOR ONLY MALE CANDIDATES) Walk-in Date/ Time: 19th October 2020, 10.00 AM - 4.30 PM Venue Details- Visionet Systems Private Limited Bommanahalli, AMR Tech Park, Ground Floor, # 23 & 24, Hosur Main Road, Next to Oxford College of Engineering, Bengaluru, Karnataka - 560 068. Contact Person - Neelam (8707253872)","location":"Bangalore","experience":"1 - 3 Years"},{"date":"19 - Oct - 2020","skills":"Email Support, Non Voice Process, Domestic Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Hexaware Technologies Limited, Elysium central building, 2nd floor, Near Carmal Garden School, Sungam Bus Stop, Coimbatore \u0096 641 045.","phone":"9677117759","profile":"Non-Voice Process Executive \nHexaware Technologies Limited","description":"We are looking for freshers and experienced candidates for domestic non-voice process at Coimbatore. It's a pure day shift process with attractive salary package. Expectation: He/she should know to read, write and speak Hindi mandatory Must be good in written English communication. Note: Candidates who doesn't know Hindi, please do not walk in/apply If you meet the above criterias, please directly walk-in at the mentioned venue with your basic documents (10th, 12th and Semester mark sheets - original and photocopies and also your government id proofs). It's mandatory that you mention HR Pro as reference, else you woud not get a chance for F2F interview. Please do share this post to your friends who are in need of a job. You can also send in your resumes to placements.hrpro@gmail.com for jobs like this. Walk-in Date/ Time: 19th October 2020, 10.00 AM - 4.00 PM Venue Details- Hexaware Technologies Limited, Elysium central building, 2nd floor, Near Carmal Garden School, Sungam Bus Stop, Coimbatore \u0096 641 045. Lankmark\u0096 Opposite to Indian Bank Contact Person- Maya (9677117759)","location":"Coimbatore","experience":"0 - 3 Years"},{"date":"19, 20, 21 - Oct - 2020","skills":"Customer Support, Business Events, Field Work, Reception/ Guest Relations","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"MALIKPURIA TECHNOLOGIES PRIVITE LIMITED NEAR AIRTEL BUILDING SECTOR 18, GURUGRAM","phone":"9896724550","profile":"Customer Support Executive \nMalikpuria Technologies Private Limited","description":"(FRESHERS WITH GOOD ENGLISH COMMUNICATION SKILLS WILL ALSO BE CONSIDERED, TRAINING WILL PROVIDED FOR THE POSITION). Build sustainable relationships of trust through open and interactive communication; Identifying and assessing customers needs to achieve customer satisfaction. Maintain records of customer interactions, customer accounts, and file documents. Serving customers by providing the knowledge of the products and services.2. Interact with customers on daily basis and document information shared by the customers on the CRM. You will act as a liaison, provide product/ services information to our customers and resolve any emerging issues/ queries they face with accuracy and efficiency. The target is to ensure excellent service standards, respond efficiently to customer inquiries and maintain high customer satisfaction. Both Freshers and Experienced can apply! Walk-in Date/ Time- 19th October - 21st October , 1.00 PM - 5.30 PM Venue Details- MALIKPURIA TECHNOLOGIES PRIVITE LIMITED NEAR AIRTEL BUILDING SECTOR 18, GURUGRAM Contact Person- BHUWAN GARG (9896724550)","location":"Gurgaon","experience":"0 - 2 Years"},{"date":"19, 20, 21, 22, 23, 24, 25, 26 - Oct - 2020","skills":"JAVA, J2EE, MySQL, Javascript","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"STRYDO TECHNOLOGIES PVT. LTD (VELLORE CORPORATE OFFICE) 257, SAPTHAGIRI COMPLEX, 2ND FLOOR, KATPADI MAIN ROAD VELLORE \u0096 632007.","phone":"9787374374","profile":"Java Programmer \nStrydo Technologies Private Limited","description":"We are recruiting professionals for the following position: POSITION: JAVA PROGRAMMER Educational Qualification: BE/ B.Tech/ ME/ M.Tech/ MCA Key Skills: JAVA, J2EE, MySQL, Javascript Work Experience: 0-2 Years Gender: Male / Female \u0095 Candidate should have minimum 60 percent aggregate in academics. \u0095 He / She should have good knowledge in JAVA and OOPS concepts. \u0095 He / She should take care of coding & development. \u0095 Candidate is responsible for the development, support, maintenance and implementation of research projects. \u0095 He / She should be strong in coding JAVA technologies. \u0095 He / She should work in Java on Windows based & Web based applications development. \u0095 Candidate should have strong knowledge in understanding web application development using JAVA & J2EE. \u0095 He / She should also have good knowledge of MS Access and MySQL server. \u0095 He / She should possess good Communication and Presentation skills. \u0095 He / She should be a good performer. \u0095 He / She should have a good troubleshooting and problem solving skills. \u0095 He / She should be proactive in identifying problems and suggesting solutions. Walk-in Date/ Time: 19th October - 26 October , 11.00 AM - 4.00 PM OUR ADDRESS: STRYDO TECHNOLOGIES PVT. LTD (VELLORE CORPORATE OFFICE) 257, SAPTHAGIRI COMPLEX, 2ND FLOOR, KATPADI MAIN ROAD VELLORE \u0096 632007. CALL : 0416 \u0096 2241901 / 9787374374 STRYDO TECHNOLOGIES PVT. LTD (TIRUPATHI CORPORATE OFFICE) 103, 2ND FLOOR PRAKASAM ROAD, VESYALAMMA GUDIVADHI, BALAJI COLONY, TIRUPATHI, AP \u0096 517501. CALL : 9110781901","location":"Tirupati, Others","experience":"0 - 2 Years"},{"date":"19, 20 - Oct - 2020","skills":"Core Java, Advanced Java, Stringing, Spring","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Stemetric IT Solutions Private Limited, 101/A, 1st Floor, Plot #2, Above Karnataka Bank, Opposite to, Image Gardens Road, HITEC City, Hyderabad, Telangana - 500 081.","phone":"Not Provided","profile":"Java Developers \nStemetric IT Solutions Private Limited","description":"We at Stemetric IT Solutions Private Limited are looking for Java Developers Prerequisite: Candidate should be Trained/ Experienced Educational Qualification: BE/ B.Tech/ MCA Work Experience: 0 to 3 Years NOTE: 2019-2020 Not Required Location: Hyderabad /Bangalore If your interested please come to walking on 19th & 20th October 2020 Timings: 10:30 AM to 2 PM Venue Details- Stemetric IT Solutions Private Limited 101/A, 1st Floor, Plot #2, Above Karnataka Bank, Opposite to, Image Gardens Road, HITEC City, Hyderabad, Telangana - 500 081.","location":"Bangalore, Hyderabad","experience":"0 - 3 Years"},{"date":"19, 20, 21 - Oct - 2020","skills":"Technical Support, Voice Based Process, Troubleshooting","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Zebronics India Private Limited, No: 118, Poonamallee High Road, Vepery, Chennai - 600 084","phone":"Not Provided","profile":"Technical Support Engineer \nZebronics India Private Limited","description":"We at Zebronics India Private Limited are hiring Technical Support Engineer (Only Male) for R&D Department. Location: Chennai Work Experience: 0 to 3 Years (Freshers can also apply) Languages: English & Hindi Speaking Must | Other regional languages will be advantageous Should have excellent communication skills in English and Hindi Should have strong technical skills Job Responsibility:- Responds to customer technical problems/issues related to hardware, software and networking via e-mail/chat and phone. Report Preparation Walk-in Date: 19th October - 21st October, 2020 Timings : 10.30 AM - 6.30 PM (Monday-Saturday) Venue Deetails- Zebronics India Private Limited No: 118, Poonamallee High Road, Vepery, Chennai - 600 084","location":"Chennai","experience":"0 - 3 Years"},{"date":"19 - Oct - 2020","skills":"Core Java, J2ee, JSP, Servlet, Spring/ Hibernate/ Struts, MySQL or PostgreSQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Ojas Softech Private Limited, A-139, Sector-63, Noida - 201301","phone":"8447131703","profile":"Java Developer/ Team Lead \nOjas Softech Private Limited","description":"Candidate should have good hands on experience on the following technologies- Java/ J2ee (Core Java, J2ee, JSP, Servlet, Spring/ Hibernate/ Struts) Hands on Experience on Developing Java Application. Experience in leading a team Have worked on like MySQL or PostgreSQL Must have strong coding & logical skills Strong analytical skills Should be proactive & smart Open to work in a challenging environment Walk-in Date/ Time: 19th October 2020, 9.30 AM - 5.30 PM Venue Details- Ojas Softech Private Limited A-139, Sector-63, Noida - 201301 Contact Person - Pooja Sinha Phone- 8447131703","location":"Noida","experience":"5 - 10 Years"},{"date":"19, 20 - Oct - 2020","skills":"Technical Support, IT Helpdesk/ Service Desk, Customer Support","qualification":"Diploma, B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Exim Logistics Private Limited, Unit No. 929, 9th Floor, DLF Cyber City, Patia, Bhubaneswar, Odisha - 751 024.","phone":"9937089530","profile":"Technical Support Executive \nExim Logistics Private Limited","description":"Candidate must be a Graduate/ Diploma with technical background also preferred. Candidate should be technically sound and good knowledge on MS EXCEL,WORDS. Communication skill should be good and ready to move to field for survey, if required. Experience required: 6 Months to 1 Year Job Type: Full-time Salary: 7k - 8k Walk-in Date/ Time: 19th October - 20th October , 9.30 AM - 5.30 PM Venue Details- Exim Logistics Private Limited Unit No. 929, 9th Floor, DLF Cyber City, Patia, Bhubaneswar, Odisha - 751 024. Contact Person- Monalisa (9937089530)","location":"Bhubaneshwar","experience":"0 - 1 Years"},{"date":"20, 21 - Oct - 2020","skills":"Compliance, File System, Back Office, ESIC, HR","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Rajratan Industries Private Limited, 123-124, First Floor, Shastri Market, Opposite. Gandhi Hall, Indore, M.P","phone":"Not Provided","profile":"Compliance/ Back Office - Female \nRajratan Industries Private Limited","description":"Any Graduate in English Medium with skills in HR, Filing System MS Excel Skills for Reporting Strong attention to Details Must have good analytical skills Language - English & Hindi Roles and Responsibilities Manage Filing System, ESIC and other HR related Work. Walk in Details: Date: 20.10.2020 & 22.10.2020 Time: 3:00 pm to 6:00 pm Venue: Rajratan Industries Private Limited 123-124, First Floor, Shastri Market, Opposite. Gandhi Hall, Indore, M.P Contact Person: Ankit Jain, 9993345377","location":"Indore","experience":"1 - 3 Years"},{"date":"16 - Oct - 2020","skills":"Agency Sales/ Development, Channel Development, Insurance Sales","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Kotak Life Insurance Co. Limited, Ceebros centre, 1st floor, no 45, Montieth Road , Egmore , Chennai Tamil Nadu - 600 008.","phone":"7977965314","profile":"Agency Sales Manager \nKotak Life Insurance Compnay Limited","description":"Here is an opportunity to get associate and enhance your career with a leading brand. Job Location- Chennai (Egmore) Recruit The person shall be responsible for Recruitment and Development of quality advisors and encourage them for long term career.by selling career opportunity to such prospective advisors Coach performance and daily activity of advisors. the morale to retain performing advisors & special attention to average performers & providing need based training. Sales Leader product as well as practical training to the advisors by accompanying them to client meetings and motivating them on the sales funnel and achieving revenue targets Job Specifications: 1. The candidate must be a graduate 2. Must have minimum 2 years of sales experience 3. Age (Max 40 years) 4. Current location should be Chennai Interested candidates can directly walk-in on the below mentioned details or can call on 7977965314 Walk-in Address - Kotak Life Insurance Co. Limited Ceebros centre, 1st floor, no 45, Montieth Road , Egmore , Chennai Tamil Nadu - 600 008. Walk-in Date- 16 October 2020 Timings- 10:30 PM to 3:00 PM Interviewer Name - Balaji/ Surendar Raj/ Balram","location":"Chennai","experience":"2 - 7 Years"},{"date":"16 - Oct - 2020","skills":"Back Office, Mutual Funds Process, Banking/ Financial Products","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Contact- HR Ramesh Pal","phone":"7303443025","profile":"Mutual Fund Process Executive (WFH) \nSitel India Private Limited","description":"ALL INTERVIEW ONLEY TELEPHONIC -(HR Ramesh Pal- 7303443025) Eligibility Criteria: Qualification- B.Com, BAF, BMM, BBI Graduate Good communication skills in English with Hindi Preferred 6 months to 1 year Exp. in Banking & Financial Sector (Equity or debt markets and Mutual funds) Experience and good knowledge on Financial products. NISM Certification Provided/ Candidate with NISM Certification will be preferred. 6 days working with and 1 day off Voice process ( Sales) Perks and Benefits 1. Centralized pick up & drop facility 2. Attractive performance incentives. 3. Day shifts. Key Skills Communication in English With Hindi Banking and Mutual Funds Knowledge Current Security Market Update Mutual Funds Benefits : 1. Centralized pick up & drop facility 2. Attractive performance incentives. 3. Day shifts. Contact HR-RAMESH PAL Mobile No - 7303443025 *Note.: This is a work from home Job during lockdown once the lockdown is lifted the candidate needs to come to office to work. System will be provided.","location":"Mumbai","experience":"1 - 2 Years"},{"date":"16, 17 - Oct - 2020","skills":"Saving Account, Customer Service, Cross Selling, Liabilities, Insurance Sales","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"AU Small Finance Bank Limited, A 24- Old Storey, Lajpat Nagar IV, Ring Road, Near Vinobha Puri Metro Station","phone":"Not Provided","profile":"Bank Officer - CASA \nAU Small Finance Bank Limited","description":"Candidate should have 1 to 4 years of experience in Field Sales (Liability/ Insurance Sales preferred), preferably Localite, Selling skills, Good communication skills, Fluently speaks and understands local language. Customer service attitude, Negotiation & Relationship building Skills. Ability to convince the customers & work under pressure Roles and Responsibilities: Acquisition of Current account/ Saving Account from cold calling, market reference, cross sell and selling third party products (life & health insurance, mutual funds SIPs). Responsible for implementing sales and marketing activities within a branch in order to grow the Liabilities business and achievement of sales targets. Ensure Liability acquisition targets are met by developing new relationships and leveraging existing ones within the customer base. Responsible for acquiring new customers through multiple channels campaigns (in the vicinity), branch walk-ins, referrals from existing customers, through industry bodies and associations and through running industry Achieving over all numbers and value targets as per scorecard. Ensuring timely opening of accounts and giving smooth on boarding experience to NTB customers Walk-in Date/ Time: 16th & 17th October 2020, 10.00 AM - 3.00 PM Venue Details- AU Small Finance Bank Limited A 24- Old Storey, Lajpat Nagar IV, Ring Road, Near Vinobha Puri Metro Station Contact - Sonali Chopra (HR)","location":"Delhi","experience":"1 - 6 Years"},{"date":"17 - Oct - 2020","skills":".Net Version 4, .Net Core, C#, OOPs Concepts, SOLID Principles","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Please register on the below link so that HR could reach out to schedule your zoom interview for Saturday, 17 Oct 2020. https://lnkd.in/dxW9Ak6","phone":"Not Provided","profile":".Net Developers \nRateGain Travel technologies Pvt. Limited","description":"RateGain is conducting virtual walk-in drive on Saturday, 17th October 2020 for hiring .NET Developers for its Noida Sector-125 location. Experience Range: 3 - 7 Years No. of Openings: 5 Purpose of the role: Responsible for designing user interactions on websites, developing servers and databases for website functionality. Key Skills: Experience in .Net Version 4, .Net Core, C#, OOPs Concepts, SOLID Principles Design patterns (at-least two: singleton, factory, abstract-factory, strategy, builder, etc.) Understanding of n-tier application architecture and workflow, Javascript, JQuery (any JS framework like Angular/ Ember/ knockout/ Bootstrap/ React) Experience in Multithreading (Thread Pool/TPL), MVC 4 or above, WCF and Web APIs, Proficient in MS tech Stack. Working knowledge of Fiddlers, HTTP Analyzer, SOAP-UI, Postman, Windows Service and Entity Framework 6 or above, Regular Expressions. One who builds strong relationship with Testing, Service Delivery, and Support Teams. Mode of Interview: Zoom Interview Date of Interview: Saturday, 17th Oct 2020 Timings: 10 am - 7 pm Please register on the below link so that HR could reach out to schedule your zoom interview for Saturday, 17 Oct 2020. https://lnkd.in/dxW9Ak6","location":"Noida","experience":"3 - 7 Years"},{"date":"17, 18 - Oct - 2020","skills":".Net, Azure/ AWS, ReactJs, Angular, NodeJs","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Virtual Interviews Only","phone":"9600167789","profile":".Net Professionals \nKanini Software Solutions Private Limited","description":"1. Technical Application Architect . Years of Experience: 12+ Relevant years of experience in Architect :7+ Skill set- .Net , Azure/ AWS, ReactJs 2 .Full Stack Technical Lead Years of Experience: 8+ Relevant years of experience in Lead :5+ Skill set- .Net, Azure/ AWS, ReactJs, Angular, NodeJs 3. Full Stack Senior Backend Developer Years of Experience: 7+ Skill set- .Net, Azure/ AWS, ReactJs, Angular, NodeJs 4.. Full Stack Mid Level Backend Developer Years of Experience: 6+ Skill set- .Net, Azure/ AWS, ReactJs , Angular, NodeJs Note- Need Immediate joinee (15 days max) Virtual Interview 17th October - 18th October , 9.30 AM - 5.30 PM Contact - Nibedita ( 9600167789 ) Interested candidate share your updated CV to nibedita.panigrahi@Kanini.com","location":"Chennai","experience":"7 - 12 Years"},{"date":"16, 17, 18, 19, 20, 21, 22, 23, 24, 25 - Oct - 2020","skills":"Manual Testing, Web Testing, Quality Analysis, Testing Types and Methodologies","qualification":"B.E./B.Tech, MCA/PGDCA","address":"OX SoftwareS Private Limited, Devapragasam Trade Centre, No.15, Ground Floor, A Block Center, Madura Garden, Poonamallee High Road, Maduravoyal, Chennai - 600 095","phone":"8056293534","profile":"Quality Analyst (Software Tester) \nOX SoftwareS Private Limited","description":"Roles and Responsibilities: We are looking for a QA Tester to assess software quality through manual testing. You will be responsible for finding and reporting bugs and glitches. In this role, you should have a keen eye for detail and excellent communication skills. If you are also competent in executing test cases and are passionate about quality, we'd like to meet you. Ultimately, you will ensure that our products, applications and systems work correctly. Key Skills: Sound knowledge in Manual Testing, Web Testing. Good knowledge of Testing Types and Methodologies. Proficiency in the preparation and execution of Test Cases. Exposure to any performance/functional tool will be an added advantage. Good analytical, written & communication skills. Knowledge in the eCommerce industry will be an added advantage. Relevant certification is a plus. Experience in automation testing is a plus Responsibilities: Understand customer requirements and create test cases based on it Peer review for test cases Test data creation in test systems Planning and executing as per the defined Test Strategy Handle and resolve customer escalations effectively Must be a self-starter, team player & be able to work with minimum supervision Must be self-motivated, and able to do multi-task Salary is not a constraint for the right candidate. Walk-in Date/ Time: 16th - 25th October 2020, 10.00 AM - 6.00 PM Venue Details- OX SoftwareS Private Limited Devapragasam Trade Centre, No.15, Ground Floor, A Block Center, Madura Garden, Poonamallee High Road, Maduravoyal, Chennai - 600 095 Contact Person- Seetha (8056293534) Timings: in between 10.00 am to 6.00 pm","location":"Chennai","experience":"2 - 5 Years"},{"date":"19, 20, 21, 22, 23 - Oct - 2020","skills":"Technical Support, Customer Support, International Voice Process","qualification":"B.E./B.Tech","address":"Genxlead Solutions Private Limited, Devapragasam Trade Centre, Madura Gardens, 15/491, B-1, Poonamallee High Road, Maduravoyal, Chennai - 600 095.","phone":"044-23781312","profile":"Trainee - Software Engineer (Male) \nGenxlead Solutions Private Limited","description":"Should diligently work on mailing, configure the mail system if necessary and take responsibility over the work. Should work on the snippet codes on Html, Php, MySQL and Perl allotted to, and should create productive programs within the project timeline. To optimize the lead conversion rates through the process of SMTP services. Plan and schedule an Email Calendar for promoting offer through SMTP services Understand the Pros and cons of an email campaign and work for the betterment of the same Keep a track on key metrics on an ongoing basis Derive insights from results and share recommendations with immediate superior. Walk-in Date/ Time: 19th October - 23 October , 11.00 AM - 2.00 PM Venue Details- Genxlead Solutions Private Limited Devapragasam Trade Centre, Madura Gardens, 15/491, B-1, Poonamallee High Road, Maduravoyal, Chennai - 600 095. If you are interested for this role, please call or you can reach us at 044-23781312 before coming for a walk-in. Note : Only Engineering graduates of ECE, CSE, EEE, IT with no standing arrears will be eligible. Do refer your friends if you find them interested in this requirement.","location":"Chennai","experience":"0 - 1 Years"},{"date":"16, 19, 20, 21, 22 - Oct - 2020","skills":"Technical Support, Desktop Support/ Network Support","qualification":"B.E./B.Tech, B.Sc, BCA/BCS","address":"Artemis Medicare Services Limited, Artemis Hospitals, Ground Floor, HR Department, Sector 51, Gurgaon","phone":"Not Provided","profile":"Desktop/ Network Support Engineer \nArtemis Medicare Services Limited","description":"Candidate should be BE/ B.Tech or MCA with 2 to 4 years of experience in Technical Support, Desktop Support/ Network Support. Must have excellent communication skills. Roles and Responsibilities: OS installation, configuring, Attending Desktop Problems Install, troubleshoot for printers, Computer hardware & other peripheral equipment Troubleshooting network connective in a LAN/ WAN, Good knowledge in Windows, MS Office products Outlook, desktop, laptops Switches L2,software installations, new computer setups, upgrades, Patch management for desktops, laptops, etc. You can walk-in from Monday to Friday between 2:00 PM to 4:00 PM Date: 14th October - 22nd October 2020 Venue Details- Artemis Medicare Services Limited Artemis Hospitals, Ground Floor, HR Department, Sector 51, Gurgaon Contact Person- Megha/ Jaideep Please seek entry from gate no 2.","location":"Gurgaon","experience":"2 - 4 Years"},{"date":"17 - Oct - 2020","skills":"ASP .Net, C#, Web API, HTML5, CSS and JavaScript frameworks","qualification":"B.E./B.Tech, MCA/PGDCA","address":"https://www.vyomlabs.com/careers/","phone":"Not Provided","profile":"Senior .NET Developers \nVyom Labs Private Limited","description":"Vyom Group of companies is conducting virtual walk-in for Senior .NET Developers who would be trained, groomed and given a chance to work on a booming technologies. Eligibility Criteria : MCA/ MSc/ ME/ M.Tech Pass outs Experience Required : 3 to 8 Years (Freshers Do Not Apply) Looking for immediate joiners only. Job Location: Pune Candidates should be ready to learn Out Systems (.NET based platform) Ready to travel across India and onsite once COVID situation is under control Ready to sign service agreement Candidate should have Degree in Computer Science, Business or related IT discipline with At least 3 years of hands-on Full Stack experience of developing cloud-native applications using ASP .Net and C# Mandatory skills: ASP .Net, C#, Web API, Hands-on experience in JavaScript and CSS customization Working experience in Agile software development and technical practices Familiar with OOP programing and Design pattern Familiar with HTML5, CSS and JavaScript frameworks Working experience with interfacing using SOAP/ REST API technologies Working experience in full-stack development will be an added advantage Working experience in Oracle database, SQL and PLSQL scripting will be an added advantage Working experience in setting up, configuring and administering Microsoft IIS will be an added advantage Good to have experience in workflow products Positive and willing to learn new technologies Ability to understand complex systems and think strategically about business, products and technical challenges Team player and passionate in championing the team to continuously refactor and improve to deliver the quality software product. Virtual Walk-in date : 17th October 2020 Webinar time : 10.00AM Procedure for Interview: 1. Webinar on pre-placement (30-45 mins/Link would be sent on mail one day before) 2. Online Test 3. Technical discussions and HR discussion (in next week) for the selected candidates only. How will it happen: 1. You need to apply to this job 2. You will get a Google Forms registration link 3. Selected candidates will get Zoom meeting joining link for next steps","location":"Pune","experience":"3 - 8 Years"},{"date":"15, 16, 17 - Oct - 2020","skills":"Technical Support, IT Helpdesk/ Service Desk, Customer Support","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Allsec Technologies Limited, 46 C, Velachery Main Road, Velachery, Chennai- 42. (Next to Velachery EB Office)","phone":"Not Provided","profile":"Technical Support Associates \nAllsec Technologies Limited","description":"We are hiring Fresher (2020) for Technical Voice Executive (Technical Support) for Day shift at All Sec Technologies Ltd in Chennai. Candidates should have good communication skill in English. Fluent in any one following language Hindi or Telugu or Kannada or Malayalam or Tamil. Interacting with Clients/ Customers - Over Call. Understanding the Technical queries. Resolving the Technical queries. Eligibility: Education (Graduation Must) - BE/ B.Tech/ Bsc/ BCA/ ME/ M.Tech/ MCA (2017, 2018 ,2019 and 2020 Fresher's can also apply) Fresher's & Experienced can apply. Age criteria: 18 - 27 Years. Perks and Benefits : Salary + Incentives. Interview Date: From 15th till 17th October 2020. Timing: 10.00 AM to 5.00 PM Please find the below venue details for your reference. Allsec Technologies Limited, 46 C, Velachery Main Road, Velachery, Chennai- 42. (Next to Velachery EB Office) Note: Candidate should have proper graduation without any standing Arrears will be consider. Candidates from 2020 Pass out without any standing Arrears till 5th or 7th Semester based their graduation will be consider. Direct Work No Work from Home.","location":"Chennai","experience":"0 - 1 Years"},{"date":"12, 13, 14, 15, 16, 17, 18 - Oct - 2020","skills":"Customer Relationship Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Jana Small Finance Bank Limited, Cosmo Bazar, Bagnan Station Road, Bagnan, Howrah, Kolkata - 7113 03.","phone":"Not Provided","profile":"Customer Relationship Executive \nJana Small Finance Bank Limited","description":"Candidate should be Any Graduate with 3 to 6 years of experience in Customer Relationship Management Must have excellent communication skills Job Responsibilities : Sourcing new customers, enhancing existing relationships, analyzing needs, cross sell of products & services. Handling walk in customers, providing service quality, Daily coordination with head offices, Complaint resolution within TAT, Daily CIBIL Logins on step by step complaints and queries of new customer/ existing customers. Movement of CASA Forms, Service Enquiry to the existing and related products & services of customers, adherence to process. Handling the Cashier responsibility in absence of Cashier. Walk-in Date/ Time: 12th October - 18th October , 9.30 AM - 5.30 PM Venue Details- Jana Small Finance Bank Limited, Cosmo Bazar, Bagnan Station Road, Bagnan, Howrah, Kolkata - 7113 03. Contact Person- Tuhin Kumar Ghosh","location":"Kolkata","experience":"3 - 6 Years"},{"date":"13 - Oct - 2020","skills":"Portfolio Management, Client Relationship Management, Wealth Management, Lead Generation","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Kotak Mahindra Bank Limited, Preet Vihar, East Delhi","phone":"Not Provided","profile":"Branch Relationship Manager \nKotak Mahindra Bank Limited","description":"We have Urgent openings for Branch Relationship Manager - Business Development for the entire Delhi- NCR location. Designation: Branch Relationship Manager (BRM) Grade: Deputy Manager/ Manager (M3) CTC Offered- Upto 6.50 LPA Maximum Age Limit - 32 Years Minimum work Experience- 4 Years Preferred candidates From Banking, Insurance, Stockbroking Only Job Profile Developing new and expanding existing High Net worth Customer(HNI) relationships for liabilities by sourcing customers. Sources new bank customers through external individual efforts and acquisition channel. Cross-sells bank products to the existing set of Branch customers which are mapped. Informs customers of new products or product enhancements to further expand the banking relationship. Maintains complete relationship record for assigned customer accounts. Responsible for NTB acquisition of customers. Originate/Develop new and expands existing HNI relationships for liabilities, specifically and across the range of KMBL product offering. Develop a database for lead generation, identifies market segments, strategies with acquisition channel. Plan and Conduct special sales initiatives and events for prospective and existing clients. Track customer complaints/queries and turnaround times to ensure a high level of customer satisfaction and provide information for product and service enhancements. Coordinate with other group companies to provide bank customers with seamless access to other group products. Job Requirement : Should have direct sales experience & orientation. Portfolio Management. Customer retention. Cost efficiency through the process. Immense interest in developing a relationship with the customers. Interview Date: 13th October 2020 Timing: 11:00 AM to 2:00 PM Interview Venue: Kotak Mahindra Bank Limited, Preet Vihar, East Delhi Note: Candidates coming after 1:00 pm won't be entertain","location":"Delhi","experience":"4 - 9 Years"},{"date":"13 - Oct - 2020","skills":"Portfolio Management, Customer Retention, Business Development","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Kotak Mahindra Bank Limited, Sector-16, Faridabad","phone":"Not Provided","profile":"Relationship Officer \nKotak Mahindra Bank Limited","description":"We have Urgent openings for Relationship Officer (Business Development) for the entire Delhi- NCR location. Job Requirement : Should have direct sales experience & orientation. Portfolio Management, Customer retention. Cost efficiency through the process. Immense interest in developing a relationship with the customers. Minimum work exp.- 2 year Maximum Age - 30 yrs Eligibility: Must be a Graduate with Fair English communication skills Must have a minimum of 2 years of experience in Sales Must have Field Sales Exposure and willing to hunt in the open market Designation: Relationship Officer - Business Development Grade: M2 - Deputy Manager CTC Offered- Upto 4.50 lac Job Profile Developing new and expanding existing High Net worth Customer(HNI) relationships for liabilities by sourcing customers. Sources new bank customers through external individual efforts and acquisition channel. Cross-sells bank products to the existing set of Branch customers which are mapped. Informs customers of new products or product enhancements to further expand the banking relationship. Maintains complete relationship record for assigned customer accounts. Responsible for NTB acquisition of customers. Responsible for successfully contacting 20 customers per day. Responsible for meeting 4 customers/ prospects per day. Responsible for 2 product sales (CASA, TD, SIP, MF, Insurance, Gold, Demat, Asset, Gift Card etc.) per day. Interview Date: 13th October 2020 Timing: 2:00 PM to 4:00 pm Interview Venue: Kotak Mahindra Bank Limited, Sector-16, Faridabad","location":"Faridabad","experience":"3 - 8 Years"},{"date":"13 - Oct - 2020","skills":"Tellecalling, Voice Process, Inbound/ Outbound Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"TEAMLEASE DIGITAL PRIVATE LIMITED, 3RD FLOOR, CROMPTON HOUSE, KODAMBAKKAM HIGH ROAD, NUNGAMABAKKAM, CHENNAI","phone":"8838139874","profile":"Telecalling Executive \nSBI TeamLease Services Limited","description":"Candidate should be Any Graduate with 6 months to 1 year of experience in Any BPO Sector. Must have excellent communication skills. Initiating sales with potential customers over the phone. Asking questions to engage customers and keep the conversation going. Listening to the customers' needs to generate repeat sales. Gathering and documenting customer information, payment methods, purchases, and reactions to products. Keeping up to date on all products and informing customers of new products. Answering customers' questions on the products. Meeting sales quotas. WALK_IN DATE/ TIME- 13th October 2020, 1 PM onwards TEAMLEASE DIGITAL PRIVATE LIMITED, 3RD FLOOR, CROMPTON HOUSE, KODAMBAKKAM HIGH ROAD, NUNGAMABAKKAM, CHENNAI LANDMARK- NEAR BY PALMGROVE HOTEL. SOUNDARYA HR / 8838139874","location":"Chennai","experience":"0 - 4 Years"},{"date":"13, 14 - Oct - 2020","skills":"Customer Service, Customer Support, Back Office, Customer Care","qualification":"Diploma, B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Aegis Customer Support Services Private Limited, 4th Floor, Essar House, Opp. Gujarat College, Ellisbridge, Ahmedabad - 380 006","phone":"Not Provided","profile":"Customer Care Executive \nAegis Customer Support Services Pvt. Limited","description":"Aegis Ahmedabad is required Customer Care Executive for one of the leading banking process Qualification: HSC/ Under Graduate/ Any Graduate Work Experience: 0 - 1 Years Fresher's can also apply Day shift only Fix Sunday off Must be good in Gujarati language Walk-in Date/ Time: 13th October - 14th October , 10.00 AM - 6.00 PM Venue Details- Aegis Customer Support Services Private Limited 4th Floor, Essar House, Opp. Gujarat College, Ellisbridge, Ahmedabad - 380 006","location":"Ahmedabad","experience":"0 - 1 Years"},{"date":"13, 14, 15 - Oct - 2020","skills":"Banking Process, Non Voice/ Chat Process, Customer Handling","qualification":"Diploma, B.A., B.Com, B.B.A, B.Sc","address":"Teleperformance Global Services Pvt. Limited, NSL Centrum Mall, Brand factory Building, Lift Lobby 2, 2nd Floor, Plot No-1062 & 1063, Phase 5, KPHB Colony, Opp Road to Forum Mall Lane, Hyderabad \u0096 500 072","phone":"Not Provided","profile":"Chat/ Banking Process Associate \nTeleperformance Global Services Pvt. Limited","description":"Candidate should be minimum 12th/ Any Graduate with excellent English Communication Skills Must have good communication skills with English, Hindi. Fresher / Experienced can apply. Should have good Customer handling skills. Rotational shifts, Rotational week off. 6 days a week. Open Positions - 30 Package : Freshers/ Experienced : 17,000 CTC (Fixed) Mode of Work :- Work From Office Typing :- 25 Words Per Minute. Interested candidates can walk-in for interview from 12th October - 15th October , 9.30 AM - 1.30 PM to the below mentioned address- Teleperformance Global Services Pvt. Limited NSL Centrum Mall, Brand factory Building, Lift Lobby 2, 2nd Floor, Plot No-1062 & 1063, Phase 5, KPHB Colony, Opp Road to Forum Mall Lane, Hyderabad \u0096 500 072","location":"Hyderabad","experience":"0 - 3 Years"},{"date":"13, 14, 15, 16, 17 - Oct - 2020","skills":"Back Office, MIS Preparation, MS Office/ Computer Operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Sterling Hospitals, Near Maharaja Agresan School, Gurukul Road, Memnagar, Ahmedabad- 380 052","phone":"079-40011954","profile":"Back Office Executive \nSterling Addlife India Private Limited","description":"Hiring candidates for Back office Executive/ Computer Operator at communication & correspondence with Units to handle back office responsibilities,. Computer work in MS Office, MIS Preparation, Communication & correspondence with Units Client companies, Taking feedback &. Reports etc. Graduation in Any stream is must. Freshers can also apply. Should be comfortable with rotation duties. We are looking preferably for male candidates. Walk-in Date/ Time: 13th October - 17th October , 10.00 AM - 4.00 PM Venue Details- Sterling Addlife India Private Limited Sterling Hospitals, Near Maharaja Agresan School, Gurukul Road, Memnagar, Ahmedabad- 380 052 Contact - Kinjal Rathod (07940011954)","location":"Ahmedabad","experience":"0 - 1 Years"},{"date":"13, 14, 15, 16, 17 - Oct - 2020","skills":"HR Generalist Activities, Human Resource Management, Employee Engagement, HR Operations","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Starmark Fitness Studios Pvt. Limited, 85 PRINCE ANWAR SHAH ROAD, FIRST FLOOR, CITY HIGH BUILDING, near Navina Cinema Hall, Kolkata, West Bengal - 700 033","phone":"6291031933","profile":"HR Executive (Female Only) \nStarmark Fitness Studios Pvt. Limited","description":"Applicant must be well versed with all the gamuts of HR. Must have a good & pleasing personality. Must have good communication skills Without good communication, skill please don't apply Required Candidate profile- Recruitment, Hiring, Selection. It is 10 am to 7 pm job profile for HR Executive. Must be good looking and experienced with fluent English communication. Must be below 35 years of age Female only. It's a walk-in Interview please call at 6291031933 for more details. Date/ Time: 13th October - 17th October , 11.00 AM - 5.30 PM VENUE- Starmark Fitness Studios Pvt. Limited 85 PRINCE ANWAR SHAH ROAD, FIRST FLOOR, CITY HIGH BUILDING, near Navina Cinema Hall, Kolkata, West Bengal - 700 033 Contact - Dipti Mehrotra ( 6291031933 )","location":"Kolkata","experience":"1 - 5 Years"},{"date":"13 - Oct - 2020","skills":"Semi Voice/ Voice Process, International Voice Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Avanze Technologies India Pvt. Limited, # 403, 3rd & 4th Floor, Above Reliance Digital, Kammanahalli Main Road, HRBR Layout 3rd Block, Kalyan Nagar, Bengaluru","phone":"080-4670000","profile":"Semi Voice Process Executive - US \nAvanze Technologies India Private Limited","description":"Avanze Technologies India Pvt. Limited is looking for BPO Professionals with experience in Voice/ Semi Voice Process IMMEDIATE JOINERS PREFERED Please call 9535770036 for interviews. Walk-in Date/ Time: 13th October 2020, 9.30 AM - 5.30 PM Venue Details- Avanze Technologies India Pvt. Limited # 403, 3rd & 4th Floor, Above Reliance Digital, Kammanahalli Main Road, HRBR Layout 3rd Block, Kalyan Nagar, Bengaluru Landmark: Jalvayu Vihar/ Cafe Coffee Day Contact - HR (080-46700000)","location":"Bangalore","experience":"2 - 7 Years"},{"date":"13, 14, 15 - Oct - 2020","skills":"Core Java, Advanced Java/ J2Ee, Hibernate, Spring","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Stemetric IT Solutions Private Limited, 101/A, 1st Floor, Plot #2, Above Karnataka Bank, Opposite to, Image Gardens Road, HITEC City, Hyderabad, Telangana - 500 081.","phone":"Not Provided","profile":"JAVA Developers \nStemetric IT Solutions Private Limited","description":"Stemetric IT Solutions Private Limited, is having Opportunity For Trained or Experienced Candidates for the position of JAVA Developer Prerequisite: Candidate should be Trained/ Experienced on Java Technologies Core Java, Advanced Java/ J2Ee, Hibernate, Spring Work Experience: 0 to 5 Years 2019-2020 Passed outs are not allowed. Job Location: Hyderabad Walk-in Date/ Time: 13th October - 15th October , 10.30 AM - 1.00 PM Venue Details- Stemetric IT Solutions Private Limited 101/A, 1st Floor, Plot #2, Above Karnataka Bank, Opposite to, Image Gardens Road, HITEC City, Hyderabad, Telangana - 500 081. Contact Person- SAI SIRISHA If your interested please share your Updated Resume to recruiter@stemetricitsolutions.com","location":"Hyderabad","experience":"0 - 5 Years"},{"date":"16, 17 - Oct - 2020","skills":"JAVA, Python, Node JS, C++ ,C#, .Net","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Soft Suave Technologies Private Limited, Gayatri Tech Park 4th floor Plot No 183, EPIP, Near iGate, KIADB Industrial Area, Road, 1B, EPIP Zone Whitefield Rd, Kundalahalli, Whitefield, Bengaluru, Karnataka - 560 066","phone":"Not Provided","profile":"Full Stack Developer (Java/ .Net) \nSoft Suave Technologies Private Limited","description":"Candidate should have good knowledge in JAVA, Python, Node JS, C++ ,C#, .Net with Logical and analytical thinking towards the programming Eligibility Criteria: BE/ B.Tech/ ME/ M.Tech/ MCA 2018, 2019 passed outs only. Immediate Joiners. Job Responsibility: Execute full software development life cycle (SDLC) Code, test and troubleshoot programs utilizing the appropriate framework, database, and programming technology. Write quality and clean code using prescribed specifications. Analyze performance of programs and take action to correct deficiencies . Levels of Interview: Level 1: Online test (the moment you apply for this job, you receive online link your mail with in 2-3 days) Level 2 & 3: Online Programming Test Level 4: Technical Interview Walk-in Date/ Time: 16th October - 17th October , 10.30 AM - 3.30 PM Venue Details- Soft Suave Technologies Private Limited Gayatri Tech Park 4th floor Plot No 183, EPIP, Near iGate, KIADB Industrial Area, Road, 1B, EPIP Zone Whitefield Rd, Kundalahalli, Whitefield, Bengaluru, Karnataka - 560 066","location":"Bangalore","experience":"0 - 2 Years"},{"date":"14 - Oct - 2020","skills":"Core Java (v1.5 and above), J2EE/ JEE with Spring and or Struts","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Please share your profile on above given email and get yourself shortlisted for the interview this Wednesday.","phone":"Virtual Walk in","profile":"Java/ J2EE Developers \nInterra InfoTech India Private Limited","description":"We are conducting a recruitment drive on Wednesday, October 14, 2020, for the position of Java/ J2EE Developers. Required Experience/ Skills- Core Java (v1.5 and above), J2EE/ JEE with Spring and or Struts Working knowledge with Databases SQL, JDBC Frontend - JSP, HTML, CSS, JavaScript Experience with Application Servers (WebSphere/ Weblogic/ JBoss) Knowledge about and experienced with MQ Series is a plus Excellent English both verbal and written communication skills. If you are someone with the skills suited for the job position, please share your profile with us now on Email Id: Careers@InterraIT.COM and get yourself shortlisted for the interview this Wednesday.","location":"Noida, Kolkata","experience":"2 - 7 Years"},{"date":"12, 13, 14, 15, 16, 17, 18 - Oct - 2020","skills":"Customer Relationship Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Jana Small Finance Bank Limited, Cosmo Bazar, Bagnan Station Road, Bagnan, Howrah, PIN - 711303.","phone":"Not Provided","profile":"Customer Relationship Executive \nJana Small Finance Bank Limited","description":"Jana Small Finance Bank Limited, is looking for Customer Relationship Executive (CRE) Key Responsibilities : Sourcing new customers, enhancing existing relationships, analyzing needs, cross sell of products & services. Handling walk in customers, providing service quality, Daily coordination with head offices, Complaint resolution within TAT, Daily CIBIL Logins on step by step complaints and queries of new customer/ existing customers. Movement of CASA Forms, Service Enquiry to the existing and related products & services of customers, adherence to process. Handling the Cashier responsibility in absence of Cashier. Walk-in Dare- 12th October - 18th October , 9.30 AM - 5.30 PM Venue Details- Jana Small Finance Bank Limited, Cosmo Bazar, Bagnan Station Road, Bagnan, Howrah, PIN - 711303. Contact Person- Tuhin Kumar Ghosh Interested candidates kindly share the resumes on swarnendu.roy@janabank.com","location":"Kolkata","experience":"0 - 1 Years"},{"date":"12, 13, 14, 15, 16, 17, 19, 20, 21 - Oct - 2020","skills":"Desktop Support, LAN, Laptop Support, Networking","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Chamunda Tech-Net Services Pvt. Limited 401 L wing, Tex Center, Near Narayan Plaza, Chandivali Andher (East), Mumbai","phone":"Not Provided","profile":"Technical Support Engineer \nChamunda Tech-Net Services Pvt. Limited","description":"Candidate should be Any Graduate with Windows and Desktop Installation and Administration skills Must have excellent communication skills Job Responsibility- Office applications - Install, Configure and Support OS Drivers and Patch installation Desktop/ Laptop hardware and OS Installation Patch Installation Desktop support LAN Troubleshooting Walk-in Date/ Time: 12th October - 21st October , 9.30 AM - 5.30 PM Venue Details- Chamunda Tech-Net Services Pvt. Limited 401 L wing, Tex Center, Near Narayan Plaza, Chandivali Andher (East), Mumbai Contact Person- Rupesh Patil Phone No. 9821381118","location":"Mumbai","experience":"0 - 1 Years"},{"date":"12, 13, 14, 15, 16, 17, 19, 20, 21, 22 - Oct - 2020","skills":"Email Support, Customer Service, Customer Calling, Backend Support","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"CorpAid Services Private Limited, 101 102, First Floor, Gulmohar Apartment, East Street, Camp Pune - 411001","phone":"9112211104","profile":"Customer Support Executive \nCorpAid Services Private Limited","description":"Candidate should be Any Graduate with Good English Communication Skills Must have Basic Knowledge of Computer Operations The only Candidate apply whose age between 20 to 30 Salary Offer: As per Industry Standard Walk-in Date/ Time: 12th October - 22nd October , 10 AM onwards Venue Details- CorpAid Services Private Limited 101 102, First Floor, Gulmohar Apartment, East Street, Camp Pune - 411 001. Contact Person- Sulakshana HR Contact No.: 8669998509/ 9112211104","location":"Pune","experience":"0 - 2 Years"},{"date":"12, 13, 14, 15, 16, 17, 19, 20, 21 - Oct - 2020","skills":"Customer Service, Inbound Process, Customer Support","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"1Point1 Solutions Limited, Plot No. 17, Sector-18 Near Sarhaul Mod Gurgaon, Haryana","phone":"9999535416","profile":"Customer Support - Inbound Process \nOne Point One Solutions Limited","description":"First point of contact for customers calling for Support Engineer is expected to interact with customers to identify the issue, create case with correct documentation and guide the case to correct department for further troubleshooting. Candidates working with any kind of Voice based customer support/ Semi- Technical Support/ Product Support are the preferred ones. Must possess Best-in-class Communication skills to provide premium level support to our valued Customers. Core Skills- Excellent Soft skills to build customer rapport for an effectively controlled interaction Direct Customer Handling Experience Excellent written & verbal communication skills in English Good typing speed and ability to take notes while talking to the customer Eligibility Criteria- Fresher - Male/ Female both can apply for this job. Candidate must be 12th Pass [Under graduate and graduate can apply] Candidate must speak fluent English & Hindi Must know basic computer. Job Responsibility- 1) Attending customer queries over the phone and providing solutions. 2) Following quality parameters while talking or dealing with customers and clients. 3) Resolving matters in the best interest of both the customer and the company 4) Participating in all organizational activities like RNR | Fun Activities and Sports activities. 5) Coordination with Team Supervisor and colleagues in case of any doubts and problems Other Details- Shift For Female Employee : 9am to 6pm and 9:30am to 6:30pm. For Male- Rotational Shifts. Six days working and 1 week off. Salary : 11314k CTC to 18000K CTC basis of Final Interview Interested candidates may walk-in on given venue/ Or can call/ Whats app on given below no :- 12th October - 21st October , 9.30 AM - 5.30 PM 1Point1 Solutions Limited Plot No. 17, Sector-18 Near Sarhaul Mod Gurgaon, Haryana Sunny Kaushik- 9999535416","location":"Gurgaon","experience":"0 - 1 Years"},{"date":"10 - Oct - 2020","skills":"Customer Support, Voice Process, Voice Support","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Equiniti India Private Limited, Zed Tech Park 1st Floor, Electronic City Phase 1, Bangalore, Karnataka.","phone":"Not Provided","profile":"Customer Support Executive \nEquiniti India Private Limited","description":"In the role of Customer Experience Executive/Sr CEE/SME/TL you would need to assist shareholders in buying & selling shares, in accordance with predetermined procedures & service standards under appropriate guidance and direction. Eligible Criteria: Any Graduates/ Post Graduates. Years of Experience in International Voice Process from 1 to 7 years. Candidate should be comfortable to work in US Shift (Night Shift). The successful candidate will be responsible for: Answer inbound calls, emails from Shareholders and assist them with their queries within the agreed service standards, Contribute to the completion of the teams workload, Undertake duties at a similar level as required, Always to undertake the duties of this role in accordance with the requirements of the company's Regulators, Ensure that all work is undertaken within the quality system, Ensure that work and ethics comply with all security arrangements both physical and information. To be the successful candidate one would need to possess the below: Strong command on English language speaking & call handling Understanding of Customer Experience /BPO Prior experience of international voice process Satisfactory resolution of queries. Walk-in Date/ Time: 10th October 2020, 10.00 AM - 1.30 PM Venue Details- Equiniti India Private Limited, Zed Tech Park 1st Floor, Electronic City Phase 1, Bangalore, Karnataka. Contact Person - Chandra","location":"Bangalore","experience":"1 - 7 Years"},{"date":"10 - Oct - 2020","skills":"MIS Reporting, Stakeholder Management, MIS, Bidata Analyst","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Flipkart Grocery, PMR Warehousing, Next to Commando Dogs training, Devarayamjal Village road, Medchal, Hyderabad.","phone":"Not Provided","profile":"Backend Executive - MIS Reporting \nFlipkart Internet Private Limited","description":"Walk-in for MIS Operations only for Female Hiring-Executive operations for (MIS Reporting) Grocery FC-Hyderabad. Qualification: Any Graduates/ Post Graduates Can apply Work Experience: 1- 4Years in MIS Reporting CTC : Upto 4 LPA including variable. Notice Period : Not more than 20 days/ Immediate Joiners Preferred Must Haves: 1. Strong in problem-solving and analytical skills. 2. Technical capabilities: SQL and Excel.. 3. Experience in analyzing very large, complex, multi-dimensional data sets. 4.MIS reporting (Vlookup, Hlookup, Sumif, Pivot etc) : 5.Should have hands on team handling. 6. Should be good at communication Analytical and problem solving skills. Strong technical skills. The ability to work well under pressure. Attention to detail with Teamworking skills. Organisation and time management. Interpersonal and communication skills. Management and leadership skills. Job location : Grocery Warehouse Medchal Hyderabad. Walk-in Interview Date & Time: 9th & 10th October : Between 10AM to 4:00PM Address for Walk-in: Flipkart Grocery, PMR Warehousing, Next to Commando Dogs training, Devarayamjal Village road, Medchal, Hyderabad. SPOC: Ramesh Gantha / Chandrashekar Note: This position is open only for Female applicants ,other will not be allowed for the interview.","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"10 - Oct - 2020","skills":"Handling Customer Queries, Customer Service, Customer Support","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Rosmerta Safety Systems (P) Limited, 137, Udyog Vihar, Phase - I, Gurugram, Haryana - 122 016","phone":"Not Provided","profile":"Customer Care Executive \nRosmerta Technologies Limited","description":"Candidate should be Any Graduate with good communication skills Must be well versed in remote support to customer queries Must have exposure of call center specially helpline Can join us immediately Roles & Responsibilities- Handling & managing of customer queries over call Dealing with OEMs, Dealers or directly with the customers & providing solution to their queries related to HSRP order Maintaining relationship with the customer to increase HSRP orders Proactive resolutions of query raised Sharing daily, weekly, monthly, quarterly & annual reports Complaint resolutions percentage under detailed timeline & control process Walk-in Date/ Time: 10th October 2020, 10.00 AM - 5.00 PM Venue Details- Rosmerta Safety Systems (P) Limited 137, Udyog Vihar, Phase - I, Gurugram, Haryana - 122 016 Contact Person - Rahul Tiwari","location":"Gurgaon","experience":"1 - 6 Years"},{"date":"10 - Oct - 2020","skills":"Tender Registration, Bidding, e Tendering","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Alankit House, 4E/2 Jhandewalan Extension New Delhi -110 055. Landmark:- Near post office","phone":"7290012325","profile":"Tender Executive - Preferably Male \nAlankit Limited","description":"Person should be Any Graduate with minimum 6 month experience in Tender. Follow up Tender Registration & Payments in various Govt. Department. Should be responsible to handle tenders published on GEM Portal. Prepare documents for e-Tendering, Studying tender documents, qualification criteria, scope of work, Floating RFQ to various vendors/ contractors, collecting quotations, preparing comparative statements, meeting deadlines for the tenders received from public sector undertaking Govt. and other organizations. Prepare Bills of All Departments Follow ups from client regarding order. Convert inquiries into order. Preparing MIS weekly/ Monthly Reports. Date & Timing: 10th October 2020 @ 10:00 AM to 1:00 PM Venue Details:- Alankit House, 4E/2 Jhandewalan Extension New Delhi -110 055 Landmark:- Near post office Nearest Metro Station:- Jhandewalan Metro Station Gate No. 2 Contact Person:- Ms. Usha Phone:- 7290012325 Note:- Interested candidate can share their resume on ushar@alankit.com OR call on 7290012325.","location":"Delhi","experience":"0 - 1 Years"},{"date":"12, 13, 14, 15, 16, 17, 19, 20, 21 - Oct - 2020","skills":"Desktop Support, LAN, Laptop Support, Networking","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Chamunda Tech-Net Services Pvt. Limited 401 L wing, Tex Center, Near Narayan Plaza, Chandivali Andher (East), Mumbai","phone":"Not Provided","profile":"Technical Support Engineer \nChamunda Tech-Net Services Pvt. Limited","description":"Candidate should be Any Graduate with Windows and Desktop Installation and Administration skills Must have excellent communication skills Job Responsibility- Office applications - Install, Configure and Support OS Drivers and Patch installation Desktop/ Laptop hardware and OS Installation Patch Installation Desktop support LAN Troubleshooting Walk-in Date/ Time: 12th October - 21st October , 9.30 AM - 5.30 PM Venue Details- Chamunda Tech-Net Services Pvt. Limited 401 L wing, Tex Center, Near Narayan Plaza, Chandivali Andher (East), Mumbai Contact Person- Rupesh Patil Phone No. 9821381118","location":"Mumbai","experience":"0 - 1 Years"},{"date":"12, 13, 14, 15, 16, 17, 19, 20, 21, 22 - Oct - 2020","skills":"Email Support, Customer Service, Customer Calling, Backend Support","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"CorpAid Services Private Limited, 101 102, First Floor, Gulmohar Apartment, East Street, Camp Pune - 411001","phone":"9112211104","profile":"Customer Support Executive \nCorpAid Services Private Limited","description":"Candidate should be Any Graduate with Good English Communication Skills Must have Basic Knowledge of Computer Operations The only Candidate apply whose age between 20 to 30 Salary Offer: As per Industry Standard Walk-in Date/ Time: 12th October - 22nd October , 10 AM onwards Venue Details- CorpAid Services Private Limited 101 102, First Floor, Gulmohar Apartment, East Street, Camp Pune - 411 001. Contact Person- Sulakshana HR Contact No.: 8669998509/ 9112211104","location":"Pune","experience":"0 - 2 Years"},{"date":"12, 13, 14, 15, 16, 17, 19, 20, 21 - Oct - 2020","skills":"Customer Service, Inbound Process, Customer Support","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"1Point1 Solutions Limited, Plot No. 17, Sector-18 Near Sarhaul Mod Gurgaon, Haryana","phone":"9999535416","profile":"Customer Support - Inbound Process \nOne Point One Solutions Limited","description":"First point of contact for customers calling for Support Engineer is expected to interact with customers to identify the issue, create case with correct documentation and guide the case to correct department for further troubleshooting. Candidates working with any kind of Voice based customer support/ Semi- Technical Support/ Product Support are the preferred ones. Must possess Best-in-class Communication skills to provide premium level support to our valued Customers. Core Skills- Excellent Soft skills to build customer rapport for an effectively controlled interaction Direct Customer Handling Experience Excellent written & verbal communication skills in English Good typing speed and ability to take notes while talking to the customer Eligibility Criteria- Fresher - Male/ Female both can apply for this job. Candidate must be 12th Pass [Under graduate and graduate can apply] Candidate must speak fluent English & Hindi Must know basic computer. Job Responsibility- 1) Attending customer queries over the phone and providing solutions. 2) Following quality parameters while talking or dealing with customers and clients. 3) Resolving matters in the best interest of both the customer and the company 4) Participating in all organizational activities like RNR | Fun Activities and Sports activities. 5) Coordination with Team Supervisor and colleagues in case of any doubts and problems Other Details- Shift For Female Employee : 9am to 6pm and 9:30am to 6:30pm. For Male- Rotational Shifts. Six days working and 1 week off. Salary : 11314k CTC to 18000K CTC basis of Final Interview Interested candidates may walk-in on given venue/ Or can call/ Whats app on given below no :- 12th October - 21st October , 9.30 AM - 5.30 PM 1Point1 Solutions Limited Plot No. 17, Sector-18 Near Sarhaul Mod Gurgaon, Haryana Sunny Kaushik- 9999535416","location":"Gurgaon","experience":"0 - 1 Years"},{"date":"10 - Oct - 2020","skills":"Customer Support, Voice Process, Voice Support","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Equiniti India Private Limited, Zed Tech Park 1st Floor, Electronic City Phase 1, Bangalore, Karnataka.","phone":"Not Provided","profile":"Customer Support Executive \nEquiniti India Private Limited","description":"In the role of Customer Experience Executive/Sr CEE/SME/TL you would need to assist shareholders in buying & selling shares, in accordance with predetermined procedures & service standards under appropriate guidance and direction. Eligible Criteria: Any Graduates/ Post Graduates. Years of Experience in International Voice Process from 1 to 7 years. Candidate should be comfortable to work in US Shift (Night Shift). The successful candidate will be responsible for: Answer inbound calls, emails from Shareholders and assist them with their queries within the agreed service standards, Contribute to the completion of the teams workload, Undertake duties at a similar level as required, Always to undertake the duties of this role in accordance with the requirements of the company's Regulators, Ensure that all work is undertaken within the quality system, Ensure that work and ethics comply with all security arrangements both physical and information. To be the successful candidate one would need to possess the below: Strong command on English language speaking & call handling Understanding of Customer Experience /BPO Prior experience of international voice process Satisfactory resolution of queries. Walk-in Date/ Time: 10th October 2020, 10.00 AM - 1.30 PM Venue Details- Equiniti India Private Limited, Zed Tech Park 1st Floor, Electronic City Phase 1, Bangalore, Karnataka. Contact Person - Chandra","location":"Bangalore","experience":"1 - 7 Years"},{"date":"10 - Oct - 2020","skills":"MIS Reporting, Stakeholder Management, MIS, Bidata Analyst","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Flipkart Grocery, PMR Warehousing, Next to Commando Dogs training, Devarayamjal Village road, Medchal, Hyderabad.","phone":"Not Provided","profile":"Backend Executive - MIS Reporting \nFlipkart Internet Private Limited","description":"Walk-in for MIS Operations only for Female Hiring-Executive operations for (MIS Reporting) Grocery FC-Hyderabad. Qualification: Any Graduates/ Post Graduates Can apply Work Experience: 1- 4Years in MIS Reporting CTC : Upto 4 LPA including variable. Notice Period : Not more than 20 days/ Immediate Joiners Preferred Must Haves: 1. Strong in problem-solving and analytical skills. 2. Technical capabilities: SQL and Excel.. 3. Experience in analyzing very large, complex, multi-dimensional data sets. 4.MIS reporting (Vlookup, Hlookup, Sumif, Pivot etc) : 5.Should have hands on team handling. 6. Should be good at communication Analytical and problem solving skills. Strong technical skills. The ability to work well under pressure. Attention to detail with Teamworking skills. Organisation and time management. Interpersonal and communication skills. Management and leadership skills. Job location : Grocery Warehouse Medchal Hyderabad. Walk-in Interview Date & Time: 9th & 10th October : Between 10AM to 4:00PM Address for Walk-in: Flipkart Grocery, PMR Warehousing, Next to Commando Dogs training, Devarayamjal Village road, Medchal, Hyderabad. SPOC: Ramesh Gantha / Chandrashekar Note: This position is open only for Female applicants ,other will not be allowed for the interview.","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"10 - Oct - 2020","skills":"Handling Customer Queries, Customer Service, Customer Support","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Rosmerta Safety Systems (P) Limited, 137, Udyog Vihar, Phase - I, Gurugram, Haryana - 122 016","phone":"Not Provided","profile":"Customer Care Executive \nRosmerta Technologies Limited","description":"Candidate should be Any Graduate with good communication skills Must be well versed in remote support to customer queries Must have exposure of call center specially helpline Can join us immediately Roles & Responsibilities- Handling & managing of customer queries over call Dealing with OEMs, Dealers or directly with the customers & providing solution to their queries related to HSRP order Maintaining relationship with the customer to increase HSRP orders Proactive resolutions of query raised Sharing daily, weekly, monthly, quarterly & annual reports Complaint resolutions percentage under detailed timeline & control process Walk-in Date/ Time: 10th October 2020, 10.00 AM - 5.00 PM Venue Details- Rosmerta Safety Systems (P) Limited 137, Udyog Vihar, Phase - I, Gurugram, Haryana - 122 016 Contact Person - Rahul Tiwari","location":"Gurgaon","experience":"1 - 6 Years"},{"date":"10 - Oct - 2020","skills":"Tender Registration, Bidding, e Tendering","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Alankit House, 4E/2 Jhandewalan Extension New Delhi -110 055. Landmark:- Near post office","phone":"7290012325","profile":"Tender Executive - Preferably Male \nAlankit Limited","description":"Person should be Any Graduate with minimum 6 month experience in Tender. Follow up Tender Registration & Payments in various Govt. Department. Should be responsible to handle tenders published on GEM Portal. Prepare documents for e-Tendering, Studying tender documents, qualification criteria, scope of work, Floating RFQ to various vendors/ contractors, collecting quotations, preparing comparative statements, meeting deadlines for the tenders received from public sector undertaking Govt. and other organizations. Prepare Bills of All Departments Follow ups from client regarding order. Convert inquiries into order. Preparing MIS weekly/ Monthly Reports. Date & Timing: 10th October 2020 @ 10:00 AM to 1:00 PM Venue Details:- Alankit House, 4E/2 Jhandewalan Extension New Delhi -110 055 Landmark:- Near post office Nearest Metro Station:- Jhandewalan Metro Station Gate No. 2 Contact Person:- Ms. Usha Phone:- 7290012325 Note:- Interested candidate can share their resume on ushar@alankit.com OR call on 7290012325.","location":"Delhi","experience":"0 - 1 Years"},{"date":"12, 13, 14, 15, 16, 17, 19, 20, 21 - Oct - 2020","skills":"Desktop Support, LAN, Laptop Support, Networking","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Chamunda Tech-Net Services Pvt. Limited 401 L wing, Tex Center, Near Narayan Plaza, Chandivali Andher (East), Mumbai","phone":"Not Provided","profile":"Technical Support Engineer \nChamunda Tech-Net Services Pvt. Limited","description":"Candidate should be Any Graduate with Windows and Desktop Installation and Administration skills Must have excellent communication skills Job Responsibility- Office applications - Install, Configure and Support OS Drivers and Patch installation Desktop/ Laptop hardware and OS Installation Patch Installation Desktop support LAN Troubleshooting Walk-in Date/ Time: 12th October - 21st October , 9.30 AM - 5.30 PM Venue Details- Chamunda Tech-Net Services Pvt. Limited 401 L wing, Tex Center, Near Narayan Plaza, Chandivali Andher (East), Mumbai Contact Person- Rupesh Patil Phone No. 9821381118","location":"Mumbai","experience":"0 - 1 Years"},{"date":"12, 13, 14, 15, 16, 17, 19, 20, 21, 22 - Oct - 2020","skills":"Email Support, Customer Service, Customer Calling, Backend Support","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"CorpAid Services Private Limited, 101 102, First Floor, Gulmohar Apartment, East Street, Camp Pune - 411001","phone":"9112211104","profile":"Customer Support Executive \nCorpAid Services Private Limited","description":"Candidate should be Any Graduate with Good English Communication Skills Must have Basic Knowledge of Computer Operations The only Candidate apply whose age between 20 to 30 Salary Offer: As per Industry Standard Walk-in Date/ Time: 12th October - 22nd October , 10 AM onwards Venue Details- CorpAid Services Private Limited 101 102, First Floor, Gulmohar Apartment, East Street, Camp Pune - 411 001. Contact Person- Sulakshana HR Contact No.: 8669998509/ 9112211104","location":"Pune","experience":"0 - 2 Years"},{"date":"12, 13, 14, 15, 16, 17, 19, 20, 21 - Oct - 2020","skills":"Customer Service, Inbound Process, Customer Support","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"1Point1 Solutions Limited, Plot No. 17, Sector-18 Near Sarhaul Mod Gurgaon, Haryana","phone":"9999535416","profile":"Customer Support - Inbound Process \nOne Point One Solutions Limited","description":"First point of contact for customers calling for Support Engineer is expected to interact with customers to identify the issue, create case with correct documentation and guide the case to correct department for further troubleshooting. Candidates working with any kind of Voice based customer support/ Semi- Technical Support/ Product Support are the preferred ones. Must possess Best-in-class Communication skills to provide premium level support to our valued Customers. Core Skills- Excellent Soft skills to build customer rapport for an effectively controlled interaction Direct Customer Handling Experience Excellent written & verbal communication skills in English Good typing speed and ability to take notes while talking to the customer Eligibility Criteria- Fresher - Male/ Female both can apply for this job. Candidate must be 12th Pass [Under graduate and graduate can apply] Candidate must speak fluent English & Hindi Must know basic computer. Job Responsibility- 1) Attending customer queries over the phone and providing solutions. 2) Following quality parameters while talking or dealing with customers and clients. 3) Resolving matters in the best interest of both the customer and the company 4) Participating in all organizational activities like RNR | Fun Activities and Sports activities. 5) Coordination with Team Supervisor and colleagues in case of any doubts and problems Other Details- Shift For Female Employee : 9am to 6pm and 9:30am to 6:30pm. For Male- Rotational Shifts. Six days working and 1 week off. Salary : 11314k CTC to 18000K CTC basis of Final Interview Interested candidates may walk-in on given venue/ Or can call/ Whats app on given below no :- 12th October - 21st October , 9.30 AM - 5.30 PM 1Point1 Solutions Limited Plot No. 17, Sector-18 Near Sarhaul Mod Gurgaon, Haryana Sunny Kaushik- 9999535416","location":"Gurgaon","experience":"0 - 1 Years"},{"date":"10 - Oct - 2020","skills":"Customer Support, Voice Process, Voice Support","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Equiniti India Private Limited, Zed Tech Park 1st Floor, Electronic City Phase 1, Bangalore, Karnataka.","phone":"Not Provided","profile":"Customer Support Executive \nEquiniti India Private Limited","description":"In the role of Customer Experience Executive/Sr CEE/SME/TL you would need to assist shareholders in buying & selling shares, in accordance with predetermined procedures & service standards under appropriate guidance and direction. Eligible Criteria: Any Graduates/ Post Graduates. Years of Experience in International Voice Process from 1 to 7 years. Candidate should be comfortable to work in US Shift (Night Shift). The successful candidate will be responsible for: Answer inbound calls, emails from Shareholders and assist them with their queries within the agreed service standards, Contribute to the completion of the teams workload, Undertake duties at a similar level as required, Always to undertake the duties of this role in accordance with the requirements of the company's Regulators, Ensure that all work is undertaken within the quality system, Ensure that work and ethics comply with all security arrangements both physical and information. To be the successful candidate one would need to possess the below: Strong command on English language speaking & call handling Understanding of Customer Experience /BPO Prior experience of international voice process Satisfactory resolution of queries. Walk-in Date/ Time: 10th October 2020, 10.00 AM - 1.30 PM Venue Details- Equiniti India Private Limited, Zed Tech Park 1st Floor, Electronic City Phase 1, Bangalore, Karnataka. Contact Person - Chandra","location":"Bangalore","experience":"1 - 7 Years"},{"date":"10 - Oct - 2020","skills":"MIS Reporting, Stakeholder Management, MIS, Bidata Analyst","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Flipkart Grocery, PMR Warehousing, Next to Commando Dogs training, Devarayamjal Village road, Medchal, Hyderabad.","phone":"Not Provided","profile":"Backend Executive - MIS Reporting \nFlipkart Internet Private Limited","description":"Walk-in for MIS Operations only for Female Hiring-Executive operations for (MIS Reporting) Grocery FC-Hyderabad. Qualification: Any Graduates/ Post Graduates Can apply Work Experience: 1- 4Years in MIS Reporting CTC : Upto 4 LPA including variable. Notice Period : Not more than 20 days/ Immediate Joiners Preferred Must Haves: 1. Strong in problem-solving and analytical skills. 2. Technical capabilities: SQL and Excel.. 3. Experience in analyzing very large, complex, multi-dimensional data sets. 4.MIS reporting (Vlookup, Hlookup, Sumif, Pivot etc) : 5.Should have hands on team handling. 6. Should be good at communication Analytical and problem solving skills. Strong technical skills. The ability to work well under pressure. Attention to detail with Teamworking skills. Organisation and time management. Interpersonal and communication skills. Management and leadership skills. Job location : Grocery Warehouse Medchal Hyderabad. Walk-in Interview Date & Time: 9th & 10th October : Between 10AM to 4:00PM Address for Walk-in: Flipkart Grocery, PMR Warehousing, Next to Commando Dogs training, Devarayamjal Village road, Medchal, Hyderabad. SPOC: Ramesh Gantha / Chandrashekar Note: This position is open only for Female applicants ,other will not be allowed for the interview.","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"10 - Oct - 2020","skills":"Handling Customer Queries, Customer Service, Customer Support","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Rosmerta Safety Systems (P) Limited, 137, Udyog Vihar, Phase - I, Gurugram, Haryana - 122 016","phone":"Not Provided","profile":"Customer Care Executive \nRosmerta Technologies Limited","description":"Candidate should be Any Graduate with good communication skills Must be well versed in remote support to customer queries Must have exposure of call center specially helpline Can join us immediately Roles & Responsibilities- Handling & managing of customer queries over call Dealing with OEMs, Dealers or directly with the customers & providing solution to their queries related to HSRP order Maintaining relationship with the customer to increase HSRP orders Proactive resolutions of query raised Sharing daily, weekly, monthly, quarterly & annual reports Complaint resolutions percentage under detailed timeline & control process Walk-in Date/ Time: 10th October 2020, 10.00 AM - 5.00 PM Venue Details- Rosmerta Safety Systems (P) Limited 137, Udyog Vihar, Phase - I, Gurugram, Haryana - 122 016 Contact Person - Rahul Tiwari","location":"Gurgaon","experience":"1 - 6 Years"},{"date":"10 - Oct - 2020","skills":"Tender Registration, Bidding, e Tendering","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Alankit House, 4E/2 Jhandewalan Extension New Delhi -110 055. Landmark:- Near post office","phone":"7290012325","profile":"Tender Executive - Preferably Male \nAlankit Limited","description":"Person should be Any Graduate with minimum 6 month experience in Tender. Follow up Tender Registration & Payments in various Govt. Department. Should be responsible to handle tenders published on GEM Portal. Prepare documents for e-Tendering, Studying tender documents, qualification criteria, scope of work, Floating RFQ to various vendors/ contractors, collecting quotations, preparing comparative statements, meeting deadlines for the tenders received from public sector undertaking Govt. and other organizations. Prepare Bills of All Departments Follow ups from client regarding order. Convert inquiries into order. Preparing MIS weekly/ Monthly Reports. Date & Timing: 10th October 2020 @ 10:00 AM to 1:00 PM Venue Details:- Alankit House, 4E/2 Jhandewalan Extension New Delhi -110 055 Landmark:- Near post office Nearest Metro Station:- Jhandewalan Metro Station Gate No. 2 Contact Person:- Ms. Usha Phone:- 7290012325 Note:- Interested candidate can share their resume on ushar@alankit.com OR call on 7290012325.","location":"Delhi","experience":"0 - 1 Years"},{"date":"12, 13, 14, 15, 16, 17, 19, 20, 21 - Oct - 2020","skills":"Desktop Support, LAN, Laptop Support, Networking","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Chamunda Tech-Net Services Pvt. Limited 401 L wing, Tex Center, Near Narayan Plaza, Chandivali Andher (East), Mumbai","phone":"Not Provided","profile":"Technical Support Engineer \nChamunda Tech-Net Services Pvt. Limited","description":"Candidate should be Any Graduate with Windows and Desktop Installation and Administration skills Must have excellent communication skills Job Responsibility- Office applications - Install, Configure and Support OS Drivers and Patch installation Desktop/ Laptop hardware and OS Installation Patch Installation Desktop support LAN Troubleshooting Walk-in Date/ Time: 12th October - 21st October , 9.30 AM - 5.30 PM Venue Details- Chamunda Tech-Net Services Pvt. Limited 401 L wing, Tex Center, Near Narayan Plaza, Chandivali Andher (East), Mumbai Contact Person- Rupesh Patil Phone No. 9821381118","location":"Mumbai","experience":"0 - 1 Years"},{"date":"12, 13, 14, 15, 16, 17, 19, 20, 21, 22 - Oct - 2020","skills":"Email Support, Customer Service, Customer Calling, Backend Support","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"CorpAid Services Private Limited, 101 102, First Floor, Gulmohar Apartment, East Street, Camp Pune - 411001","phone":"9112211104","profile":"Customer Support Executive \nCorpAid Services Private Limited","description":"Candidate should be Any Graduate with Good English Communication Skills Must have Basic Knowledge of Computer Operations The only Candidate apply whose age between 20 to 30 Salary Offer: As per Industry Standard Walk-in Date/ Time: 12th October - 22nd October , 10 AM onwards Venue Details- CorpAid Services Private Limited 101 102, First Floor, Gulmohar Apartment, East Street, Camp Pune - 411 001. Contact Person- Sulakshana HR Contact No.: 8669998509/ 9112211104","location":"Pune","experience":"0 - 2 Years"},{"date":"12, 13, 14, 15, 16, 17, 19, 20, 21 - Oct - 2020","skills":"Customer Service, Inbound Process, Customer Support","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"1Point1 Solutions Limited, Plot No. 17, Sector-18 Near Sarhaul Mod Gurgaon, Haryana","phone":"9999535416","profile":"Customer Support - Inbound Process \nOne Point One Solutions Limited","description":"First point of contact for customers calling for Support Engineer is expected to interact with customers to identify the issue, create case with correct documentation and guide the case to correct department for further troubleshooting. Candidates working with any kind of Voice based customer support/ Semi- Technical Support/ Product Support are the preferred ones. Must possess Best-in-class Communication skills to provide premium level support to our valued Customers. Core Skills- Excellent Soft skills to build customer rapport for an effectively controlled interaction Direct Customer Handling Experience Excellent written & verbal communication skills in English Good typing speed and ability to take notes while talking to the customer Eligibility Criteria- Fresher - Male/ Female both can apply for this job. Candidate must be 12th Pass [Under graduate and graduate can apply] Candidate must speak fluent English & Hindi Must know basic computer. Job Responsibility- 1) Attending customer queries over the phone and providing solutions. 2) Following quality parameters while talking or dealing with customers and clients. 3) Resolving matters in the best interest of both the customer and the company 4) Participating in all organizational activities like RNR | Fun Activities and Sports activities. 5) Coordination with Team Supervisor and colleagues in case of any doubts and problems Other Details- Shift For Female Employee : 9am to 6pm and 9:30am to 6:30pm. For Male- Rotational Shifts. Six days working and 1 week off. Salary : 11314k CTC to 18000K CTC basis of Final Interview Interested candidates may walk-in on given venue/ Or can call/ Whats app on given below no :- 12th October - 21st October , 9.30 AM - 5.30 PM 1Point1 Solutions Limited Plot No. 17, Sector-18 Near Sarhaul Mod Gurgaon, Haryana Sunny Kaushik- 9999535416","location":"Gurgaon","experience":"0 - 1 Years"},{"date":"10 - Oct - 2020","skills":"Customer Support, Voice Process, Voice Support","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Equiniti India Private Limited, Zed Tech Park 1st Floor, Electronic City Phase 1, Bangalore, Karnataka.","phone":"Not Provided","profile":"Customer Support Executive \nEquiniti India Private Limited","description":"In the role of Customer Experience Executive/Sr CEE/SME/TL you would need to assist shareholders in buying & selling shares, in accordance with predetermined procedures & service standards under appropriate guidance and direction. Eligible Criteria: Any Graduates/ Post Graduates. Years of Experience in International Voice Process from 1 to 7 years. Candidate should be comfortable to work in US Shift (Night Shift). The successful candidate will be responsible for: Answer inbound calls, emails from Shareholders and assist them with their queries within the agreed service standards, Contribute to the completion of the teams workload, Undertake duties at a similar level as required, Always to undertake the duties of this role in accordance with the requirements of the company's Regulators, Ensure that all work is undertaken within the quality system, Ensure that work and ethics comply with all security arrangements both physical and information. To be the successful candidate one would need to possess the below: Strong command on English language speaking & call handling Understanding of Customer Experience /BPO Prior experience of international voice process Satisfactory resolution of queries. Walk-in Date/ Time: 10th October 2020, 10.00 AM - 1.30 PM Venue Details- Equiniti India Private Limited, Zed Tech Park 1st Floor, Electronic City Phase 1, Bangalore, Karnataka. Contact Person - Chandra","location":"Bangalore","experience":"1 - 7 Years"},{"date":"10 - Oct - 2020","skills":"MIS Reporting, Stakeholder Management, MIS, Bidata Analyst","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Flipkart Grocery, PMR Warehousing, Next to Commando Dogs training, Devarayamjal Village road, Medchal, Hyderabad.","phone":"Not Provided","profile":"Backend Executive - MIS Reporting \nFlipkart Internet Private Limited","description":"Walk-in for MIS Operations only for Female Hiring-Executive operations for (MIS Reporting) Grocery FC-Hyderabad. Qualification: Any Graduates/ Post Graduates Can apply Work Experience: 1- 4Years in MIS Reporting CTC : Upto 4 LPA including variable. Notice Period : Not more than 20 days/ Immediate Joiners Preferred Must Haves: 1. Strong in problem-solving and analytical skills. 2. Technical capabilities: SQL and Excel.. 3. Experience in analyzing very large, complex, multi-dimensional data sets. 4.MIS reporting (Vlookup, Hlookup, Sumif, Pivot etc) : 5.Should have hands on team handling. 6. Should be good at communication Analytical and problem solving skills. Strong technical skills. The ability to work well under pressure. Attention to detail with Teamworking skills. Organisation and time management. Interpersonal and communication skills. Management and leadership skills. Job location : Grocery Warehouse Medchal Hyderabad. Walk-in Interview Date & Time: 9th & 10th October : Between 10AM to 4:00PM Address for Walk-in: Flipkart Grocery, PMR Warehousing, Next to Commando Dogs training, Devarayamjal Village road, Medchal, Hyderabad. SPOC: Ramesh Gantha / Chandrashekar Note: This position is open only for Female applicants ,other will not be allowed for the interview.","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"10 - Oct - 2020","skills":"Handling Customer Queries, Customer Service, Customer Support","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Rosmerta Safety Systems (P) Limited, 137, Udyog Vihar, Phase - I, Gurugram, Haryana - 122 016","phone":"Not Provided","profile":"Customer Care Executive \nRosmerta Technologies Limited","description":"Candidate should be Any Graduate with good communication skills Must be well versed in remote support to customer queries Must have exposure of call center specially helpline Can join us immediately Roles & Responsibilities- Handling & managing of customer queries over call Dealing with OEMs, Dealers or directly with the customers & providing solution to their queries related to HSRP order Maintaining relationship with the customer to increase HSRP orders Proactive resolutions of query raised Sharing daily, weekly, monthly, quarterly & annual reports Complaint resolutions percentage under detailed timeline & control process Walk-in Date/ Time: 10th October 2020, 10.00 AM - 5.00 PM Venue Details- Rosmerta Safety Systems (P) Limited 137, Udyog Vihar, Phase - I, Gurugram, Haryana - 122 016 Contact Person - Rahul Tiwari","location":"Gurgaon","experience":"1 - 6 Years"},{"date":"10 - Oct - 2020","skills":"Tender Registration, Bidding, e Tendering","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Alankit House, 4E/2 Jhandewalan Extension New Delhi -110 055. Landmark:- Near post office","phone":"7290012325","profile":"Tender Executive - Preferably Male \nAlankit Limited","description":"Person should be Any Graduate with minimum 6 month experience in Tender. Follow up Tender Registration & Payments in various Govt. Department. Should be responsible to handle tenders published on GEM Portal. Prepare documents for e-Tendering, Studying tender documents, qualification criteria, scope of work, Floating RFQ to various vendors/ contractors, collecting quotations, preparing comparative statements, meeting deadlines for the tenders received from public sector undertaking Govt. and other organizations. Prepare Bills of All Departments Follow ups from client regarding order. Convert inquiries into order. Preparing MIS weekly/ Monthly Reports. Date & Timing: 10th October 2020 @ 10:00 AM to 1:00 PM Venue Details:- Alankit House, 4E/2 Jhandewalan Extension New Delhi -110 055 Landmark:- Near post office Nearest Metro Station:- Jhandewalan Metro Station Gate No. 2 Contact Person:- Ms. Usha Phone:- 7290012325 Note:- Interested candidate can share their resume on ushar@alankit.com OR call on 7290012325.","location":"Delhi","experience":"0 - 1 Years"},{"date":"12, 13, 14, 15, 16, 17, 19, 20, 21 - Oct - 2020","skills":"Desktop Support, LAN, Laptop Support, Networking","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Chamunda Tech-Net Services Pvt. Limited 401 L wing, Tex Center, Near Narayan Plaza, Chandivali Andher (East), Mumbai","phone":"Not Provided","profile":"Technical Support Engineer \nChamunda Tech-Net Services Pvt. Limited","description":"Candidate should be Any Graduate with Windows and Desktop Installation and Administration skills Must have excellent communication skills Job Responsibility- Office applications - Install, Configure and Support OS Drivers and Patch installation Desktop/ Laptop hardware and OS Installation Patch Installation Desktop support LAN Troubleshooting Walk-in Date/ Time: 12th October - 21st October , 9.30 AM - 5.30 PM Venue Details- Chamunda Tech-Net Services Pvt. Limited 401 L wing, Tex Center, Near Narayan Plaza, Chandivali Andher (East), Mumbai Contact Person- Rupesh Patil Phone No. 9821381118","location":"Mumbai","experience":"0 - 1 Years"},{"date":"12, 13, 14, 15, 16, 17, 19, 20, 21, 22 - Oct - 2020","skills":"Email Support, Customer Service, Customer Calling, Backend Support","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"CorpAid Services Private Limited, 101 102, First Floor, Gulmohar Apartment, East Street, Camp Pune - 411001","phone":"9112211104","profile":"Customer Support Executive \nCorpAid Services Private Limited","description":"Candidate should be Any Graduate with Good English Communication Skills Must have Basic Knowledge of Computer Operations The only Candidate apply whose age between 20 to 30 Salary Offer: As per Industry Standard Walk-in Date/ Time: 12th October - 22nd October , 10 AM onwards Venue Details- CorpAid Services Private Limited 101 102, First Floor, Gulmohar Apartment, East Street, Camp Pune - 411 001. Contact Person- Sulakshana HR Contact No.: 8669998509/ 9112211104","location":"Pune","experience":"0 - 2 Years"},{"date":"12, 13, 14, 15, 16, 17, 19, 20, 21 - Oct - 2020","skills":"Customer Service, Inbound Process, Customer Support","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"1Point1 Solutions Limited, Plot No. 17, Sector-18 Near Sarhaul Mod Gurgaon, Haryana","phone":"9999535416","profile":"Customer Support - Inbound Process \nOne Point One Solutions Limited","description":"First point of contact for customers calling for Support Engineer is expected to interact with customers to identify the issue, create case with correct documentation and guide the case to correct department for further troubleshooting. Candidates working with any kind of Voice based customer support/ Semi- Technical Support/ Product Support are the preferred ones. Must possess Best-in-class Communication skills to provide premium level support to our valued Customers. Core Skills- Excellent Soft skills to build customer rapport for an effectively controlled interaction Direct Customer Handling Experience Excellent written & verbal communication skills in English Good typing speed and ability to take notes while talking to the customer Eligibility Criteria- Fresher - Male/ Female both can apply for this job. Candidate must be 12th Pass [Under graduate and graduate can apply] Candidate must speak fluent English & Hindi Must know basic computer. Job Responsibility- 1) Attending customer queries over the phone and providing solutions. 2) Following quality parameters while talking or dealing with customers and clients. 3) Resolving matters in the best interest of both the customer and the company 4) Participating in all organizational activities like RNR | Fun Activities and Sports activities. 5) Coordination with Team Supervisor and colleagues in case of any doubts and problems Other Details- Shift For Female Employee : 9am to 6pm and 9:30am to 6:30pm. For Male- Rotational Shifts. Six days working and 1 week off. Salary : 11314k CTC to 18000K CTC basis of Final Interview Interested candidates may walk-in on given venue/ Or can call/ Whats app on given below no :- 12th October - 21st October , 9.30 AM - 5.30 PM 1Point1 Solutions Limited Plot No. 17, Sector-18 Near Sarhaul Mod Gurgaon, Haryana Sunny Kaushik- 9999535416","location":"Gurgaon","experience":"0 - 1 Years"},{"date":"10 - Oct - 2020","skills":"Customer Support, Voice Process, Voice Support","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Equiniti India Private Limited, Zed Tech Park 1st Floor, Electronic City Phase 1, Bangalore, Karnataka.","phone":"Not Provided","profile":"Customer Support Executive \nEquiniti India Private Limited","description":"In the role of Customer Experience Executive/Sr CEE/SME/TL you would need to assist shareholders in buying & selling shares, in accordance with predetermined procedures & service standards under appropriate guidance and direction. Eligible Criteria: Any Graduates/ Post Graduates. Years of Experience in International Voice Process from 1 to 7 years. Candidate should be comfortable to work in US Shift (Night Shift). The successful candidate will be responsible for: Answer inbound calls, emails from Shareholders and assist them with their queries within the agreed service standards, Contribute to the completion of the teams workload, Undertake duties at a similar level as required, Always to undertake the duties of this role in accordance with the requirements of the company's Regulators, Ensure that all work is undertaken within the quality system, Ensure that work and ethics comply with all security arrangements both physical and information. To be the successful candidate one would need to possess the below: Strong command on English language speaking & call handling Understanding of Customer Experience /BPO Prior experience of international voice process Satisfactory resolution of queries. Walk-in Date/ Time: 10th October 2020, 10.00 AM - 1.30 PM Venue Details- Equiniti India Private Limited, Zed Tech Park 1st Floor, Electronic City Phase 1, Bangalore, Karnataka. Contact Person - Chandra","location":"Bangalore","experience":"1 - 7 Years"},{"date":"10 - Oct - 2020","skills":"MIS Reporting, Stakeholder Management, MIS, Bidata Analyst","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Flipkart Grocery, PMR Warehousing, Next to Commando Dogs training, Devarayamjal Village road, Medchal, Hyderabad.","phone":"Not Provided","profile":"Backend Executive - MIS Reporting \nFlipkart Internet Private Limited","description":"Walk-in for MIS Operations only for Female Hiring-Executive operations for (MIS Reporting) Grocery FC-Hyderabad. Qualification: Any Graduates/ Post Graduates Can apply Work Experience: 1- 4Years in MIS Reporting CTC : Upto 4 LPA including variable. Notice Period : Not more than 20 days/ Immediate Joiners Preferred Must Haves: 1. Strong in problem-solving and analytical skills. 2. Technical capabilities: SQL and Excel.. 3. Experience in analyzing very large, complex, multi-dimensional data sets. 4.MIS reporting (Vlookup, Hlookup, Sumif, Pivot etc) : 5.Should have hands on team handling. 6. Should be good at communication Analytical and problem solving skills. Strong technical skills. The ability to work well under pressure. Attention to detail with Teamworking skills. Organisation and time management. Interpersonal and communication skills. Management and leadership skills. Job location : Grocery Warehouse Medchal Hyderabad. Walk-in Interview Date & Time: 9th & 10th October : Between 10AM to 4:00PM Address for Walk-in: Flipkart Grocery, PMR Warehousing, Next to Commando Dogs training, Devarayamjal Village road, Medchal, Hyderabad. SPOC: Ramesh Gantha / Chandrashekar Note: This position is open only for Female applicants ,other will not be allowed for the interview.","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"10 - Oct - 2020","skills":"Handling Customer Queries, Customer Service, Customer Support","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Rosmerta Safety Systems (P) Limited, 137, Udyog Vihar, Phase - I, Gurugram, Haryana - 122 016","phone":"Not Provided","profile":"Customer Care Executive \nRosmerta Technologies Limited","description":"Candidate should be Any Graduate with good communication skills Must be well versed in remote support to customer queries Must have exposure of call center specially helpline Can join us immediately Roles & Responsibilities- Handling & managing of customer queries over call Dealing with OEMs, Dealers or directly with the customers & providing solution to their queries related to HSRP order Maintaining relationship with the customer to increase HSRP orders Proactive resolutions of query raised Sharing daily, weekly, monthly, quarterly & annual reports Complaint resolutions percentage under detailed timeline & control process Walk-in Date/ Time: 10th October 2020, 10.00 AM - 5.00 PM Venue Details- Rosmerta Safety Systems (P) Limited 137, Udyog Vihar, Phase - I, Gurugram, Haryana - 122 016 Contact Person - Rahul Tiwari","location":"Gurgaon","experience":"1 - 6 Years"},{"date":"10 - Oct - 2020","skills":"Tender Registration, Bidding, e Tendering","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Alankit House, 4E/2 Jhandewalan Extension New Delhi -110 055. Landmark:- Near post office","phone":"7290012325","profile":"Tender Executive - Preferably Male \nAlankit Limited","description":"Person should be Any Graduate with minimum 6 month experience in Tender. Follow up Tender Registration & Payments in various Govt. Department. Should be responsible to handle tenders published on GEM Portal. Prepare documents for e-Tendering, Studying tender documents, qualification criteria, scope of work, Floating RFQ to various vendors/ contractors, collecting quotations, preparing comparative statements, meeting deadlines for the tenders received from public sector undertaking Govt. and other organizations. Prepare Bills of All Departments Follow ups from client regarding order. Convert inquiries into order. Preparing MIS weekly/ Monthly Reports. Date & Timing: 10th October 2020 @ 10:00 AM to 1:00 PM Venue Details:- Alankit House, 4E/2 Jhandewalan Extension New Delhi -110 055 Landmark:- Near post office Nearest Metro Station:- Jhandewalan Metro Station Gate No. 2 Contact Person:- Ms. Usha Phone:- 7290012325 Note:- Interested candidate can share their resume on ushar@alankit.com OR call on 7290012325.","location":"Delhi","experience":"0 - 1 Years"},{"date":"12, 13, 14, 15, 16, 17, 19, 20, 21 - Oct - 2020","skills":"Desktop Support, LAN, Laptop Support, Networking","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Chamunda Tech-Net Services Pvt. Limited 401 L wing, Tex Center, Near Narayan Plaza, Chandivali Andher (East), Mumbai","phone":"Not Provided","profile":"Technical Support Engineer \nChamunda Tech-Net Services Pvt. Limited","description":"Candidate should be Any Graduate with Windows and Desktop Installation and Administration skills Must have excellent communication skills Job Responsibility- Office applications - Install, Configure and Support OS Drivers and Patch installation Desktop/ Laptop hardware and OS Installation Patch Installation Desktop support LAN Troubleshooting Walk-in Date/ Time: 12th October - 21st October , 9.30 AM - 5.30 PM Venue Details- Chamunda Tech-Net Services Pvt. Limited 401 L wing, Tex Center, Near Narayan Plaza, Chandivali Andher (East), Mumbai Contact Person- Rupesh Patil Phone No. 9821381118","location":"Mumbai","experience":"0 - 1 Years"},{"date":"12, 13, 14, 15, 16, 17, 19, 20, 21, 22 - Oct - 2020","skills":"Email Support, Customer Service, Customer Calling, Backend Support","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"CorpAid Services Private Limited, 101 102, First Floor, Gulmohar Apartment, East Street, Camp Pune - 411001","phone":"9112211104","profile":"Customer Support Executive \nCorpAid Services Private Limited","description":"Candidate should be Any Graduate with Good English Communication Skills Must have Basic Knowledge of Computer Operations The only Candidate apply whose age between 20 to 30 Salary Offer: As per Industry Standard Walk-in Date/ Time: 12th October - 22nd October , 10 AM onwards Venue Details- CorpAid Services Private Limited 101 102, First Floor, Gulmohar Apartment, East Street, Camp Pune - 411 001. Contact Person- Sulakshana HR Contact No.: 8669998509/ 9112211104","location":"Pune","experience":"0 - 2 Years"},{"date":"12, 13, 14, 15, 16, 17, 19, 20, 21 - Oct - 2020","skills":"Customer Service, Inbound Process, Customer Support","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"1Point1 Solutions Limited, Plot No. 17, Sector-18 Near Sarhaul Mod Gurgaon, Haryana","phone":"9999535416","profile":"Customer Support - Inbound Process \nOne Point One Solutions Limited","description":"First point of contact for customers calling for Support Engineer is expected to interact with customers to identify the issue, create case with correct documentation and guide the case to correct department for further troubleshooting. Candidates working with any kind of Voice based customer support/ Semi- Technical Support/ Product Support are the preferred ones. Must possess Best-in-class Communication skills to provide premium level support to our valued Customers. Core Skills- Excellent Soft skills to build customer rapport for an effectively controlled interaction Direct Customer Handling Experience Excellent written & verbal communication skills in English Good typing speed and ability to take notes while talking to the customer Eligibility Criteria- Fresher - Male/ Female both can apply for this job. Candidate must be 12th Pass [Under graduate and graduate can apply] Candidate must speak fluent English & Hindi Must know basic computer. Job Responsibility- 1) Attending customer queries over the phone and providing solutions. 2) Following quality parameters while talking or dealing with customers and clients. 3) Resolving matters in the best interest of both the customer and the company 4) Participating in all organizational activities like RNR | Fun Activities and Sports activities. 5) Coordination with Team Supervisor and colleagues in case of any doubts and problems Other Details- Shift For Female Employee : 9am to 6pm and 9:30am to 6:30pm. For Male- Rotational Shifts. Six days working and 1 week off. Salary : 11314k CTC to 18000K CTC basis of Final Interview Interested candidates may walk-in on given venue/ Or can call/ Whats app on given below no :- 12th October - 21st October , 9.30 AM - 5.30 PM 1Point1 Solutions Limited Plot No. 17, Sector-18 Near Sarhaul Mod Gurgaon, Haryana Sunny Kaushik- 9999535416","location":"Gurgaon","experience":"0 - 1 Years"},{"date":"10 - Oct - 2020","skills":"Customer Support, Voice Process, Voice Support","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Equiniti India Private Limited, Zed Tech Park 1st Floor, Electronic City Phase 1, Bangalore, Karnataka.","phone":"Not Provided","profile":"Customer Support Executive \nEquiniti India Private Limited","description":"In the role of Customer Experience Executive/Sr CEE/SME/TL you would need to assist shareholders in buying & selling shares, in accordance with predetermined procedures & service standards under appropriate guidance and direction. Eligible Criteria: Any Graduates/ Post Graduates. Years of Experience in International Voice Process from 1 to 7 years. Candidate should be comfortable to work in US Shift (Night Shift). The successful candidate will be responsible for: Answer inbound calls, emails from Shareholders and assist them with their queries within the agreed service standards, Contribute to the completion of the teams workload, Undertake duties at a similar level as required, Always to undertake the duties of this role in accordance with the requirements of the company's Regulators, Ensure that all work is undertaken within the quality system, Ensure that work and ethics comply with all security arrangements both physical and information. To be the successful candidate one would need to possess the below: Strong command on English language speaking & call handling Understanding of Customer Experience /BPO Prior experience of international voice process Satisfactory resolution of queries. Walk-in Date/ Time: 10th October 2020, 10.00 AM - 1.30 PM Venue Details- Equiniti India Private Limited, Zed Tech Park 1st Floor, Electronic City Phase 1, Bangalore, Karnataka. Contact Person - Chandra","location":"Bangalore","experience":"1 - 7 Years"},{"date":"10 - Oct - 2020","skills":"MIS Reporting, Stakeholder Management, MIS, Bidata Analyst","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Flipkart Grocery, PMR Warehousing, Next to Commando Dogs training, Devarayamjal Village road, Medchal, Hyderabad.","phone":"Not Provided","profile":"Backend Executive - MIS Reporting \nFlipkart Internet Private Limited","description":"Walk-in for MIS Operations only for Female Hiring-Executive operations for (MIS Reporting) Grocery FC-Hyderabad. Qualification: Any Graduates/ Post Graduates Can apply Work Experience: 1- 4Years in MIS Reporting CTC : Upto 4 LPA including variable. Notice Period : Not more than 20 days/ Immediate Joiners Preferred Must Haves: 1. Strong in problem-solving and analytical skills. 2. Technical capabilities: SQL and Excel.. 3. Experience in analyzing very large, complex, multi-dimensional data sets. 4.MIS reporting (Vlookup, Hlookup, Sumif, Pivot etc) : 5.Should have hands on team handling. 6. Should be good at communication Analytical and problem solving skills. Strong technical skills. The ability to work well under pressure. Attention to detail with Teamworking skills. Organisation and time management. Interpersonal and communication skills. Management and leadership skills. Job location : Grocery Warehouse Medchal Hyderabad. Walk-in Interview Date & Time: 9th & 10th October : Between 10AM to 4:00PM Address for Walk-in: Flipkart Grocery, PMR Warehousing, Next to Commando Dogs training, Devarayamjal Village road, Medchal, Hyderabad. SPOC: Ramesh Gantha / Chandrashekar Note: This position is open only for Female applicants ,other will not be allowed for the interview.","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"10 - Oct - 2020","skills":"Handling Customer Queries, Customer Service, Customer Support","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Rosmerta Safety Systems (P) Limited, 137, Udyog Vihar, Phase - I, Gurugram, Haryana - 122 016","phone":"Not Provided","profile":"Customer Care Executive \nRosmerta Technologies Limited","description":"Candidate should be Any Graduate with good communication skills Must be well versed in remote support to customer queries Must have exposure of call center specially helpline Can join us immediately Roles & Responsibilities- Handling & managing of customer queries over call Dealing with OEMs, Dealers or directly with the customers & providing solution to their queries related to HSRP order Maintaining relationship with the customer to increase HSRP orders Proactive resolutions of query raised Sharing daily, weekly, monthly, quarterly & annual reports Complaint resolutions percentage under detailed timeline & control process Walk-in Date/ Time: 10th October 2020, 10.00 AM - 5.00 PM Venue Details- Rosmerta Safety Systems (P) Limited 137, Udyog Vihar, Phase - I, Gurugram, Haryana - 122 016 Contact Person - Rahul Tiwari","location":"Gurgaon","experience":"1 - 6 Years"},{"date":"10 - Oct - 2020","skills":"Tender Registration, Bidding, e Tendering","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Alankit House, 4E/2 Jhandewalan Extension New Delhi -110 055. Landmark:- Near post office","phone":"7290012325","profile":"Tender Executive - Preferably Male \nAlankit Limited","description":"Person should be Any Graduate with minimum 6 month experience in Tender. Follow up Tender Registration & Payments in various Govt. Department. Should be responsible to handle tenders published on GEM Portal. Prepare documents for e-Tendering, Studying tender documents, qualification criteria, scope of work, Floating RFQ to various vendors/ contractors, collecting quotations, preparing comparative statements, meeting deadlines for the tenders received from public sector undertaking Govt. and other organizations. Prepare Bills of All Departments Follow ups from client regarding order. Convert inquiries into order. Preparing MIS weekly/ Monthly Reports. Date & Timing: 10th October 2020 @ 10:00 AM to 1:00 PM Venue Details:- Alankit House, 4E/2 Jhandewalan Extension New Delhi -110 055 Landmark:- Near post office Nearest Metro Station:- Jhandewalan Metro Station Gate No. 2 Contact Person:- Ms. Usha Phone:- 7290012325 Note:- Interested candidate can share their resume on ushar@alankit.com OR call on 7290012325.","location":"Delhi","experience":"0 - 1 Years"}]}