{"Walkins":[{"date":"16, 17 - Sept - 2019","skills":"Talent Acquisition, Vendor management, hiring operations, general accounting","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Directi Internet Solutions Private Limited, Directiplex, Old Nagardas Road Near Andheri Subway Andheri (East) Mumbai - 400 069","phone":"Not Provided","profile":"Operations Associate (Talent Acquisition) \nDirecti Internet Solutions Pvt. Limited","description":"Candidate should be Graduate in any stream with 0 to 2 years of experience in Recruitment/ Talent Acquisition Operations. Should either be well versed with Excel or should have an incline to learn it. Must have good verbal and written communication skills Meticulous, methodical & extremely well organized Should have good persuasion and negotiation skills As an Operations Associate, you will be the backbone of the Talent Acquisition team by managing day to day activities. The core responsibilities include: To be the point of contact for all candidate inquiries on background verification, onboarding, travel coordination, offer letters etc. Walk-in Date: 16th - 17th September 2019 Time: 11AM - 3PM Interview Venue: Directi Internet Solutions Private Limited Directiplex, Old Nagardas Road Near Andheri Subway Andheri (East) Mumbai - 400 069 Interview Process: GD + Case-study + Personal round POC : Adelaide Please carry your updated resume with you.","location":"Mumbai","experience":"0 - 3 Years"},{"date":"16, 17, 18, 19, 20 - Sept - 2019","skills":"HR Operations, Grievance Handling, Retention Management, Talent Acquisition, Employee Engagement","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Manba Finance Limited, Manba House Plot No. A-79, Opposite to Lotus Park, Thane West","phone":"Not Provided","profile":"HR Executive \nManba Finance Limited (MFL)","description":"Candidate should have relevant experience in hiring Sales staff. Good Communication & presentable candidate required. Profile is mixture of recruitment & HR Operations. Job Responsbility- End to End recruitment as per division of departments Induction Background verification of on roll employees Salary Inputs & Attendance management Arrangement of Uniforms Performance Management Appraisal Quarterly Star Performer Nomination Grievance Handling Retention Management Employee Engagement Office Decorum & Infra Walk-in Date: 16th - 20th September 2019 Time : 10 AM to 5 PM Interview Venue: Manba Finance Limited Manba House Plot No. A-79, Opposite to Lotus Park, Thane West Contact Person: Milan Suthar","location":"Mumbai","experience":"1 - 6 Years"},{"date":"16, 17, 18, 19, 20 - Sept - 2019","skills":"Administration, Project Management, Document Control, HR Project Coordination","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Rexus India Private Limited, C312, Mittal Commercia, Marol, Andheri (East), Mumbai, Maharashtra - 400 059.","phone":"022-49713072","profile":"HR & Project Coordinator \nRexus India Private Limited","description":"Education and Formal Training Any Bachelors Degree from an accredited college or university in Computer / Electronics or any stream. Certification in PMP or Prince will be preferred. MBA in HR or Diploma in HR preferred. Work Experience: Fresher or 1 to 3 years related experience in the IT hardware and networking industry with at least 1-year experience in project management role and IT recruitments. Fluency in English is a must. Required Knowledge, Skills and Abilities: General management skills. Integrity, respect, honesty and trustworthiness. Good knowledge in Excel Excellent MS Office skills & PPT is a must. Self-disciplined and able to self-manage and set goals HR management and global recruitments (understanding of legislation and procedures) Presentation and meeting facilitation skill. Report writing and document management. Walk-in Date/ Time: 16th - 20th September , 2 PM onwards Interview Venue: Rexus India Private Limited C312, Mittal Commercia, Marol, Andheri (East), Mumbai, Maharashtra - 400 059. Phone No: 022-49713072","location":"Mumbai","experience":"0 - 3 Years"},{"date":"16 - Sept - 2019","skills":"General Administration, Back Office, Data Processing","qualification":"Diploma, B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Vara Infotech Private Limited, 1st Floor, Raghuleela Arcade, Vishwaroop Software Park ( Above Audi Showroom), Sec 30A, Vashi, Navi Mumbai - 400 703","phone":"9075917122","profile":"Back Office Executive \nVara Infotech Private Limited","description":"Vara Infotech Private Limited is hiring Fresher candidates for Backend Process (Data Processing) for Vashi and Andheri Location Please find the job details below: Candidate should should be H.Sc or Any Graduate. Minimum of 25 to 35 WPM in Typing with 95% accuracy. Willing to work in Rotational Shifts Interview location is same for both the location. Interested candidates kindly come for an interview on 16th September 2019 (Monday) at below address: Vara Infotech Private Limited 1st Floor, Raghuleela Arcade, Vishwaroop Software Park ( Above Audi Showroom), Sec 30A, Vashi, Navi Mumbai - 400 703 Interview Time: 10:30 A.M to 3:30 P.M Contact Person: Priyanka Kindly carry the following documents during interview: All educational documents(Photo Copies of Mark Sheets degree) Aadhar Card and PAN Card Updated resume","location":"Mumbai","experience":"0 - 1 Years"},{"date":"16, 17, 18 - Sept - 2019","skills":"Domestic BPO, Back Office Operations","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Reliable Business Solutions & Services Pvt. Limited, No. 51, Rajiv Gandhi Salai (OMR) | Rattha TEK MEADOWS, C Block, 1st floor | Sholinganallur | Chennai - 600 119.","phone":"7904356739","profile":"Banking Executive (Non-Voice Process) \nReliable Business Solutions & Services","description":"We have Immediate job openings for Non-Voice process. Requirements: 1. Should know English and Tamil. 2. Freshers 3. Any qualification is accepted. 4. No age criteria. 5. Immediate joiners preferred. Job Responsbility: 1. The candidate will be involved in Banking Non-Voice process. 2. Complete Day Shift. 3. Attractive and Best in market Salary Packages. * Spot Offer on Selection. Walk-in Date/ Time: 16th - 18th September , 10 AM onwards Interview Venue: Reliable Business Solutions & Services Pvt. Limited No. 51, Rajiv Gandhi Salai (OMR) | Rattha TEK MEADOWS, C Block, 1st floor | Sholinganallur | Chennai - 600 119. Tel: 7904356739","location":"Chennai","experience":"2 - 4 Years"},{"date":"16, 17 - Sept - 2019","skills":"Vendor Management, HR/ Recruitment, Volume Hiring, Bulk Hiring/ Sourcing","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"WNS Global Services Private Limited, 11th Floor, Tower A2 & A3, DLF IT SEZ World Tech Park, Silokhera, Nearest metro Huda City Centre, Sector-30, Gurgaon. Near Star Mall.","phone":"Not Provided","profile":"HR Executive \nWNS Global Services Private Limited","description":"Candidate must be a Graduate with 0 to 4 years of relevant experience Must have good communication skills. Freshers can also apply Would be working in a Bulk Hiring role for Finance domain Vendor Hiring Sourcing through job portals and social media Managing full life cycle of recruitment Maintains applicant tracking system to ensure data integrity and compliance Interested candidates may walk in with a copy of updated resume and an identity proof WNS Global Services Private Limited, 11th Floor, Tower A2 & A3, DLF IT SEZ World Tech Park, Silokhera, Nearest metro Huda City Centre, Sector-30, Gurgaon. Near Star Mall. Walkin Date: 16th & 17th September 2019 Time - 1 pm - 3 pm","location":"Gurgaon","experience":"0 - 4 Years"},{"date":"17 - Sept - 2019","skills":"ADA Testing (Functional Testing)","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Infosys BPM Limited, 4th Floor, South Wing C Block, Tidel Park, 4th Floor Rajiv Gandhi Salai, Taramani, Chennai - 600 113","phone":"Not Provided","profile":"ADA Testing (Functional Testing) \nInfosys BPM Limited","description":"Infosys BPM Limited is hiring for ADA Testing (Functional Testing) role in Chennai Educational Qualification: Any full time Graduation Experience Required: Min 2 yeas Relevant Experience Job location: Chennai Shift: Rotational Shifts Job Responsibilities: Update existing tests/ Create new tests in the automation test suite for ADA testing. Write test planning documentation from requirements specifications. Review all testing documents and other test-related documentation. Assist in implementation of the overall testing strategy. Ensure that quality standards are adhered to during the development of products. Add new tests and expand the automation test suite. Collect and create test data for functional and non-functional testing. Run functional and non-functional tests. Liaise with developers during the Software Development Life Cycle (SDLC). Walk-in Date: 17th September, 2019 Time: 9 AM to 11 AM Interview Venue: Infosys BPM Limited, 4th Floor, South Wing C Block, Tidel Park, 4th Floor Rajiv Gandhi Salai, Taramani, Chennai - 600 113 Contact person: Mohamed Ibrahim","location":"Chennai","experience":"2 - 5 Years"},{"date":"17, 18, 19, 20, 21 - Sept - 2019","skills":"Software Testing, Application Testing, Manual Testing, Web Technologies","qualification":"B.E./B.Tech, MCA/PGDCA","address":"D2K Technologies (India) Private Limited, 605, Pujit Plaza, Plot No. 67, Sector-11, CBD Belapur, Navi Mumbai","phone":"022-27562853","profile":"Software Tester - Male Only \nD2K Technologies (India) Private Limited","description":"Experiences using task & Defect Management tools viz JIRA Prepare & Execute , Test Scenarios for Module , Integration System and sanity Testing as required Prepare Test Data for the Test Cases Defect logging & Tracking Web based application Testing, Database (Sql) Testing Experience in creation & Execution of Test scenarios & Test Cases covering entire product life cycle Functional , system Integration , User Acceptance , Go Live Testing . Experiences of Cross. Walk-in Date/ Time: 17th - 21st September , 10 AM onwards Interview Venue: D2K Technologies (India) Private Limited 605, Pujit Plaza, Plot No. 67, Sector-11, CBD Belapur, Navi Mumbai","location":"Mumbai","experience":"1 - 3 Years"},{"date":"21, 22 - Sept - 2019","skills":"Software Testing, Test Engineering, Writing Test Cases, Selenium, Webdriver API Testing","qualification":"B.E./B.Tech, M.Tech","address":"ISC Software Private Limited, IT Plaza, E-8, Gulmohar, Near Aura Mall, Bhopal (MP)","phone":"9827795917","profile":"Software Testing Engineer \nISC Software Private Limited","description":"SKILLS AND ABILITIES: Experience with writing test plans and test cases Experience in testing web/android applications on various platforms Write and maintain automated test suites for functional Good Knowledge API testing using SOAP-UI & POSTMAN. Good Knowledge of Automation tools (Java, Selenium WebDriver and TestNG, etc) Basic knowledge of SQL queries Experience in automated and manual testing of desktop web applications and android application Experience in implementation of automated testing tools for Desktop and/or web, i.e. selenium web driver or android studio DUTIES & RESPONSIBILITIES: Design test plans, write test cases, review functional requirement documentation, and present test strategies for team review Creating an automation test plan and getting approval. Automation framework design and implementation according to project structure Conduct integration, regression, ad-hoc, and edge-case testing as part of release cycles Analyze a complicated software system and design a strategy to test this system Implement code coverage for functional test cases and consistently improve it Walk-in Date/ Time: 21st - 22nd September , 9 AM onwards Interview Venue: ISC Software Private Limited IT Plaza, E-8, Gulmohar, Near Aura Mall, Bhopal (MP) In addition to it, candidate can mail the resume to hrbhopal@corecard.com","location":"Indore","experience":"1 - 5 Years"},{"date":"16, 17, 18, 19, 20, 21 - Sept - 2019","skills":"Manual Testing, SCM, Erp Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Computer Generated Solutions India Private Limited, 4th Floor, Plot No. 5 & 6, Image Garden, Silicon Valley Road, Madhapur, Hyderabad - 500 081","phone":"Not Provided","profile":"Manual Testing Engineer \nComputer Generated Solutions India (P) Ltd.","description":"We @ CGS India is looking for Manual ERP Tester with 2+ yrs of experience, Interested candidates can share their resumes to kkaipu@cgsinc.com Skill Set: Manual ERP Testing (SCM/ Procurement/ Sales modules) 2 Years of experience in Software Testing [ERP/ ECommerce] Should be able to develop Test Cases with minimal supervision Good understanding of Test Methodologies and Scrums Well versed in B2B and B2C Concepts Must have excellent communication skills Good Team Player and contributor Value Added: Should have basic knowledge on ERP Modules Hand on Experience on B2B Application Walk-in Date/ Time: 16th - 21st September , 11 AM onwards Interview Venue: Computer Generated Solutions India Private Limited 4th Floor, Plot No. 5 & 6, Image Garden, Silicon Valley Road, Madhapur, Hyderabad - 500 081 Interested candidates can share their resumes to kkaipu@cgsinc.com","location":"Hyderabad","experience":"2 - 6 Years"},{"date":"16, 17, 18, 19 - Sept - 2019","skills":"Jenkins Java VSTS SOAP UI API Testing Microsoft Azure Selenium QA Automation","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Agile Cockpit Software Development Pvt. Limited, Ecoworld Building 6A, Outer Ring Road, Devarabeesanahalli Village, Adarsh Palm Retreat, Bellandur, Bengaluru - 560 103","phone":"Not Provided","profile":"Senior QA/ Testing Engineer \nAgile Cockpit Software Development Pvt. Limited","description":"Work Experience: 4 - 8 Years Tools preferred postman, JMeter, and SoapUI Good to have experience in CI/CD using VSTS or Jenkins Good to have experience in Microsoft Azure cloud Must have working Experience in Automation (Selenium with Java/C#) Very good knowledge of API Testing Walk-in Date/ Time: 16th - 19th September , 9 AM onwards Interview Venue: Agile Cockpit Software Development Pvt. Limited, Ecoworld Building 6A, Outer Ring Road, Devarabeesanahalli Village, Adarsh Palm Retreat, Bellandur, Bengaluru, Karnataka - 560 103","location":"Bangalore","experience":"4 - 8 Years"},{"date":"15 - Sept - 2019","skills":"Software Testing, Java Core Java, Automation Testing","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"HCL Technologies Limited, ODC 3, First floor, Plot No. 3, Surya Sapphire, Hosur Road, Near D-Mart, 1st Phase, Electronic City, Bengaluru, Karnataka - 560 100","phone":"Not Provided","profile":"Automation Tester with Java \nHCL Technologies Limited","description":"We are pleased to inform you that we currently have opening for Automation tester with Java programming @ Bangalore Primary Skills (Mandatory) Selenium with experience on Java - 5 + Years exp Automation testing candidate with good working knowledge on Java Programming. Demonstrated experience and Proficient understanding of tools across full software delivery life cycle of IDE source control ,CL, test, Mocking, work tracking defect Management etc Experience Knowledge on UI testing Automation Frame work & API Automation frame work using Selenium web driver Understanding and experience of full life cycle of testing Intimation understanding and experience of functional regression and acceptance testing Good knowledge on webservice testing (SOAP and RESTful services) Strong sql server knowledge. Expert development practice and debugging skills This is a customer facing role for a major Global Bank, the candidate must possess exceptional Written and Verbal communication skills. The candidate will maintain a professional and presence at all times. Knowledge of Agile way of working, Good Team Player, Collaborative, analytical and problem solving skills and ownership are key attributes for potential candidates. Notice period : Immediate - 45 days. Walk-in Date: 15th September 2019 Drive timing: 9:00 AM - 12:30 PM Interview Location: HCL Technologies Limited ODC 3, First floor, Plot No. 3, Surya Sapphire, Hosur Road, Near D-Mart, 1st Phase, Electronic City, Bengaluru, Karnataka - 560 100 Job Location : Jigani, Bangalore The candidates who are interested & ready to attend interview, please share your resume with below details to ahmed_s@hcl.com Required Details: Name: Contact Number: Email ID : Total Exp: Relevant Exp: Current CTC (Annually): Exp CTC (Annually): Current Org: Current Location: Preferred Location: Notice Period: Availability on 15th SEP:","location":"Bangalore","experience":"5 - 10 Years"},{"date":"16, 17, 18, 19, 20 - Sept - 2019","skills":"Java Hibernate JPA Spring Javascript Maven JQuery","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Maarga Systems Private Limited, Bali Towers, 2nd Floor, No 1, Abdul Razak Street, Saidapet, Chennai - 600 015","phone":"044-42238322","profile":"Java Developers \nMaarga Systems Private Limited","description":"Primary Skill Set- Java 8.0 Spring 4.0.6 Spring data JPA 1.3.2 Hibernate 4.2.1 Jenkins 2.176.1 Maven 1.7 Oracle 12c Apache Tomcat 8.0.30 Sub version 5.1.0 Secondary Skill Set: Bootstrap , jQuery, HTML5, CSS3, Javascript Walk-in Date/ Time: 16th - 20th September , 10 AM onwards Interview Venue: Maarga Systems Private Limited Bali Towers, 2nd Floor, No 1, Abdul Razak Street, Saidapet, Chennai - 600 015 Landmark: Near Panagal Maligai","location":"Chennai","experience":"4 - 7 Years"},{"date":"16, 17, 18, 19, 20 - Sept - 2019","skills":"Core Java, J2EE with Servlets, Spring, Hibernate, Struts","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Ebix Software (India) Private Limited, 7th Floor, Building No: H6A, Phoenix Infocity, Advance Business Hub, Hitech City-2, Hyderabad","phone":"Not Provided","profile":"Java Developers \nEbix Software (India) Private Limited","description":"Ebix Software (India) Private Limited is hiring for ' Java Developer ' Work Experience: 2+ years CTC: Not a constraint for right candidate Key Requirements: Strong knowledge in Core Java, J2EE with Servlets, Spring, Hibernate, Struts. Hands on experience in understanding of application architectures and XML Good understanding of Design and J2EE technologies, ability to solve technical problems independently Can convert business requirements into a design and technical implementation Complete ownership of the solution design and development, ability to mentor a team of developers in programming, design and documentation, ability to do estimation for the project. Effective client interaction skills, ability to interact with customers independently and resolve issues. Essential Skills: Persistence and patience to deal with ambiguity with positive attitude Proven ability to perform under pressure with minimal supervision Proactive, disciplined individual who can drive results Good debugging skills and ability to learn new technology quickly Walk-in Details: Date: 16th to 20th September 2019 Day: Monday to Friday Time: 11:00 AM to 4:00 PM Interview Venue: Ebix Software (India) Private Limited 7th Floor, Building No: H6A, Phoenix Infocity, Advance Business Hub, Hitech City-2, Hyderabad Please carry a copy of your updated CV & Photograph","location":"Hyderabad","experience":"2 - 7 Years"},{"date":"16, 17, 18, 19, 20 - Sept - 2019","skills":"Collection Framework Core Java Hadoop Big Data Spark HBase","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"CRIF Solutions Private Limited, Unit No.- 01, Ground Level, Survey No.114 & 115 Icon Towers, Baner Road, Pune - 411 045","phone":"020-67642952","profile":"Java/ Big Data Developer \nCRIF Solutions Private Limited","description":"Candidates who are meeting below criteria will only be considered:- 3 to 6 years of relevant experience. Should match below skill sets also- 3 to 6 years Experience in Core Java (Collection Framework, Exceptional handling) 2+ years of experience in spark, elastic basic knowledge, Hadoop, Hbase Walk-in Date: 16th - 20th September 2019 Drive will start from 11:00 to 6:00 PM Interview Date: CRIF Solutions Private Limited Unit No.- 01, Ground Level, Survey No. 114 & 115 Icon Towers, Baner Road, Pune - 411 045 Tel Off: 020-67642952","location":"Pune","experience":"3 - 6 Years"},{"date":"16, 17, 18, 19, 20 - Sept - 2019","skills":"Java/ C/ C++/ Python, C Programming","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Evelyn Learning Systems Private Limited, Building No. 382, Ghitorni, 2nd Floor, New Delhi.","phone":"9873814760","profile":"Java Programmer \nEvelyn Learning Systems Private Limited","description":"Good communication and writing skills Knowledge of Computer is mandatory. Attractive incentives 1. Creating, reviewing, and fixing content for American textbooks 2. Offering 24/7 online assistance with questions posted by high school and college students 3. Thinking out of the box to create innovative ways of imparting education and assessing the understanding and learning of students 4. Work on cutting-edge projects and learning to work with new software through KT sessions 5. Adapting to new teaching methodologies and preparing learning objectives for any course. CS Topics 1. Data Structure (Array, List, Linked List, Stack, Queue, Graph, Tree) 2. Any Programming language (Java/ C/ C++/ Python) 3. Sorting techniques 4. Basic knowledge of database Delhi Office Address: Building no. 382, Ghitorni, 2nd Floor, New Delhi. Noida office Address: A/23, 1st Floor Tower 23, Sector 9, Noida-201 301","location":"Delhi, Noida","experience":"0 - 2 Years"},{"date":"21 - Sept - 2019","skills":"Core java, struts, jsp, servlet, hibernate","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Montran Corporation India Private Limited, C/o. NPCI, 8th Floor, VBC Solitaire, No 47 & 49, Bazullah Road, Parthasarthi Puram, T. Nagar, Chennai, Tamil Nadu - 600 017.","phone":"Not Provided","profile":"Java Developer \nMontran Corporation India Private Limited","description":"As a Java Developer, you will focus on back end technologies, working directly with both technical and business stakeholders to translate a vision and designs into sustainable business solutions. You will be responsible for the maintenance of complex payment software applications, ensuring they are built with quality, consistency to our standards, performance and responsive to the device accessing the applications. *The Value you deliver The developer will be responsible for the creation of quality software components that are used by Montran customers. The developer will work closely with the product owner and other developers to design, build, test and deliver the features. They will be expected to work closely and collaborate with other developers in and across the team. *Responsibilities of the role includes - Provides business solutions by developing complex or multiple software applications - Performs independent technical and functional analysis for multiple projects - Designs applications or subsystems on major projects and platforms - Participates in application level architecture design and review - Implementation of products as per Customer requirements Walk-in Date/ Time: 21st September 2019, 10 AM onwards Interview Venue: Montran Corporation India Private Limited C/o. NPCI, 8th Floor, VBC Solitaire, No 47 & 49, Bazullah Road, Parthasarthi Puram, T. Nagar, Chennai, Tamil Nadu - 600 017.","location":"Chennai","experience":"1 - 4 Years"},{"date":"21 - Sept - 2019","skills":"Core Java, JSP / Servlet , J2EE, Object Oriented Programming, Oracle/ MS SQL Server","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Xpanxion International Private Limited, Sai Radhe Ground Floor Behind Sheraton Hotel Near Pune Railway Station, Pune - 411 001","phone":"Not Provided","profile":"Java Fullstack Developers \nXpanxion International Private Limited","description":"Experience required for the Job: 3 - 8 Years Technical Skills - Mandatory Strong understanding of Object Oriented Programming Strong skills in Core Java, JSP / Servlet , J2EE Must have experience in Spring, Hibernate, Angular2/4/5 , Micro services Strong in Jenkins, Maven/ any build tools. Strong Oracle/ MS SQL Server and database designing skills Walkin Interview on 21st September 2019 Timings: 9 am - 1 pm Interview Venue: Xpanxion International Private Limited Sai Radhe Ground Floor Behind Sheraton Hotel Near Pune Railway Station, Pune - 411 001 Contact Person: Shweta Patil","location":"Pune","experience":"3 - 8 Years"},{"date":"28 - Sept - 2019","skills":"Core Java, Java/ J2ee/ JSP/ Servlets/ Spring/ Hibernate","qualification":"B.E./B.Tech, MCA/PGDCA","address":"ADJECTI Solutions Private Limited, 123, Level-II, Tower-A The Corenthum Building A-41, Sector 62 Noida - 201 301","phone":"0120-4089940","profile":"Software Trainees - Java/ J2ee \nADJECTI Solutions Priavte Limited","description":"Candidate should be BE/ B.Tech or MCA with profound interest in Java technologies. Must have accomplished academic projects on Core Java, JSP Servlets, JDBC, Spring & Hibernate. Must have taken any professional training from any reputed training institute viz- Ducat, J Spiders, Cetpa Infotech, Trisect etc. Would be ready for signing a Contract/ Bond for 2 Years. Entitled for appraisal plans that are based on performance during this course of time. Candidate Skills Level Technologies Required Remunerations Per Anum Below is the Remuneration Criteria- Level-I Core Java + HTML, CSS, Bootstrap Up to 1,00,000 LPA Level-II Core Java, JSP, Servlets + HTML, CSS, Bootstrap Up to 1,80,000 LPA Level-III Core Java, JSP, Servlets, Spring & Hibernate Frameworks + HTML, CSS, Bootstrap Up to 2,50,000 LPA Level-IV Core Java, JSP, Servlets, Spring & Hibernate Frameworks + HTML, CSS, Bootstrap + Angular Up to 3,00,000 LPA Walk-in Date/ Time: 28th September 2019, 10 AM onwards Interview Venue: ADJECTI Solutions Private Limited 123, Level-II, Tower-A The Corenthum Building A-41, Sector 62 Noida - 201 301 Office Landline: 0120-4089940","location":"Noida","experience":"0 - 1 Years"},{"date":"14 - Sept - 2019","skills":"C#, ASP .Net MVC, Web API, HTML, CSS, jQuery, Javascript, SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA","address":"ndVOR IT Solutions Private Limited, III Floor, 738, Sumo Sapphire, 15th Cross Ring Road, J. P. Nagar 6th Phase, Bangalore - 560 078","phone":"Not Provided","profile":"ASP. NET/ MVC Developer \nndVOR IT Solutions Private Limited","description":"Urgent position for .NET MVC Developer at ndVOR IT Solutions Private Limited Skill Set Required- Design, develop, and implement solutions using C#, ASP .Net MVC, Web API, HTML, CSS, jQuery, Javascript, SQL Server and Visual Studio 2017 as your environment. Should have at least 1+ year minimum experience in MVC Conceive and build unit testable solutions for our website applications. Participate in technical design meetings with other developers and assist in defining the system architecture and choosing technologies. You have good reading, written and verbal language skills (English) Work From Home Benefit Immediate to 30 day Notice period preferred. Walk-in Date: 14th September 2019 Timings: 10:00 AM - 1:00 PM Interview Venue: ndVOR IT Solutions Private Limited III Floor, 738, Sumo Sapphire, 15th Cross Ring Road, J. P. Nagar 6th Phase, Bangalore - 560 078 Landmark: 6th Phase Underpass (a.k.a. G.R. Vishwanath underpass)","location":"Bangalore","experience":"2 - 4 Years"},{"date":"14 - Sept - 2019","skills":"Software Testing, Automation Framework, SDLC, STLC","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Amazon Development Centre (India) Private Limited, Ground Floor, Infinity Tower, Tata Ramanujan IT City SEZ, Rajiv Gandhi Salai, Near Tidal Park, Old Mahabalipuram Road, Taramani, Chennai - 600 113","phone":"Not Provided","profile":"Software Testing (QAT) \nAmazon Development Centre (India) Pvt. Limited","description":"Amazon is hiring Software Testing(QAT) for Chennai location. Eligibility Cretria: BE Computer Science, B-Tech, Master of Computer Applications (MCA), MSc Information Technology (IT) with relevant experience in Software testing with 2 to 3 years of industry experience. Well versed in SDLC and has hands on experience on STLC. Have fair scripting knowledge using Python and Java, able to own, execute and verify results of existing automated tests, manage and scale the lab infrastructure based on project needs. Have basic understanding of the automation framework to initiate, manage and maintain automation runs as per defined schedule/SLA. Interview Date: 14th September 2019 Walk-in: 11:00 AM to 12.00 PM Building Address- Amazon Development Centre (India) Private Limited Ground Floor, Infinity Tower, Tata Ramanujan IT City SEZ, Rajiv Gandhi Salai, Near Tidal Park, Old Mahabalipuram Road, Taramani, Chennai - 600 113 Documents to Carry: 2 copies of Resume (Mandatory) Pan Card (Mandatory) Photo Copies Provisional Certificate and/or Degree Certificate (Mandatory) Photo Copies Upon arrival, please ask for Kalpana","location":"Chennai","experience":"2 - 3 Years"},{"date":"13, 14 - Sept - 2019","skills":"Office Administration Front Office Receptionist Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"E-Con Packaging Private Limited, Ground Floor, A/1, Rikhav Bldg, 21/1, Kidwai Road, Wadala, MUMBAI, Maharashtra - 400 031","phone":"022-261726000","profile":"Front Office cum Admin Executive \nE-Con Packaging Private Limited","description":"Candidate should be Any Graduate with good communication skills Should be presentable with Basic computer knowledge Punctual and Honest Candidate need not have any past experience , freshers can also be considered. Salary up to 2.2 LPA Should be willing to join at a short notice (Immediate joiner will be given preference) Walk-in Date/ Time: 13th - 14th September , 10 AM onwards Interview Venue: E-Con Packaging Private Limited Ground Floor, A/1, Rikhav Bldg, 21/1, Kidwai Road, Wadala, MUMBAI, Maharashtra - 400 031","location":"Mumbai","experience":"0 - 1 Years"},{"date":"13, 16, 17, 18, 19 - Sept - 2019","skills":"General Administration, End to end of recruitment process, Vendor management","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Quintessence Business Solutions Services Pvt. Limited, Elnet SoftwareCity, Module 21 23, Second Floor, Chennai, Tamilnadu - 600 113","phone":"8870428777","profile":"HR/ Admin Executive \nQuintessence Business Solutions Pvt. Ltd","description":"We are looking for MBA/ BBA (HR) with 6 months to 1 year experience Preferably Female candidates Must have good communication skills End to end of recruitment process Hndling the vendor management Responsible of the on boarding the new joinees and hand over to the operations Flexible to work in night shift Interested candidates can walk In directly from 13th - 19th September (Monday to Friday) at 11.00 AM to 3.00 PM Or forward your CV to mail sangeetha.p@qbssmail.com Interview Venue: Quintessence Business Solutions Services Pvt Ltd Elnet SoftwareCity, Module 21 23, Second Floor, Chennai, Tamilnadu - 600 113 Contact Person: Sangeetha HR Contact No: 8870428777 / 7338853331","location":"Chennai","experience":"0 - 1 Years"},{"date":"16, 17, 18, 19, 20 - Sept - 2019","skills":"General Administration, Travel Desk, Front Office, Housekeeping","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"FabAlley High Street Essentials Pvt. Limited, C-11 Sector 7 Noida - 201 301","phone":"Not Provided","profile":"HR Executive \nHigh Street Essentials Pvt. Limited","description":"Candidate should be MBA-HR or Equivalent with 1 to 3 years of relevant experience. Must have excellent communication & people management skills Talent Acquisition - - Handling recruitment of fashion consultants and store managers. -Sourcing profiles through various job portals. -Coordination with respective stakeholders for various rounds of interviews -Salary negotiations and offer closures . -Creating bench strength for front end candidates. -Conducting employee reference checks. Joining And Induction- -Responsible for joining formalities of all store employees. -Preparing Welcome circulars. -ID Card data preparation. -Employee file creation. -Bank Formalities . -Employee Code creation Confirmations- -Ensure timely confirmations for all store employees -Follow up on PIP cases . Exit Management.- -Coordination with payroll team for Full And Final settlement . -Managing Exit Interviews and NOC process. Rewards And Recognition- -Coordination with various departments for conducting employee of the month,quarter,year for frontend staff. Walk-in 16th - 20th September, 2019 Timings: 11 AM to 5 PM Interview Venue: FabAlley High Street Essentials Pvt Ltd C-11 Sector 7 Noida - 201 301","location":"Noida","experience":"1 - 3 Years"},{"date":"14 - Sept - 2019","skills":"General Administration, Back Office, Data Processing","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Vara Infotech Private Limited, 1st Floor, Raghuleela Arcade, Vishwaroop Software Park (Above Audi Showroom), Sector 30A, Vashi, Navi Mumbai - 400 703","phone":"022-45420045","profile":"Back Office Executive \nVara Infotech Private Limited","description":"Vara Infotech Private Limited, is hiring Fresher candidates for Backend Process (Data Processing) for Vashi and Andheri Location Candidate should be H.Sc or Graduate. Willing to work in Rotational Shifts Candidate should have minimum of 25 to 35 WPM in Typing with 95% accuracy. Walk-in Date: 14th September 2019 Time: 9:30 A.M to 3:30 P.M Interview Venue: Vara Infotech Private Limited 1st Floor, Raghuleela Arcade, Vishwaroop Software Park (Above Audi Showroom), Sector 30A, Vashi, Navi Mumbai - 400 703 Contact Person: Priyanka Tel: 022-45420045 / 9075917122 Kindly carry the following documents during interview: All educational documents (Photo Copies of Mark Sheets degree) Aadhar Card and PAN Card Updated resume","location":"Mumbai","experience":"0 - 1 Years"},{"date":"13, 14, 16, 17, 18 - Sept - 2019","skills":"HR Intern/ Fresher","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Kotak Mahindra Bank, #22, MG Road, Near Trinity Metro Station, Opposite HSBC Bank, Bangalore - 560001","phone":"Not Provided","profile":"HR Executive - Intern \nKotak Mahindra Bank Limited","description":"Students Looking for HR Internship can walk-in to the below mentioned address or can share the cv to below mail ids- deepanjali.shah@kotak.com naveen.kumar4@kotak.com Walk-in Date: 12th - 18th September Time : 10 AM - 2:00 PM Address : Kotak Mahindra Bank, #22, MG Road, Near Trinity Metro Station, Opposite HSBC Bank, Bangalore - 560001 Contract person : Deepa /Naveen","location":"Bangalore","experience":"0 - 1 Years"},{"date":"13, 14, 16, 17 - Sept - 2019","skills":"HR/ Recruitment, Sourcing Profiles, Telecalling, Joining Formalities","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"SLK Global Solutions Private Limited, Yerwada Bldng No 26th Floor Commerce Zone, Pune","phone":"Not Provided","profile":"Talent Acquisition Executive \nSLK Global Solutions Private Limited","description":"Candidate should have good communication with interpersonal and analytical skills. Recruitment analysis. Essential duties and responsibilities include the following (other duties may be assigned) Sourcing the potential candidates from various sources i.e. Database, Employee reference, Tele-calling, Outstation hiring. Handling support/ lateral/ leadership level recruitment of all processes right from sourcing profiles, interviewing, offer making and discussion and joining formalities. Short-listing, interviewing and selecting candidates based on process requirement. Walk-in Date/ Time: 11th - 17th September , 12 PM onwards Interview Venue: SLK Global Solutions Private Limited Yerwada Bldng No 26th Floor Commerce Zone, Pune","location":"Pune","experience":"1 - 3 Years"},{"date":"13, 14 - Sept - 2019","skills":"Software Testing, Functional testing, QA Testing, Manual testing, System testing, Product testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"LogStar ERP India Private Limited, 302, Sai Enclave, C-Wing, Behind Vikhroli Bus Depot, Vikhroli (East), Mumbai- 400 083.","phone":"022-41192254","profile":"QA/ Testing Engineer \nLogStar ERP India Private Limited","description":"Candidate should have 1 to 4 years of experience on Software Testing, Functional testing, QA Testing, Manual testing, System testing, Product testing Job Responsibilities- Reviewing and analyzing system specifications Executing test scripts and reviewing results Reporting and documenting technical issues Execute test cases (manual or automated) and analyze results Report bugs to developers Walk-in Date/ Time: 13th - 14th September , 11 AM onwards Interview Venue: LogStar ERP India Private Limited 302, Sai Enclave, C-Wing, Behind Vikhroli Bus Depot, Vikhroli (East), Mumbai- 400 083. Landmark: ICICI Bank Vikhroli East branch/ Dominos Pizza Contact No: 022 61792227","location":"Mumbai","experience":"1 - 4 Years"},{"date":"14 - Sept - 2019","skills":"Java, Selenium / Informatica Testing, QTP/ UFT/ Performance Testing (Load Runner)","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Infosys BPO Limited, Tidel Park, South Wing, C Block, 4th Floor, Taramani, Chennai - 600 113","phone":"Not Provided","profile":"Software Engineer/ Testers \nInfosys BPM Limited","description":"Infosys BPM Limited is hiring for Multiple Technology Skills - Chennai on 14-Sep-2019 (Saturday) Skills/ Technologies: Selenium / Informatica Testing /DWH / Informatica Developer / QTP/UFT/ Performance Testing (Load Runner)/ Mainframes Developer/ Mainframes Tester/ .Net / WCF/ WPF / Angular 5/6 /JAVA With Spring & Hibernate / JAVA Full Stack Qualification : Any graduate with Full-time Education Work Experience : Minimum 2 to 5 Years Shifts: Should be flexible for 24*7 Shifts Interview Date: 14th September 2019 (Saturday) Time: 09:30 AM to 11:30 AM Interview Venue: Infosys BPO Limited, Tidel Park, South Wing, C Block, 4th Floor, Taramani, Chennai - 600 113 Point of Contact: Ibrahim / Rini John Note: Reference DS-Mahadev Vamsi (mention on top of your CV before submit your candidature). Please ask your friends /Colleagues also to walk for the drive if their profile matches the requirement","location":"Chennai","experience":"2 - 5 Years"},{"date":"14 - Sept - 2019","skills":"Software Testing, Manual Testing, STLC and expertise with SQL","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"ADF Data Science Private Limited, Fayola Towers (2nd Floor), S. No. 56/3A, 200 Feet Road, Pallikaranai, Chennai-600100. Landmark: Opposite to Kamakshi Hospital","phone":"9790740638","profile":"Manual Testing Engineer \nADF Data Science Private Limited","description":"Candidate should have Bachelor of Engineering, (or B Sc, M.Sc, MCA) preferably in Computer Science/or related fields with 0 to 2 years of work experience in Manual Testing. Must have good knowledge on STLC and expertise with SQL. Familiarity with mobile device testing added advantage Critical thinker and problem-solving skills Familiar with Agile methodology Good time-management skills Roles & Responsibilities: Develop test cases and plans to test the current suite of products. Collaborate with the Development team in root cause analysis. Log defects in issue system with clear and complete information. Be able to participate in scrum meetings and provide input to other stakeholders Walk-in Date/ Time: 14th September 2019, 9 AM onwards Venue Details:- ADF Data Science Private Limited Fayola Towers (2nd Floor), S. No. 56/3A, 200 Feet Road, Pallikaranai, Chennai-600100. Landmark: Opposite to Kamakshi Hospital","location":"Chennai","experience":"0 - 2 Years"},{"date":"14 - Sept - 2019","skills":"C#, MVC, Javascript, JQuery, SQL Server , Asp .Net","qualification":"B.E./B.Tech, MCA/PGDCA","address":"PreludeSys India Limited, Old No. D-12, New No. 3/A3, 1st Cross Street, Siruseri SIPCOT IT Park, Chennai - 603 103","phone":"Not Specified","profile":".Net Developers \nPreludeSys India Limited","description":"Candidate must have 1 to 3 years of experience with exposure in C#, MVC, Javascript, JQuery, SQL Server , Asp.net and willing to work in VB.Net. VB .Net added advantage. Good Communication. Walk-in Date: 14th September 2019 Time - 10 AM to 2 PM Interview Venue: PreludeSys India Limited Old No. D-12, New No. 3/A3, 1st Cross Street, Siruseri SIPCOT IT Park, Chennai - 603 103 Contact Person - Vijay R (HR Team)","location":"Chennai","experience":"1 - 3 Years"},{"date":"14 - Sept - 2019","skills":"Automation Testing, SOAP UI, Web Application Testing, Selenium","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Altran Technologies India Private Limited, Unitech Infospace SEZ, Tikri, Sohna Road, Sec. 48 Tower 5 , Ground Floor Gurgaon Haryana - 122 018","phone":"Not Provided","profile":"Automation Test Engineer \nAltran Technologies India Private Limited","description":"Candidate should have Master's or bachelors degree in Engineering, Telecommunication, Computer Science, Software Technology or equivalent education with 3+ years experience in E2E feature testing and Web application testing within Telecom domain. Experience in creating, reviewing and execution of test plans based on specifications. Experience in Automation using python, selenium, Ansible, robot framework. Knowledge of SOAP UI, JMeter, Seagull, and SIPP tools Knowledge of SIP, RTP, INAP, CAMEL, DIAMETER, REST. Hands-on experience on fALU/fNokia Products is an advantage Ability to work in Agile mode with strict deadlines Walk-in Date/ Time: 14th September from 10 AM onwards Interview Venue Altran Technologies India Private Limited Unitech Infospace SEZ, Tikri, Sohna Road, Sec. 48 Tower 5 , Ground Floor Gurgaon Haryana - 122 018","location":"Gurgaon","experience":"3 - 6 Years"},{"date":"14 - Sept - 2019","skills":"C#, Ado .Net, MVVM, Basic .Net, WPF, SQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Capgemini Technology Services India Limited, Campus: 6B, 1st Floor, RMZ Ecospace, Bellandur, Bangalore - 560 037","phone":"9886594559","profile":".Net C# WPF Developer \nCapgemini Technology Services India Limited","description":"Qualifications- Any Graduation Work Experience: 4 to 6 Years in C# with WPF Software & development skill set: Framework Stack: .Net Framework 4.5 and above, .Net Core 2.2, .Net Standard 2.0. dot net ecosystem (.Net framework, .Net Core/ ASP .Net Core) and strong hands on experience in development of software tools and applications in C# and in .Net (Must) Programming Languages: C# and interoperability. Experience in C++, (added advantage). UI Stack: WPF (using PRISM, MEF/ Unity) , Windows Forms, UWP (Good to have), ASP .Net Core Razor (Good to have), Angular (Good to Have). Experience in UI framework development and UI development for Web based UI, Desktop and HTML5 (Must) Service Stack: WCF, ASP .Net Core 2.2 (WebAPI, SignalR, HTTP Clients), Any Messaging Framework. Strong knowledge and skills in WPF, Web services, WCF etc.- (Must) Programming Paradigms: Object Oriented Programming (includes SOLID, Design Patterns, UML), Task Parallel Programming (Async, Await), Functional Programming (LINQ/PLINQ). Experience in Software modelling, information modelling etc, and hands on experience in Software Design, Design patterns, architectural patterns and experience with UML, EA tool etc (Preferred). Walk-in Date/ Time: 14th September , 9 AM onwards Interview Venue: Capgemini Technology Services India Limited Campus: 6B, 1st Floor, RMZ Ecospace, Bellandur, Bangalore - 560 037 Contact Person- Manjunath/ Jins/ Girish/ Pampa","location":"Bangalore","experience":"4 - 6 Years"},{"date":"13, 14, 16, 17 - Sept - 2019","skills":"Angularjs, Design Patterns, OOPS, MVC Framework, Node.Js, SQL, Algorithms, NoSQL, Mean Stack","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Pandaje Web Services Pvt. Limited A/60 Sector 58 Noida","phone":"0120-4526967","profile":"C# .Net Developer \nPandaje Web Services Private Limited","description":"Candidate must have excellent understanding of computer science fundamentals, data structures, algorithms and design patterns. Currently working as a hands-on developer in Python/ Dot net with a thorough understanding of Mean Stack (Mongo DB, Angular.js, Node.js, Express.js) Candidate should have 1 to 5 years of product development experience for large scale systems with high volume and high-performance requirements. Deep understanding on OOPs concepts, logics, & JavaScript. Experience and good knowledge of event-based programming. Fundamentals of Micro-Services. Working experience of RESTful APIs / Soap APIs and Data Modeling. Walk-in Date/ Time: 13th - 17th September , 6 PM onwards Interview Venue: Pandaje Web Services Pvt. Limited A/60 Sector 58 Noida","location":"Noida","experience":"1 - 5 Years"},{"date":"20, 21, 23, 24, 25, 26, 27 - Sept - 2019","skills":"ASP .Net MVC4 and above, ASP .Net Web API, C# (.Net framework)","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Online24x7 India Private Limited, Vipul Business Park, 601-605 Sector 4, Gurgaon, Haryana","phone":"Not Provided","profile":".NET Lead Developer \nOnline24x7 India Private Limited","description":"Full Time Bachelors / Masters degree (Science or Engineering preferred) with 3 to 6 years of experience. Familiar with various design and architectural patterns. Proficient in designing and developing web based applications using ASP .Net MVC4 and above, ASP .Net Web API, C# (.Net framework). Good experience in Entity framework/ NHibernate, SQL Sever Hands-on experience in messaging platform (Tibco, Rabbit MQ, nServicebus etc) is highly preferred Experience in HTML5/JavaScript is required Experience in implementing automated testing platforms and unit tests Good to have experience in Knockout/angular/jQuery, JavaScript, Kendo UI Exposure in Build and release Strong understanding of object-oriented programming Worked in large teams using Agile based development methodology Walk-in Date/ Time: 20th September - 27th October , 11 AM onwards Interview Venue: Online24x7 India Private Limited Vipul Business Park, 601-605 Sector 4, Gurgaon, Haryana","location":"Gurgaon","experience":"3 - 6 Years"},{"date":"14, 16, 17, 18, 19, 20, 21 - Sept - 2019","skills":"DotNet, C, C++, Core Java, Node, MySQL","qualification":"B.E./B.Tech, B.Sc, BCA/BCS","address":"Vedic Systems Private Limited, Srinivasam 4--17, Street 11, Snehapuri Colony, Nacharam, Hyderabad - 500 076","phone":"9182290545","profile":"Application Developer (.Net/ C++/ Java) \nVedic Systems Private Limited","description":"Candidate should have good knowledge on DotNet, C, C++, Core Java, Node, MySQL Knowledge on Web Design Tools: HTML, CSS, Javascript, Ajax, JQuery Good Communication Skills Walk-in Date/ Time: 14th - 21st September , 11 AM onwards Interview Venue: Vedic Systems Private Limited Srinivasam 4--17, Street 11, Snehapuri Colony, Nacharam, Hyderabad - 500 076","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"14 - Sept - 2019","skills":".Net Framework 4.0/4.5 C#, ASP .Net, WCF/ Web Services, SOA, Multi-tenancy, OOAD SQL Server","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Nihilent Limited, 4th Floor, D Block Nagar Road Weikfield, IT Citi Infopark, Pune, Maharashtra - 411 014","phone":"Not Provided","profile":"Senior .Net Developer \nNihilent Limited","description":"Nihilent is organising Walk-in drive for Dot Net/ Sr. Dot Net Developers on 14th Sept,19 in our Nihilent, Pune office Skills Required: .Net Framework 4.0/4.5 C#, ASP .Net, WCF/ Web Services, SOA, Multi-tenancy, OOAD SQL Server 2005/ 2008 -fundamental database concepts, designing & programming skills Strength in designing truly scalable applications. Aware & practiced secure application / web API programming practices Strong application design skills -high level and low-level design You have credible experience in C# and WCF, anywhere between 3 and 6 years. You have a good understanding of IIS Architecture, ASP .Net framework/ Lifecycle and .Net framework You understand how API frameworks are built, analyzed for performance, security & scalability You have a passion for programming and good participation in community media You have acumen for programming excellence and hunger to see your work successfully in the market. Job Role/ Responsibility: Responsible to develop scalable and high-performance components. Should analyze, review requirements from product specifications and provide accurate estimates Should take ownership of the technical aspects of a product vertical. Should drive code reviews and develop processes for coding practices. Walk-in Date/ Time: 14th September 2019, 10 AM onwards Interview Venue: Nihilent Limited 4th Floor, D Block Nagar Road Weikfield, IT Citi Infopark, Maharashtra - 411 014 Interested candidates please share your most updated resume on kshipra.udhoji@nihilent.com along with the below details: Availability for the Drive on 14th Sept: Total Experience: Relevant Experience: Current CTC: Expected CTC: Notice Period (Immediate Candidates preferred)","location":"Pune","experience":"4 - 9 Years"},{"date":"14 - Sept - 2019","skills":"VB .Net, Angularjs, C++, OOPS, C#, ASP .Net","qualification":"B.Sc, BCA/BCS, Diploma","address":"Xenovex Technologies Private Limited, 5/60, 1st Floor, Aries Towers, 100 Feet Road, Opposite to SRM University, Vadapalani, Chennai","phone":"Not Provided","profile":".Net Developer/ Freshers \nXenovex Technologies Private Limited","description":"We are looking only Diploma UG Degree (Computer Science and IT) Possess good analytical & problem solving skills. Be a good attitude person, a quick learner & good communicator. BSC (Computer Science), BCA (Computer Science), Diploma (Computer Science) Education : 2019 or 2018 Passed Out Percentage : Minimum 50% in Graduation Note : 3 Years of Bond. Duration : 6 Months (After the completion of 6 Months, Based on the performance, hired as Permanent Employee). Salary : Rs. 10,000 / Month Fixed Saturday and Sunday Holiday. Interview Process : 1. Written Test (Aptitude / Basics of CS) 2. Face to Face Interview (Technical) 3. HR Interview Interested candidates drop into our office from 14th Sep, 2019 (On Saturday) i.e., 10 AM and 1 PM to the below Xenovex Technologies Private Limited 5/60, 1st Floor, Aries Towers, 100 Feet Road, Opposite to SRM University, Vadapalani, Chennai","location":"Chennai","experience":"0 - 1 Years"},{"date":"15 - Sept - 2019","skills":"ASP .NET, C#, SQL, MVC, AJAX, JQuery, HTML/ CSS, Angular, Web API","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Hetero Learning Center-1, 1st Floor, Above Honda Showroom, Beside Gokul Theatre. Erragada, Hyderabad.","phone":"0120-7182424","profile":".Net Developer \nHetero Drugs Limited","description":"Educational Qualification: B.Tech/ M.Tech/ MCA/ BSc (Computer Science) Work Experience: 1 to 5 Years Job Location: Hyderabad Key Skills: ASP .NET, C#, SQL, MVC, AJAX, JQuery, HTML/ CSS, Angular, Web API Interested candidates can walk-in on 15th September 2019 ( Sunday) @ 10 AM to 2 PM. Interview Venue: Hetero Learning Center-1, 1st Floor, Above Honda Showroom, Beside Gokul Theatre. Erragada, Hyderabad. Please carry an updated Resume along with your Photograph.","location":"Hyderabad","experience":"1 - 5 Years"},{"date":"14 - Sept - 2019","skills":"ASP .NET, C#, VB .NET, SQL Server, SQL Reporting Services, Crystal Reports","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Global E-SoftSys Private Limited, SUMERU, 1st Floor, No. 327, 15th Cross II Block, Jayanagar, Bangalore - 560 011","phone":"080-26566604","profile":"Trainee .Net Programmer \nGlobal E-SoftSys Private Limited","description":"Good knowledge, exposure and proficiency in .NET and SQL technologies such as ASP .NET, C#, VB .NET, SQL Server, SQL Reporting Services, Crystal Reports, UML, SOAP, XML, etc. Certification course in Dot Net is a plus. Walk-in Date/ Time: 14th September , 10 AM onwards Interview Venue: Global E-SoftSys Private Limited SUMERU, 1st Floor, No. 327, 15th Cross II Block, Jayanagar, Bangalore - 560 011 Contact Person: Chaitanya Phone No: 080-26566604","location":"Bangalore","experience":"0 - 1 Years"},{"date":"14 - Sept - 2019","skills":"C#.NET, ASP .Net, Sql Developer","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Techwave Consulting Inc., Level 4, Buildig No. H6 Phoenix Avance Business Hub, Hitech City, Behind Dell Campus, Hyderabad - 500 081","phone":"040-66583513","profile":"C#, .Net Developer \nTechwave Consulting India Private Limited","description":"Candidate should have 3 to 8 years of proven experience as a C#.NET, ASP .Net, Sql Developer Must have excellent troubleshooting and communication skills Understanding of Agile methodologies is a plus Interview Process : Online system test will be on Saturday, if through Technical round will be in week days. Walk-in Date/ Time: 14th September from 10 AM onwards Interview Venue: Techwave Consulting Inc., Level 4, Buildig No. H6 Phoenix Avance Business Hub, Hitech City, Behind Dell Campus, Hyderabad - 500 081 Anusha Kandula Assistant Manager Recruitment Desk: 040-66583513 |Mobile: 9100247819 (India) Email : kanusha@techwave.net","location":"Hyderabad","experience":"3 - 8 Years"},{"date":"16, 17 - Sept - 2019","skills":"C# .NET & WPF","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"InspiriSYS Solutions Limited, TC 17/ 27, Jagathy, Trivandrum -14","phone":"0471- 2342215","profile":"Software Engineer (.Net) \nInspirisys Solutions Limited","description":"Candidate should be BSc/ BA in Computer Science, Engineering or a related field. Proven experience as a .NET Developer or Application Developer. Familiarity with the C# .NET Experience in WPF. Understanding of Agile methodologies Excellent troubleshooting and communication skills Attention to detail MANDATORY SKILL REQUIRED: C# .NET & WPF SITE - On Site & Permanent role EXPERIENCE DETAILS: Min 0.6 Month to Max 3 Yrs. JOB LOCATIONS: Trivandrum. SALARY DETAILS: Max 25,000 INR / Month REQUIREMENT: Immediate to 15 days Walk-In Date: 16th - 17th Sep 2019 (Monday & Tuesday) Time: 10:00 AM to 05:00 PM Interview Venue: InspiriSYS Solutions Limited TC 17/ 27, Jagathy, Trivandrum -14 SPOC: Abhilash Phone: 0471- 2342215, 65 / 2342197 Mobile: +91-9847098451 Interested candidate kindly shares an updated resume to a.sindhu@inspirisys.com with the below details. Total/ Overall Experience: Rel Expr in C# .NET: Rel Expr in WPF: C.CTC & THS: Official NP:","location":"Trivandrum","experience":"1 - 3 Years"},{"date":"14, 15 - Sept - 2019","skills":".Net, WEB API , SQL Server , C# , WinForms","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Nagarro Software Private Limited, WorkEdge Coworx B-23, Sector 63 Road, B Block, Sector 63, Noida - 201 301","phone":"Not Provided","profile":".Net Professionals \nNagarro Software Private Limited","description":"Position 1: Dot Net Winforms (3-8 years) Must have exposure- .Net, WEB API , SQL Server , C# , WinForms Preferred- WCF, GIt Position 2: Dot Net Core Fullstack (6-8 years) Must have exposure - .NET Core , OOPS , C# , SQL, JavaScript preferred AWS, Angular 2, Redux , React JS , Microservices, Vue JS, Azure Position 3: : Dot Net Core with microservices (6-8 years) Must have exposure - .NET Core & Microservice Position 4: : Dot Net with Backbone.js (6-8 years) Must have exposure - .net 4.5, JavaScript, CSS, Backbone.js, SQL Server Position 5: VB Dot Net (3-8 years) Must have exposure- Asp.Net MVC, SQL Server , VB.Net , C# Preferred - Oracle PL/SQL , scrum Interview Date - 14th/ 15th September 2019 (Saturday/ Sunday) in Noida Interview time : 9:30 AM -1:00 PM Interview Venue: WorkEdge Coworx B-23, Sector 63 Road, B Block, Sector 63, Noida - 201 301 Contact Person Kshama Chanda","location":"Noida","experience":"3 - 8 Years"},{"date":"13, 14 - Sept - 2019","skills":"Office Administration, Front Office/ Receptionist Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"E-Con Packaging Private Limited, Ground Floor,A/1, Rikhav Building, 21/1, Kidwai Road, Wadala, Mumbai - 400 031","phone":"022-261726000","profile":"Front Office/ Admin Executive \nE-Con Packaging Private Limited","description":"Urgent Requirement for Front Office cum Admin Executive at Wadala, Mumbai Candidate must have below requisites- Very good communication skills Should be presentable Basic computer knowledge Punctual and Honest Candidate need not have any past experience, freshers can also be considered. Salary up to 2.2 LPA Should be willing to join at a short notice (Immediate joiner will be given preference) Walk-in Date/ Time: 13th - 14th September , 10 AM onwards Interview Venue: E-Con Packaging Private Limited Ground Floor,A/1, Rikhav Building, 21/1, Kidwai Road, Wadala, Mumbai - 400 031","location":"Mumbai","experience":"0 - 1 Years"},{"date":"12, 13 - Sept - 2019","skills":"Java, Spring, Hybernate, SQL, Multithreading Concepts, API development","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Authbridge Research Services Pvt. Limited, Plot No. 123, 2nd floor, Udyog Vihar Phase 4, Gurgaon, Haryana - 122 015","phone":"Not Provided","profile":"JAVA Developer/ Freshers \nAuth Bridge Research Services Pvt. Ltd.","description":"Educational Qualification: B.Tech/ MCA (60% Throughout) Key Skills: Spring, Hybernate, SQL, Multithreading Concepts, API development Key Responsibilities: Contribute in all phases of the development lifecycle. Write well designed, testable, efficient code Ensure designs are in compliance with specifications. Prepare and produce releases of software components Support continuous improvement by investigating alternatives and technologies and presenting these for architectural review. Walk-in Date/ Time: 12th - 13th September , 11 AM onwards Interview Venue: Authbridge Research Services Pvt. Limited, Plot No. 123, 2nd floor, Udyog Vihar Phase 4, Gurgaon, Haryana - 122 015","location":"Gurgaon","experience":"0 - 1 Years"},{"date":"12, 13, 14 - Sept - 2019","skills":"Technical Support, IT Helpdesk/ Service Desk, Customer Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"HCL Technologies Limited, Surya Sapphire, Plot No 3, 1st Phase, Hosur Road, Electronics City Bangalore - 560 100","phone":"Not Mentioned","profile":"L1 Technical Support (Voice Process) \nHCL Technologies Limited","description":"Candidate should have 6 months - 3 years of Service desk, voice customer service, and support experience with problem solving involving hardware, involving hardware, software, and networks. Should have Global support experience. Technical Requirements- Phone support experience necessary. Technical Service desk or technical call center experience is necessary. Disciplined, systematic problem solving skills required. Hands-on work experience with the following: Windows Operating systems Clients: Windows7, Windows Vista, Windows XP, Windows 2000 Servers: Windows 2000, Windows 2003, Windows 2008, Knowledge of Active Directory, Exchange 2003/2007 Soft Skills- Excellent communication and conversation skills (Verbal and Written) Good documentation skills Good working knowledge of MS OFFICE (Including MS Project and Visio) Should have a great customer handling skills Able to handle unforeseen situations High level of acceptance Can drive HCLs value and its methodology Walk-in Date- 11th to 14th September 2019 Time - 10:00 AM to 1:30 PM Interview Venue: HCL Technologies Limited Surya Sapphire ,Plot No 3, 1st Phase, Hosur Road, Electronics City Bangalore - 560 100 Documents to Carry (Mandatory)* Hard Copy of your updated Resume. Printout / Screenshot of this walkin post One Government ID proof Xerox copy (Preferable Passport ) One Passport size photograph.","location":"Bangalore","experience":"0 - 3 Years"},{"date":"11, 12, 13, 14, 16, 17, 18, 19, 20, 21 - Sept - 2019","skills":"Front Office Assistance, General Administration, Back Office Operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"A to Z Electrotrade (India) Pvt. Limited, Plot No. 14, Basai Enclave, Basai Industral Area, Basai, Gurgaon - 122 006","phone":"Not Provided","profile":"Admin/ Front Office Executive \nA to Z Electrotrade (India) Pvt. Limited","description":"Candidate should be Any Graduate with 0 to 3 years of experience in Back Office Operations, General Administration, Front Office Assistance. Must have excellent communication skills. Job Responsbility- Keep front desk tidy and presentable Greet & Welcome guests Handling all incoming calls and redirect them or keep messages Receive letters, packages etc. and distribute them Keep updated records and files Monitor office expenses and cost Walk-in Date/ Time: 11th - 30th September , 10 AM onwards Interview Venue: A to Z Electrotrade (India) Pvt. Limited Plot No. 14, Basai Enclave, Basai Industral Area, Basai, Gurgaon - 122 006 Meet HR : Mr. Bablu Sharma","location":"Gurgaon","experience":"0 - 3 Years"},{"date":"11, 12 - Sept - 2019","skills":"Customer Support, Non Voice Process, Back Office, Customer Service","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Groupon Shared Services Private Limited, Gopalan Global Axis, G Block, 2nd floor, Road No. 9, KIADB Export Promotion Industrial Area, Whitefield, Bengaluru - 560 066","phone":"Not Provided","profile":"Back Office/ Non Voice Process \nGroupon Shared Services Private Limited","description":"Candidate should be a Graduate or Post Graduate with good command over English writing, ready to work in a state of art ambiance & amongst fun loving people. Where so much learning & growing happens! If you believe in working in any time zone & interact with people across the globe. We have the right job for you. You might even have some previous experience, no matter with the role or the industry, we still have so much to offer you! Bring your expertise in communication, logical skills & timely responsiveness skills & we will ensure to mold it into professional with high quality Customer centric solitaires. You are a great fit to this role if you have, Good written communication skills Logical Skills Graduation is a must Previous experience in customer services is good have Should be ready to work in rotational shifts/ including Night shifts (The shortlisted candidate should be able to join us in 30 days Max) If you feel confident to meet the need please Walk In with your updated resumes & necessary documents like: PAN, Aadhar card, graduation certificates & relieving letter from previous employer & latest payslips (All originals) Please be available at our office address between 9.30 AM to 11 AM only (No Weekends) Date: 11th - 12th September 2019 Our office Address, Groupon Shared Services Private Limited, Gopalan Global Axis, G Block, 2nd floor, Road No. 9, KIADB Export Promotion Industrial Area, Whitefield, Bengaluru, Karnataka - 560 066 Landmark: Opposite to Satya Sai Hospital","location":"Noida","experience":"0 - 3 Years"},{"date":"11, 12 - Sept - 2019","skills":"General Administration, Housekeeping, Travel Desk, Front Office Management","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Kotak Mahindra Life Insurance Company Limited, #337, 1st floor, 27th Main Road, HSR Layout Sector 2, Bangalore - 560 102 Landmark: Opposite to KLM MALL","phone":"022-66057050","profile":"Administration Executive \nKotak Mahindra Life Insurance Co. Limited","description":"Candidate should be a Graduate with min 6 month work-experience. Age should not be more than 28 Knowledge of Admin role is a must Aware of Local language must Candidates with experience in the below profiles will not be suitable - (Tele calling or customer care profiles (Insurance, Credit card, Holiday Selling etc), Sales background, Account Assistant/ Purchase Assistant, Secretaries/ Receptionists, Telephone Operators and Admin profiles from educational institutions.) Walk-in Date: 11th - 12th September 2019 Interview Time : 11:00 AM - 3:00 PM Interview Venue: Kotak Mahindra Life Insurance Company Limited #337, 1st floor, 27th Main Road, HSR Layout Sector 2, Bangalore - 560 102 Landmark: Opposite to KLM MALL Interviewer Details: Priyanka Prakash Contact No- 022-66057050 Email- kli.jayshree-bhati@kotak.com","location":"Bangalore","experience":"0 - 1 Years"},{"date":"11, 12, 13, 14, 16, 17, 18 - Sept - 2019","skills":"Back office operations, Underwriting, Banking Operations, MIS Operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Kotak Mahindra Life Insurance Co. Limited, 9, 2nd floor, Neeladri Building, Cenotaph Road, Teynampet, Chennai - 600 018. Land Mark - CARS India Maruti Showroom.","phone":"Not Mentioned","profile":"Customer Service/ Operations Executive \nKotak Mahindra Life Insurance Co. Limited","description":"Roles & Responsibilities: Servicing Walk in Clients at the Branch Renewal Premium Followups Back end Processing of Life Insurance Proposals Coordination in Excel & Maintaining MIS Candidates - Born after 1994. Minimum 1 year experience Required. Hindi Speaking is an added advantage but not compulsory. No of Openings - 5 Work Location: Chennai, Coimbatore & Salem Walk-in Date/ Time: 11th - 18th September , 10 AM onwards Interview Venues: 1) Kotak Life insurance - Salem Sivaranya Towers 2nd Floor Brindhavan Road Salem - 636004 2) Kotak Life Insurance - Coimbatore 2A,1st Floor, 500, Gujarati samaj Building, Mettupalayam Road, R. S. Puram, Coimbatore - 641002 Landmark: Near Central Theatre 3) Kotak Life Insurance - Chennai 9, 2nd floor, Neeladri Building, Cenotaph Road, Teynampet, Chennai - 600 018 Land Mark - CARS India Maruti Showroom.","location":"Chennai, Coimbatore, Salem","experience":"1 - 2 Years"},{"date":"11, 12, 13, 14 - Sept - 2019","skills":"Front Office Operations, Cash Handling, Book Keeping","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Bajaj Capital Limited, 1st floor, Near Hotel Saurabh Candy, Mukharji Compound, Nainital Road, Haldwani","phone":"8395888050","profile":"Senior Executive - Operations \nBajaj Capital Limited","description":"Qualification: - MBA, BBA, B.Com, M.com Age :-18 to 26 years Vacancy: -1 for each location Location:-Haldwani Responsibilities and Duties Responsible for punching business in our system and handling cash on day to day basis. Responsible for solving problem of client and give end to end solution. Responsible for co-ordinating with Principal company, HR and Head office . Qualifications & Skills- Good communication skills in Hindi, English & local language. Good personality. Positive attitude regarding work Smart worker. Have relation building quality. Extrovert Have interest in operation profile . Able to work in under pressure. Have good knowledge of MS-office (world and excel) Should have good mail proficiency . Salary: - Up to 15,000 CTC + Incentives Walk-in Date/ Time: 11th - 14th September , 11 AM onwards Interview Venue: Bajaj Capital Limited 1st floor, Near Hotel Saurabh Candy, Mukharji Compound, Nainital Road, Haldwani","location":"Uttaranchal- Other","experience":"0 - 2 Years"},{"date":"11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22 - Sept - 2019","skills":"Core PHP, MySQL, JQuery, Ajax, Wordpress and MVC Framework","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Credit Wise Capital Private Limited, 602 Marathon Icon, Off Ganpatrao Kadam Marg, Lower Parel (West) Mumbai - 400 022.","phone":"Not Provided","profile":"Back Office Executive \nCreditWise Capital Private Limited","description":"Person should have a Bachelors degree in any subject or field with good communication skills. Should have computer knowledge (well versed in Microsoft Excel) Able to work in coordination and under supervision Should have basic math and analytical skills. Duties & Responsibilities : Keeping the customer accounts and financial details. Updating Customer records and details, Filling of letter and courier the same. Entering all data of customer into the system. Providing management and support solutions properly. Coordinating the work activity between the workers of different divisions in the company Walk-in Date/ Time: 9th - 22nd September , 11 AM onwards Interview Venue: Credit Wise Capital Private Limited 602 Marathon Icon, Off Ganpatrao Kadam Marg, Lower Parel (West) Mumbai - 400 022.","location":"Mumbai","experience":"1 - 6 Years"},{"date":"14 - Sept - 2019","skills":"Technical Support, International Voice Process, Customer Service","qualification":"Diploma, B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"4th Floor, Cognizant ISH Office, Hinjewadi Phase 1, Pune","phone":"Not Provided","profile":"Technical Support (Voice Process) \nCognizant Technology Solutions India Limited","description":"We are looking for enthusiastic professionals for International Voice Process who possess flawless communication and expertise in Technical skills. If you have excellent customer handling skills, are tech-savvy, love learning and implementing new technology, with the passion to guide to customers, wed love to talk to you. Education: Any Graduate (Under Graduates are also Eligible) Work Experience: 1 - 3 Years Job Location: Pune Mandatory Experience- Minimum 1 year experience in an International BPO. Experience in Voice/Semi Voice process. Expertise in Technical Skills. Desirable Experience- Experience in International Calling Experience in Technical Support domain Experience in Salesforce, CRM Excellent Customer handling skills Others- Understanding of Salesforce, CRM applications functionalities which can be used via Salesforce Exposure and experience in L1 Support Benefits: -Exposure to Sales force, Marketing Cloud - being one of the most sought after skills in the market. -High cost Sales force certifications to the employees credit after completion of training. -Providing Technical assistance for one of the largest cloud computing companies in the US. -Flexible and employee friendly environment. Mode of Interview: Face to Face Interview Date : 14th September 2019 (Thursday) Interview time : 11 AM - 1 PM Interview Location: 4th Floor, Cognizant ISH Office, Hinjewadi Phase 1, Pune Point of Contact: Jash (HR) Note : Under Graduates can also apply Candidates with excellent communication are only applicable for this process Candidate must have completed Min 10+2 Years Education Only candidates interested to work in International Voice Process and willing to work in night shifts are eligible for this process Referrals are invited Candidates who have recently taken up interview at Cognizant are not eligible.","location":"Pune","experience":"1 - 3 Years"},{"date":"12, 13, 14 - Sept - 2019","skills":"Technical Support, Voice Process, Customer Support","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Aegis Customer Support Services Pvt. Limited, 41, Old Lakshmi Theatre Building, Essar House, St Johns Road, Bangalore - 560 042","phone":"6361275363","profile":"Technical Support Executive \nAegis Customer Support Services Pvt. Limited","description":"Great opportunity to work with Aegis as a Technical Support Executive Eligibility Criteria:- 1. Good Communication Skills in English & Hindi 2. Dayshift for Female and Male 4. Salary upto 17k CTC.PM 5. Qualification Diploma OR Degree + 6 m Experience into any domain 6. Work location Shivajinagar Interested candidates are requested to come for a direct walk-in interview along with your updated resume from 11th - 14th September (between 10 AM to 5 PM) at our office address mentioned below; Aegis Customer Support Services Pvt. Limited 41, Old Lakshmi Theatre Building, Essar House, St Johns Road, Bangalore - 560 042 Contact Person: Bala -6361275363","location":"Bangalore","experience":"0 - 5 Years"},{"date":"12, 13, 14, 16, 17, 18, 19, 20 - Sept - 2019","skills":"Technical Support, International Voice Process, Customer Service","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Tech Mahindra Limited, Rajiv Gandhi Chandigarh Technology Park, Plot No. 23, Phase 2, Kishangarh, Chandigarh, 160101.","phone":"Not Mentioned","profile":"Technical Support Associate \nTech Mahindra Limited","description":"Tech Mahindra Limited is Hiring for Technical Support Associate (International Process) Eligibility Criteria: BE/ B.Tech (CSE, IT & ECE), BSc-IT, BCA & MCA graduates only can apply Fresher & Experience up to 24 Months can apply Quick learner & Team player Willing to work in rotational shifts & night shifts Confident and self-motivated with positive attitude Skills Required: Good knowledge in UNIX & SQL Good verbal / written communication skills Basic computer knowledge. Walk-in Date/ Time: 10th - 30th September , 10 AM onwards Interview Venue: Tech Mahindra Limited Rajiv Gandhi Chandigarh Technology Park, Plot No. 23, Phase 2, Kishangarh, Chandigarh - 160 101 Kindly mention GUNDEEP- INTERNATIONAL on the resume. Contact Person: GUNDEEP KAUR","location":"Chandigarh","experience":"0 - 2 Years"},{"date":"12, 13, 14 - Sept - 2019","skills":"Technical Support, Third Party","qualification":"B.E./B.Tech, Diploma","address":"Sony India Private Limited, A-18, Near Sarita Vihar Metro Station, Mohan Co-operative Estate, Mathura Road, New Delhi","phone":"Not Provided","profile":"Technical Support Executive \nSony India Private Limited","description":"We are urgently looking for B.Tech/ BE/ Diploma holder for Technical Support executive Position in our organisation (Third Party Payroll) at New Delhi Office. Will be responsible for attending calls of the customer for Technical Support To manage escalated customers Trouble shooting over phone Punching the calls in software Walk-in Date: 12th - 14th September 2019 Time: 10.00 am to 12.00 pm Interview Venue: Sony India Private Limited, A-18, Near Sarita Vihar Metro Station, Mohan Co-operative Estate, Mathura Road, New Delhi","location":"Delhi","experience":"0 - 1 Years"},{"date":"12, 13 - Sept - 2019","skills":"Technical Support, IT Helpdesk/ Service Desk, Customer Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"HCL Technologies Limited, A-22, Sector 60, Noida","phone":"9971777986","profile":"Product Support Engineer \nHCL Technologies Limited","description":"HCL is hiring for Hardware Support Engineers with good technical knowledge and command over spoken English language. The client is a prestigious US based Healthcare Equipment Manufacturer organization. Educational Qualification: Any Technical Graduate Experience: 1-year experience in hardware troubleshooting, calling experience is preferable. Job Location: Noida Salary: Upto 4.77 LPA (** Basis last CTC drawn) Working days: 5 days, 2 days off (Rotational) Shifts: US Shift Job Responsibility: #Analyse and resolve moderately complex Hardware / application problems faced by clients in Timely manner #Assist in identification, validation, review and approval of customer support procedures #Documents problem and resolution accurately #Escalates or hands-off issues to other areas appropriately #Follows established Procedures and process in resolving the issues #provides support to customers via Phone or E-mail #Correctly identifying case categorization and severity definition #Collection of relevant customer information #Initial understanding of the incident upon call receipt #Resolving issues based on information available Eligibility Criteria #Only Technical graduates or post graduates can apply. #Minimum of 01-year experience in hardware troubleshooting is mandatory. #excellent spoken English skills are compulsory!! #Must be comfortable working in US shifts (Night Shifts). Please come down for a face to face Interview. Please write HR Chander Mohan on top of your resume for gate entry Interview Dates - 12th & 13th September 2019 Timings: 11:00 am to 6 pm Interview Venue: HCL Technologies Limited, A-22, Sector 60, Noida Contact Person: Chander Mohan Contact No: 9971777986 , chander.mohan@hcl.com Kindly carry: A copy of your updated resume A govt Address/ Id Proof","location":"Noida","experience":"1 - 6 Years"},{"date":"10, 11, 12, 13 - Sept - 2019","skills":"Java, J2EE, Struts/ Spring","qualification":"B.E./B.Tech, MCA/PGDCA","address":"CNSI, 709, 7th Floor, Phase II SPENCER PLAZA, Anna Salai Channai","phone":"044-43937500","profile":"Software Engineer -Java \nCNSI","description":"Looking for Software Engineer -Java ( Immediate joining preferable) No. of Openings: 20 Experience in Java, J2EE, Struts/ Spring Hands on in writing code Excellent oral & written communication skills, Good problem-solving & analytical skills Must be an excellent team player. Walk-in Date : 10th to 13th Sep 2019 Time : 10 AM to 5 PM Interview Venue: CNSI 709, 7th Floor, Phase II SPENCER PLAZA, Anna Salai Channai","location":"Chennai","experience":"2 - 3 Years"},{"date":"11 - Sept - 2019","skills":"Java, Core Java, Spring, Hibernate and UI","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Maxima IT Consulting India Pvt. Limited, G2/3 Sigma House Senapati Bapat Road, Pune, Maharashtra - 411 016","phone":"020-41463471","profile":"Java Developers \nMaxima IT Consulting India Pvt. Limited","description":"Candidate should have good experience on Java, Core Java, Spring, Hibernate and UI Must have excellent communication skills Immediate Joiner preferred. Walk-in Date/ Time: 11th September 2019, 1 PM onwards Interview Venue- Maxima IT Consulting India Pvt. Limited G2/3 Sigma House Senapati Bapat Road, Pune, Maharashtra - 411 016 Tel: 020-41463471 (Office) 8208806551 (MO) Interested candidates has to call an take an Interview email before coming. Please send your resume on gborase@maximaconsulting.com","location":"Pune","experience":"1 - 2 Years"},{"date":"10, 11, 12, 13, 14 - Sept - 2019","skills":"C# .Net and Java/ Android Programming","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Elico Limited, B-90, C-56, A.P.I.E, Gate No. 6, Sanathnagar, Hyderabad - 18","phone":"040-44451244","profile":"Software Engineer (C# .Net and Java) \nXL Dynamics India Private Limited","description":"Role: Software Engineer/ Developer. Qualification: B.Tech (ECE or C.Sc) / MCA or Equivalent. Work Experience: 2 to 5 Years Roles and Responsibilities: Software Coding. Involve in Application Architecture Designing, Documenting the Project Implementation. Adhere to Specified s/w Development practices. External Client Project and Communications. Maintain the project delivery schedules. Required Skills: C# .Net and Java/ Android Programming. Must have a strong experience in at least one set of the above mentioned fields. Experience in Communication programming (Serial, Network Programming) Development of image processing Algorithms. Knowledge in Web Application Development. Knowledge in Cloud Computing is an advantage. Knowledge in AI and ML is an advantage. Strong analytical, communication and problem solving skills. Should be able to work independently. Should be proactive & possess good interpersonal skills. Ability to work in fast paced environment and be self-driven with strong commitment to work. Note: Candidate should have at least 2 years of work experience in real time projects. At least 6 months of experience in the real time project with an external client. Should have knowledge about Project Management and Version control Software. And Good Communication Skills. Interested candidates, Please walk-in directly with your resume at below mentioned address (Excluding Sunday) or send your Updated resume to prasannam@elicohcs.com Elico Limited B-90, C-56, A.P.I.E, Gate No. 6, Sanathnagar, Hyderabad - 18 Land Mark: Near Bharathanagar MMTS & Metro Rlwy Stations Contact Person: Prasanna. Contact Number: 040-44451244/ 8978447766","location":"Hyderabad","experience":"2 - 5 Years"},{"date":"14 - Sept - 2019","skills":"Java, J2Ee, Postrgre, Spring Boot","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Hinduja Tech Limited, SKCL Triton Squaer Unit C3 to C7, TVK industrial Estate, Guindy, Chennai - 600 032","phone":"Not Provided","profile":"Java Developer \nHinduja Tech Limited","description":"Primary Skill Group (used for reporting purpose): JAVA/ J2EE Primary Skill1 : J2EE Other Skill1 : Primary Skill2 : Others Other Skill2 : Springboot Primary Skill3 : Others Other Skill3 : PostrgreSQL Secondary Skills : Angular 4 Work Experience: 4 to 6 Years Walk-in Date/ Time: 14th September from 9 AM onwards Interview Venue: Hinduja Tech Limited SKCL Triton Squaer Unit C3 to C7, TVK industrial Estate, Guindy, Chennai - 600 032","location":"Chennai","experience":"4 - 6 Years"},{"date":"14 - Sept - 2019","skills":"Java Spring JSP, Spring Core, MVC, Hibernate, JQuery, SQL, PLSQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Nucleus Software Exports Limited, A-39, Sector-62, Noida (Opposite Noida Electronic City Metro Station)","phone":"0120-2403970","profile":"Core Java Developer \nNucleus Software Exports Limited","description":"We are inviting applicants for our product development team in Java Spring Hibernate Hands on experience in Core Java [Threading, Collections, Exception handling JSP, Spring Core, MVC, Hibernate, JQuery Basic knowledge of SQL, PLSQL Writing and maintaining unit test cases Technical architecture Log Analysis, L1/ L2 Custom layer development Role/ Responsbility- Developing Custom layer code based on solution designed following standard coding practice Needs to adhere to committed delivery timelines Sharing status update to supervisors on time Needs to interact with customer for issue analysis & resolution related to Product & Interfaces developed Issue/log analysis and fixing- Innovate and create re-usable component Walk-in Date 14th September 2019 - Saturday Timings - 9.30 am to 2 pm Venue Details- Nucleus Software Exports Limited A-39, Sector-62, Noida (Opposite Noida Electronic City Metro Station) Interested candidates may send their applications to karan.setia@nucleussoftware.com with below details to check the fitment at glance Total Experience- Current CTC- Expected CTC- Notice Period- Note: Please carry a hard copy of your updated resume.","location":"Noida","experience":"3 - 6 Years"},{"date":"12 - Sept - 2019","skills":"Core Java, J2EE, Any framework, HTML, JavaScript, and Jquery","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Eastern Software Systems Pvt. Limited, B-65 Sector 63 Noida - 201 307","phone":"7303555266","profile":"JAVA Developer \nEastern Software Systems Pvt. Limited","description":"Candidate should have 6 months to 2 years of strong hands-on experience with Core Java, J2EE. Experience in any framework, HTML, JavaScript, and Jquery. Working knowledge of MVC, Object Oriented Analysis /Object Oriented Design methodologies. Excellent Debugging / Troubleshooting skills Strong Aptitude and logic is a must. Good Communication Skills. Design, code and debug web applications, create robust high-volume production applications, and develop prototypes quickly. Walk-in Date/ Time: 12th September , 9 AM onwards Interview Venue: Eastern Software Systems Pvt. Limited B-65 Sector 63 Noida - 201 307","location":"Noida","experience":"0 - 2 Years"},{"date":"14 - Sept - 2019","skills":"Java, Node, Go, Python, MySQL, Oracle, PostgreSQL, SQL Server, NoSQL, etc","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Ideas2IT Technologies Private Limited, Plat no 33A, RR Towers-V, 8th floor, Lazer St, Thiru Vi Ka Industrial Estate, Guindy, Chennai, Tamil Nadu - 600 032","phone":"Not Provided","profile":"Java Professionals \nIdeas2IT Technologies Private Limited","description":"Candidate should have 3 to 8 years of strong backend development experience in one of the server-side languages: Java, Node, Go, Python. Familiarity with few databases, like MySQL, Oracle, PostgreSQL, SQL Server, NoSQL, etc. Ability to write high-quality code with test automation A technical mindset with great attention to detail Senior developers (4+ years) are expected to be the Architect for relatively smaller enterprise level projects and for larger projects, you will be closely working with the fellow architects to come up with the architecture and take it further. Walk-in Date: 14th September 2019 Time 11 AM to 3 PM Interview Venue: Ideas2IT Technologies Private Limited Plat no 33A, RR Towers-V, 8th floor, Lazer St, Thiru Vi Ka Industrial Estate, Guindy, Chennai, Tamil Nadu - 600 032 If interested, please share your profile to karthick@ideas2it.com to proceed further","location":"Chennai","experience":"3 - 8 Years"},{"date":"10, 11, 12, 13, 14, 16, 17 - Sept - 2019","skills":"Java and J2EE frameworks, Spring boot, Data Structure","qualification":"B.E./B.Tech, MCA/PGDCA","address":"E2 Software India Private Limited, 22/1, Madeeha Square, 2nd Floor, Coles Road, Frazer Town, Bengaluru, Karnataka - 560 005.","phone":"Not Provided","profile":"Java Developers \nE2 Software India Private Limited","description":"Person must have strong fundamentals in Java and J2EE frameworks. Spring Framework overall with Spring boot strong experience. Strong problem solving and data structure skills. Strong database knowledge Experience in REST and Micro Service development Experience in Web services and hibernate. Good written and oral communication skills. Walk-in Date/ Time: 10th - 17th September , 11 AM onwards Interview Venue: E2 Software India Private Limited 22/1, Madeeha Square, 2nd Floor, Coles Road, Frazer Town, Bengaluru, Karnataka - 560 005.","location":"Bangalore","experience":"3 - 5 Years"},{"date":"11, 12 - Sept - 2019","skills":"Core Java, Spring, Java/ J2EE and related technologies","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Johnson Controls India Private Limited, C 601, 6th Floor, RMZ Centennial, Kundalahalli Main Road, Whitefield Bangalore, Karnataka - 560 048","phone":"080-40527009","profile":"Software Engineer (Java) \nJohnson Controls India Private Limited","description":"Candidate should have 2 to 3 years of industry and relevant experience Excellent knowledge of Core Java and Spring Candidate should have working knowledge on web services Should be efficient with Java J2EE and related technologies. Should have worked in distributed agile model and continuous integration Should have knowledge on designing and implementation of REST Web services Strong experience with REST API and web services Strong RESTFUL web service experience Strong SQL (preferably Oracle), JQuery, HTML/CSS, Oracle Restful, SOAP web services Walk-in Date/ Time: 11th - 12th September , 10 AM onwards Interview Venue: Johnson Controls India Private Limited C 601, 6th Floor, RMZ Centennial, Kundalahalli Main Road, Whitefield Bangalore, Karnataka - 560 048 PoC - Abhijit","location":"Bangalore","experience":"2 - 3 Years"},{"date":"11, 12, 13, 14 - Sept - 2019","skills":"Core PHP, OOP. HTML, CSS, Javascript, jQuery,, MySQL","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"BaffleSol Technologies Private Limited, Tower A, Spaze iTech Park, 307, Sohna - Gurgaon Road, Sector 49, Gurugram, Haryana - 122 018","phone":"8958937343","profile":"PHP Developer \nBaffleSol Technologies Private Limited","description":"Server side Programming - Core PHP, Object oriented programming using PHP (Preferred if they have). Client Side Programming - HTML, CSS, Javascript, jQuery, Database design and development, MySQL Platforms: CakePHP, Wordpress, Codelgniter, Json Walk-in Date/ Time: 11th - 14th September , 10 AM onwards Interview Venue: BaffleSol Technologies Private Limited Tower A, Spaze iTech Park, 307, Sohna - Gurgaon Road, Sector 49, Gurugram, Haryana - 122 018","location":"Gurgaon","experience":"2 - 5 Years"},{"date":"13, 14 - Sept - 2019","skills":"Java, HTML5, CSS, JavaScript, Web Sockets, AJAX, JSON and XML","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Trident Hotel, Bhubaneswar, CB-1 - Jayadebvihar Nayapalli - 751 013","phone":"674 230 1010","profile":"Java Developers \nBroadridge Financial Solutions (India) Pvt. Limited","description":"Broadridge Financial Solutions (India) is hiring for Java Developers at Bhubaneshwar Job Location: Bangalore Required Skills/ Knowledge/ Experience: Candidate must have 3 to 10 years of strong Java programming experience Strong HTML5, CSS, JavaScript, Web Sockets, AJAX, JSON and XML skills. Hands On - J2EE, Struts 1.x, 2.x, Spring IOC, JDBC. Hands On - PL/SQL Oracle Knowledge of Jersey, Jetty, ORM, Groovy would be an advantage Experience using NodeJS would be an advantage Experience using JavaScript modules and frameworks such as JQuery, ExtJS would be an advantage Exposure to backend programming and understanding of interaction with databases (NoSql and SQL) and socket communication would be an advantage Working knowledge of various tools (Git, Maven/Gradle, Grunt, Jenkins, Docker) Other - C/ C++ Strong verbal and written communication skills. Ability to work in a rapidly changing environment and work under pressure Domain experience in capital markets either in trading or clearing preferred Some basic understanding of securities and how trading and settlement works Walk-in Dates : 13th and 14th September, 2019 Time : 10:00 AM to 5:00 PM Walk-In Venue: Trident Hotel, Bhubaneswar CB-1 - Jayadebvihar Nayapalli - 751 013 Tel. +91 674 230 1010 POC @ the Venue : Manish Jagirdar - HR Kindly Note: Please Mention Source as 'Direct Sourcing' on top of your Resume Please carry updated profile, PP Pic and any address ID proof at the venue","location":"Bhubaneshwar","experience":"3 - 10 Years"},{"date":"11, 12, 13, 14, 16, 17, 18, 19, 20 - Sept - 2019","skills":"PHP, MySQL, Ajax, and JavaScript, Web Services","qualification":"B.E./B.Tech, MCA/PGDCA","address":"RAA/5, Raghunathpur, Beside Spandan Hospital, Tegharia, Kolkata - 700 059","phone":"8001014089","profile":"PHP Developer \nApp ExpertIn","description":"HP Developer is responsible for creating and implementing an array of Web-based products using PHP, MySQL, Ajax, and JavaScript. You develop back-end components, connect the application with other Web Services. Walk-in Date/ Time: 10th - 30th September , 11 AM onwards Interview Venue: RAA/5, Raghunathpur, Beside Spandan Hospital, Tegharia, Kolkata - 700 059 Bus Stop : Teghoria Landmark : Spandan Hospital","location":"Kolkata","experience":"1 - 6 Years"},{"date":"11, 12 - Sept - 2019","skills":"PHP and Angular 2/4/5/6/7 & Bootstrap 3/ 4, JavaScript","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Matrimony.Com Limited, Arihant ePark, Lattice Bridge Road, 2nd Floor, Baktavatsalm Nagar, Adyar, Chennai - 600 020","phone":"Not Specified","profile":"PHP/ Angular JS Developer \nMatrimony.Com Limited","description":"Candidate should have experience in working PHP and Angular 2/4/5/6/7 & Bootstrap 3 / 4 Must have strong knowledge of JavaScript Node JS experience is an added advantage Very good knowledge of HTML and CSS Experience with git Comfortable working across the full stack from development to deployment Knowledge of NPM Knowledge of gulp/ grunt Knowledge of Agile React or any JS framework is an advantage Server-side knowledge is an advantage Walk-in Date: 11th - 12th September 2019 Time: 11:00 AM to 4:00 PM Interview Venue: Matrimony.Com Limited Arihant ePark, Lattice Bridge Road, 2nd Floor, Baktavatsalm Nagar, Adyar, Chennai - 600 020 Landmark: Opposite to Adyar Anantha Bhavan Contact Person: Gracy L Note: Only candidates who are available Immediate to 1 Month Notice will be considered","location":"Chennai","experience":"3 - 5 Years"},{"date":"14 - Sept - 2019","skills":"Laravel, Php, Architect Solution, Zend Framework, Codeigniter Framework","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Innofied Solution Private Limited, AMP Vaisaakkhi, 603, AG-112, Sector 2, Salt Lake City, Kolkata - 700 091,","phone":"8017105232","profile":"PHP/ Laravel Developer \nInnofied Solution Private Limited","description":"Innofied is looking for PHP Laravel Developer | Sr. Developer and Architect Position. Candidate should be BE/ B.Tech or MCA with 4 to 9 years of experience in Laravel, Php, Architect Solution, Zend Framework, Codeigniter Framework. Registration form will be available till 13th September, 5 PM Walk-in date 14th September Time 11 am - 1 pm Registration is must at bit.ly/Innofied-walk-in-php Interview Venue: Innofied Solution Private Limited AMP Vaisaakkhi, 603, AG-112, Sector 2, Salt Lake City, Kolkata - 700 091,","location":"Kolkata","experience":"4 - 9 Years"},{"date":"11, 12, 13, 14 - Sept - 2019","skills":"HTML, CSS, JavaScript and related web designing technologies, AJex, Boostrap with PHP, Word Pres","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Eaton Power, 1st Floor, Sawant Park Above Vodafone Store, Pune Satara Road, Chaitanya Nagar, Near Canara Bank, Dhankawadi, Pune - 411 043","phone":"07058563193","profile":"Web/ PHP Developer \nEaton Power","description":"Proficiency in HTML, CSS, JavaScript and related web designing technologies, AJex, Boostrap with PHP, Word Press, Digital Marketing Knowledge. Should have experience in Website layout in Photoshop, PSD to HTML conversion, SEO friendly Responsive layout Walk-in Date/ Time: 9th - 14th September , 10 AM onwards Interview Venue: Eaton Power 1st Floor, Sawant Park Above Vodafone Store, Pune Satara Road, Chaitanya Nagar, Near Canara Bank, Dhankawadi, Pune - 411 043 Phone No. 07058563193","location":"Pune","experience":"0 - 5 Years"},{"date":"10, 11, 12, 13, 14, 16, 17, 18, 19, 20 - Sept - 2019","skills":"Core PHP, Frameworks like (CI, Laravel), Ajax, XML, MySql","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Ergode IT Services Private Limited, Unit No.43, 1st Floor, Jamanadas Industrial Estate, Dr. RP Road, Mulund (West), Mumbai","phone":"7208015045","profile":"PHP Developers \nErgode IT Services Private Limited","description":"Candidate should have 1+ years of experience in Core PHP Development, Frameworks like (CI, Laravel) Should have experience with Ajax, XML, MySql or other Databases Experience Open cart, Shopify, Magneto, Drupal, Joomla would be an advantage Walk-in Date/ Time: 10th - 20th September , 11 AM onwards Interview Venue: Ergode IT Services Private Limited Unit No.43, 1st Floor, Jamanadas Industrial Estate, Dr. RP Road, Mulund (West), Mumbai","location":"Mumbai","experience":"1 - 3 Years"},{"date":"10, 11, 12, 13, 14, 16, 17, 18, 19, 20 - Sept - 2019","skills":"PHP, MySQL, HTML, JQuery, JS and CSS","qualification":"B.E./B.Tech, MCA/PGDCA","address":"IndiaFilings Private Limited, Belthel, Plot. No.1, Dhanalakshmi Nagar, Alapakam, Chengalpattu,","phone":"7338725976","profile":"Php Developers \nVerve Financial Services Private Lmited","description":"Candidate must have a strong knowledge of PHP, MySQL, HTML, JQuery, JS and CSS. Should have experience working on OOPS Concept, API, Web Services. Our PHP developers are responsible for developing and maintaining web apps that power thousands of business. Walk-in Date/ Time: 10th - 30th September , 9 AM onwards Interview Venue: IndiaFilings Private Limited, Belthel, Plot. No.1, Dhanalakshmi Nagar, Alapakam, Chengalpattu, Contact Person: Pavithra - 7338725976","location":"Others","experience":"0 - 5 Years"},{"date":"10, 11, 12, 13 - Sept - 2019","skills":"Java, Spring boot, Hibernate, MySQL, PostgreSQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Enstrapp IT Solutions Private Limited, #1556/57, 2nd Floor, Sector 1, HSR Layout, Bangalore - 560 102","phone":"Not Provided","profile":"Java Full Stack Developer \nEnstrapp IT Solutions Private Limited","description":"Person must have 2+ years of experince in Java, Spring boot, Hibernate, MySQL, PostgreSQL HTML5, Boostrap, CSS, JavaScript, Angular JS (1.x) and Gulp Job Location : Bangalore (HSR Layout) Interested candidates can walk-in to our office from 10th - 13th September '2019 at the below mentioned Venue between 10.00 Am - 4.30 Pm Enstrapp IT Solutions Private Limited #1556/57, 2nd Floor, Sector 1, HSR Layout, Bangalore - 560 102 Landmark: Opposite to Indian Oil Petrol Bunk or Next to Hotel Nandas Contact Person : Smithy.M","location":"Bangalore","experience":"2 - 4 Years"},{"date":"11, 12, 13, 14 - Sept - 2019","skills":"Php, MySQL, CSS, OOPS, HTML, Java Script, Jquery","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Novalnet e-Solutions Private Limited, 131 Erikarai Street, East Tambaram, Chennai - 600 059","phone":"7708222259","profile":"PHP Developer/ Trainee \nNovalnet e-Solutions Private Limited","description":"Candiddate should be BE/ B.Tech/ BCA/ M.Tech/ MCA or MSc (Computers) with good knowledge of Php, MySQL, CSS, OOPS, HTML, Java Script, Jquery. A strong ability to understand the project requirements & Execute project plans. Creating & modifying the custom themes and plugin (payment plugin) for e-commerce shop system. Design, develop, maintain, analyse and troubleshoot the plugin & themes. Walk-in Date/ Time: 10th - 14th September , 11 AM onwards Interview Venue: Novalnet e-Solutions Private Limited 131 Erikarai Street, East Tambaram, Chennai - 600 059","location":"Chennai","experience":"0 - 1 Years"},{"date":"14 - Sept - 2019","skills":"Java/ J2EE (Core java, Struts, Hibernate & Spring Framework)","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"TOMIA (Formerly Starhome Mach) #49, Ground Floor, Shilpa Vidya, 1st Main Road, Sarakki Industrial Layout, 3rd Phase, JP Nagar, Bengaluru, Karnataka - 560 078","phone":"080-66909490","profile":"Senior JAVA Developer \nTOMIA (Formerly Starhome Mach)","description":"Candidate should have Any Engineering degree (BE/ B.Tech/ ME/ M.Tech), preferably in Computer Science Or Computer Application degree (MCA) with 5+ years of experience in Java/ J2EE development, creating application in Telecom OSS/BSS domains. Technical Skills: Java/ J2EE (Core Java, Struts, Hibernate & Spring Framework) Advanced level Angular Intermediary level Oracle, others RDBMS Concepts Intermediary level UNIX Intermediary level Performance Tuning Intermediary level Agile Methodologies Intermediary level Worked on Telecommunication OSS/ BSS platforms Prior experience in Roaming domain would be preferred Subversion, CVS Intermediary level. Walk-in Date/ Time: 14th September 2019, 10 AM onwards Interview Venue: TOMIA (Formerly Starhome Mach) #49, Ground Floor, Shilpa Vidya, 1st Main Road, Sarakki Industrial Layout, 3rd Phase, JP Nagar, Bengaluru, Karnataka - 560 078","location":"Hyderabad","experience":"5 - 9 Years"},{"date":"9, 10, 11, 12, 13, 14 - Sept - 2019","skills":"General Administration, Housekeeping, Front Office","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Nittany Creative Services LLP, 141, Prakash Towers, 2nd Floor, OMR IT highway, Near IGP Bus stop, Chennai - 600 041.","phone":"9003238160","profile":"Admin Executive \nNittany Creative Services LLP","description":"Candidates with Decent communication can apply. Willing to Work in Rotational Night Shits Only Male Candidate EDUCATION QUALIFICATION: Any Degree (with arrear or Without arrear) SHIFTS: Rotational Shifts (Day/ Night), there will not be any static shifts. Shifts will be decided by the Team leads/ Managers Walk-in Date/ Time: 9th - 14th September , 10 AM onwards Interview Address: Nittany Creative Services LLP 141, Prakash Towers, 2nd Floor, OMR IT highway, Near IGP Bus stop, Chennai - 600 041. Contact Person: Vaidheeswaran HR Contact No: 9003238160 / 9176332863","location":"Chennai","experience":"0 - 1 Years"},{"date":"9, 10, 11, 12, 13 - Sept - 2019","skills":"C# .Net, ASP .Net, MVC 5.0, Web forms, Entity Framework, Java script, ADO .Net","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Selectsys India Private Limited, Plot-4, Road No. 45/A, Masthan Nagar, Jubilee Hills, Hyderabad - 500 033.","phone":"9849360114","profile":".Net Trained/ Developers \nSelectsys India Private Limited","description":"We are inviting Freshers/Experienced who are Certified /Trained in Dot Net Environment. Any Graduate/ B.Tech/ PG/ M.Tech/ MCA is eligible. Relevant Experience: Fresher to 2 years Skills :- C# .Net, ASP .Net, MVC 5.0, Web forms, Entity Framework, Java script, ADO .Net, JQuery, Web API, MS SQL Server. Job Requirements: Good in Verbal and Written Communication. Excellent Analytical, Presentation and Interpersonal skills. Walk-In Drive between Mon-Fri (11 am-4 pm) hours Interview Venue: Selectsys India Private Limited Plot-4, Road No. 45/A, Masthan Nagar, Jubilee Hills, Hyderabad - 500 033. LandMark: Near to Dr Ambedkar University / Hanuman Temple Point of Contact: - Pawan/ Bhargavi. Mobile:- 9849360114/ 7331149671. Email id:- hrsupport@selectsysamerica.com","location":"Hyderabad","experience":"0 - 2 Years"},{"date":"9, 10, 11, 12, 13, 14 - Sept - 2019","skills":"ASP .Net, MVC, CSS, Web API, Web / WCF Services","qualification":"B.E./B.Tech, MCA/PGDCA","address":"iMarque Solutions Private Limited, No. 9-10, 1st Floor, Theyagaraya Road, T. Nagar, Chennai, Tamilnadu - 600 017","phone":"9087884463","profile":"Software Developer (.Net) \niMarque Solutions Private Limited","description":"Candidate must have 1 to 4 years of experience as .Net Developer with SQL Server Maintaining Internal application & solving Bugs during testing. Must have exposure in Software Development with System Integrity. Should be flexible with strong knowledge in programming languages. Job Responsbility- Planning, developing, testing and implementing the Software. Handling and maintaining the current software and improvising. Working on par with information security managements in software development field. Immediate Joiners Preferred. Walk-in Date/ Time: 9th - 14th September , 10 AM onwards Interview Venue: iMarque Solutions Private Limited, No. 9-10, 1st floor, Theyagaraya Road, T. Nagar, Chennai - 17. (Opposite to Globus, Above Idea Showroom) Contact YAMUNA -9087884463","location":"Chennai","experience":"1 - 4 Years"},{"date":"9, 10, 11 - Sept - 2019","skills":"ASP .Net, C# .Net, SQL Server, OOPS Concepts and Data Structures","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Binary Semantics Limited, 15, Sector 18, Electronics City Gurgaon, Haryana","phone":"9911205666","profile":".Net Developer/ Trainee \nBinary Semantics Limited (BSL)","description":"Candidate must have done some project or training or internship on dot net skills. Education: MCA/ B.Tech (CS/ IT) Technical Skills: ASP .Net, C# .Net, SQL Server Good with OOPS Concepts and Data Structures Excellent Communication Skills Good Analytical Skills Bond of Service Agreement of 2 yrs No of Position: 3 (Dot Net Trainee) Shift Timing: General Shift Job Location: Gurgaon Walk-in Date/ Time: 9th - 11th September , 10 AM onwards Interview Venue: Binary Semantics Limited, 15, Sector 18, Electronics City Gurgaon, Haryana Please go through the above job details and reply back with your updated resume at nirav.soni@binarysemantics.com","location":"Gurgaon","experience":"0 - 1 Years"},{"date":"9, 10, 11 - Sept - 2019","skills":"ASP .Net, MVC, Ajax, Javascript, Jquery, Web Application, Stored Procedures","qualification":"B.E./B.Tech, MCA/PGDCA","address":"SITEL India Private Limited, 5th Floor, B wing Boomerang Building, Chandivali, Andheri (East) Mumbai - 400072","phone":"8451957388","profile":".Net Developers \nSITEL India Private Limited","description":"Person should have good hands on experience with web application development utilizing ASP .Net, JavaScript, Ajax, XML, jQuery, etc. Design and develop complex systems with a high level of reliability and execution speed. Database development using Microsoft SQL Server and/or MySQL including table schemas, stored procedures, triggers, database jobs, etc. Mandatory Skills- Required 1 years of experience with the following: C#, SQL Server. Ability to perform programming, debugging, data analysis, system analysis, and quality assurance preferred Good understanding of the entire software development life cycle. Good communication Skills (Mandatory) Freshers can apply Walk-in Date: 11th September 2019 Interview timings 4 pm - 5 pm Venue Details- SITEL India Private Limited 5th Floor, B wing Boomerang Building, Chandivali, Andheri (East) Mumbai - 400072 Call or drop a text on 8451957388 for further queries Contact person - Jyoti","location":"Mumbai","experience":"1 - 2 Years"},{"date":"9, 10, 11, 12, 13, 14 - Sept - 2019","skills":"Front Office/ Front Desk Activities, Hospitality and Guest Relations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Jehangir Hospital, 32, Sasoon Road, Pune - 411001","phone":"020-66819921","profile":"Front Office Executive \nJehangir Hospital","description":"Candidate should be Any Garduate with 0 to 3 years of experience in Front Office/ Front Desk Activities, Hospitality and Guest Relations. Must have excellent communication skills Key Responsibilities- 1) Attending phone calls & giving appointments. 2) Preparing summaries & typing out reports. 3) Handling patient queries. 4) Accompanying the patient to various dept. for the tests. 5) Settling checks received by health check. 6) Maintaining important records & documentation as per departmental rules. Walk-in Date/ Time: 9th - 14th September , 10 AM onwards Interview Venue: Jehangir Hospital 32, Sasoon Road, Pune - 411001 Note: Kindly get your updated CV/Bio-data along with a passport size photograph","location":"Pune","experience":"0 - 3 Years"},{"date":"9 - Sept - 2019","skills":"C#, VB .NET, ASP .NET with Framework 4.0","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Tai Infotech Private Limited, Building No. 149 4th floor Sector 44 Gurgaon. Next to Luminous Building Near Punjab and Sindh bank, HUDA Metro","phone":"9599555476","profile":"Backend Process Executive \nHCL Technologies Limited","description":"Educational Requirement: BBA, BA, B Com, B.SC Graduates (Only 2015/2016/2017/2018 Pass-outs are eligible for this opening). CS can also apply for the same. Note: Technical graduates / Regular MBA's are not eligible for this opening. Shifts : 24*7 (Rotational) Salary: Upto 2.50 LPA Job Location: Gurgaon Work Experience: Freshers / Maximum 6 months experience Roles and Responsibilities:- *Manage and update Insurance Member and Plan data on multiple systems. *Enter new member data into excel and enrolment forms. *Processes customer requests in a timely and accurate manner. *Communicates with customers through written correspondence. *Using PC application and functions such as Excel and Word to update and load data sets. *To answer queries coming from end user customers in a polite and professional manner. Skill Set Required:- *Good typing speed (25 wpm with 80% Accuracy). *Strong commitment to customer service and quality *Excellent Keyboard Skills *Demonstrates a strong customer service orientation. *Takes responsibility to follow up with customers to ensure their needs and expectations are satisfied. Please come down for a face to face Interview Please write HR Yogendra 9599555476 on the top of your resume for entry Interview Date: 9th September 2019 (Monday) Timings - 11 AM to 4 PM Venue:- Tai Infotech Private Limited Building No. 149 4th floor Sector 44 Gurgaon Next to Luminous Building Near Punjab and Sindh bank Near to HUDA Metro Please Be in Formals For the interview. Need to Carry: Updated CV, All education certificates (Original & Xerox copy) & Govt address / ID proof.","location":"Gurgaon","experience":"0 - 1 Years"},{"date":"9, 10, 11, 12, 13, 14, 16, 17, 18, 19, 20, 21 - Sept - 2019","skills":"C#, SQL, .NET ASP .NET","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Chamunda Tech Net Services Private Limited, 401 L-Wing Tex Center, Near Naryan Plaza. Chandivali, Andheri (East) Mumbai","phone":"Not Specified","profile":"Software Developer (.Net) \nChamunda Tech Net Services Pvt. Limited","description":"Need fresher software developers for IT company Applicant should have good knolwdge of C#, SQL, .NET ASP.NET Job Location: Mumbai Salary: INR 80,000 - 3,00,000 PA. Capable candidates will be offered good salary package. Walk-in Date/ Time: 9th - 21st September , 9 AM onwards Interview Venue: Chamunda Tech Net Services Private Limited 401 L-Wing Tex Center, Near Naryan Plaza. Chandivali, Andheri (East) Mumbai","location":"Mumbai","experience":"0 - 2 Years"},{"date":"9, 10, 11, 12 - Sept - 2019","skills":"General Administration, Housekeeping, Office Management, Amcs Petty Cash","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Brain4ce Education Solutions (P) Limited, 3rd Floor, No. 38/4, Adjacent to Dell EMC2, Outer Ring Rd, Doddanekundi, Bengaluru, Karnataka - 560 048","phone":"9902826205","profile":"Administration Executive \nBrain4ce Education Solutions (P) Limited","description":"Candidate should be Any Graduate with 0 to 3 years of experience in General Administration, Housekeeping, Office Management, Amcs, Petty Cash, Travel Booking, Vendor Management and Facilities Management. Job Responsibilities: Managing entire admin & facilities at Edureka Maintaining budgets & petty cash Team & Vendor Management Creating internal processes and checklists for internal operations Managing housekeeping, security and office boys Ensure AMCs are managed as per SOP Responsible for managing IT infrastructure through vendor management Strategic initiatives as when required for facilities Ensure general upkeep & maintenance of the facility Liaison with different internal & external stakeholders Involved in travel booking as when required Any other ad hoc duties as when assigned by the superiors Walk-in Date/ Time: 9th - 12th September, 10 AM onwards Interview Venue: Brain4ce Education Solutions (P) Limited 3rd Floor, No. 38/4, Adjacent to Dell EMC2, Outer Ring Rd, Doddanekundi, Bengaluru, Karnataka - 560 048","location":"Bangalore","experience":"0 - 3 Years"},{"date":"9, 10, 11, 12, 13, 14, 16, 17, 18, 19, 20 - Sept - 2019","skills":"Back Office Operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Hexaware Technologies Limited, Q1, 1st floor, M/S Loma IT Park Developer Pvt Ltd, Opposite to MC Donalds, Ghansoli, Navi Mumbai - 400 701","phone":"Not Provided","profile":"Back Office Executive \nHexaware Technologies Limited","description":"Hiring Candidates from Science Streams: Education : H.S.C/ Graduates from Science only (No Bsc IT) Basic Requirement : Candidate should be willing to work in rotational shifts Excellent Communication Good Comprehensive skills Comfortable with UK-US shifts Technical Competencies: Typing speed 25 to 30 wpm with 90% accuracy Ability to multitask and effectively prioritize work Salary: - Good in the industry Benefits:- Working for Brand Name Pickup and Drop Facilities Available Subsidized Canteen Food Walk-in Date/ Time: 9th September - 20th September , 3 PM onwards Interview Venue: Hexaware Technologies Limited Q1, 1st floor, M/S Loma IT Park Developer Pvt Ltd, Opposite to MC Donalds, Ghansoli, Navi Mumbai - 400 701 Contact Person : HR Wasim M","location":"Mumbai","experience":"1 - 4 Years"},{"date":"23, 24, 25 - Sept - 2019","skills":"C++, C#, ASP .Net, OOPS, Javascript, Networking, CSS, HTML, Databases","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Enzigma Software Private Limited, 111/10/3, Opposite D-Mart, Baner Road, Baner, Pune","phone":"Not Provided","profile":".Net Trainee Engineer \nEnzigma Software Private Limited","description":"Technical Skills: C++, C#, ASP .Net, OOPS, Javascript, Networking, CSS, HTML, Databases, Web Services. Candidates have to be flexible in terms of technology as we are on the cloud platform and in the near future, if the projects require, they will have to switch to the cloud along with Dot Net. Excellent communication skills- Written and Verbal. Must be ready to work in any shift and sign a bond of 2.5 years. Walk-in Date/ Time: 23rd - 25th September , 9 AM onwards Interview Venue: Enzigma Software Private Limited 111/10/3, Opposite D-Mart, Baner Road, Baner, Pune Candidates who have applied in the past 3 months for any position in Enzigma will not be eligible to apply.","location":"Pune","experience":"0 - 2 Years"},{"date":"9, 10, 11, 12, 13 - Sept - 2019","skills":"Java, .Net, IOT","qualification":"B.E./B.Tech, MCA/PGDCA","address":"VDart Software Services Pvt. Limited, No. 37, Raja Colony, 1st Main Road, Collector Office Road, Trichy 1.","phone":"8870110485","profile":"Software Developer (Java/ .Net) \nVdart Software Services Private Limited","description":"Candidate should have good experience in any coding Language Experience in Java, .Net, IOT will be added advantage. Work Experience: 0 to 2 Years Job Location : Trichy Walk-in Interview from 9th - 13th September , 10 AM onwards Interview Venue: VDart Software Services Pvt. Limited, No. 37, Raja Colony, 1st Main Road, Collector Office Road, Trichy 1. Contact Person: Siva/ 8870110485 Interested candidates reach me @ 8870110485 / siva@vdartinc.com","location":"Trichy","experience":"0 - 2 Years"},{"date":"11, 12 - Sept - 2019","skills":"Core Java, Spring, Web Services, J2EE and related technologies.","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Johnson Controls India Private Limited, C 601, 6th Floor, RMZ Centennial, Kundalahalli Main Road, Whitefield Bangalore, Karnataka - 560 048","phone":"080-40527009","profile":"Software Engineer (Java) \nJohnson Controls India Private Limited","description":"Candidate should have 2 to 3 years of industry and relevant experience with excellent knowledge of Core Java and Spring. Should have working knowledge on web services. Efficient with Java J2EE and related technologies. Should have worked in distributed agile model and continuous integration Knowledge on designing and implementation of REST Web Services Strong experience with REST API and web services Strong RESTFUL web service experience Strong SQL (preferably Oracle), JQuery, HTML/CSS, Oracle Restful, SOAP web services Walk-in Date/ Time: 11th - 12th September , 10 AM onwards Interview Venue: Johnson Controls India Private Limited C 601, 6th Floor, RMZ Centennial, Kundalahalli Main Road, Whitefield Bangalore, Karnataka - 560 048 Contact Person- Abhijit","location":"Bangalore","experience":"2 - 3 Years"},{"date":"9, 10, 11, 12, 13 - Sept - 2019","skills":"Software Testing, Quality Assurance, Test Case Design, Test Execution and Defect Management","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Analec Infotech Private Limited, 6th Floor, Tower B, Park Centra NH-8 Sector 30, Gurgaon, Haryana","phone":"Not Provided","profile":"Software Testing Engineer \nANALEC Infotech Private Limited","description":"Candidate should have 0-2 years of experience in Software Testing and Quality Assurance with hands on experience in Agile methodology. Should be very strong in Manual Testing. Expertise in Test Case Design, Test Execution and Defect Management. Perform manual testing, the scope of which will encompass all functionality of services to as a prequel to Automation Ability to track and manage numerous parallel test activities Understanding of QA methodologies, life cycle and processes Leadership and initiative skills Good in Data Analysis, Data Validation, Data Cleansing, Data Verification Design and build the automated test suites/ cases for use in development and testing cycles (Desirable) Having financial domain (Investment Banking/ Capital Market) knowledge (Desirable) Walk-in Date/ Time: 9th - 13th September , 10 AM onwards Interview Venue: Analec Infotech Private Limited 6th Floor, Tower B, Park Centra NH-8 Sector 30, Gurgaon, Haryana","location":"Gurgaon","experience":"0 - 2 Years"},{"date":"10 - Sept - 2019","skills":"Manual Testing/ Database Testing, SQL Query write ups","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Wipro Limited, Olympia Tech Park -3rd Floor Altius Block, Guindy, Chennai - 600 032","phone":"044-43905000","profile":"Manual/ Database Testing Engineer \nWipro Limited","description":"Candidate should be B.Tech or MCA with 18 to 36 months work experience in Manual Testing/ Database Testing, SQL Query write ups. Should have experience in creating test plans, identifying test cases and perform test execution. Experience in benefits administration preferably in Health or Insurance sector. Must have excellent Communication Skills Shift Timings- 11.30 am to 9 pm Need immediate joiners or less than 15 days-30 days Interview Rounds- Logical evaluation + Tech manager round Walk in dates- 10th September 2019 Timing- 9 am Onwards Interview Venue- Wipro Limited, Olympia Tech Park -3rd Floor Altius Block, Guindy, Chennai - 600 032","location":"Chennai","experience":"1 - 3 Years"},{"date":"12, 13 - Sept - 2019","skills":"Manual Testing, Database Testing, SQL Server, QA, Web Technologies","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Sagarsoft (India) Limited, Plot No-111, 1st floor, Road No-10 Jubilee Hills, Hyderabad","phone":"9100814445","profile":"QA (Manual) Testing Engineer \nSagarsoft (India) Limited","description":"Candidate should have good experience on manual testing of Trading applications. Experience in Automation and Web API will be added advantage Capital Market/ Trading domain Experience is mandatory. Good on SQL Server and Database Testing. Strong communication skills. Knowledge on Linux basics is plus. Location: Hyderabad Notice Period: Immediate to 15 Days (Max 30 Days) Shift Timing: 3 PM to 12 AM Walk-in Date/ Time: 12th - 13th September , 2 PM onwards Interview Venue: Sagarsoft (India) Limited Plot No-111, 1st floor, Road No-10 Jubilee Hills, Hyderabad Note: Please carry a copy (In Mobile or Print-Out) of this posting for security clearance at the venue.","location":"Hyderabad","experience":"4 - 8 Years"},{"date":"10 - Sept - 2019","skills":"test engineering, Manual Testing, Selenium, Technology Solutions Testing","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"NOVAC Technology Solutions, Office No. 275 R. K. Mutt Road, Statesmen One Mylapore, Chennai - 600 004. (Landmark: Near to Bata Showroom/ Mylapore Railway Station)","phone":"Not Provided","profile":"Testing Trainee (Freshers) \nShriram Value Services Private Limited","description":"Novac Technology Solutions(Shriram Value Services) is currently hiring for Software Test Engineer Trainee. Candidate with 65% above in 10th, 12th, UG, PG are only eligible BE/ B Tech (CSE/ IT/ ECE/ EEE), MCA, MSc (CS) from 2018 & 2019 batch only BSc (CS), B.com & BCA from 2018 & 2019 batch only Work Experience: Fresher Good knowledge in Testing is preferred Age criteria Not more than 25 Years Selection Process : Aptitude Test Technical Round Walk-in Date: 10th September 2019 Timing:9.30 am to 3 pm Interview Venue: NOVAC Technology Solutions Office No. 275 R. K. Mutt Road, Statesmen One Mylapore, Chennai - 600 004. (Landmark: Near to Bata Showroom/ Mylapore Railway Station) Documents To Be Carried : Resume Passport Size Photo ID Proof If you have attended this interview process in last 6 months you won't be eligible.","location":"Chennai","experience":"0 - 1 Years"},{"date":"10, 11, 12, 13 - Sept - 2019","skills":"Test Scenarios, Software Testing, Manual Testing, Test Cases, Automation Testing","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"AQM Technologies Private Limited, 4th Floor, A-Wing, Raheja Plaza, LBS Road, Ghatkopar (West) Mumbai - 400 086","phone":"022-40508299","profile":"Software Tester - Freshers \nAQM Technologies Private Limited","description":"Candidate should have good understanding of Software Testing Should prepare Test scenarios and derive test cases Strong Programming skills in common languages like C++ or Core Java Should have basic SQL Database query knowledge Completion of Software Testing course is Mandatory. Should have good verbal & written communication skills. Should have the willingness to travel & work at various locations Walk-in Date/ Time: 10th to 13th September 2019, 10 AM onwards Interview Venue: AQM Technologies Private Limited 4th Floor, A-Wing, Raheja Plaza, LBS Road, Ghatkopar (West) Mumbai - 400 086","location":"Mumbai","experience":"0 - 1 Years"},{"date":"14 - Sept - 2019","skills":"Automation framework, Java, Web Servicess, White box Testing, Automation Testing, Agile SQL Server","qualification":"B.E./B.Tech","address":"BOLD Technology Systems Pvt. Limited, Aykon Tower, 4th Floor, Plot No. 4 Sector-135, Noida","phone":"Not Provided","profile":"Software Testing Engineer \nBold Technology Systems Private Limited","description":"Candidate should have good experience in White Box testing & Web Services Experience with one or more database technology- Relational (like SQL Server) and NoSQL Good working experience in security and performance testing & tools. Hands on coding in Java is a must Prior experience in platform based teams is preferable. Automation, API, web services, Java Job Responsibilities: Independently utilize innovative test methodologies to develop test plans/strategies for owned features. Create and enhance backend automation tests and test tools Ability to extend API automation framework Work efficiently in a multi-project agile environment Add to performance, security and scalability testing efforts Write specialized testing tools for use in testing our software platform Participate in design and code reviews Excellent debugging skills, measures and analyses code for quality. Walk-in Interview on 14th September from 9 AM onwards Interview Venue: BOLD Technology Systems Pvt. Limited Aykon Tower, 4th Floor, Plot No. 4 Sector-135, Noida","location":"Noida","experience":"1 - 5 Years"}]}