{"Walkins":[{"date":"14 - Feb - 2021","skills":"Email Process, Chat Process, Customer Support","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Tech Mahindra Limited, Delta 1, 2nd Floor, Giga Space, Vimanagar, Pune","phone":"9579167599","profile":" Backoffice Executive (Email Process) \nTech Mahindra Limited","description":"Qualification Required : Any Graduate / Age Criteria - 18 to 35 Max Experience Required : 1 Year BPO Experience (Email & Chat Process) Minimum 1 Year - Email / Chat Process Experience is Mandatory Shift: 8 Am to 8 Pm Rotational Shift ( One Week off-rotational) Salary: 180000-220000 LPA The primary responsibilities of a Customer Service specialist would be: Handling escalations and complex queries. Manage large amounts of emails & chats Answer calls professionally to provide information about products and services, take/ or obtain details of complaints. Identify and assess customers needs to achieve satisfaction Build sustainable relationships and trust with customer accounts through open and interactive communication Key skills required: Proven customer support experience or experience as a client service representative Excellent English communications skills Ability to listen and active problem solving skills Good interpersonal skills Ability to handle pressure Ability to multi-task, prioritize, and manage time effectively Walk-in Date/ Time: 14th February 2021, 9.30 AM - 5.30 PM Venue Details- Tech Mahindra Limited Delta 1, 2nd Floor, Giga Space, Vimanagar, Pune Interview Process- Telephonic/ Walk-in Work Location- Viman Nagar Giga Space IT Park Contact Person- Prachi -9579167599  ","location":"Pune","experience":"1-4Years"},{"date":"14 - Feb - 2021","skills":"Talent Acquisition/ Recruitment, Lateral Hiring, Volume Hiring, Bulk Hiring","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Visionary RCM Infotech (India) Private Limited, 4th Floor, Tidel Park, Elcot SEZ, Aerodrome Po., Coimbatore - 14","phone":"8939207603","profile":" Talent Acquisition Executive \nVisionary RCM Infotech (India) Private Limited","description":"Candidate must be a MBA Graduate with 3 to 5yrs of experience in bulk or volume hiring Candidate must have handled end to end recruitment process Candidate should have experience in Campus & Fresher Hiring Candidate should be strong in screening process Candidate with prior experience in Healthcare is preferable. Should know to implement recruitment strategies. Job Responsibilities- Assessing the hiring needs of the organization and developing job descriptions and specifications accordingly. Designing and implementing recruitment strategies such as events and social media campaigns. Sourcing talented candidates through a variety of means including events, advertising, and databases. Maintaining relationships with universities, student organizations, and recruitment networks. Screening resumes and scheduling interviews. Managing and conducting interviews with shortlisted candidates. Managing all administrative tasks such as updating recruitment databases, hiring profiles, and applicant documentation. Hosting and attending college career days and conferences. Walk-in Date/ Time: 14th February 2021 from 9.30 AM onwards Venue Details- Visionary RCM Infotech (India) Private Limited 4th Floor, Tidel Park, Elcot SEZ, Aerodrome Po., Coimbatore - 14 Contact Person- Lokesh HR -8939207603  ","location":"Coimbatore","experience":"3-5Years"},{"date":"10, 11, 12 - Feb - 2021","skills":"HR Generalist Activities, IT Recruitment, HR Operations/ Recruitment","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Computer Junction Private Limited, C-129, Naraina Industrial Area, Phase-1, New Delhi - 110 028 (India)","phone":"011-42333333","profile":" HR Executive \nComputer Junction Private Limited","description":"Candidate should be Any Graduate with at least 3 year experience in Recruitment by Naukri.com, LinkedIn, other Social sites, HR Generalist role, letter drafting, employees records filling. Must have good knowledge of MS-Excel with excellent communication skills. Job Responsibility- Recruitment through Naukri.com, other portal, references Screening, interview line-up of short-listed candidates Joining Documentation filling of employees Background Verification Letter drafting, employees data update HR Operations Wishes E-mailer Walk-in Date/ Time: 10th - 12th February 2021, 2.00 PM - 5.00 PM Venue Details- Computer Junction Private Limited C-129, Naraina Industrial Area, Phase-1, New Delhi - 110 028. Contact - Jeetu Chauhan (011-42333333)  ","location":"Delhi","experience":"3-5Years"},{"date":"10 - Feb - 2021","skills":"General Administration, Office Management, Conflict Resolution, Office Coordination","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"PVR Projects Limited, IIIrd Floor Sri Durga Chambers, Thakur Mansion Lane, Behind Khazana Jewellery, Somajiguda Circle, Punjagutta, Hyderabad - 500 082.","phone":"040-23348080","profile":" Administrative Assistant (Female) \nPVR Projects Limited","description":"Candidate should be Any Graduate with 2 to 3 years experience in General Administration, Office Management, Computer Operations, Conflict Resolution, Office Coordination and Facility Management. Should have excellent interpersonal & problem solving skills Walk-in Date/ Time: 10th February 2021, 11.00 AM - 5.30 PM Venue Details- PVR Projects Limited IIIrd Floor Sri Durga Chambers, Thakur Mansion Lane, Behind Khazana Jewellery, Somajiguda Circle, Punjagutta, Hyderabad - 500 082. Phone: 040-23348080/ 23418080  ","location":"Hyderabad","experience":"2-3Years"},{"date":"10 - Feb - 2021","skills":"General Administration, Office Management, Conflict Resolution, Office Coordination","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"The Mirador, 131 / B, Link Road, Chakala, Andheri East, Mumbai, Maharashtra - 400 099","phone":"Not Provided","profile":" Administration Executive \nSpice Healthcare Private Limited","description":"Educational Qualification: Any Graduate Work Experience: 1 - 4 years Required Skill Sets- Excellent Communication skills (English language) Excellent interpersonal and coordination skills Job Responsibilities- Keeping coordination with Head office and vendors for all requirements, supplies ,material management and bill verification for Laboratories. Keeping record of staff attendance and other admin related requirements of Labs. Handling small maintenance issues related to Lab facilities. Interested candidates may walk- in with their updated resume at the below mentioned interview and venue details: Walk-in Date: 10th February, 2021 Time: 10:00AM to 1:00 pm Venue: The Mirador 131 / B, Link Road, Chakala, Andheri East, Mumbai, Maharashtra - 400 099  ","location":"Mumbai","experience":"1-4Years"},{"date":"10 - Feb - 2021","skills":"Office Assistance, Office Administration, Front Office/ Receptionist Activities","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Kumar Prestige Point, 1st Floor, Office No. 11 A, 283, Shukrawar Peth, Opp. Chinchechi Talim, Near B, Pune","phone":"9667671155","profile":" Receptionist/ HR Admin Officer \nA S foundation - Leading CA's & Faculties Group","description":"Desired Candidate Profile Minimum 12th Pass/ Graduate Any Stream. Should Possess Good English, Hindi & Marathi Speaking Skills. Good organisational skills and attention to detail Exceptional multitasker Excellent communication skills Courteous, Strong customer service skills Roles and Responsibilities- Handling queries via phone, email and general correspondence Greeting all visitors, Transferring calls as necessary Possibly managing office supplies such as stationery, equipments etc Performing ad-hoc administration duties Maintaining office services as required (Admin Work) Receiving and dispatching deliveries Assisting with mail as required Taking and ensuring messages are passed to the appropriate staff member on a timely basis Assisting the HR team Perks and Benefits Monthly Sal Between 12k-15 K in Hand Plus Incentives. Freshers Can APPLY Ask For HR Manager Tehseen- 9667671155 Please Email Your Resumes at Tehseen@asfoundtation.co.in Mention Subject As HR Admin. Walk-in Date/ Time: 10th February 2021, 11.00 AM - 2.30 PM Venue Details- Kumar Prestige Point, 1st Floor, Office No. 11 A, 283, Shukrawar Peth, Opp. Chinchechi Talim, Near B, Pune, Maharashtra. Contact - HR Manager Tehseen (9667671155)  ","location":"Pune","experience":"0-1Years"},{"date":"10 - Feb - 2021","skills":"Customer Service, Voice Process, Customer Support","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Reliable Spaces Private Limited, Reliable Tech Park, 5th floor A-1 Wing, Lift No. 4/5 behind reliable plaza Airoli","phone":"8108298319","profile":" Customer Response Executive \nReliable Spaces Private Limited","description":"Job for Sales Experience and Linguist Fresher and any BPO Experienced Candidates. Candidates should know Good English and Hindi. Shift timing 9.30 am to 6.30 pm. Sunday Fixed WK Off Job location Airoli. Salary up to 8k to 18k CTC Walk-in Date/ Time: 10th February 2021, 9.30 AM - 5.30 PM Venue Details- Reliable Spaces Private Limited Reliable Tech Park, 5th floor A-1 Wing, Lift No. 4/5 behind reliable plaza Airoli Interested candidate can call or come for direct Interview. Meet HR Susheel. 8108298319  ","location":"Mumbai","experience":"1-2Years"},{"date":"8, 9, 10, 11, 12 - Feb - 2021","skills":"ASP .NET, Web Services, SQL Server, HTML, CSS, Java Script, and C#/ VB .NET","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Flentis Corporation(Sister Concern of Opusing Information Services) C-56 A/12, 3rd Floor, Sector 62, Technopolis IT Hub building (Opposite Stellar IT Park) Noida - 201 301.","phone":"9310277794","profile":" ASP .Net Developers \nFlentis Corporation (Sister Concern of Opusing)","description":"Hunting for few good resources ASP .Net Developers' for our own organisation 'FLENTIS CORPORATION' - US Canada Based IT Setup (A Sister concern of OPUSING LLC INFORMATION SERVICES PVT. LIMITED) Technical Requirements: Fluent in ASP .Net, Database design and development (Microsoft SQL Server) Experience with not limited to ASP .NET, Web Services, SQL Server, HTML, CSS, JavaScript, and C#/ VB .NET Should have experience on multiple projects especially US Canada based projects that will be plus point. Must have excellent communication skills. Job Responsibilities: Analyze system requirements and prioritize tasks Upgrading/ Working on existing .NET websites and applications. Write clean, testable code using .NET programming languages Test and debug various .NET applications Review and refactor code Deploy fully functional applications Document development and operational procedures KINDLY WALKIN ONLY IF YOU ARE OK WITH US SHIFT-NIGHT SHIFT Shift timing: Summer: 6:30 pm to 3:30 am & Winter: 7:30 pm to 4:30 am IST Walk-in Date/ Time: 8th February - 12th February , 12.30 PM - 6.30 PM Venue Details- Flentis Corporation(Sister Concern of Opusing Information Services) C-56 A/12, 3rd Floor, Sector 62, Technopolis IT Hub building (Opposite Stellar IT Park) Noida - 201 301. Contact - Ruchi Garg (9310277794)  ","location":"Noida","experience":"5-10Years"},{"date":"8, 9, 10, 11, 12, 13, 14, 15 - Feb - 2021","skills":"General Administration, Back Office, Documentation, etc","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Pelican (India) Private Limited, Bhosale Terrace, Opposite to Surya Hotel, Deccan, Pune","phone":"8180886080","profile":" Back Office Executive \nPelican (India) Private Limited","description":"Candidate should be Any Graduate with good interpersonal skills, including the ability to deal with people from a wide range of backgrounds, ages and temperament excellent skills on MS Word and Excel. Can be fresher or experienced and ready to take new challenges. Required Skills: Scanning Operator/ Data Entry Operator Shift Timing: Genaral Shift Hiring in both process in domestic BPO Walk-in Date/ Time: 6th - 15th February 2021, 9.30 AM - 5.30 PM Venue Derails- Pelican (India) Private Limited Bhosale terrace, Opp. to Surya Hotel, Deccan, Pune Contact - Mr. Bharate (8180886080)  ","location":"Pune","experience":"0-1Years"},{"date":"5 - Feb - 2021","skills":"Contract Staffing, IT Staffing/ IT Recruitment/ C2H Sourcing","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Artech Infosystems Private Limited, Cyber Park, 1st floor, B Block, Doddathogur, Electronic City Phase 1, Bangalore - 50","phone":"Not Provided","profile":" IT/ Technical Recruiter \nArtech Infosystems Private Limited","description":"We are looking for 'IT/ Technical Recruiter' for our company - Artech Infosystems Private Limited Educational Qualification: Any Graduate Work Experience: 2- 5 Years Good Communication skills (Spoken/ Written) Positive and Energetic. Keen learn more about Recruitment Dedicated towards work. Basic Knowledge in MS office IT Recruitment and Contract Staffing (C2H) is mandatory Notice period: Immediate or should be able to join within 15 days. Roles and Responsibilities Source resumes from Job Portals, LinkedIn and other channels for the requirements Screen the candidates as per the given requirements of the clients. Submit the resumes of the candidates for Internal and External review as instructed by the supervisor. Schedule telephonic discussion and in-person meetings for candidates shortlisted by the internal supervisor / client manager. Connect with the candidate to ensure that scheduled meetings happen on time and if there is a delay keep all the concerned parties informed. Submit a daily, weekly and monthly tracker as per the format suggested by the internal supervisor and the external client manager. Ensure that offer letters are released on time and keep in regular touch with the candidates till they join the required organization. Build a database of candidates with the relevant information (Name, contact info, skill sets, education, experience etc.) on a regular basis and share that with the internal supervisor. Strong Negotiating Skills with Go Getter attitude and ability to work under pressure Walk-in Date/ Time: 5th February 2021, 10.00 AM - 2.00 PM Venue Details- Artech Infosystems Private Limited Cyber Park, 1st floor, B Block, Doddathogur, Electronic City Phase 1, Bangalore - 50 Landmark: Close to Genpact Electronic City-1 Contact Person - Kalai  ","location":"Bangalore","experience":"2-5Years"},{"date":"5 - Feb - 2021","skills":"HR/ Recruitment, BPO Hiring, Volume Hiring, Sourcing, Mass Hiring","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Policybazaar Insurance Brokers Pvt. Limited, Plot 110 Sector 44 Gurgaon, Haryana. Landmark- Near Ramada Hotel","phone":"Not Provided","profile":" HR Executive/ Recruiter \nPolicybazaar Insurance Brokers Pvt. Limited","description":"Candidate should be a Graduate with minimum 1 year of experience in BPO Recruitment, Bulk Hiring Roles & Responsibilities- To achieve the target assigned within agreed quality & timelines. Independently manage recruitment for all positions across all verticals. Co-ordinate/ liaison with placement consultants/ institutions etc. Conducting skill testing & interviews Planning & Sourcing for specific recruitment within defined time frames Ensuring that documentation and salary fitment is as per agreed guidelines, to maintain Green status in compliance front Contribute to creating an organizational image, which would help in attracting and recruiting the best talent Seek to expand the talent pool by evaluating new employee profiles and assess their suitability Stakeholder management What do we offer? Amazing work culture Complete Day shift 6 Days working Shift Timing - 10:00 AM to 07:00 PM Walk-in Date/ Time: 5th February 2021, 11.00 AM - 4.00 PM Interview Venue- Policybazaar Insurance Brokers Pvt. Limited Plot 110 Sector 44 Gurgaon, Haryana. Landmark- Near Ramada Hotel Contact - Sanjog Katyal  ","location":"Gurgaon","experience":"1-4Years"},{"date":"5 - Feb - 2021","skills":"IT Recruitment, Human Resource Management","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Contact - ( 9884834539 )","phone":"9884834539","profile":" HR Executive/ IT Recruiter \nSixsigma Softsolutions Private Limited","description":"Candidate should be Any Graduate with 0 to 2 years experience in IT Recruitment, Human Resource Management. Must have fluent communication in English & should have basic knowledge in recruitment process. Freshers can also apply Only Female Candidates required Telephonic Interview- 5th February 2021, 10.30 AM - 4.00 PM Contact No - (9884834539)  ","location":"Mumbai","experience":"0-2Years"},{"date":"5 - Feb - 2021","skills":"Creative Writing, Content Management, Content Editing, Web Content Writing","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Platinum Techno Park, 1001, 10th Floor, Plot No-17- A, Bhagwan Mahaveer Rd, Sector 18, Vashi, Navi Mumbai, Maharashtra - 400 703.","phone":"9136667791","profile":" Content Writer \nITM Edutech (India) Limited","description":"Job Opening for Content Writer with ITM Group of Institutions Navi Mumbai Qualification: Only Graduates can apply. General Shift: (9:30 am to 6 pm) Organization: ITM Group of Institution Job Location : Nerul, Navi Mumbai Benefits: Every Month 3 Paid leaves Walk-in Date/ Time: 5th February 2021, 10.00 AM - 3.00 PM Venue Details- Platinum Techno Park, 1001, 10th Floor, Plot No-17- A, Bhagwan Mahaveer Rd, Sector 18, Vashi, Navi Mumbai, Maharashtra - 400 703. Contact - Shony Yadav (9136667791) If interested email me your CV on yshony@itm.edu with the below details- Total Experience : Current CTC: Expected CTC: Notice Period: Availability of face to face interview on Friday ie 5th Feb 2021 . Note: Its Not work from Home Kindly Carry Hard copy your updated resume Wearing a mask is compulsory and please download the Aarogya Setu App Check our website itm.edu and study about our products/ programs for the interview  ","location":"Mumbai","experience":"1-5Years"},{"date":"2, 3, 4, 5, 6 - Feb - 2021","skills":"Front desk/ Receptionist Activities, Front Office Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"KSNR Immegration Services Pvt. Limited, H-49, ALPC Business Park, 4th Floor, Sector-63, Noida.","phone":"7290016169","profile":" Front Office Executive \nKSNR Immegration Services Pvt. Limited","description":"A front office executive is the one who is responsible for overseeing the interaction with clients and handling their service requests. The duty includes delegating the request to the appropriate person or serves them personally. The executive has to fulfill the administrative tasks as well as front office executive duties. Duties and Responsibilities The duties and responsibilities of a front office executive are as follows: The main duty is to do the Management of the front desk. The person should take in charge of all front desk operations. Has to attend incoming and outgoing calls and transfer calls to various departments. Has to be responsible for dispatching courier mails and keeping a record of them. Has to maintain the coordination of ID and other visitors cards. Has to distribute inwards documents received and responsible for the payments of bills. Has to handle all of the company's petty cash. Has to work as an in charge of the utilities and maintenance of furniture. Skills Required The required skills and specifications are as follows; The person must have a friendly personality to do the job. The others skills required are the excellent interpersonal and communication skills. Should be able to work well under pressure and may be independently or as part of a team. The person must have the ability to accurately record information. Should be multi tasking. Walk-in Date/ Time: 2nd February - 6th February , 9.30 AM - 5.30 PM Venue Details- KSNR Immegration Services Pvt. Limited H-49, ALPC Business Park, 4th Floor, Sector-63, Noida. Contact - Tania Kaul (7290016169)  ","location":"Noida","experience":"0-1Years"},{"date":"4 - Feb - 2021","skills":"HR/ Administration, Talent Acquisition/ Recruitment","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"ISDC Services (India) Private Limited, ISDC 4th Floor, Lakshmi Narayan Complex Palace Road, Vasanth Nagar Bangalore - 560 052","phone":"Not Provided","profile":" Assistant Manager - Talent Acquisition & Coordination \nISDC Services (India) Private Limited","description":"Candidate should be Any Graduate with good experience in end to end Recruitment. Must be Tech Savvy with working knowledge in MS office ( Word, Excel, PPt) Should have excellent interpersonal, presentation and communication skills Work Location- Bangalore Roles & Responsibilities: Job broadly involves end to end Talent Acquisition/ Recruitment for Marketing and BD Team. Conducting full-cycle of recruitment for new employees, including placing advertisements, developing contacts with recruiting sources, interviewing, shortlisting and final selection. Conduct new employee orientations and training programs Meeting the recruitment needs based on the given TAT conducting the initial product training to the new incumbents Coordinating & supporting marketing teams for sales operation. Counseling students wherever required Publishing MIS reports on a daily basis Enabling a better business performance with effective coordination on the aforementioned tasks. Walk-in Date/ Time: 4th February 2021, 9.30 AM - 11.30 AM Venue Details- ISDC Services (India) Private Limited ISDC 4th Floor, Lakshmi Narayan Complex Palace Road, Vasanth Nagar Bangalore - 560 052. Wearing a mask at the venue is a must Contact - Baishali Please carry below mentioned documents for the interview 1. updated CV 2. Last 2 month pay slip copy 3. 1 passport size pic  ","location":"Bangalore","experience":"4-8Years"},{"date":"4 - Feb - 2021","skills":"HR/ Recruitment, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Shriram Life Insurance Company Limited, Plot No. 31 and 32, 5th Floor, Ramky Selenium, Financial District, Gachibowli, Hyderabad","phone":"Not Provided","profile":" HR Executive - Fresher \nShriram Life Insurance Company Limited","description":"Candidate should be from MBA HR/ PGDM background from B School with Excellent Communication skills both verbal and written. Must have knowledge of HR activities including Recruitment, Operations, Training & Development. Should be fully equipped with MS Office Tools/ Excel. Ability of Self Start, Quick Learner and should be able to work in Team Should be ready to do self-learning as per requirements Should be Active, Smart and have pleasing personality Should have Interviewing Skills and Convincing Skills Should have genuine interest in developing her career in HR Meeting the targets and Reporting to the Manager Note: This job is for 6 months on contract basis and based on performance would be converted to full time employment.  ","location":"Hyderabad","experience":"0-1Years"},{"date":"4 - Feb - 2021","skills":"Email Support, Customer Service, Team Coordination, Non Voice Process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Brickwork India Private Limited, 3rd Floor, Raj Alkaa Park, 29/3 & 32/2 Kalena Agrahara, Bannerghatta Road, Bengaluru, Karnataka - 560 076.","phone":"9845819333","profile":" Business Support Executive \nBrickwork India Private Limited","description":"Educational Qualification- Any Graduate / Postgraduate Work Experience- 2 to 8 years Job Location- Bannerghatta Road, Bangalore Work Timings : 6:30 PM to 3:30 AM Primary Responsibility: Deliver customer projects as per the defined scope of work Good written and verbal communication skills 100% adherence to project timelines, quality standards and expected efficiency Experience to effectively communicate with global customers through email / phone / chat Develop a trusted advisor relationship with customers Learn quickly in a fast paced, ever changing environment Organize and prioritize tasks to meet diverse project timelines set by the customer Competency /Skills: Good keyboard skills - Accuracy and Speed Strong working knowledge of Outlook, Excel, Word, and PowerPoint Experience or knowledge on online CRM\u0092s, Project Management tools, Expense Management, Database Management, Social Media platforms etc., Excellent desktop research skills to gather, collate and present data Walk-in Date/ Time: 4th February 2021, 9.30 AM - 5.30 PM Venue Details- Brickwork India Private Limited 3rd Floor, Raj Alkaa Park, 29/3 & 32/2 Kalena Agrahara, Bannerghatta Road, Bengaluru, Karnataka - 560 076. Contact - Sangeeta Prasad (9845819333)  ","location":"Bangalore","experience":"2-8Years"},{"date":"4 - Feb - 2021","skills":"Back office Operations, Data Entry, Back office processing","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Vibrant Screen Private Limited, # 710, 5th D Cross, HRBR Layout, 2nd Block, Kalyan Nagar, Near Royal Concorde School, Bengaluru, Karnataka - 560 043.","phone":"6366222627","profile":" Backend Process Executive \nVibrant Screen Private Limited","description":"We have an immediate opening for Background Verification Process. Required Skills- Candidate should know the following languages. English Kannada Tamil or Malayalam or Hindi Walk-in Date/ Time: 4th February 2021, 10.00 AM - 4.00 PM Venue Details: Vibrant Screen Private Limited # 710, 5th D Cross, HRBR Layout, 2nd Block, Kalyan Nagar, Near Royal Concorde School, Bengaluru, Karnataka - 560 043. Landmark: Bangalore Nethralaya Super Specialty Eye Hospital/ Behind Blue Dart. Contact - Bhavya ( 6366222627 )  ","location":"Bangalore","experience":"0-1Years"},{"date":"4 - Feb - 2021","skills":"MIS Reporting, Data Management, Index, Business Analysis","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Bisleri International Private Limited, Bisleri Sales Office, 5th Floor, City Centre, 79/2, Hebbal Service Road, Hebbal Bangalore - 560 024.","phone":"Not Provided","profile":" MIS Officer/ Manager \nBisleri International Private Limited","description":"Educational Qualification- Any Graduate/ Post Graduate Work Experience - 1 to 3 Years Location - Bangalore (Hebbal) Key Responsibilities: Preparing Daily, Weekly & Monthly MIS reports Handling records & data on MS Excel MS-office , Preparing presentation, graphs and analytical reports Good typing speed with accuracy. Power point presentation skills Must be strong in following aspects: Lookup: Index, Match, Offset, Indirect, Vlookup, Hlookup, Address, Choose Date&Time: Datedif, Networkdays(.intl), Workday(.intl), Weeknum, Weekday, Eomonth Arithmetical: Round (up/ down), Sumif(s) Text:Text, Value, Char, Code, Substitute, Replace, Find, Left, Right, Mid, Exact Information: Iserr, Iserror, Isological, Isodd, Iseven, Sheet(s), Type Logical:If, And, Or, Xnor,Not, True,False, Iferror,Ifna Statistical: Min, Max, Small, Large, Count(a) Countif(s), Average(a), Averageif(s)etc Walk-in Date/ Time: 4th February 2021, 9 AM onwards Venue Details: Bisleri International Private Limited Bisleri Sales Office, 5th Floor, City Centre, 79/2, Hebbal Service Road, Hebbal Bangalore - 560024. To Meet - Sandeep/ Sneha/ Abinay  ","location":"Bangalore","experience":"1-3Years"},{"date":"4 - Feb - 2021","skills":"Branch Operations, Customer Service, Back Office Operations","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Kotak Mahindra Life Insurance Company Limited, 1st Floor, Shubhashri Pride, No. 41, South End Road, Next to Bharthi Nursing Home, Basavanagudi, Bangalore - 560 082.","phone":"Not Provided","profile":" Branch Operations Executive \nKotak Mahindra Life Insurance Co. Limited","description":"Candidate should be Full time Graduate Fresher's/ MBA Fresher's (2020 batch passed out) having basic insurance knowledge can apply. Local Candidate required Max Age limit - 28 years Job Locations: Bangalore (Basvangudi) CTC: Upto 3 lacs Job Responsibility: 1. New Business proposal form processing. 2. Primary underwriting. 3. Customer Service. 4. Renewal Calling 5. Stale Chq Closure. Walk-in Date- 4th February, 2021 (Thursday) Timings- 11:00 AM to 3:00 PM Venue Details- Kotak Mahindra Life Insurance Company Limited 1st Floor, Shubhashri Pride, No. 41, South End Road, Next to Bharthi Nursing Home, Basavanagudi, Bangalore - 560 082. Interviewer Name - Madhusudhan/ Raghavendra  ","location":"Bangalore","experience":"0-3Years"},{"date":"3, 4 - Feb - 2021","skills":"Core Java, J2EE, JDK, JQuery, AJAX","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"PIL India Private Limited, No 177, Raheja Towers, 8th Floor, Door No 807 - 809, Anna Salai, Mount Road, Chennai - 600 002.","phone":"Not Provided","profile":" Java Developer \nPIL India Private Limited","description":"Candidate should be IT Graduate with around 2 to 4 years of experience in Java development tools Core Java, J2EE, JDK, JQuery, AJAX. Must have ability to work on multiple tasks and execute complex assignments. Shipping domain knowledge would be a plus. Walk-in Date/ Time: 3rd February - 4th February , 9.30 AM - 4.00 PM Venue Details- PIL India Private Limited No 177, Raheja Towers, 8th Floor, Door No 807 - 809, Anna Salai, Mount Road, Chennai - 600 002. Landmark- Near LIC  ","location":"Chennai","experience":"2-4Years"},{"date":"3, 4 - Feb - 2021","skills":"Java/ J2EE, Spring, Spring boot, Microservices, Spring data, Maven, Jira, SOA","qualification":"B.E./B.Tech, MCA/PGDCA","address":"OnPassive, DSR Inspire HUDA Techno Enclave, HITEC City, Hyderabad, Telangana - 500 081","phone":"6305570618","profile":" Senior Java Developer \nOnPassive","description":"Candidate must have a Degree in Engineering, Information Systems or related with 6 to 10 years of proven experience in Java/ J2EE, Spring, Spring boot, Microservices, Spring data, Maven, Jira, SOA Webservices, REST, Open-Source products, XML, Spring MVC and JSON. Experience is RDBMS like MySql, Oracle, SQL Server and NO SQL like MONGO DB, CASSANDRA. Performing requirement analyses. Developing high-quality and detailed designs. Conducting unit testing using automated unit test frameworks. Identifying risk and conducting mitigation action planning. Conducting configuration of your own work. Reviewing the work of other developers and providing feedback. Using coding standards and best practices to ensure quality. Extensive experience in the IT industry. Sound knowledge of estimation techniques. Sound knowledge of Java technologies. Good understanding of unit testing methodologies. Excellent analytical skills. Exceptional communication skills. Walk-in Date/ Time: 2nd February - 4th February 2021, 11.30 AM - 6.30 PM Venue Details- OnPassive DSR Inspire HUDA Techno Enclave, HITEC City, Hyderabad, Telangana - 500 081 Contact - Ashwin (6305570618)  ","location":"Hyderabad","experience":"6-10Years"},{"date":"1, 2, 3, 4, 5, 6, 8, 9, 10 - Jan - 2021","skills":"Administration Management, Vendor Management, House Keeping Management, Security Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Cameo Corporate Services Limited, No.1, Subramanian Building, 5th Floor, Club House Road, Anna Salai, Chennai. Landmark: - Near Spencer Plaza","phone":"Not Provided","profile":" Asst Manager - Administration \nCameo Corporate Services Limited","description":"Immediate Opening for Asst Manager - Admin Department Educational Qualification: Any Degree Work Experience: Min 3 to 5 Years of Experience Job Location: Chennai Roles and Responsibilities- Vendor Management House Keeping Management Security Management Company Administration Management Perks and Benefits- Salary Package: Rs: 25K to 35K CTC (Based on Experience) Walk-in Date/ Time: 1st - 10th February 2021, 9.30 AM - 5.30 PM Venue Details- Cameo Corporate Services Limited No.1, Subramanian Building, 5th Floor, Club House Road, Anna Salai, Chennai. Landmark: - Near Spencer Plaza, Opp. building to Senthur Hotel, Bank of Baroda Bank.  ","location":"Chennai","experience":"3-5Years"},{"date":"1 - Feb - 2021","skills":"HR/ Recruitment, Talent Acquisition, Payroll, Statutory/ Legal Compliance","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Bandhan KOnnagar, DN- 34, Saltlake Sector- V, Near College More, Kolkata- 700 091.","phone":"9749312276","profile":" HR Executive (Male Only) \nBandhan KOnnagar","description":"Candidate should be MBA with minimum 2 years experience in Human Resources specially in compliance and payroll. Male candidate only apply Walk-in Date/ Time: 1st February 2021, 9.30 AM - 5.30 PM Venue Details- Bandhan KOnnagar DN- 34, Saltlake Sector- V, Near College More, Kolkata- 700 091. Contact - Aniket Mukherjee ( 9749312276 )  ","location":"Kolkata","experience":"2-5Years"},{"date":"1, 2, 3, 4, 5, 6, 8, 9, 10, 11, 12, 13, 15, 16, 17, 18, 19, 20, 22, 23, 24, 25, 26 - Feb - 2021","skills":".Net framework, C#, ASP .Net, MVC & MS SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA","address":"ICREA Infotech Private Limited, First Floor, Lumbini Rockdale Beside Eenadu Office, Opposite to Kshetra Restaurant Khairtabad","phone":"9985036368","profile":" Software Engineer/ .Net Fresher \nICREA Infotech Private Limited","description":"The ideal candidate must have knowledge on .Net framework, C#, ASP .Net, MVC & MS SQL Server. Strong knowledge in OOPS. Angular native will be an added advantage. Required Skill set: Trained fresher in .Net framework, C#, ASP .Net, MVC & MS SQL Server Fair knowledge in software engineering - Software development life cycle HTML, Java Script, JQuery, Angular and Ajax will be an added advantage Good attitude and aptitude. Quick learning and listening abilities. Good verbal and written communication. Machine Learning The ideal candidate will have Knwoledge in the latest techniques in Artificial Intelligence, Machine Learning (including Deep Learning approaches) Knowledge with Deep Learning frameworks would be a big plus Job Responsibilities: Programming experience in Python or R Design and develop machine learning algorithms Background in machine learning frameworks such as TensorFlow or Keras Deep understanding of ML techniques such as classification, clustering, deep learning, and optimization methods, supervised and unsupervised techniques- Research-minded, ability to run experiments independently. Design and develop Deep Learning/ Image Processing Walk-in Date/ Time: 1st - 10th February 2021, 12.00 PM - 5.00 PM Venue Details: ICREA Infotech Private Limited, First Floor, Lumbini Rockdale Beside Eenadu Office, Opposite to Kshetra Restaurant Khairtabad. While attending the interview the candidate needs to come along with the following Documents: 1. Updated Resume Interview Process: 1st Round: Aptitude Test /Coding Test 2nd round: Managarial Round 3rd Round: HR Please drop resume to sangeetha@docassistant.net or contact 9985036368.  ","location":"Hyderabad","experience":"0-1Years"},{"date":"2 - Feb - 2021","skills":"MIS Preparation, Excel, MIS, VLOOKUP, MS Office","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"IndusInd Bank Limited, 3rd Floor, Tower-C, Sewa Tower, Udyog Vihar-IV, Gurugram, Haryana","phone":"Not Provided","profile":" MIS Executive \nIndusInd Bank Limited","description":"Candidate should be Any Graduate with 1 to 5 years of experience into MIS preparation Must have good communication skills. Roles and Responsibilities- Responsible for updating, retrieving, and maintaining information & data in a systematic manner Use MS office & other software to input data, including data that are related to Company Reports, Past Updating, retrieving, and maintaining information & Data in a systematic manner Use MS office & other software to input data, including data that are related to Company Reports, Past Sales etc. Master and own the monthly deliverables in the form of reports & presentations and send quality output in a timely manner. Maintain an accurate, complete, up-to-date and insightful Data to be shared with senior management Stakeholder Management: Engage with the stakeholders to understand the requirement, and present final output as per the requirement Be directly accountable for work conducted and perform quality checks on all reports for alignment to request, accuracy and correctness. Display a high sense of accountability and presence of mind when completing requests with high visibility or tight turnaround times and communicate effectively Walk-in Date/ Time: 2nd February 2021, 10.30 AM - 3.30 PM Venue Details- IndusInd Bank Limited, 3rd Floor, Tower-C, Sewa Tower, Udyog Vihar-IV, Gurugram, Haryana Contact - Talha Asif  ","location":"Gurgaon","experience":"1-5Years"},{"date":"1 - Feb - 2021","skills":"Non Voice Process, Back Office Operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"International InfoTech Park, Above Vashi Railway Station, Tower No 1, 4th floor, Vashi Navi Mumbai - 400 703","phone":"022-67841000","profile":" Non-Voice/ Back Office Executive \nHinduja Global Solutions Limited","description":"It's our privilege in notifying that we have immediate openings for Back office Executive at Hinduja Global Solutions, Mumbai Eligibility Criteria:- 1) Candidates should be Graduate (Compulsory) 2) Any Graduates No BE/ B.Tech Transport Boundaries- Wadala Byculla Panvel Dombivli Salary Offered: 1,94,000 L.P.A Take home 11,451 After 6 months: 6000 Bonus / No of working Day is 5 Job Responsivity:- 1) Non-Voice/ Back Office Process 2) Good Communication Skills in English, Hindi. 3) 9 working hours inclusive of 1hrs break. 5 working days and Saturday and Sunday off Needs to be in compliance with all the operational requirements and work as per the company's norms and policies. 4) Flexible to work in Shifts (24*7 Shift) (Day and Night) Transport Provided. 5) Candidates with Passport will be given high priority. Office Location:- International InfoTech Park, Above Vashi Railway Station, Tower No 1, 4th floor, Vashi Navi Mumbai - 400 703 NOTE - Write 'Supriya' on resume if you have read this posting & attending the Interview.  ","location":"Mumbai","experience":"0-1Years"},{"date":"1 - Feb - 2021","skills":"Front desk/ Receptionist Activities, Front Office Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Marine Electricals (India) Limited, B-1, Udyog Sadan-3, M I D C, Marol Industrial Area, Andheri East, Andheri East, Mumbai - 400 093.","phone":"022-40334355","profile":" Front Office Executive/ Receptionist \nMarine Electricals (India) Limited","description":"Candidate should be presentable & have good communication skills, MS Office. Qualification: Any Graduate Work Experience: 1 to 4 Years Job Location: Mumbai Job Responsibilities- Handling Receptionist profile, Provide basic and accurate information in-person and via phone/ email Greet and welcome guests as soon as they arrive at the office. Walk-in Date/ Time: 1st February 2021, 11.30 AM - 4.00 PM Venue Details- Marine Electricals (India) Limited B-1, Udyog Sadan-3, M I D C, Marol Industrial Area, Andheri East, Andheri East, Mumbai - 400 093. Landmark: Opposite SEEPZ gate number 1/ SEEPZ bus depot / Domino's Pizza Bldg. Bus from Andheri stat Contact - Snehal ( 022-40334355 )  ","location":"Mumbai","experience":"1-4Years"},{"date":"1 - Feb - 2021","skills":"Invoice Processing, Non Voice Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"AnnexMed Private Limited, Sree Narayana Complex, No. 29, Sarathy Nagar, Velachery, Chennai, Tamil Nadu - 600 042.","phone":"8056564376","profile":" Invoice Process Executive/ Fresher \nAnnexMed Private Limited","description":"AnnexMed Private Limited, is looking for Invoice Process Executive/ Freshers Immediate joiners freshers are apply now. Desperately looking for Corporate job Willing to work in Rotational shifts and Night shift Immediate joiners expected Walk-in Date/ Time- 1st February 2021, 9.30 AM - 5.30 PM Venue Details: AnnexMed Private Limited Sree Narayana Complex, No. 29, Sarathy Nagar, Velachery, Chennai, Tamil Nadu - 600 042. https://goo.gl/maps/be5KMqmrZerHH4mN6 Please bring a copy of your resume along with your Degree Xerox copies. Please send an Acknowledgement email for a confirmation. We look ahead to seeing you. Note: If the date & time of the interview is not convenient, please contact me by phone (Saranya-8056564376) to assemble another appointment.  ","location":"Chennai","experience":"0-1Years"},{"date":"1, 2, 3, 4, 5, 6, 8, 9, 10, 11, 12, 13, 15, 16, 17, 18, 19, 20, 22, 23, 24, 25, 26 - Feb - 2021","skills":".Net framework, C#, ASP .Net, MVC & MS SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA","address":"ICREA Infotech Private Limited, First Floor, Lumbini Rockdale Beside Eenadu Office, Opposite to Kshetra Restaurant Khairtabad","phone":"9985036368","profile":" Software Engineer/ .Net Fresher \nICREA Infotech Private Limited","description":"The ideal candidate must have knowledge on .Net framework, C#, ASP .Net, MVC & MS SQL Server. Strong knowledge in OOPS. Angular native will be an added advantage. Required Skill set: Trained fresher in .Net framework, C#, ASP .Net, MVC & MS SQL Server Fair knowledge in software engineering - Software development life cycle HTML, Java Script, JQuery, Angular and Ajax will be an added advantage Good attitude and aptitude. Quick learning and listening abilities. Good verbal and written communication. Machine Learning The ideal candidate will have Knwoledge in the latest techniques in Artificial Intelligence, Machine Learning (including Deep Learning approaches) Knowledge with Deep Learning frameworks would be a big plus Job Responsibilities: Programming experience in Python or R Design and develop machine learning algorithms Background in machine learning frameworks such as TensorFlow or Keras Deep understanding of ML techniques such as classification, clustering, deep learning, and optimization methods, supervised and unsupervised techniques- Research-minded, ability to run experiments independently. Design and develop Deep Learning/ Image Processing Walk-in Date/ Time: 1st - 10th February 2021, 12.00 PM - 5.00 PM Venue Details: ICREA Infotech Private Limited, First Floor, Lumbini Rockdale Beside Eenadu Office, Opposite to Kshetra Restaurant Khairtabad. While attending the interview the candidate needs to come along with the following Documents: 1. Updated Resume Interview Process: 1st Round: Aptitude Test /Coding Test 2nd round: Managarial Round 3rd Round: HR Please drop resume to sangeetha@docassistant.net or contact 9985036368.  ","location":"Hyderabad","experience":"0-1Years"},{"date":"2 - Feb - 2021","skills":"MIS Preparation, Excel, MIS, VLOOKUP, MS Office","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"IndusInd Bank Limited, 3rd Floor, Tower-C, Sewa Tower, Udyog Vihar-IV, Gurugram, Haryana","phone":"Not Provided","profile":" MIS Executive \nIndusInd Bank Limited","description":"Candidate should be Any Graduate with 1 to 5 years of experience into MIS preparation Must have good communication skills. Roles and Responsibilities- Responsible for updating, retrieving, and maintaining information & data in a systematic manner Use MS office & other software to input data, including data that are related to Company Reports, Past Updating, retrieving, and maintaining information & Data in a systematic manner Use MS office & other software to input data, including data that are related to Company Reports, Past Sales etc. Master and own the monthly deliverables in the form of reports & presentations and send quality output in a timely manner. Maintain an accurate, complete, up-to-date and insightful Data to be shared with senior management Stakeholder Management: Engage with the stakeholders to understand the requirement, and present final output as per the requirement Be directly accountable for work conducted and perform quality checks on all reports for alignment to request, accuracy and correctness. Display a high sense of accountability and presence of mind when completing requests with high visibility or tight turnaround times and communicate effectively Walk-in Date/ Time: 2nd February 2021, 10.30 AM - 3.30 PM Venue Details- IndusInd Bank Limited, 3rd Floor, Tower-C, Sewa Tower, Udyog Vihar-IV, Gurugram, Haryana Contact - Talha Asif  ","location":"Gurgaon","experience":"1-5Years"},{"date":"1 - Feb - 2021","skills":"Non Voice Process, Back Office Operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"International InfoTech Park, Above Vashi Railway Station, Tower No 1, 4th floor, Vashi Navi Mumbai - 400 703","phone":"022-67841000","profile":" Non-Voice/ Back Office Executive \nHinduja Global Solutions Limited","description":"It's our privilege in notifying that we have immediate openings for Back office Executive at Hinduja Global Solutions, Mumbai Eligibility Criteria:- 1) Candidates should be Graduate (Compulsory) 2) Any Graduates No BE/ B.Tech Transport Boundaries- Wadala Byculla Panvel Dombivli Salary Offered: 1,94,000 L.P.A Take home 11,451 After 6 months: 6000 Bonus / No of working Day is 5 Job Responsivity:- 1) Non-Voice/ Back Office Process 2) Good Communication Skills in English, Hindi. 3) 9 working hours inclusive of 1hrs break. 5 working days and Saturday and Sunday off Needs to be in compliance with all the operational requirements and work as per the company's norms and policies. 4) Flexible to work in Shifts (24*7 Shift) (Day and Night) Transport Provided. 5) Candidates with Passport will be given high priority. Office Location:- International InfoTech Park, Above Vashi Railway Station, Tower No 1, 4th floor, Vashi Navi Mumbai - 400 703 NOTE - Write 'Supriya' on resume if you have read this posting & attending the Interview.  ","location":"Mumbai","experience":"0-1Years"},{"date":"1 - Feb - 2021","skills":"Front desk/ Receptionist Activities, Front Office Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Marine Electricals (India) Limited, B-1, Udyog Sadan-3, M I D C, Marol Industrial Area, Andheri East, Andheri East, Mumbai - 400 093.","phone":"022-40334355","profile":" Front Office Executive/ Receptionist \nMarine Electricals (India) Limited","description":"Candidate should be presentable & have good communication skills, MS Office. Qualification: Any Graduate Work Experience: 1 to 4 Years Job Location: Mumbai Job Responsibilities- Handling Receptionist profile, Provide basic and accurate information in-person and via phone/ email Greet and welcome guests as soon as they arrive at the office. Walk-in Date/ Time: 1st February 2021, 11.30 AM - 4.00 PM Venue Details- Marine Electricals (India) Limited B-1, Udyog Sadan-3, M I D C, Marol Industrial Area, Andheri East, Andheri East, Mumbai - 400 093. Landmark: Opposite SEEPZ gate number 1/ SEEPZ bus depot / Domino's Pizza Bldg. Bus from Andheri stat Contact - Snehal ( 022-40334355 )  ","location":"Mumbai","experience":"1-4Years"},{"date":"1 - Feb - 2021","skills":"Invoice Processing, Non Voice Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"AnnexMed Private Limited, Sree Narayana Complex, No. 29, Sarathy Nagar, Velachery, Chennai, Tamil Nadu - 600 042.","phone":"8056564376","profile":" Invoice Process Executive/ Fresher \nAnnexMed Private Limited","description":"AnnexMed Private Limited, is looking for Invoice Process Executive/ Freshers Immediate joiners freshers are apply now. Desperately looking for Corporate job Willing to work in Rotational shifts and Night shift Immediate joiners expected Walk-in Date/ Time- 1st February 2021, 9.30 AM - 5.30 PM Venue Details: AnnexMed Private Limited Sree Narayana Complex, No. 29, Sarathy Nagar, Velachery, Chennai, Tamil Nadu - 600 042. https://goo.gl/maps/be5KMqmrZerHH4mN6 Please bring a copy of your resume along with your Degree Xerox copies. Please send an Acknowledgement email for a confirmation. We look ahead to seeing you. Note: If the date & time of the interview is not convenient, please contact me by phone (Saranya-8056564376) to assemble another appointment.  ","location":"Chennai","experience":"0-1Years"}]}