{"Walkins":[{"date":"10 - Aug - 2019","skills":"Angular JS, .Net, MVC, ASP .Net, MVC","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Hytech Professionals India Pvt. Limited, A-89 Sector-63, Noida","phone":"Not Specified","profile":".Net Developer \nHytech Professionals India Pvt. Limited","description":"Candidate should be BE/ B.Tech/ M.Tech or MCA with 1 to 5 years of experience in Software Development using Angular JS, .Net, MVC, ASP .Net, MVC Walk-in Date/ Time: 10th August (Saturday), 10 AM onwards Interview Venue: Hytech Professionals India Pvt. Limited A-89 Sector-63, Noida","location":"Noida","experience":"1 - 5 Years"},{"date":"10 - Aug - 2019","skills":"Software Testing, Embedded testing, Test Case Design","qualification":"B.E./B.Tech","address":"Cyient Limited, Plot No. 2, IT Park, Nanakramguda, Manikonda, Hyderabad - 500 032","phone":"040-67489921","profile":"Embedded Testing Engineer \nCyient Limited","description":"Qualification: BE/ B.Tech (Electronics/ Computers) Work Experience: 2 to 5 years Job Location: Hyderabad Good understanding of complete Software Test life cycle for software in real time embedded control, communication and information systems. Should able to understand system/software requirements for software testing. Create Test specification from requirements, execute testing and create test reports. Experience for creating test case as per standard Test case design techniques. Experience of integration & rig-based functional testing involving both software only and software/hardware integration configurations. Knowledge of simulation test environments. Basic knowledge on C Good understating of real time system, data communication e.g. serial RS232/485 and TCP/IP. ISTQB foundation level certification. IBM Rational tool like DOORS, ClearCase/ClearQuest or similar Requirements management tool knowledge. Good written/ oral communication skills. Walk in Date : 10th August (Saturday) Time: 10.00 AM - 12.00 PM Walk-In Venue: Cyient Limited, Plot No. 2, IT Park, Nanakramguda, Manikonda, Hyderabad - 500 032 Land Mark: Near Continental Hospital Contact Person: Manohar Burri Tel: 040-67489921 Note: Candidates who have attended the interview in last 6 months are not eligible for this walk-in","location":"Hyderabad","experience":"2 - 5 Years"},{"date":"9, 10, 12, 13, 14 - Aug - 2019","skills":"Technical Support, Software Testing/ Troubleshooting Skills","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Rayna Group Private Limited, Opposite Holiday Inn Hotel, Next to Kaweri Hotel, Mumbai Pune Banglore Bypass Highway, Wakad, Pune - 411 045","phone":"Not Provided","profile":"Backend Support & Tester (Freshers) \nRayna Group Private Limited","description":"Candidate must be from IT background with Qualification (BCA/ BCS/ MCA/ BE-IT/ Computer) Candidates should have a good communication skills. Should have knowledge good knowledge of Word, and Excel Good written and verbal English is must. Taking care of Backend of Raynatours websites. Work on Creating Discount Coupon codes. Work with software developers and get the issues done from them. Test in different environments including web and mobile Checking Hotjar (Video Recording tool) Walk-in Date/ Time: 14th August 2019, 10 AM onwards Interview Venue: Rayna Group Private Limited Opposite Holiday Inn Hotel, Next to Kaweri Hotel, Mumbai Pune Banglore Bypass Highway, Wakad, Pune - 411 045","location":"Pune","experience":"0 - 1 Years"},{"date":"12 - Aug - 2019","skills":"Software Testing, Test Planning, Automation Testing, Test Scenarios, Test Plan Creation, Manual Testing, Selenium","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Ebix Software India Private Limited, Plot No - 122 & 123 (Opp. Corporation Bank ATM), Noida Special Economic Zone (NSEZ), Near Sector 82, Phase - II, Noida","phone":"9315634728","profile":"Manual Testing Engineer \nEbix Software India Pvt. Limited","description":"Person must have good experience of Manual Testing/ Test Documents/ SQL/ OOPS Should have good knowledge of Automation Testing / Selenium. Review system requirements specification, features descriptions and present test scenarios. Assist with test plan creation and setting up test environment. Create test cases and prioritize based on the criticality of the business operation. Proven work experience in Web and API testing. Strong knowledge of software QA methodologies and processes Excellent communication skills, good sense of teamwork. Walk-in Date/ Time: 12th August 2019, 11 AM onwards Interview Venue: Ebix Software India Private Limited Plot No - 122 & 123 (Opp. Corporation Bank ATM), Noida Special Economic Zone (NSEZ), Near Sector 82, Phase - II, Noida","location":"Noida","experience":"3 - 5 Years"},{"date":"10 - Aug - 2019","skills":"Automation Testing, Cucumber, Maven, Jenkins, Selenium","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Xpanxion International Private Limited, 3rd Floor, Server Space, A.G. Technology Park, Off ITI Road, Near Sarja Hotel, Aundh, Pune- 411 007","phone":"Not Mentioned","profile":"QA/ Automation Tester \nXpanxion International Pvt. Limited","description":"Technical Skills - Mandatory Experience or exposure to test automation 2 to 3 Years of experience hands on experience on Java, Groovy Hands on experience on working with XML and JSON and parsing/ using them Experience in using various IDE's Eclipse/ IntelliJ Experience in using build tools like Maven/ Gradle Must be very strong in Automation Concepts Strong knowledge of software testing methodology and hands-on application test experience Ability to quickly grasp the application domain and functionality Strong experience creating and maintaining test cases/ scripts Work Location: Aundh/ Pune Station Interested candidates can walk-in directly with their updated resumes Walk-in Date/ Time: 10th August from 10 AM onwards Venue Details: Xpanxion International Private Limited 3rd Floor, Server Space, A.G. Technology Park, Off ITI Road, Near Sarja Hotel, Aundh, Pune- 411 007 Contact Person: Kashish Chauhan Interview Process: 1. Candidate will have Test & L1 Technical F2F discussion Same day. 2. If Selected in above rounds we will brief about further Client rounds.","location":"Pune","experience":"2 - 3 Years"},{"date":"8, 9 - Aug - 2019","skills":"Test Engineering, QATesting Tools, Load Runner, Automation Testing, Load Testing, Test Scripts, Testing Concepts","qualification":"B.E./B.Tech","address":"Extramarks Education India Pvt. Limited, D-180 , Sector 63, Noida","phone":"Not Provided","profile":"Software Testing Engineer \nExtramarks Education India Pvt. Limited","description":"Qualification BE/ B.Tech (IT/ CS) Expert knowledge of Testing Concepts & Methodologies Exposure to automated testing tools; Load Testing (Load Runner) Team-oriented experience highly desired Superb attention to detail Required Skills/ Experience: Experience testing complex web applications and software systems (Manual / Automated) Experience writing and maintaining test scripts Experience creating and maintaining testing environments Excellent understanding of testing concepts and the role of QA in the software development Exposure to understanding Test Plans; creating plans for small applications Good written and spoken communication skills Walk-in Date/ Time: 8th - 9th August from 11 AM onwards Interview Venue: Extramarks Education India Pvt. Limited D-180 , Sector 63, Noida","location":"Noida","experience":"4 - 8 Years"},{"date":"9 - Aug - 2019","skills":"Software Testing, Manual & Automation Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"IKS Health (Inventurus Knowledge Solutions Pvt. Ltd) M/s. Serene Properties Private Limited (SEZ), Unit No. 203, Building No. 5, 2nd Floor Mindspace Airoli (East), Navi Mumbai - 400 708","phone":"Not Provided","profile":"Software Testing Engineer \nInventurus Knowledge Solutions Pvt. Limited","description":"Years of Exp : 2 to 4 years (Analyst) Must have skill for Automation Engineers : Selenium+C# Walk-in Date - 9th Aug 2019 Timing -11:00 AM to 5:00 PM Notice Period -Preferring Immediate to One month Interview Location:- IKS Health (Inventurus Knowledge Solutions Pvt. Ltd) M/s. Serene Properties Private Limited (SEZ) Unit No. 203, Building No. 5, 2nd Floor Mindspace Airoli (East), Navi Mumbai - 400 708 Contact Person : Deepika P Documents to carry :- Updated resume with Original Govt ID Interview Process 1. Two level of technical discussion 2. Hiring manager discussion 3. HR Discussion","location":"Mumbai","experience":"2 - 4 Years"},{"date":"11 - Aug - 2019","skills":"ASP .Net/ Software Testing","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Shriram City Union Finance Limited, No. 5M, MRP Complex, 11th Cross Street, Thillai Nagar, Ramachandrapuram, Thennur, Trichy - 620 017","phone":"044-42913006","profile":"Software Test Engineer/ Trainee \nShriram Value Services Limited","description":"Candidate with 65% above in 10th, 12th, UG, PG are only eligible BE/ B Tech (CSE/ IT/ ECE) MCA, MSC (CS) from 2018 & 2019 batch only Bsc-Cs & BCA from 2018 & 2019 batch only Experience: Fresher Good knowledge in ASP .Net/ Testing is preferred Age criteria Not more than 25 Years. Job Location: Chennai Selection Process: Aptitude Test Technical Round If interested walk-in to the below mentioned venue directly with your updated CV. Walk-in Date/ Time: 11th August 2019, 10 AM onwards Interviiew Venue: Shriram City Union Finance Limited, No. 5M, MRP Complex, 11th Cross Street, Thillai Nagar, Ramachandrapuram, Thennur, Trichy - 620 017 Contact Person: Mr. Caleb Jerome Documents To Be Carried: Resume Passport Size Photo ID Proof Note: If you have attended this interview process in last 6 months you won't be eligible.","location":"Trichy","experience":"0 - 1 Years"},{"date":"10 - Aug - 0","skills":"Software Testing, Test data, Test Scenarios SQL Queries, Manual testing, Test cases","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Equiniti India Private Limited, Block 10, 8th Floor, DLF IT Park 1/124, Mt Poonamalle High Road, Ramapuram, Chennai, Tamil Nadu - 600 089","phone":"7338755955","profile":"Manual Testing Engineer \nEquiniti India Private Limited","description":"Qualification & Skills- Any UG Degree with good track records. Should be a team player with good interpersonal skills Drive to take responsibility for the tasks assigned. Personal Traits- Ability to demonstrate a pro-active, dynamic and focused approach Should possess good functional understanding of the assigned project. Highly flexible, including willingness to work away from home base. Should communicate effectively in a non-confrontational manner. Experience in manual testing of Client Server and Web applications. Exposure of testing methodologies, defect management system and database knowledge is must. Good Exposure in Writing SQL Queries & Joins is added advantage. Knowledge on preparing test scenarios, test cases and test data for the test cases. Testing experience with different types of testing including Regression and Functional. Should have Good verbal and written communication skills Experience in using Visual Studio/Microsoft Test Manager is an added advantage. Exposure to Automation tools and V-Model/Agile testing process is an added advantage Walk-In Date: 10th August 2019 Timings: Between 10 AM to 1 PM Interview Venue: Equiniti India Private Limited Block 10, 8th Floor, DLF IT Park 1/124, Mt Poonamalle High Road, Ramapuram, Chennai, Tamil Nadu - 600 089","location":"Chennai","experience":"2 - 6 Years"},{"date":"10 - Aug - 2019","skills":".Net, C#, SQL Server","qualification":"B.E./B.Tech, B.Sc, BCA/BCS","address":"Spider Software Private Limited, 206, Jalaram Business Center, Ganjawala Lane, Near Chamunda Circle, Borivali West, Mumbai - 400 092","phone":"022-42446400","profile":".Net Developers \nSpider Software Private Limited","description":"Person should have good knowledge/ practical handling .Net, C#, SQL Knowledge of making windows based application will be an added advantage Has good knowledge of internet and/or client server architecture Clear concepts of Multi threading Job Responsibility- Develop high quality software Develop applications to handle live streaming data Design/ Develop internet based client server data architecture Design/ develop software to work in Real-Time environment Process handling+memory management technology Walk-in Date: 10th August 2019 Timings: Fri (9 am-3 pm)/ Sat (9 am -1 pm) Interview Venue: Spider Software Private Limited 206, Jalaram Business Center, Ganjawala Lane, Near Chamunda Circle, Borivali West, Mumbai - 400 092 Landmark- Petrol Pump lane","location":"Mumbai","experience":"0 - 3 Years"},{"date":"10 - Aug - 2019","skills":".NET 3.0+, C#, ASP .NET, SQL Server (2012), T-SQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Riversand Technologies India Pvt. Limited, IBC Knowledge Park, Tower D, 8th Floor. 4/1, Bannerghatta Main Road, Bengaluru - 560 029","phone":"080-25538669","profile":"Senior Software Engineer (.Net) \nRiversand Technologies (India) Pvt. Limited","description":"Person must have advanced level knowledge and experience is required in .NET 3.0+, C#, ASP .NET, SQL Server (2012), T-SQL Should have good experience is desired in WCF, MVC and XML and Agile Methodology Experience in previous consulting or customer facing roles is not mandatory, but preferred Any other MDM product knowledge would be an asset Walk-in Date: 10th August 2019 Timings: 9:30 AM - 1 PM only Interview Venue: Riversand Technologies India Pvt. Limited IBC Knowledge Park, Tower D, 8th Floor. 4/1, Bannerghatta Main Road, Bengaluru - 560 029","location":"Bangalore","experience":"5 - 10 Years"},{"date":"10 - Aug - 2019","skills":".Net Framework, C#/ VB .Net, ASP .Net, SQL Server 2005/ 2008","qualification":"B.E./B.Tech, MCA/PGDCA","address":"GlobalData Research Center Private Limited, 3rd Floor, MSR Block, Krishe Sapphire Building, Madhapur, Hyderabad - 500 081. Landmark- Opposite to Nandini Cafe and Beside Image Hospital","phone":"040-66166706","profile":"Senior .Net Engineer \nGlobalData Research Center Pvt. Limited","description":"Person should have Bachelors Degree in Engineering/ Technology or MCA with minimum 3 years of experience in .Net Framework, C#/ VB .Net, ASP .Net, SQL Server 2005/ 2008. Well-versed with JavaScript, AJAX, Web services, Threading and strong Concepts of OOPS. Hands on experience in product/ project development using MVC Exposure of Endeca Configuration, NHibernate, JQuery etc., Strong database programming skills (T-SQL) Good communication skills in English, both written and verbal and analytical skills. Walk-in Date/ Time: 10th August 2019, 10 AM onwards Interview Venue: GlobalData Research Center Private Limited 3rd Floor, MSR Block, Krishe Sapphire Building, Madhapur, Hyderabad - 500 081 Landmark- Opposite to Nandini Cafe and Beside Image Hospital","location":"Hyderabad","experience":"3 - 7 Years"},{"date":"10 - Aug - 2019","skills":".NET, HTML, XML, SQL Server and Web Hosting Technologies","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Maersk Global Services (India) Private Limited, Line, No 286/1 Prince Infocity One, KLA Tencor Building, 11th Floor, Old Mahabalipuram Road, Kandanchavadi, Chennai - 600 096","phone":"9099066240","profile":".Net Developers \nMaersk Global Services (India) Pvt. Limited","description":"Candidate should have Bachelor's degree or equivalent in Computer Science, Business or related discipline or equivalent combination of education with 0 to 5 years of experience in .NET, HTML, XML, SQL Server and web hosting technologies. Experience in development of web applications and window applications is must. Knowledge on Scrum framework and Project Management Certification is required Must be able to communicate effectively to all levels of the organization including software development teams, technical support, end-users, management, vendors and others. Proficiency with software applications used to manage projects and portfolios and produce deliverables, (e.g. MS Project, Word, PowerPoint, Visio, Excel) Service delivery experience & should have worked with large teams. Should have Outstanding organization and time management skills Must have strong learning, reasoning and problem-solving ability Strong communications skills both verbal and written. Walk-in Date: 10th August 2019 Time - 10 AM - 12 Noon Interview Venue: Maersk Global Services (India) Private Limited Line, No 286/1 Prince Infocity One, KLA Tencor Building, 11th Floor, Old Mahabalipuram Road, Kandanchavadi, Chennai - 600 096","location":"Chennai","experience":"0 - 5 Years"},{"date":"10 - Aug - 2019","skills":"Angular 2/4/6, .Net - C#, MVC, WCF, Windows Forms, Oracle or SQL Server","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Hexaware Technologies Limited, 152, Sector III, Millennium Business Park, A Block TTC Industrial Area, Mahape, Navi Mumbai - 400 710","phone":"Not Provided","profile":".NET Professionals \nHexaware Technologies Limited","description":"Hexaware Technologies Limited is hiring Dotnet, Angular Professionals on 10th August 2019 at Mumbai Work Experience: 4 to 12 Years Skills: Angular 2/4/6, MVC, WCF Notice Period: Immediate to 60 days Must have Skills Angular 2/4/6, .Net - C#, MVC, WCF, Windows Forms, Oracle or SQL Server Interview Date: 10th August 2019 Time: 9 am to 2 pm Interview Venue: Hexaware Technologies Limited, 152, Sector III, Millennium Business Park, A Block TTC Industrial Area, Mahape, Navi Mumbai - 400 710 Contact Person: Prethiba T","location":"Mumbai","experience":"4 - 12 Years"},{"date":"10, 12, 13, 14, 15, 16, 17 - Aug - 2019","skills":".Net, ASP .NET, MVC, WCF, Web Services, SQL Server","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Spar Solutions India Private Limited, Pune IT Park, Bhau Patil Marg, 34 Aundh Road, Bopodi, Pune, Maharashtra - 411 020.","phone":"020-25810725","profile":".Net Developers \nSPAR Solutions India Private Limited","description":"Education: Graduate - B.Tech/ BE - Computers, Electronics/Telecommunication PG - M.Sc. Computers, M.Tech - Any Specialization, MCA - Computers Work Experience: 3 - 5 Years Job Location: Pune 3 to 5 years of experience in .Net, to build software using languages and technologies of the .NET framework. The primary role of the developer will be to design, develop, and maintain the software. Ability to communicate well. Fluency in written and spoken English is ESSENTIAL. Result oriented team player mindset. Be able to share knowledge at all levels. Possess valid passport. Be willing to travel to client locations abroad at short notice. Be able to join immediately. Essential Skill Set: Hands-on in coding C# with strong knowledge of ASP .NET, MVC, WCF, Web Services Good understanding of SQL server and database programming (joins, queries, procedures etc.). Knowledge of HTML, CSS, JavaScript, JQuery, OOPS Concepts. Must have good verbal and written communication skills. Walk-in Date/ Time: 9th August - 6th September , 9 AM onwards Interview Venue: Spar Solutions India Private Limited Pune IT Park, Bhau Patil Marg, 34 Aundh Road, Bopodi, Pune, Maharashtra - 411 020.","location":"Pune","experience":"3 - 5 Years"},{"date":"10 - Aug - 2019","skills":".Net Framework 3.5 or higher C# ASP .Net MVC 5 HTML 5 ASP .Net Bootstrap and Responsive Design Web API Web Services / WCF","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Equiniti India Private Limited, Block 10, 8th Floor, DLF IT Park, 1/124, Mt Poonamalle High Road, Ramapuram, Chennai, Tamil Nadu - 600 089","phone":"7550225966","profile":".Net Developer \nEquiniti India Private Limited","description":"Person must have good experience in developing application on MVC. Should be a team player with good interpersonal skills and a drive to take ownership of and responsibility for the tasks assigned to you. Must have good knowledge in Responsive Web Design. Will be working in India hours but should be willing to stretch into UK hours when required. Should have appropriate level of expertise of using several of the following technologies: .Net Framework 3.5 or higher C# ASP .Net MVC 5 HTML 5 ASP .Net Bootstrap and Responsive Design Web API Web Services / WCF SQL Server 2008 or higher Entity Framework Walk-in Date: 10th August 2019 Time: 10 AM to 1 PM Interview Venue: Equiniti India Private Limited Block 10, 8th Floor, DLF IT Park, 1/124, Mt Poonamalle High Road, Ramapuram, Chennai, Tamil Nadu - 600 089","location":"Chennai","experience":"2 - 6 Years"},{"date":"10 - Aug - 2019","skills":"ASP .Net, C#, SQL Server, MVC, HTML, CSS","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Inogic Tech India Private Limited, Everest Nivara Infotech Park 1. Office No-301, 3rd Floor, B wing, Plot No. D-3, TTC Industrial Area, Indira Nagar, Turbhe, MIDC, Navi Mumbai - 400 705","phone":"022-67687898","profile":".Net Developer/ Freshers \nInogic Tech India Private Limited","description":"Candidate should be Any Technical Graduate with excellent knowledge of ASP .Net, C#, SQL Server, MVC, HTML, CSS. Certification in .Net technologies would be preferred. Must have good communication skills. Walk-in Date: Saturday, 10 August' 2019 Time: Between 9 am -10 am Interview Venue: Inogic Tech India Private Limited Everest Nivara Infotech Park 1. Office No-301, 3rd Floor, B wing, Plot No. D-3, TTC Industrial Area, Indira Nagar, Turbhe, MIDC, Navi Mumbai - 400 705","location":"Mumbai","experience":"0 - 1 Years"},{"date":"10 - Aug - 2019","skills":"Automation Tools Jenkins Java JUnit Web Technologies Selenium Webdriver","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Impiger Technologies Private Limited, Sudhama Commercial Building 2nd Floor, No. 36, Vijayaraghava Road, T-Nagar, Chennai- 600 017","phone":"Not Provided","profile":"Automation Test Engineer \nImpiger Technologies Private Limited","description":"Person must have 3+ years overall experience/ with 2+ years experience in automating web applications using Selenium Web driver, Java, JUnit, JS, TestNG. Should have experience with build automation tools such as Jenkins. Good manual testing experience on Web, Mobile-web, Mobile Apps Walk-in Date/ Time: 10th August 2019, 9 AM onwards Interview Venue: Impiger Technologies Private Limited Sudhama Commercial Building 2nd Floor, No. 36, Vijayaraghava Road, T-Nagar, Chennai- 600 017","location":"Chennai, Coimbatore","experience":"3 - 8 Years"},{"date":"17 - Aug - 2019","skills":"Java/ J2EE, Angular JS, Spring Framework, Restful Web Services etc","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Sedin Technologies Private Limited, A1/1, 49th Street, 7th Ave, Ashok Nagar, Chennai, Tamil Nadu - 600 083","phone":"Not Provided","profile":"Java Developer \nSedin Technologies Private Limited","description":"Good hands on experience in server-side development technologies and concepts (Java/ J2EE, Angular JS, Spring Framework, Restful Web Services etc.) Good experience with build systems like Maven & Gradle. Version control using Git Very strong programming skills Should be able to write optimized, modular code. Solid Agile Programming methodologies and general software development best practices. Experience in developing unit tests and expanding unit test coverage (TDD). Performance tuning, Groovy, Apache Thrift knowledge is a plus. experience with any Javascript framework - preferably Angular 2+ or React or Vue and JQuery. Expert knowledge of web technologies, such as HTML5/ CSS3/ Javascript/ ES6 and possibly Server-side language such as Python. Good knowledge of web frameworks such as Vue/React, JQuery etc. Ability to work independently and proactive. Excellent problem-solving & communication skills Walk-in Date/ Time: 17th August , 9 AM onwards Interview Venue: Sedin Technologies Private Limited A1/1, 49th Street, 7th Ave, Ashok Nagar, Chennai, Tamil Nadu - 600 083","location":"Chennai","experience":"2 - 4 Years"},{"date":"15, 16 - Aug - 2019","skills":"TestNG Framework. Application Development, Framework, Core Java","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Cenduit (India) Services Pvt. Limited, 33, 5th Floor, Ness Towers, 17th H Main Road, 6th Block, Koramangala, Bengaluru - 560 095","phone":"7982915549","profile":"Java Developers \nCenduit (India) Services Pvt. Limited","description":"Candidate with rich experience in Core Java, coding, selenium can only attend the walk-in. Good Communication skills is required for the role. We are looking for an individual contributor so confident, energetic and one who can articulate well, these skills are preferred. 1 + Years of experience required Experience with OOPs Concepts. Experience with concepts likes collections, Strings, Exceptions, Java Streams, Property files and JDBC Connectivity. Experience with interacting/working with different APIs like Apache POI, Tom Cat Servers Experience with TestNG Framework Knowledge/experience on Maven, Jenkins or Cucumber will be an added advantage. Ability to Develop ,Implement ,Test ,Debug and maintain the scripts. Walk-in Date/ Time: 15th - 16th August from 11 AM onwards Interview Venue: Cenduit (India) Services Pvt. Limited 33, 5th Floor, Ness Towers, 17th H Main Road, 6th Block, Koramangala, Bengaluru - 560 095","location":"Bangalore","experience":"1 - 2 Years"},{"date":"9 - Aug - 2019","skills":"Insurance Processing, Non Voice Process, Back Office Operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"HCL Technologies Limited, 1st Floor, WSS Towers or Navins Building, 106 & 107, Langs Garden Road, Mount Road, Pudupet, Chennai - 600 002","phone":"Not Provided","profile":"Back End Executive (Insurance Process) \nHCL Technologies Limited","description":"Eligibility Criteria: Any Graduates can apply (No Backlog/ Arrears') Should be willing to work in Night Shift Should have good written and oral communication Fresher/ Experienced Candidates maximum within 2 years can walk-in Role/ Responsibility: Handling and resolving issues related to E-Commerce business. This position is responsible for day-to-day operations. Other Benefits: Doorstep cab pick and drop - Free Transportation for women up to 20kms from work location. Internal opportunity within HCL BPO after 18 months. Excellent opportunity for Fresher's to start their career. UG Consolidated & Provisional certificate is mandatory at the time of joining Job Timings: 11 AM- 9 PM Walk in Date: 9th August 2019 Timings: 11 am to 12 pm Interview Venue : HCL Technologies Limited, 1st Floor, WSS Towers or Navins Building, 106 & 107, Langs Garden Road, Mount Road, Pudupet, Chennai - 600 002 Landmark : Near Casino Theatre, Contact HR : Sharmi Sai If Interested, you may walk-in with 2 Copies of your updated Resume. Please mention as HR Sharmi Sai and Insurance Process on top of your resume without fail","location":"Chennai","experience":"0 - 2 Years"},{"date":"12 - Aug - 2019","skills":"Java C++ Software Development SE Algorithms NoSQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Azuga Telematics Private Limited, A2, 77 Town Center Yemalur Bangalore","phone":"080-67087777","profile":"Java Developers \nAzuga Telematics Private Limited","description":"A Software Engineer (SE) in Azuga would develop world-class applications and contribute to the culture of innovation via new technologies and new ideas that enhance the customer experience. You will be part of a talented software team that works on mission-critical applications. Basic Qualifications 1. Engineering in Computer Science or equivalent. 2. A portfolio of completed professional-grade work on proof-of-concepts (PoCs) or innovative ideas or open source contributions or mobile apps. 3. Experience applying Computer Science fundamentals in software development of these PoCs via data structures, algorithms, problem solving, and complexity analysis. 4. Write well designed, testable, efficient code that is in compliance with specifications. 5. Either very good understanding or experience with relational databases, ORM frameworks, NoSQL. 6. Experience with, at least, one modern programming language such as Java, C++, Python, Go, etc. 7. Excellent communication skills in English, verbal, and written. 8. Go-getter, energetic, willing to explore tech solutions and get things done fast. Preferred Additional Qualifications 1. Internship experience in working in a team and in building complex software systems that have been successfully delivered to customers. 2. PoCs or mobile apps demo apps that use concepts from distributed computing. Walk-in Date/ Time: 12th August 2019, 10 AM onwards Interview Venue: Azuga Telematics Private Limited A2, 77 Town Center Yemalur Bangalore","location":"Bangalore","experience":"0 - 2 Years"},{"date":"9 - Aug - 2019","skills":"talent acquisition recruitment Employee Engagement hr third party sourcing","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"ICICI Bank Limited, Trans Trade Centre, Near Floral Deck Plaza, Seepz, MIDC, Andheri (East), Mumbai","phone":"Not Provided","profile":"HR Recruiter/ Executive \nICICI Bank Limited","description":"ICICI Bank Limited, is looking for Recruiters with atleast 1 year of relevant work experience Job Responsibilities:- Use all methodologies of sourcing like Employee referrals, Internet sourcing (Job portals) Keep records of candidates and update tracker on timely basis Conduct sourcing activities in order to fill open positions. Responsible for end to end employee engagement activities. Suggest new ideas for improving talent acquisition activities. Walk-in Date: 9th August 2019 Timings - 2:00 PM to 5:00 PM Venue: ICICI Bank Limited, Trans Trade Centre, Near Floral Deck Plaza, Seepz, MIDC, Andheri (East), Mumbai","location":"Mumbai","experience":"1 - 5 Years"},{"date":"9, 11, 12, 13, 14 - Aug - 2019","skills":"HR/ Recruitment, Interviewing, Talent Acquisition, Selection, Coordination, Sourcing","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Eyegear Optics India Private Limited, Banjara Hills, Road #2, House No # 8-2-277/A/9, Soudagar Silver Breeze, Hyderabad - 500 034","phone":"9121474111","profile":"Recruitment Executive (Non IT) \nEyegear Optics India Private Limited","description":"Eyegear Optics India Private Limited, is hiring Looking for female Applicants for Recruitment Executive She/He must be strong in Written & Oral Communication Must be passionate about end-to-end recruitment. Job Responsibility- 1. Maintaining ongoing relationship with concerned departmental HODs and address their manpower needs under timelines. 2. MRF validation by calculating present head count, cost of the counter & state and discussion the same with hiring managers to approve/reject. 3. Sourcing relevant profiles from diverse sources and sharing with hiring managers. 4. Scheduling and coordinating interviews as per the selection methods. 5. Ensuring healthy hit ratio of profiles for each position. 6. Negotiating compensation & benefits with selected applicants and closing the final TCC (Total Cost to Company). 7. Accumulating MRF (Manpower Requisition Form), Resume, IAS (Interview Assessment Sheet) and other documents of selected applicant as per Offer Release Checklist and share with on-boarding specialist. 8. Proceeding for offer proposals and get approvals from departmental HOD and head HR. 9. Ensure to close the offers under management budgets. 10. Releasing LOI (Letter of Intents) to selected applicants with expected DOJ (Date of Joining). 11. Reporting weekly Talent Acquisition Dashboard to management on every week. Walk-in Date/ Time: 7th August - 14th August from 11 AM onwards Interview Venue: Eyegear Optics India Private Limited Banjara Hills, Road #2, House No # 8-2-277/A/9, Soudagar Silver Breeze, Hyderabad - 500 034","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"12, 13, 14, 15, 16 - Aug - 2019","skills":"Back Office, Non Voice Process, Customer support Chat Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"NISA Industrial Services Private Limited, 402 B, Vip Plaza, Veera Desai Industrial Estate, Off New Link Road, Andheri West, Mumbai - 400 053","phone":"022- 45204506","profile":"Customer Support Representative \nNISA Industrial Services Private Limited","description":"Great opportunity for Customer Support Professionals to work with NISA Industrial Services Private Limited Job Responsibility: 1. Remote monitoring Live site alarms for Bank branches and ATMs as well as other clients. 2. Maintain Logbook for all open alarms. 3. To initiate a video verification in case of any alarm/ticket and maintain a record and also escalate to the senior officials if necessary 4. Maintain a log for video online offline report 5. Prepare and maintain daily site reports for various parameters 6. Co -ordinating with the support team as well as software team in case of on sites problems faced by the client. 7. Its a rotational shift job and rotational weekly off. Walk-in Date/ Time: 12th August - 16th August , 12 AM onwards Interview Venue: NISA Industrial Services Private Limited 402 B, Vip Plaza, Veera Desai Industrial Estate, Off New Link Road, Andheri West, Mumbai - 400 053 Tel Number: 022- 45204506","location":"Mumbai","experience":"1 - 6 Years"},{"date":"9, 10, 11, 12, 13, 14 - Aug - 2019","skills":"Back Office Activities, Data Entry Operations, Non Voice Process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Hinduja Global Solutions Limited, 15, Sri Chamundi Towers, C-2 Building, Hosur Main Road, Garvebhavi Palya, Bangalore - 560 068. Landmark: Opposite Sai Baba Temple","phone":"7829533724","profile":"Back Office Executive/ Trainee \nHinduja Global Solutions Limited","description":"Any Graduate-Fresher or Experienced (NO- BE, B.Tech, Post Graduates) Must be willing to work in rotational shifts Way cab facility provided 5 Days working, 2 Days Off Desired Skills and Abilities: * Good communication * Good Analytical Skills * Basic computer knowledge Walk-in Date/ Time: 9th August - 14th August , 10 AM onwards Interview Venue: Hinduja Global Solutions Limited 15, Sri Chamundi Towers, C-2 Building, Hosur Main Road, Garvebhavi Palya, Bangalore - 560 068 Landmark: Opposite Sai Baba Temple","location":"Bangalore","experience":"0 - 1 Years"},{"date":"10 - Aug - 2019","skills":"HR / Administration, Payroll Recruitment, Talent Acquisition, Staffing","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Accenture Solutions Private Limited, 3 Tower B Reception 4/1, IBC Knowledge Park, Bannerghatta Road, Bengaluru - 560 029.","phone":"9986523530","profile":"HR Operations Executive \nAccenture Solutions Private Limited","description":"Person should be Any Graduates or Post Graduate with relevant experience Basic knowledge about Attendance management, Leave of Absence (LOA) Must have excellent communication skills Basic knowledge about background verification. Ability to multi-task Only candidates with excellent communication skills will be shortlisted Candidates should be flexible working with night and rotational shifts Freshers cannot apply Walk-in Date/ Time: 10th August from 9 AM onwards Interview Venue: Accenture Solutions Private Limited 3 Tower B Reception 4/1, IBC Knowledge Park, Bannerghatta Road, Bengaluru - 560 029. Landmark : Opposite to Fire Station Contact Person : Namratha Shivakumar (9986523530)","location":"Bangalore","experience":"6 - 8 Years"},{"date":"8, 9, 10 - Aug - 2019","skills":"Technical Support, Customer Service, Voice Process","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Tech Mahindra Limited, Takshila Block, Ground Floor, Bahadurpally, Hyderaba","phone":"Not Provided","profile":"Technical Support Associate \nTech Mahindra Limited","description":"Tech Mahindra is Hiring for International Process!!! Responsibilities & Duties: Troubleshooting of network related issues Provide technical Support to International clients over the call and email Establish good customer relationship Key Skills : Excellent Verbal/ Written Communication Skills Good comprehensibility and understandability of what customer want. Basics of Computer and knowledge of MS Office. Required Experience & Qualifications: Any Graduate can apply Age should be between 18 to 35 years Fresher and Experienced both can apply Willing to work in night shifts Benefits 5 days working Transport facility available(Pick & Drop) Walk-in Date/ Time: 8th August - 10th August , 11 AM onwards Interview Venue: Tech Mahindra Limited Takshila Block, Ground Floor, Bahadurpally, Hyderabad Contact Person:- Krishna Kanth All interested applicants can send their resumes on GK00567458@techmahindra.com or can visit for the interviews in Tech Mahindra Bahadurpally location as soon as possible (Mention reference ID 'Krishna Kanth' on your resume)","location":"Hyderabad","experience":"0 - 4 Years"},{"date":"8, 9, 10 - Aug - 2019","skills":"Technical Support, International Voice Process, Troubleshooting","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"CSS Corp Private Limited, Ground Floor, 32A & 32B, Ambit IT Park, Ambattur Industrial Estate, Ambattur, Chennai - 600 058","phone":"Not Provided","profile":"Technical Support Engineer \nCSS Corp Private Limited","description":"Eligibility Criteria- Any Graduation without Arrears (Mandatory) Language: Excellent communication in English. Experience within a customer service environment preferred. Work Experience - 0 to 5 Years (Max) Required Skills- Excellent in written and spoken English Proficient in offering phone-based support to USA. Flexible to work in night shifts Keen to learn new technologies High level of customer focus & Integrity. A person who is dedicated with unfathomable ethics Team player who understands the importance of collective effort. Immediate Joiners are preferred (Max Notice Period 15 days) Interview Dates : 7th - 10th August 2019 Timing : 12 PM - 3 PM If interested please contact Sandhya (HR) on 9384035855 or Walk-in directly to the below address- Reference code :(Mention 'Sandhya HR' on top of your resume) Venue Details: CSS Corp Private Limited, Ground Floor, 32A & 32B, Ambit IT Park, Ambattur Industrial Estate, Ambattur, Chennai - 600 058 Documents to Carry: 2 copies of resume for the interview. Please carry original government ID proof for security. Benefits: Excellent Growth Cab is provided Best learning exposure","location":"Chennai","experience":"0 - 5 Years"},{"date":"8, 9 - Aug - 2019","skills":"Technical Support, IT Helpdesk, Customer Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Capgemini Technology Services India Limited, 139-140, Block B, Basement, Noida Special Economic Zone, Noida - 201 305","phone":"0120 6012400","profile":"Technical Support Associate \nCapgemini Technology Services India Limited","description":"Minimum 1+ years hands-on experience working in technical support process Should have good experience working in technical support process Must have good communication skills (verbal & Written) Willing to work in 24x7 Environment with rotational shifts and week off Interested candidates can directly walk-in for interview from 7th August - 9th August, 3 PM onwards at the below mentioned address- Capgemini Technology Services India Limited 139-140, Block B, Basement, Noida Special Economic Zone, Noida - 201 305 Contact Person: Divyanksha/ Arpita Contact No: 0120 6012400 (Extn- 74185)","location":"Noida","experience":"1 - 4 Years"},{"date":"8, 9, 10 - Aug - 2019","skills":"Technical Support, International Voice Process, Customer Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Sutherland Global Services Private Limited, A1 Ground floor, Shriram The Gateway, New Perungalathur, Chennai - 600 063. Landmark: Adjacent to Perungalthur Railway Station.","phone":"7358370542","profile":"Technical Support (Voice Process) \nSutherland Global Services Private Limited","description":"We have exciting opportunities for Candidates with Experience for International Voice Process (Technical Support) Eligibility Criteria: Looking for both UG/ PG (in any discipline) Freshers are not eligible for this process. Candidates with minimum 6 months of any International voice experience can apply Must be able to communicate fluently in English . Candidates with experience in Customer support / Technical Support can apply. Job Responsibility: Assist customers with any Malware, Virus, Hardware related issues. Answer Phone to respond to customer inquires and troubleshoot for any Malware issues Assist customers with installation / un installation of McAfee products. Assist customers with product configuration, error messages & / or common issues Project a professional company image through phone interaction Provide customers with product and service information Transfer the customer appropriate department if required Escalate the customer's concern to the next level if required Benefits : Cab facilities (Within the boundary limits) Excellent Growth Huge Incentives Interested candidates can directly walk-in for interview from 8th August - 10th August (between 12 PM to 4 PM) at the below mentioned address- Sutherland Global Services Private Limited A1 Ground floor, Shriram The Gateway, New Perungalathur, Chennai - 600 063 Landmark: Adjacent to Perungalthur Railway Station. Reference ID : Vandhana HR [Write on top of your resume] Carry your ID proof for security clearance and don't carry any gadgets like Laptop, pendrive, etc.","location":"Chennai","experience":"1 - 5 Years"},{"date":"8, 9 - Aug - 2019","skills":"Technical Support, IT Helpdesk, Customer Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Attra Infotech Private Limited, Building Name is : Zero One 201/202 Zero1ne Village Mundhwa Koregaon Park Extension Pune - 410 036","phone":"020 39528500","profile":"Technical Support Engineer \nAttra Infotech Private Limited","description":"Candidate should have Bachelor's degree in Information Technology, Computer Science or Management Information Systems or equivalent with work experience in one or more of the following is preferred: Java, SQL Developer, Oracle, UNIX & C, C++. Strong communication skills -- both verbal and written with strong relationship, collaborative skills and organizational skills Production Support experience in Monitoring Batches, Analyzing & Resolving Batches issues and User queries. Experience in one or more of the following is preferred: C, C++, Java, SQL Developer Oracle, and UNIX. Should be proficient in the usage of tools like Putty, SQL Developer. Strong problem solving and root cause analysis skills. Knowledge of payments industry preferred. Sound knowledge of PL SQL and UNIX, average on JAVA Technical Production support environment experience is essential Ready to work in shifts (24x7) Interested candidates can directly walk-in interview on 8th & 9th August 2019 between 9 am to 6 pm at the below mentioned address- Attra Infotech Private Limited Building Name is : Zero One 201/202 Zero1ne Village Mundhwa Koregaon Park Extension Pune - 410 036 Phone No: 020 39528500","location":"Pune","experience":"0 - 5 Years"},{"date":"10 - Aug - 2019","skills":"Java/ J2EE, JavaScript, AngularJS/ JQuery, Spring, Hibernate","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Hays Business Solutions Pvt. Limited, Candor Tech Space, IT/ ITES Park, Unitech Infospace Building, 3rd Floor, Plot 2, Block B, Sector - 62, Noida. Landmark: Opposite Father Agnel School","phone":"Not Specified","profile":"Java Developers \nHays Business Solutions Pvt. Limited","description":"Candidate should have 1+ to 3.5 years development experience in Java/ J2EE Development. 1+ years experience in Java Script Technologies AngularJS/ JQuery 1+ years experience in Spring, Hibernate. Understanding of development lifecycle, Release Management, Agile Methodologies Aptitude for innovation, working independently and thinking outside of the box Working experience with Oracle Database technologies Very strong analytical and problem solving skills. Advantageous: Experience in Web Services SOAP & REST, JUnit Experience in Continuous Integration and Continuous Deployment methodologies and tools Good to have working knowledge of ADAPT Tool. Good to have knowledge of XML, XPATH may be XSLT Walk-in Date/ Time: 10th August 2019, 9 AM onwards Interview Venue: Hays Business Solutions Pvt. Limited Candor Tech Space, IT/ ITES Park, Unitech Infospace Building, 3rd Floor, Plot 2, Block B, Sector - 62, Noida Landmark: Opposite Father Agnel School","location":"Noida","experience":"1 - 4 Years"},{"date":"6, 7, 8 - Aug - 2019","skills":"Core Java, Springs, Hibernate, Webservices and Multi-threading","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Estel Technologies Private Limited, #126, Sector 44, Institutional Area Gurgaon, Haryana","phone":"0124-2578208","profile":"Sr. Java Professionals \nEstel Technologies Private Limited","description":"Person should have 3+ years of Core JAVA in an application development environment. Well versed in Core Java, which includes Springs, Hibernate, Webservices and Multi-threading. Must have knowledge of Java related technologies such as J2EE, Spring, JDBC, GWT, Multithreading. - Good understanding Architectural Design Patterns - Experience in refactoring and working with existing code - Solid database experience - Proficient in: SQL/ Database Concepts/ LINUX/ UNIX/ ORACLE - Development, deployment and testing - Agile Methodology - Review currently running architecture - Identify bottlenecks and loopholes for performance, memory management, code reusability, applications modules, etc. - Propose industry best practices and upgraded architecture - Ticket management experience: Jira - Experience with source control systems such as Git, SVN, etc. Walk-in Date: 6th - 8th August 2019 Timing: 11:00 am to 4:00 pm Interview Venue: Estel Technologies Private Limited #126, Sector 44, Institutional Area Gurgaon, Haryana Tel: 0124 257 8204/ 208 Contact Person - Nitanjali/ Saif","location":"Gurgaon","experience":"3 - 8 Years"},{"date":"7 - Aug - 2019","skills":"Java, J2EE, AngularJS, Java Script, XSLT, HTML5/ CSS, Ajax/ JSON","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"SSP India Private Limited, 12 FLOOR, TOWER-C, BUIDING NO.10, DLF CYBER CITY,, GURGAON - 122 002","phone":"Not Provided","profile":"Java Developers \nSSP India Private Limited","description":"Bachelors/ Masters degree in Engineering (preferably Electronics, Computer Science, Information Technology) Should have expertise in- At least 3 years in design and Development of Java, J2EE applications At least 2 years in AngularJS, Java Script, XSLT, HTML5/ CSS, Ajax/ JSON Strong OOPS concepts, Core Java and various design patterns using JAVA (1.5 or later)Strong knowledge of development best practices, development methodologies & standards. Experienced in J2EE, JSP, Java Servlets, EJB Experienced with Eclipse IDE, SVN version control and continuous integration XML, SQL, DB2/Oracle, WAS and Apache/IBM HTTP server Adhere to industry standard coding practices to write secured and optimized code for all above Thorough understanding of SDLC processes to drive best practices Excellent verbal, written and interpersonal communication skills to interface with various teams Walk-in Date/ Time: 7th August 2019, 9 AM onwards Interview Venue: SSP India Private Limited 12 FLOOR, TOWER-C, BUIDING NO.10, DLF CYBER CITY,, GURGAON - 122 002","location":"Gurgaon","experience":"3 - 5 Years"},{"date":"5, 6, 7, 8, 9 - Aug - 2019","skills":"Java, css nexus html5 rest api hibernate jasmine jquery sql spring","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"The Forum Vijaya Mall, 10th Floor, Prestige Center Court, 183, N.S.K. Salai, Kumaran Colony, Vadapalani, Chennai, Tamil Nadu - 600 026","phone":"Not Provided","profile":"Java Developer \nExpeditors International (India) Pvt. Limited","description":"The Associate Java Developer is a key role on a collaborative project team, which is responsible for the design and production of our core business systems. These systems satisfy customer and organizational business requirements and provide solutions that enable the organization to achieve its goals. The developer understands business problems and opportunities and applies technical skills in the design, development and testing of data flows, applications and systems. Essential Experience: Object-oriented analysis and design. Object-oriented programming and component-based development with Java. Enterprise software development and leadership experience. Customer service-oriented attitude, top-notch time management,and quality driven designs. Experience with Angular 2 or more, Kafka, Spring, Hibernate, typescript, HTML,CSS, SQL, XML, JMS, Linux operating systems, relational and document-oriented databases. Experience with Agile software development methodologies. Walk-in Date/ Time: 5th - 9th August , 10 AM onwards Interview Venue: The Forum Vijaya Mall, 10th Floor, Prestige Center Court, 183, N.S.K. Salai, Kumaran Colony, Vadapalani, Chennai, Tamil Nadu - 600 026 As its a scheduled walk- in Please send me your updated CV at sindhuja.a@expeditors.com as well with the below details Total Work Experience: Current Employer : CTC : Expected CTC : Notice Period :","location":"Chennai","experience":"3 - 6 Years"},{"date":"6, 7, 8 - Aug - 2019","skills":"Core Java, Spring, Hibernate, Web Services, Rest, SOAP, Spring boot","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Capgemini India Private Limited, Campus 6B, Pritech Park, RMZ Ecospace, Bellandur BANGALORE - 37","phone":"9632078131","profile":"Core Java Developer \nCapgemini Technology Services India Limited","description":"Capgemini Technology Services India Limited, is hiring Java Developer with Web Services with 4 to 8 years of experience at Ecospace Bellandur Bangalore location. Required Skills: Core Java, Spring, Hibernate, Web Services, Rest, SOAP, Spring boot Notice Period: Immediate to 30 days only Walk-in Date : 5th to 8th August 2019 (Thursday) Time 10:00 AM 2:00 PM Interview Location: Capgemini India Private Limited Campus 6B, Pritech Park, RMZ Ecospace, Bellandur BANGALORE - 37 Contact Person: Priyanka Saha / Sonam Singh Request to call -9632078131 to 1 hour before reaching to venue & drop resume to sonam.singh@capgemini.com with subject line 'Java Developer with Webservices_Bangalore'","location":"Bangalore","experience":"4 - 8 Years"},{"date":"8 - Aug - 2019","skills":"CORE JAVA: OOPs, Classes, Interfaces, Immutability, Inner classes, Generics","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Bravura Solutions Limited (BSL), Building No.14, Tower - B, 7th Floor, DLF Cyber City, Gurgaon - 122 001","phone":"9899466306","profile":"Core Java Developer \nBravura Solutions Limited (BSL)","description":"Person should have BE/ B.Tech/ MCA (only with min. 60% marks throughout & full-time regular education) with 2.3+ years of experience with large/complex Software Product development. Worked in a software development environment with medium to large teams (i.e. teams > 5 persons) Key Skills: Hands on experience of any CORE JAVA: OOPs, classes, interfaces, immutability, inner classes, Generics, Enums, Annotations , Deep Vs Shallow etc, Serialization, custom serialization, Collections (Linked HashSet, HashMap, TreeMap etc) + Good command over Database: Basic SQL Queries, DB modelling, Query Tuning, Indexes, Query Plans etc. Walk-in Date/ Time: 8th August from 9 AM onwards Interview Venue: Bravura Solutions Limited (BSL) Building No.14, Tower - B, 7th Floor, DLF Cyber City, Gurgaon - 122 001","location":"Gurgaon","experience":"2 - 7 Years"},{"date":"10 - Aug - 2019","skills":"Java, J2EE, JSP, EJB, Servlets, Web Services, JBOSS, ESB","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Maveric Systems Limited (Head Office), Lords Tower, Block 1, 2nd Floor, Plot No. 1&2 NP Jawaharlal Nehru Road, Thiruvika Industrial Estate Ekkatuthangal, Chennai - 600 032","phone":"Not Provided","profile":"Java Developer \nMaveric Systems Limited","description":"We are looking for profiles with strong Java programming experience to play SDET (Software Engineer in Test) role. The individual should have experience in building high-performing, scalable, enterprise-grade frameworks and applications. The SDET roles and responsibilities include certifying Enterprise applications such as web, mobile applications, web services & APIs. You will be part scrum teams to build and develop applications and testing frameworks on mission-critical projects. Candidate should have 2.5 to 5 years of experience in application development (Java Web / Enterprise) Profound insight of Java and JEE internals (Class loading, Memory Management, Transaction management etc) Excellent Java development skills using J2EE, JSP, EJB, Servlets, Web Services, jBoss, ESB Excellent knowledge of Relational Databases, jBase, JDBC, SQL Working knowledge with JMS Queues and setting uonnection factories Expertise in UI technologies like HTML, JS, CSS, XML, X Query, XSL Walk-in Date: 10th August 2019 Timing : From 10 AM to 3 PM Interview Venue: Maveric Systems Limited (Head Office), Lords Tower, Block 1, 2nd Floor, Plot No. 1&2 NP Jawaharlal Nehru Road, Thiruvika Industrial Estate Ekkatuthangal, Chennai - 600 032","location":"Chennai","experience":"2 - 5 Years"},{"date":"7, 8 - Aug - 2019","skills":"Core Java, JSP/ Servlet, J2EE, OOP, Spring, Hibernate, Angular, Micro Services","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Xpanxion International Private Limited, Sai Radhe Ground Floor, Behind Sheraton Hotel Near Pune Railway Station, Pune","phone":"40190500","profile":"Java Developers \nXpanxion International Pvt. Limited","description":"Calling out for strong Java Developers to walk-in to our Office in Pune Technical Skills - Mandatory Strong understanding of Object Oriented Programming Strong skills in Core Java, JSP/ Servlet, J2EE Must have experience in Spring, Hibernate, Angular 2/4/5, Micro Services Strong in Jenkins, Maven/ any build tools. Strong Oracle/ MS SQL Server & Database designing skills Experience required: 3 - 5 Years Walk-in Date: 7th & 8th August 2019 Timings: 8.30 am to 9.30 am Interview Venue: Xpanxion International Private Limited Sai Radhe Ground Floor, Behind Sheraton Hotel Near Pune Railway Station, Pune Contact Person: Shweta Patil","location":"Hyderabad","experience":"3 - 5 Years"},{"date":"10 - Aug - 2019","skills":"Core Java, GIT, JUnit, Eclipse, Ant Continuous Integration, Android SDK","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Purpletalk India Private Limited, Plot No. 11, 12th Floor, Watermark Techno Park, Survey No. 9, Whitefields, Kondapur, Hyderabad, Telangana - 500 084","phone":"Not Provided","profile":"Android Developer/ Java \nPurpletalk India Private Limited","description":"Required Skills: Excellent knowledge in Core Java, worked in a product environment. Hands-on experience in the full life cycle of Android application development. Strong knowledge of Android SDK, different versions of Android, form factors and material design. Familiarity with RESTful APIs to connect Android applications to back-end services Strong knowledge of Android UI design principles, patterns, and best practices Experience with offline storage, threading, and performance tuning Ability to design applications around natural user interfaces, such as touch Familiarity with the use of additional sensors, such as gyroscopes and accelerometers Roles & Responsibilities: Translate designs and wireframes into high-quality code Design, build and maintain high performance, reusable, and reliable Java code Ensure the best possible performance, quality, and responsiveness of the application Identify and correct bottlenecks and fix bugs Help maintain code quality, organization, test units, QA Automation Walk-In Date: 10th August 2019 Timings - 10:00 AM to 3:00 PM Interview Venue: Purpletalk India Private Limited Plot No. 11, 12th Floor, Watermark Techno Park, Survey No. 9, Whitefields, Kondapur, Hyderabad, Telangana - 500 084","location":"Hyderabad","experience":"3 - 6 Years"},{"date":"7, 8 - Aug - 2019","skills":"Generalist Activities, HR Administration, Joining Formalities, Leave Management","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"JiBe Development Services Pvt. Limited, Shree Nandadham Building, B Wing Office No-215, 2nd Floor, Sector - 11, Plot no 59, Near Belapur Station.","phone":"Not Provided","profile":"Senior HR Executive \nJiBe Development Services Pvt. Limited","description":"Minimum Education: MBA in Human Resources Minimum 2 years of HR experience as HR Admin Job Location: CBD Belapur, Navi Mumbai Highly organized with ability to effectively manage and execute multiple tasks/ projects simultaneously while working independently. Excellent communication skills (both written and verbal). English fluency. Very strong attention to detail and confidentiality with a commitment to high quality work Strong PC skills including expert proficiency Outlook, MS Word, Powerpoint, Excel, and internet research/data gathering; excellent analytical and problem-solving skill Walk-in Date/ Time: 7th - 8th August 2019, 10 AM onwards Interview Venue: JiBe Development Services Pvt. Limited Shree Nandadham Building, B Wing Office No-215, 2nd Floor, Sector - 11, Plot no 59, Near Belapur Station Landmark: Opposite B. P. Marine Academy. C B D Belapur,","location":"Mumbai","experience":"2 - 5 Years"},{"date":"7 - Aug - 2019","skills":"Talent Acquisition, HR/ Recruitment, Sourcing","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"IDBI Federal Life Insurance Company Limited, 22nd Floor, A Wing, Marathon Futurex, N. M. Joshi Marg, Lower Parel East, Mumbai - 400 013","phone":"Not Specified","profile":"Corporate HR Executive \nIDBI Federal Life Insurance Co. Limited","description":"We have an urgent opening for Corporate HR Recruiter on Third party payroll. Candidate should have minimum - 1 year of exp on Job portals. Only for Female candidates with very good english communication. CTC : 13-18k in hand Working days: 5 days Job Responsibilities: Sourcing relevant profiles from naukri portal. Screening and skills assessment as per the job requirements. Scheduling, Follow-up , Coordination with candidate to ensure show-up and feedback from interviewer. Develop and Manage strong consultative relationships with hiring managers and candidates. Work closely with Hiring Managers to develop relationship and to understand overall needs and requirements Consistently meet the performance metrics as defined by the Manager. Filling the gap with help of vendors, reference or Self sourcing. Coordinating with different level of managers to ensure completion of manning in TAT. Completing documentation process with the selected candidates Walk-in Schedule - 7th August 2019, Timings: between 11.00 am - 4.00 pm Interview Address - IDBI Federal Life Insurance Company Limited 22nd Floor, A Wing, Marathon Futurex, N. M. Joshi Marg, Lower Parel East, Mumbai - 400 013 (Walking distance from Curry rd/ lower parel stn) Contact Person - Akansha (HR)","location":"Mumbai","experience":"1 - 5 Years"},{"date":"6, 7, 8, 9 - Aug - 2019","skills":"Front Desk/ Front Office, Cash Handling, Guest Relations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"The Lalit New Delhi, Gate No. 3, Barakhamba Road, Fire Brigade Lane, Connaught Place, New Delhi - 110 001","phone":"Not Provided","profile":"Senior Associate - Front Office \nBharat Hotels Limited (The Lalit)","description":"Qualification: Any Graduate Experience : 1-2 Years Gender :Male/ Female Only 5 Star Hotel experience considered Walk-in Date/ Time: 6th - 9th August , 12 PM onwards Interview Venue: The Lalit New Delhi Gate No. 3, Barakhamba Road, Fire Brigade Lane, Connaught Place, New Delhi - 110 001","location":"Delhi","experience":"1 - 2 Years"},{"date":"6, 7, 8, 9, 12, 13, 14, 15, 16 - Aug - 2019","skills":"Recruitment, HR Administration","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Blue Square Tech Solutions Pvt. Limited, 1st floor, Western Pearl Building, Hitech City Road, Opposite HDFC Bank, Kondapur, Hyderabad, Telangana - 500 084","phone":"Not Provided","profile":"Administration Officer - HR \nBlue Square Tech Solutions Pvt. Limited","description":"Serving as a liaison with area employment agencies, colleges, and industry associations Completing timely reports on employment activity Conducting exit interviews on terminating employees Background Verification with Third party company Conducting Business Meetings Addressing Clients and Business Partners Employee engagement Programs and Fun games Great communication skills and interpersonal skills Able to convince candidates and business engagements Looking for Immediate joiners only Maximum 2 weeks. Walk-in Date/ Time: 6th - 16th August , 10 AM onwards Interview Venue: Blue Square Tech Solutions Pvt. Limited 1st floor, Western Pearl Building, Hitech City Road, Opposite HDFC Bank, Kondapur, Hyderabad, Telangana - 500 084 Can attend interview any time between 9:30 am to 7 :00 pm. Reference Name - Chiranjeevi (Chief Human Resources Officer) PH - 9901227034","location":"Hyderabad","experience":"0 - 2 Years"},{"date":"6, 7, 8 - Aug - 2019","skills":"Core Java, Javascript, Advanced Java, JSF, Struts, Swing","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"EXL Services Pvt. Limited, A-18, Sector-59, Noida","phone":"Not Provided","profile":"Back Office Executive \nEXL Services.com (India) Pvt. Limited","description":"Special Walk-in from 6th to 8th August 2019 for Computer Operator/ Data Entry Operator/ CCE/ Backend/ Back Office US Key Requirements- Candidates should be good in communication skill Candidates should atleast be a Graduate Candidates should be Ok with night shifts Should be good in communication skills Venue - EXL Services Pvt. Limited- A-18, Sector-59, Noida Interview Timings -11 am-3 pm Contact Person- Neda Sarfaraz Interested candidates can walk in at the above mentioned address along with the updated resume,3 passport size photographs and original Aadhar card proof in which Date of Birth is correctly mentioned. In case ful Date of Birth is not mentioned on Adhar Card then carry any other id proof alongwith Aadhar Card","location":"Noida","experience":"0 - 5 Years"},{"date":"6, 7, 8, 9, 10 - Aug - 2019","skills":"HR Recruitment, Volume Hiring/ Sourcing, Recruitment, Staffing","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Rupa Solitaire, Office Nos. 1518/ 1519, Building No A-1, Sector 1, Millennium Business Park, Behind DAKC, Mahape, Navi Mumbai - 400 710.","phone":"Not Provided","profile":"HR Executive \nL&T Finance Limited","description":"Candidate must be a Graduate with prior experience in Volume Hiring/ Sourcing Must have excellent communication skills. Tamil speaking candidates will be preferred Immediate Joining preferred Salary - Max 17k (Hike based on previous CTC) Job Responsibilities: Handling recruitment of Field employees for Micro Loans business in Tamil Nadu Good working experience in end to end recruitment Searching Candidates resumes from the job portals as per clients requirement Expertise in the areas of sourcing, screening, validating, interview coordination Build and Maintain candidate's relationship, pipeline, and proven ability to self-manage multiple positions Experience in sourcing and screening profiles from various Job portals The position will be on contract basis. After 1 year based on performance will be taken on payroll of L&T Finance. Walk-in Date/ Time: 6th - 10th August , 10 AM onwards Interview Venue: Rupa Solitaire, Office Nos. 1518/ 1519, Building No A-1, Sector 1, Millennium Business Park, Behind DAKC, Mahape, Navi Mumbai - 400 710.","location":"Mumbai","experience":"0 - 4 Years"},{"date":"10 - Aug - 2019","skills":"Core Java, Spring Mvc, Web Technologies, Spring Boot, SQL Server","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Financial Software Systems Pvt. Limited, G4 1st Cross Street, SIPCOT IT Park, Rajiv Gandhi Salai (OMR) Siruseri, Navalur, Chennai - 603 103","phone":"22540251","profile":"Java Developers \nFinancial Software & Systems Pvt. Limited","description":"* Experience in Core Java, Spring MVC / Spring Boot framework * Experience in Web Service (RESTFUL & SOAP) * Experience in Oracle/ SQL Server Databases Other Requirements: * Designs develops and implements web-based Java applications to support business requirements and projects * Write well designed, testable, efficient code * Profound of Java (Classloading, Memory management, Transaction management, etc) * Experience with test-driven development * Design and develop features and functionality * Proficient with APIs and service-oriented architectures * Willing to learn new emerging technology Walk-in Date/ Time: 10th August 2019, 9 AM onwards Interview Venue:- Financial Software Systems Pvt. Limited G4 1st Cross Street, SIPCOT IT Park, Rajiv Gandhi Salai (OMR) Siruseri, Navalur, Chennai - 603 103","location":"Chennai","experience":"2 - 5 Years"},{"date":"6, 7, 8, 9, 10 - Aug - 2019","skills":"Back Office Assistance, General Administration","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Teleperformance (Intelenet Global Services), Ashar IT Park, 2nd Floor, B-Wing, Road No-16, Waghle Estate, Thane West, Mumbai","phone":"Not Provided","profile":"Back Office Associate \nTeleperformance (Intelenet Global Services)","description":"Candidates will be responsible to handle customer queries over Calls/ Emails. Ensure quality customer service is delivered. Eligibility - Qualification- Any Graduate or Under Graduate Experience/ Fresher - Both Can Apply. Age -18 to 34 Fair Spoken English Perks and Benefits- Attractive incentive Salary Upto 20k Walk-in Date: 6th - 29th August 2019 Time: 11:00 to 5:00 (Mon to Sat) Interview Venue: Teleperformance (Intelenet Global Services), Ashar IT Park, 2nd Floor, B-Wing, Road No-16, Waghle Estate, Thane West, Mumbai","location":"Mumbai","experience":"0 - 5 Years"},{"date":"5, 6, 7, 8, 9 - Aug - 2019","skills":"ASP .Net, C#, MVC Architecture, SQL Server and Entity Framework","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"334 OMR, Futura Tech Park Block B, 1st Floor, Sholinganallur, Chennai","phone":"9384080470","profile":".Net Developer \nNorthern Lights Technology Pvt. Limited","description":"Skills Required- 2 to 6 years of experience in web application development. Experience of ASP.Net, C#, MVC architecture, SQL Server and Entity Framework Good communication skills (written and verbal) Should be able to join in 10-20 days We are conducting Walk in Interview from 5th to 9th August between 10:00 AM - 5:00 PM in our office. Venue 334 OMR, Futura Tech Park Block B, 1st Floor, Sholinganallur, Chennai Phone No: 9384080470","location":"Chennai","experience":"2 - 6 Years"},{"date":"5, 6, 7 - Aug - 2019","skills":"SQL Server, ASP .NET, VB .NET, VBA, Access Database","qualification":"B.Sc, BCA/BCS, MCA/PGDCA","address":"Atos Syntel Private Limited, Plot No. B-1 Software Technology Park, Midc Talawade, Pune, Maharashtra - 412114","phone":"Not Provided","profile":"VBA/ .Net Developer \nAtos Syntel Private Limited","description":"Educational Qualification: BCA/ MCA Experience: Between 2 to 5 Years Job Location: Pune (Talawade) & Mumbai (Airoli) Shifts: UK shifts Candidate should have strong professional software & macro development experience; preferably in enterprise applications/software/macro products for internal customers for the serving organization. Hands on experience in programming languages such as .Net, with databases such as SQL Server Developed complex SQL/ VBA queries using various joins and developed various dynamic VBA/SQL (Sub queries and Join conditions, correlated sub queries, Database creation, Tables and indexes creation) for optimum performance over large datasets. Role & Responsibilities : Develop code which is clear, concise, and technically correct. Ensure coding, testing and documentation tasks are successfully performed for new application development as well as enhancements to existing system functionalities. Essential functions: SQL Server, ASP .NET, VB .NET, VBA, Access Database Kindly go through the JD mentioned above and interested candidate can come down for In-Person (F2F) interview ,below are the details: Date: 5th to 7th Aug 2019, (Monday-Wednesday) Time: 12:00 PM to 3:00 PM Venue:: Atos Syntel Private Limited Plot No. B-1 Software Technology Park, Midc Talawade, Pune, Maharashtra - 412114","location":"Pune","experience":"2 - 5 Years"},{"date":"5, 6, 7, 8, 9 - Aug - 2019","skills":"C#, .Net, ASP .Net, SQL","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Aufait Technologies Private Limited, 3rd floor, 28, 3rd floor, 4th B Cross Road, Koramangala Industrial Layout, Koramangala, Bengaluru, Karnataka - 560 095,","phone":"Not Provided","profile":".Net Trainee Developer \nAufait Technologies Private Limited","description":"We are pleased to inform you that we are conducting a walk-in for Dot net trainee profile (fresher) interview on 5th to 9th August 2019, Monday to Friday (10:00 AM-3:00 PM). (1-2 PM will be lunch break) Educational Qualification: B.Tech/ B.E, BCA, B.Sc, M.Sc, MCA Only 2019/ 2018 passed outs can walk-in Should have good knowledge in C#, asp.net & SQL Must have good communication skills Candidates must have completed a training (OR) course (OR) Certification (OR) Internship on Dot net,C# & sql which is mandatory (OR) any academic project for a minimum duration of 6 months on the same skills. If you have already attended the walk-in please ignore, but pass on the message to your friend or acquaintance who is looking for such an opportunity. Interview Mode: Written (Technical & Logical) Walk-in Date: 5th to 9th Aug 2019 (Monday to Friday) Time: 10:00 AM-3:00 PM Venue Details: Aufait Technologies Private Limited, 3rd floor, 28, 3rd floor, 4th B Cross Road, Koramangala Industrial Layout, Koramangala, Bengaluru, Karnataka - 560 095, Landmark- Tillite Arabic Kitchen Things to carry : Updated resume","location":"Bangalore","experience":"0 - 1 Years"},{"date":"5, 6, 7, 8, 9 - Aug - 2019","skills":"OOPS, C#, SQL & .NET Technologies","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"nThrive Global Sloutions Private Limited, 15th Floor, Tower C Unitech Cyber Park Sector 39, Gurugram, Haryana - 122 002","phone":"4797940525","profile":"Software Engineer (.Net) \nnThrive Global Solutions Pvt. Limited","description":"Candidate should have an excellent knowledge on OOPS, C#, SQL & .NET Technologies. Must have an academic knowledge of Object Oriented Programming (OOP) using C# or C++, and database research skills to include SQL. Must have troubleshooting and problem solving skills, both technically and at the application level. Excellent communication skills Key Responsibilities- Facilitate technical issues resolution by interacting with other internal teams as well as with customers via both written and verbal communication. who is the cust and where are they based out of? Independently be able to understand client reported issues, triage the issues within the application, and propose or create a technical solution. Triaging routine recurring customer reported issues related to software or technical process issues, with a reliance on documentation and guidance from others. Creating technical solutions for routine recurring reported issues, with a reliance on documentation and guidance from others. Communicating with clients to understand and resolve routine and recurring reported issues, following documented best practices Perks and Benefits Free Cabs, Afternoon Shifts, One Time meal free Interview Rounds- 1. written test (SQL/ C#/ OOPS) 2. HR Interview 3. Technical Interview Candidates can walk-in between 5th to 9th August 2019 between 12 PM to 4 PM Interview Venue: nThrive Global Sloutions Private Limited 15th Floor, Tower C Unitech Cyber Park Sector 39, Gurugram, Haryana - 122 002","location":"Gurgaon","experience":"2 - 6 Years"},{"date":"5, 6, 7, 8, 9 - Aug - 2019","skills":".Net, Software Development, Technical Design, Project Implementation","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Incedo Technology Solutions Limited, Udyog Vihar Phase 4 Next to Polaris, Gurgaon, Haryana","phone":"0124-4765354","profile":"Software Engineers (.Net) \nIncedo Technology Solutions Limited","description":"Candidate should be BE/ B.Tech/ M.Tech or MCA with 4 to 7 years of experience in Software Development using .Net Technologies Work with a team of application developers and collaborate with a senior architect and solution designer to effectively deliver projects, enhancements, and applications. Develop end to end RPA solutions from requirements gathering to bot deployment focusing on scalability and extensibility using UI Path, Automation Anywhere, or blue prism. Walk-in Date: 5th - 9th August 2019 Timings - 1:00 PM- 4:00 PM Interview Venue: Incedo Technology Solutions Limited Udyog Vihar Phase 4 Next to Polaris, Gurgaon, Haryana Contact Person- Anjana Srivastava","location":"Gurgaon","experience":"4 - 7 Years"},{"date":"10 - Aug - 2019","skills":".Net, C#, ASP .Net, MVC, CSS, Database Administration, Database Design, SQL Server","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Flat world Solutions Private Limited, #15, Corporate Court Unit II, 2nd Floor, Opposite to Gulistan Shadi Mahal Infantry Road Bangalore - 560 001","phone":"Not Provided","profile":".Net Developers \nFlatworld Solutions Private Limited","description":"Looking for candidates with 6+ years of experience in developing projects in dot net technology Job Title : Senior Software Engineer Location : Infantry Road, Bangalore Job Responsibility: Develop projects using Dot Net and associate technologies. Report to the Managers and update on the project status weekly Must be able to lead a team wherever necessary and support all the team members with solutions, analysis and guidance. Should complete the work assigned as well as get the work done by the team members. Should report to Reporting Manager/ Scrum Master on impediments of the project in the daily stand up meetings Walk-in Date/ Time: 10th August 2019, 10 AM onwards Interview Venue: Flat world Solutions Private Limited #15, Corporate Court Unit II, 2nd Floor, Opposite to Gulistan Shadi Mahal Infantry Road Bangalore - 560 001","location":"Bangalore","experience":"6 - 10 Years"},{"date":"5, 6, 7, 8, 9 - Aug - 2019","skills":"Net Framework, C#, ASP .NET, Oracle/ SQL Server/ MySQL","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"InfoSun Technologies Private Limited, 8-2-120/113, Road No. 2, Banjara Hills, A Block, 2nd Floor, Sanali Info Park, Hyderabad - 34.","phone":"6302640635","profile":"Senior .Net Developer \nInfoSun Technologies Private Limited","description":"Person should have 3 to 9 years of experience with strong knowledge of .Net Framework, C#, ASP .NET & Relational databases (Oracle/ SQL Server/ MySQL). Working experience in WebAPI is required Attention to detail and an ability to build reliable, scalable, and flexible software. Supply chain/Warehouse Management functional knowledge is additional advantage Team player with excellent communication and interpersonal skills Walk-in Date/ Time: 5th - 9th August, 11 AM onwards Interview Venue: InfoSun Technologies Private Limited 8-2-120/113, Road No. 2, Banjara Hills, A Block, 2nd Floor, Sanali Info Park, Hyderabad - 34.","location":"Hyderabad","experience":"4 - 7 Years"},{"date":"5, 6 - Aug - 2019","skills":".Net, ASP .Net, MVC, SQL","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Nexsus Business Solutions Pvt. Limited, Everest Nivara Infotech Park - I, 803, Plot No. D-3, MIDC, Navi Mumbai - 400 705","phone":"022-67410357","profile":"Trainee Developer (ASP .Net) \nNexsus Business Solutions Pvt. Limited","description":"B.E/B.Tech/ M.C.A/ B.Sc (IT) - 2019 Batch Passout candidates Must have good knowledge of ASP .Net and exposure to MVC, SQL Should have done certification course in ASP .Net Walk-in Date: 5th & 6th August ,2019 Timing: Between 10 am to 5 pm Interview Venue: Nexsus Business Solutions Pvt. Limited Everest Nivara Infotech Park - I, 803, Plot No. D-3, MIDC, Navi Mumbai - 400 705 Contact Person: Sonal Tandon (HR) Contact No. 022-67410357 E-Mail ID: sonal.tandon@nexsussolutions.com","location":"Mumbai","experience":"0 - 1 Years"},{"date":"5 - Aug - 2019","skills":"Front office management, administration, maintenance activities, facility management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Cvent India Private Limited, Cvent, Unit 1, 19th Floor, Building 14C DLF Cyber City, DLF Phase 2, Gurgaon, Haryana - 122 002","phone":"Not Provided","profile":"Front Office Executive \nCvent India Private Limited","description":"Candidate should have Bachelors degree with 3 to 5 years of relevant professional experience in high-level operations environments. Must have excellent communication skills (verbal and written). Ability to interact and understand employee issues and help resolve in a simple and effective manner. Proven ability to identify, understand and resolve the issue at hand. Comfortable working in the All shifts. Very proficient with software packages of Microsoft Office. Well experienced at Facility Management and front office management. Walk-in Date/ Time: 5th August 2019, 12 AM onwards Interview Venue: Cvent India Private Limited Cvent, Unit 1, 19th Floor, Building 14C DLF Cyber City, DLF Phase 2, Gurgaon, Haryana - 122 002","location":"Delhi","experience":"3 - 5 Years"},{"date":"3 - Aug - 2019","skills":"Front desk, Guest Relations, Hotel Management, Customer Service","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"JLL, Level 16, Tower C Epitome Building No 5, DLF Cyber City Phase III, Gurugram - 122 002","phone":"Not Provided","profile":"Front Office Executive \nJones Lang LaSalle Property Consultants","description":"Role: Front Office Executive & Guest Relations Executive Work Location: Gurgaon & Noida Requirements: Any Graduate, Hotel Management Degree holder are preferred 2-10 years of experience in Front Office or Guest Relations Excellent communication skills Candidates from Hotel & Aviation Industry with relevant work experience are welcome Willing to work 6 days a week Walk-in Interview on 3rd August, Saturday Timings: 10 am - 3 pm Interview Venue: JLL, Level 16, Tower C Epitome Building No 5, DLF Cyber City Phase III, Gurugram - 122 002 Contact Person: Manisha Please carry a copy of your resume for Interview.","location":"Gurgaon","experience":"2 - 10 Years"},{"date":"5 - Aug - 2019","skills":"Back office, International BPO","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"EXL Services.com ( I ) Pvt. Limited, Tower 1, Cybercity, Magarpatta City Pune","phone":"Not Provided","profile":"Back Office Executive \nEXL Services.com ( I ) Pvt. Limited","description":"EXL Services.com ( I ) Pvt. Limited is hiring for Non Voice/ Back Office Qualification- Any Graduate (B.E/B.Tech must have one year of non technical experience). Work Experience: 6 months- 3 years Fresher can also apply Candidate should be good in Communication Skills Candidate should be OK with night shifts Should have typing speed of 30 wpm Walk-in Date: 5th August 2019 Time: 11:00 AM to 2:30 PM Venue: EXL Services.com ( I ) Pvt. Limited Tower 1, Cybercity, Magarpatta City Pune Documents to Carry- Resume and Aadhar Card (original + 2 photocopy) along with 02 passport size photographs is mandatory to carry to enter inside the premises.","location":"Pune","experience":"0 - 3 Years"},{"date":"5, 6, 7, 8, 9, 10 - Aug - 2019","skills":"Non Voice/ Chat Process, Back Office, Customer Service","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Groupon Shared Services Pvt. Limited, Gopalan Global Axis, G Block, 2 & 3 Floor, Road No. 9, KIADB Export Promotion Industrial Area, Whitefield, Bengaluru, Karnataka - 560 066","phone":"Not Provided","profile":"Backend Process Executive \nGroupon Shared Services Private Limited","description":"Candidate should be Graduate with good written communication skills Previous experience in customer services is good have Should be ready to work in rotational shifts/ including Night shifts Must have good logical skills If you feel confident to meet the need please Walk In with your updated resumes & necessary documents like: PAN, Aadhar card, graduation certificates & relieving letter from previous employer & latest payslips (All originals) Please be available at our office address between 9 AM to 11 AM only (No Weekends) Perks and Benefits Exciting monthly pay + Shift Allowance & Free Pick & Drop Walk-in Date/ Time: 5th August - 30th September from 9 AM onwards Interview Venue: Groupon Shared Services Private Limited, Gopalan Global Axis, G Block, 2 & 3 Floor, Road No. 9, KIADB Export Promotion Industrial Area, Whitefield, Bengaluru, Karnataka - 560 066 Please be available at our office address between 9 AM to 11 AM only (No Weekends) (The shortlisted candidate should be able to join us in 30 days Max)","location":"Bangalore","experience":"0 - 3 Years"},{"date":"3 - Aug - 2019","skills":"Manual Testing Database Testing (SQL), Automation (Selenium framework)","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"iBoss Tech Solutions Private Limited, D-37, Sector- 63, Noida (Landmark- Nissan Showroom)","phone":"Not Provided","profile":"Software Tester/ QA Engineer \niBoss Tech Solutions Private Limited","description":"Candidate should have 1 to 3 years experience in software quality assurance and testing of mobile and web cloud-based systems. Must have working experience of 1 to 2 years as Manual Tester. Should have good exposure in Database Testing and API Testing Able to produce reports on QA tools as well as working knowledge of MS Word, Power point and Excel. Able to mature team on QA best practices Must Have Skills : Manual Testing Database Testing (SQL) Good verbal and written communication Good to Have Skills : Automation (Selenium framework) Performance/ Load Testing (JMeter) Notice Period- Immediate/ 15 Days/ Serving Notice Working Shift : UK Shift (11 AM to 8 PM) Working Days: 5 Walk-in Date/ Time: 3rd August 2019, 10 AM onwards Interview Venue- iBoss Tech Solutions Private Limited D-37, Sector- 63, Noida (Landmark- Nissan Showroom)","location":"Noida","experience":"1 - 3 Years"},{"date":"7, 8 - Aug - 2019","skills":"Software Testing, Manual & Automation Testing","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Nucleus Software Exports Limited, A- 39, Sector - 62 Noida Nearest Metro Station: Noida Electronic City (500 Mtr)","phone":"Not Provided","profile":"Senior Testing Engineer \nNucleus Software Exports Limited","description":"Strong experience in Software Testing (Manual & Automation) Experience with building test plans and criteria for quality assurance Experience with DevOps environments. Familiar with automation test methodologies and popular automation tools (i.e. Selenium, Jmeter) Experience working with integration testing tools like Junit, etc Experience working with version control tools like SVN, JIRA Experience working on SQL Programming experience in Java, PHP, and JavaScript Strong communication and collaboration skills Overseeing, defining, and building the test processes end-to-end for our products Nice to have Skills Worked in an Agile environment Walk-in Date/ Time: 7th & 8th August, 9 AM onwards Interview Venue: Nucleus Software Exports Limited A- 39, Sector - 62 Noida Nearest Metro Station: Noida Electronic City (500 Mtr) Please carry 2 hard copies of your resumes. Please do hare your resume at prapti.madhur@nucleussoftware.com before attending the interview.","location":"Noida","experience":"4 - 5 Years"},{"date":"3 - Aug - 2019","skills":"Software Testing, Regression Testing, Database Testing, System Testing, UAT, Manual Testing","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Girikon Solutions Private Limited, B-24, Sector 65, Noida - 201301","phone":"Not Provided","profile":"Manual Tester/ QA Engineer \nGirikon Solutions Private Limited","description":"Candidate must be having 3 years of experience in Manual Testing. Participating in all testing cycles, including Functional, Regression, Integration, UAT Support and basic database testing. Documentation & Execution of test cycles and test cases. Document test findings and defect discovered during the test cycle in the standard ticketing system. Candidate should be able to work as Individual Contributor & in Team as well. Should have sound knowledge of SDLC (software development methodology) Should have sound knowledge of Software Testing methodology Must have basic database skills. Should have knowledge of Agile and Scrum. Execution, reporting, defect resolution, retesting, risk/issue management. Experience in JIRA would be an added advantage. Manual integration and system test. Walk-in Date: 3rd Aug 2019 (Saturday) Time: 11 AM to 4 PM Interview Venue- Girikon Solutions Private Limited, B-24, Sector 65, Noida - 201301","location":"Noida","experience":"3 - 7 Years"},{"date":"3 - Aug - 2019","skills":"Software Testing, Quality Assurance, Test Engineering, Quality Control","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"eClinicalWorks India Private Limited, 409-414,4th Floor, Venus Atlantis, Fourth Floor, 100 ft Road, Prahladnagar, Ahmedabad - 380 015","phone":"Not Provided","profile":"QA Manual Tester \neClinicalWorks India Private Limited","description":"Skills Required: Bachelors or Masters Degree in Computer Science or Information Technology or a related field (such as BE, B-Tech, M-Tech, BCA, MCA, BSc IT, MSc IT) Proficient with relational databases (SQL Queries) Excellent knowledge on Manual Testing Fluency in English Communication Street smart approach Strong analytical, Logical and problem solving skills Benefits: Best Professional Experience Opportunity for Career & Professional Growth Healthy Work Environment Pick & Drop facility for all employees based in Ahmedabad & Gandhinagar Meals at subsidized rate Medical insurance for self and for family members upon successful completion of 6 months Walk-in Date/ Time: 3rd August 2019, 10 AM onwards Interview Venue: eClinicalWorks India Private Limited, 409-414,4th Floor, Venus Atlantis, Fourth Floor, 100 ft Road, Prahladnagar, Ahmedabad - 380 015","location":"Ahmedabad","experience":"0 - 5 Years"},{"date":"3 - Aug - 2019","skills":"Manual Testing, Test Engineering, Bug Tracking, Quality Assurance tools","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Benchmark IT Solutions (I) Private Limited, 2nd Floor, Shinde Complex, NDA Pashan Road, Bavdhan Khurd, Pune - 411 021.","phone":"020-22951951","profile":"Software Test Engineer \nBenchmark IT Solutions (I) Private Limited","description":"Experience developing and executing manual test suites / cases. Experience testing web-based/Mobile based enterprise application. Familiarity with QA tools and techniques, bug tracking systems, test design and execution. Good command over written and verbal English communication. (If) Work experience on any finance or any insurance projects will be preferred Candidate must be good in mathematics and financial calculation. Walk-in Date/ Time: 3rd August , 10 AM onwards Interview Venue: Benchmark IT Solutions (I) Private Limited 2nd Floor, Shinde Complex, NDA Pashan Road, Bavdhan Khurd, Pune - 411 021. Phone No: 020-22951951/ 2","location":"Pune","experience":"1 - 3 Years"},{"date":"3 - Aug - 2019","skills":"Test Case Preparation Integration Test Plan Preparation Mobile Testing System Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Matrimony .Com Limited, Arihant ePark, Lattice Bridge Road, 2nd Floor, Baktavatsalm Nagar, Adyar, Chennai, Tamil Nadu - 600 020.","phone":"Not Provided","profile":"Manual Testing Engineer \nMatrimony .Com Limited","description":"Candidate should have 2 to 3 years of experience in Manual Testing Experience in Mobile testing is mandatory To be part of requirement analysis Participating in preparing Test Plans Preparing Test Scenarios Preparing Test Cases for module, integration and system testing Preparing Test Data for the test cases Preparing Test Environment to execute the test cases Analysing the Test Cases prepared by other team members Executing the Test Cases Defect Tracking Knowledge in Database querying Walk In Drive on 3rd August 2019 Timings: 11:00 AM till 4:00 PM Interview Venue: Matrimony .Com Limited Arihant ePark, Lattice Bridge Road, 2nd Floor, Baktavatsalm Nagar, Adyar, Chennai, Tamil Nadu - 600 020. (Opposite to Adyar Anantha Bhavan)","location":"Chennai","experience":"2 - 3 Years"},{"date":"3 - Aug - 2019","skills":"Regression Testing, Quality Engineering, Integration Testing, Test Cases, Manual Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Smt. Indira Gandhi College of Engineering (SIGCE), Sector-8, Plot No.1, Opposite to D- Mart, Ghansoli, Navi Mumbai - 400 701","phone":"022-61304200","profile":"QA/ Testing Engineer \nSeclore Technology Private Limited","description":"Be hands-on in generating precise and concise test plan/scenarios and test cases Have experience in transforming business requirements to create test plans/cases Have participated in full life-cycle of a development project interacting with teams of developers and testers Have involved in preparing the test plans for a release Be familiar with testing of either of system software or web based products or both. Have executed test cases (both regression and new functionality) within timescales against plan Be familiar with defect tracking tools Be familiar with the documentation of testing related artifacts Walk-in Date: 3rd August 2019 Time: 10am - 4pm Interview Venue- Smt. Indira Gandhi College of Engineering (SIGCE) Sector-8, Plot No.1, Opposite to D- Mart, Ghansoli, Navi Mumbai - 400 701","location":"Mumbai","experience":"2 - 4 Years"},{"date":"3 - Aug - 2019","skills":"Test Engineering, Android/ API Testing, Mobile Testing, Automation Testing","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"OnDot Systems India Office, Smartworks Global Technology Park, Block C, 1ST Floor, Outer Ring Road, Adarsh Palm Retreat, Bellandur, Bengaluru, Karnataka - 560 103","phone":"Not Provided","profile":"Automation Test Engineer \nOndot Systems India Private Limited","description":"Candidate should have overall 4 to 6 years of solid QA experience in Automation testing. Must have good hands on experience in mobile application testing on Android/ iOS platform. (Application end to end, functional, & UI). Experience in mobile automation using tools like APPIUM, SELENIUM, TESTNG, MAVEN, and JENKINS. Design, write and execute detailed Test Cases across Android & IOS application development. Good debugging, logging and troubleshooting skills. Walk-in Date/ Time: 3rd August 2019, 9 AM onwards Interview Venue: OnDot Systems India Office Smartworks Global Technology Park, Block C, 1ST Floor, Outer Ring Road, Adarsh Palm Retreat, Bellandur, Bengaluru, Karnataka - 560 103","location":"Bangalore","experience":"4 - 6 Years"},{"date":"10 - Aug - 2019","skills":"Software Testing, Test Engineering, Test Scenarios, Regression Testing, Automation Testing","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Hays Business Solutions Pvt. Limited, Candor Tech Space, IT/ITES Park, Unitech Infospace Building, 3rd Floor, Plot 2, Block B, Sector - 62, Noida","phone":"9871712629","profile":"Software Testing Engineer \nHays Business Solutions Pvt. Limited","description":"Person must have Bachelor Degree/ MCA with 1+ to 3.5 years of experience in necessarily in product testing. Excellent exposure of Testing in Support and Maintenance Environment and worked in Agile methodology. Proficiency in XML and experience in testing .Net/ Opensource tech. based application Testing of Complex products with integration exposure Proficient in planning, executing risk based testing solutions. Strong quality & risk quantification & management skills Exposure to Automation functional Testing tool would be plus especially Selenium and Jmeter. Key Activities/ Decision Areas: Creation & maintenance of test cases/test scenarios Execution of test cases on several platform and browser combinations Clearly & concisely report bugs/defects as they are discovered Provide daily status on overall test execution progress Monitor and escalate test and launch blocking issues Maintain daily record of test execution results Walk-in Date/ Time: 10th August 2019, 9 AM onwards Interview Venue: Hays Business Solutions Pvt. Limited Candor Tech Space, IT/ITES Park, Unitech Infospace Building, 3rd Floor, Plot 2, Block B, Sector - 62, Noida Land Mark: Opposite Father Agnel School HR Contact# 9871712629","location":"Noida","experience":"1 - 4 Years"},{"date":"1, 2 - Aug - 2019","skills":"Core Java, Spring, Struts, J2ee, Hibernate","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Colan Infotech Private Limited, Murugesa Nayakar Complex, B Block, 4th Floor, Greams Road, Thousand Lights, Chennai - 600 006","phone":"9042055706","profile":"Java Developer/ Fresher \nColan Infotech Private Limited","description":"Candidate must have completed the course or Internship in Java Should have good analytical and logical skills Must have basic coding and problem-solving skills Should have good communication skills Only 2018/ 2019 passed out are eligible Walk-In Date: 1st to 2nd Aug 2019, Thursday & Friday Time: 12:00 PM to 03:00 PM Venue: Colan Infotech Private Limited, Murugesa Nayakar Complex, B Block, 4th Floor, Greams Road, Thousand Lights, Chennai - 600 006 Landmark: Opposite Road to Seashell Hotel","location":"Chennai","experience":"0 - 1 Years"},{"date":"1, 2, 5, 6, 7, 8, 9 - Aug - 2019","skills":"Office Administration, General Admin Activities and Front Office Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Grovalue Insurance Broker Private Limited, 03, Enterprise Center, Off Nehru Road, Near Domestic Airport, Vileparle (East) Mumbai - 400 099","phone":"022-62166623","profile":"Admin Executive Cum Receptionist \nGrovalue Insurance Broker Private Limited","description":"Person should be Any Graduate with 0 to 5 years of experience in Office Administration, General Admin Activities and Front Office Management. Must have excellent communication skills. Fluent with English and Hindi Knowledge of travel booking Computer skills Job Responsibilities: 1. Stationary and Pantry materials management 2. Handling Incoming and outgoing call 3. Vendor management, vendor Negotiation 4. Printing/ Issuing company Id cards, visiting cards and SIM cards 5. Coordination with Branches Walk-in Date/ Time: 1st - 9th August 2019, 10 AM onwards Interview Venue: Grovalue Insurance Broker Private Limited 03, Enterprise Center, Off Nehru Road, Near Domestic Airport, Vileparle (East) Mumbai - 400 099 Contact No: 022-62166623/ 9699555955","location":"Mumbai","experience":"0 - 5 Years"},{"date":"1, 2, 5, 6, 7, 8, 9 - Aug - 2019","skills":"HR/ Coordination, MIS Reporting, Back Office Documentation","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Verifacts Services Private Limited, Plot No. 10, GR Nilayam, Lal Bahudur Colony, Trimulgherry, Secunderabad - 500 015","phone":"040 66509265","profile":"Administration Executive \nVerifacts Services Private Limited","description":"Candidate should be Any Graduate with 0 to 5 years of experience in HR/ Coordination, MIS Reporting, Back Office Documentation. Maintaining the office boys and Housekeeping. Check and maintain all the fire equipments. Must have good interpersonal skills. Prefer Male candidates only He will also be responsible for - HR related activities - Coordinating for interview, On boarding and induction process Finance related activities - Visiting bank when ever necessary and help in maintaining the vouchers/ bills. Interested candidates walk in on the below mentioned address- Date: 1st - 9th August , 10 AM onwards Verifacts Services Private Limited Plot No. 10, GR Nilayam, Lal Bahudur Colony, Trimulgherry, Secunderabad - 500 015 Contact No: 9167775350/ 040 66509265 (Kindly call between 10:00 AM to 6:00 PM)","location":"Hyderabad, Secunderabad","experience":"0 - 5 Years"},{"date":"2 - Aug - 2019","skills":"Desktop Support, System Support, Technical Support, Troubleshooting skills","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Dell International Services India Pvt. Limited, Vipul Tech Square, Opposite Central Park, Sector Road, Sector - 43, Gurgaon - 122 002","phone":"Not Provided","profile":"Technical Support Associate \nDell International Services India Pvt. Limited","description":"Any Graduate 0 to 1 year of relevant work experience required Should be willing to work in shifts in a 24 x7 work environment Should be residing within Transport Boundaries Excellent telephone soft skills, thorough telephone functional skills & email etiquettes Excellent spoken and written English Ability to handle stressful situations. Goal/ Career oriented and self-motivated Essential Requirements : Knowledge of job associated database, software and documentation Strong technical aptitude and troubleshooting skills Fluent communication & Time management skills Results driven with Problem-solving skills Walk-in Date: 2nd August 2019 Timings : 12:00 pm to 3:00 pm Interview Venue: Dell International Services India Pvt. Limited Vipul Tech Square, Opposite Central Park, Sector Road, Sector - 43, Gurgaon - 122002 **Note - Please carry a resume & valid Govt. ID proof","location":"Gurgaon","experience":"0 - 1 Years"},{"date":"5 - Aug - 2019","skills":"Technical Support, Hardware/ Networking Application Support, Network Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Athenahealth Technology, 13th Floor, Block C - Core 1, West Wing, SP Infocity, #40, MGR Road, Perungudi, Chennai - 600 096","phone":"044-40613331","profile":"Product Support Analyst \nAthenaHealth Technology Private Limited","description":"Candidate should be a Graduate in Engineering, Science, or Commerce stream with Fluency in both spoken and written English. Willingness and ability to work flexible hours to ensure substantial overlap with US-based teams (Morning/ Afternoon/ Evening) shift timings. Good communication skills and an ability to effectively engage with members of geographically disparate teams in India and other geographies across athena. Excellent customer service skills and professionalism to effectively manage communication with external parties including US lab and imaging vendors. Excellent analytical and problem-solving skills Preferred Skills: > Networking/ Technical Support/ Application Support/ Enterprise Support, experienced 2-5 years > Should have good communication skills (written/ verbal) > Willing to work in night shifts Shift Timings: Night Shifts 5 Days Working (Friday/ Saturday Or Sunday, Monday Off) Notice Period: Immediate: 30 Days Degree Mandatory Documents Mandatory Excellent Communication skills Willing to work in Night shifts (Cabs Provided) Technical Support/ Customer Support experience Walk-in Date: 5th August 2019 Timing: 10 AM - 1 PM Interview Venue: Athenahealth Technology, 13th Floor, Block C - Core 1, West Wing, SP Infocity, #40, MGR Road, Perungudi, Chennai - 600 096 Contact Person : Beula HR Interested candidates can send resumes to ibeula@athenahealth.com","location":"Chennai","experience":"2 - 6 Years"},{"date":"2, 3 - Aug - 2019","skills":"Technical Support, Customer Service, Voice Process","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Tech Mahindra Limited, Software Development Block -4 Ground Floor, ODC-1 602/3, Elcot SEZ, Sholinganallur Village Chennai - 600 119","phone":"Not Provided","profile":"Technical Support Associate \nTech Mahindra Limited","description":"Tech Mahindra Limited is hiring for Technical Support Associate for an International Voice Process - Handling customers over calls - Troubleshooting / Tech Support / Customer Queries - Rotational Shift - Very good communication - Experience in any voice calling profile - Experience in International BPO will be an added advantage. - Fresher are also eligible (2018 / 2019). Candidates with backlogs can also apply. Walk-in Date: 2nd - 3rd August 2019 Timings : 10 Am to 4 Pm Interview Venue: Tech Mahindra Limited, Software Development Block -4 Ground Floor, ODC-1 602/3, Elcot SEZ, Sholinganallur Village Chennai - 600 119 - Kindly bring a copy of your updated CV. - Aadhar card","location":"Chennai","experience":"0 - 5 Years"},{"date":"2, 3, 5, 6, 7 - Aug - 2019","skills":"Application Support, Technical Support, SQL Server","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Datazoic Machines Private Limited, 141, TVH Agnitio Park, 2nd Floor, OMR, Kandanchavadi, Chennai - 96","phone":"Not Provided","profile":"Technical Support Engineer \nDatazoic Machines Private Limited","description":"Role: Tech Support Engineer (International Semi Voice Process) Shift: 4.00 pm - 1.00 am Candidate must have excellent verbal & written communication skills, analytical & troubleshooting skills. Responsible to drive all technical and functional issues towards closure L1/L2 support - diagnosis, investigation, resolution, coordination with business, application owners, infrastructure support Creation of ticket and tracking through lifecycle Basic understanding of SQL. Some knowledge on scripting language (very basic Java script or windows shell or vbscript). Incident ticket handling and service request queue management (preferable JIRA). Academic and conceptual knowledge of any programming language (Java) would be plus. Fair analytical skills. Good in excel and preparing reports for management. Walk-in Date/ Time: 2nd - 7th August , 11 AM onwards Interview Venue: Datazoic Machines Private Limited 141, TVH Agnitio Park, 2nd Floor, OMR, Kandanchavadi, Chennai - 96","location":"Chennai","experience":"0 - 1 Years"},{"date":"3 - Aug - 2019","skills":"Java/ J2EE, Spring/ Hibernate, Web Technologies and MySQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"BuzzyBrains Software (India) Pvt. Limited, C-501, Wisteria Fortune, Near New Poona Bakery, Bhumkar Chowk-Marunji Road, Wakad, Pune. Landmark: Opposite Silver Spoon Restaurant","phone":"7249519431","profile":"Java/ J2EE Developer \nBuzzyBrains Software (India) Pvt. Limited","description":"Person must have sound knowledge in Java/ J2EE technologies Working knowledge in Spring/ Hibernate necessary (Java, JSP, Spring, Hibernate/ Junit) Working knowledge in web technologies and MySQL Working knowledge in tomcat and Apache Web Server is needed Must have very good analytical skills Walk-in Date/ Time: 3rd August 2019, 10 AM onwards Interview Venue- BuzzyBrains Software (India) Pvt. Limited C-501, Wisteria Fortune, Near New Poona Bakery, Bhumkar Chowk-Marunji Road, Wakad, Pune Landmark: Opposite Silver Spoon Restaurant","location":"Pune","experience":"3 - 5 Years"},{"date":"5, 6, 7, 8, 9 - Aug - 2019","skills":"Generalist Activities, Recruitment, HR Administration","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Radiant Group of Companies, No: 28, 3rd Floor, Voora J.K. Tower, Bazullah Road T Nagar, Chennai - 600 017","phone":"9500092092","profile":"HR & Admin Generalist \nRadiant Cash Management Services Pvt. Ltd","description":"Candidate should be Any Graduate with good verbal & written communication skills Should be conversant with MS office with Immense knowledge in HR activities Hindi speaking candidates are preferable Walk-in Date/ Time: 5th August - 9th August , 10 AM onwards Interview Venue: Radiant Group of Companies No: 28, 3rd Floor, Voora J.K. Tower, Bazullah Road T Nagar, Chennai - 600 017 Interested candidates can forward your CV to joshua@radiantcashlogistics.com and reach us at 9500020151 Please carry below mandatory documents: Updated Resume copy Copy of your Pan Card & Aadhar card 2 Passport size photos Educational documents: xerox copy of consolidated mark sheet/ provisional certificate Copy of experience / relieving certificate Last three months pay slip","location":"Chennai","experience":"0 - 2 Years"},{"date":"1, 2, 3 - Aug - 2019","skills":"Java, Hibernate, springs, MS SQL, Postgress, Oracle","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"AGS Transact Technologies Limited, AGS House, Plot No. EL- 82-83, TTC Industrial Area, Near Nelco, MIDC, Mahape, Navi Mumbai- 400 710.","phone":"Not Provided","profile":"Java Developer (Freshers) \nAGS Transact Technologies Limited","description":"Candidate should be BE/ B.Tech/ M.Tech or MCA with excellent knolwdge of Java, Hibernate, springs, MS SQL, Postgress, Oracle. Walk-in Date/ Time: 1st - 3rd August , 10 AM onwards Interview Venue: AGS Transact Technologies Limited AGS House, Plot No. EL- 82-83, TTC Industrial Area, Near Nelco, MIDC, Mahape, Navi Mumbai- 400 710.","location":"Mumbai","experience":"0 - 1 Years"}]}