{"Walkins":[{"date":"1, 2, 3 - Mar - 2021","skills":"HR Generalist Activities, Talent Management, Interviewing, Recruitment and Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"DTDC Regional Office, H No - 1-11-249/A, Opposite Pantaloons, Shyamlal Building, Begumpet, Hyderabad - 500 016.","phone":"Not Provided","profile":" Senior HR Executive \nDTDC Express Limited","description":"Candidate should have 2 to 7 years of experience in HR Generalist Activities, Talent Management, Interviewing, Recruitment and Talent Acquisition. Must have excellent communication skills. Job Responsibility- Responsible for handling recruitment and providing regional hiring support by connecting with internal stakeholders across teams Handling training for HR portal and providing relevant support for Regional employees of DTDC on a regular basis Handling internal recruitment communication (FACE) in the form of daily newsletters for internal stakeholders and franchisees Responsible for handling dashboards and critical trackers to ensure effective recruitment monitoring Providing hiring support to regional e-commerce operations (temporary staff), along with handling trackers and vendor communication for the same Enabling temporary and permanent identification and onboarding (complete end to end process) for external vendors Providing support for the Product management of the DTDC Careers Page, which includes being responsible for launch of new features and initiatives pertaining to that in the regions Providing support in handling other engagement activities across India, and monitoring small projects pertaining to the same Providing support for any other hiring/recruitment-related process or sub-process for teams across regions. Ensure timely closure of Leadership positions in the region by liaising with all stakeholders and senior leaders. Partner with regional souring platforms in order to hire all temporary and ground staffs in the regions. Ensure joining formalities and on boarding of hired employees on the HRMS platform Maintain Background verifications records and biometric mapping of all employees on the central platform. Support the Regional HR team with other HR related operations in the region. Walk-in Date/ Time: 1st March - 3rd March 2021, 10.00 AM - 4.00 PM Venue Details- DTDC Regional Office, H No - 1-11-249/A, Opposite Pantaloons, Shyamlal Building, Begumpet, Hyderabad - 500 016. Contact - Mohammed  ","location":"Hyderabad","experience":"2-7Years"},{"date":"1 - Mar - 2021","skills":"Inbound Process, Email Support, Customer Service, Customer Support","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Adecco India Private Limited, Summit B, 13th Floor, Brigade Metropolis, Whitefield Road City, Bangalore - 560 048.","phone":"7892003170","profile":" Customer Relations Executive \nAdecco India Private Limited","description":"Person would be required to maintain customer relationship by responding to inquiries; documenting actions within given timeframe and endorse the Adeccos brand name while servicing a hassle free associate employer interface Key Responsibilities- Determines requirements by working with associates Answers inquiries by clarifying desired information; researching, locating, and providing information. Resolves problems by clarifying issues; researching and exploring answers and alternative solutions; implementing solutions; escalating unresolved problems. Fulfils requests by clarifying desired information; completing transactions; forwarding requests. Maintains associate support centres database by entering information. Walk-in Date/ Time: 1st March 2021, 10.00 AM - 5.00 PM Venue Details- Adecco India Private Limited Summit B, 13th Floor, Brigade Metropolis, Whitefield Road City, Bangalore - 560 048. Contact Person- Nakul Pai (7892003170)  ","location":"Bangalore","experience":"0-3Years"},{"date":"1 - Mar - 2021","skills":"Education Counseling/ Career Counselling","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"SNVA Ventures Private Limited, SEO 75, Sector-15, Part 2, Urban Estate, Gurugram, Haryana","phone":"8447379398","profile":" Education/ Career Counselor \nSNVA Ventures Private Limited","description":"Candidate with good selling skills will be highly preferred. Job will involve taking follow-ups, explaining training to professionals etc. Relevant experience in the Education industry in a mandate Person must be good in convincing Good Spoken English Unlimited Incentive plan Immediate joiner Walk-in Date/ Time- 1st March 2021, 9.30 AM - 5.30 PM Venue Details- SNVA Ventures Private Limited SEO 75, Sector-15, Part 2, Urban Estate, Gurugram, Haryana Contact - HR Dept (8447379398)  ","location":"Gurgaon","experience":"2-4Years"},{"date":"1 - Mar - 2021","skills":"Customer Service, Calling, Data Verification","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"BANKSHALL STREET 2 FAIRLY PLACE BBD BAG KOLKATA - 700 001","phone":"7044833096","profile":" Back Office Executive \nKrishna Finance Company Private Limited","description":"Candidate should be Any Graduate with 0 to 1 year experience in Customer Service, Calling, Data Verification. Must have excellent communication skills Freshers can also apply Walk-in Date/ Time: 1st March 2021, Between 9.30 AM - 11.00 AM Venue Details- Krishna Finance Company Private Limited BANKSHALL STREET 2 FAIRLY PLACE BBD BAG KOLKATA - 700 001 Contact - BIPASA ( 7044833096 )  ","location":"Kolkata","experience":"0-1Years"},{"date":"1 - Mar - 2021","skills":"HR Intern, Sourcing, Apprenticeship Trainee","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Ample Technologies Private Limited, Ncc Urban - Windsor, 4th Floor, HAL Old Airport Road, Bengaluru, Karnataka - 560 064.","phone":"Not Provided","profile":" HR Executive/ Interns \nAmple Technologies Private Limited","description":"We are looking for 3 months HR interns. We provide HR internship certificate. The internship will not be paid. If you are interested please share your resume to ashwini.prasad@ample.co.in or Watsapp on 9686685448. Walk-in Date/ Time: 1st March 2021, 10.30 AM - 5.00 PM Venue Details- Ample Technologies Private Limited Ncc Urban - Windsor, 4th Floor, HAL Old Airport Road, Bengaluru, Karnataka - 560 064. Contact Person- Ashwini  ","location":"Bangalore","experience":"0-1Years"},{"date":"1, 2, 3 - Mar - 2021","skills":"HR/ Recruitment, Sourcing, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Uolo Edtech Private Limited, 91 Springboard, 5th Floor, Plot No. 145, Sector 44, Near Punjab and Sindh Bank, Gurgaon, Haryana - 122 002.","phone":"7060092639","profile":" HR Executive \nUolo Edtech Private Limited","description":"Uolo Edtech Private Limited is currently looking for HR Executive. Skills required: Partnering with team/ Function heads to determine staffing needs Screening resumes and conducting telephonic interviews with candidates Develop a pool of qualified candidates in advance of need Research and recommend new sources for active and passive candidate recruiting Walk-in Date/ Time: 1st March - 3rd March 2021, 10.00 AM - 6.30 PM Venue Details- Uolo Edtech Private Limited 91 Springboard, 5th Floor, Plot No. 145, Sector 44, Near Punjab and Sindh Bank, Gurgaon, Haryana - 122 002. Contact - Bharti Pundir (7060092639)  ","location":"Gurgaon","experience":"1-4Years"},{"date":"1, 2, 3, 4, 5, 6, 7 - Mar - 2021","skills":"Administration Management, Liaison, Personnel Management, Human Resource Management","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Bombay Intelligence Security India Pvt. Limited, BIS House, Plot No.507/10 Center Point, Near GIDC Police Station, GIDC, Ankleshwar, Bharuch, Gujarat - 393 002.","phone":"Not Provided","profile":" HR Officer - Personnel \nBombay Intelligence Security (India) Limited","description":"Candidate should have 2 to 5 years relevant work experience & knowledge of record keeping in respect of PF, ESIC, P.Tax, MLWF, Security Guard Board, HR Audit & Labour Act. Must be having excellent Laisoning with statutory authorities for successfully carrying out inspections and settlement of queries. Core Responsibilities:- Person would be mainly responsible for PF, ESIC, and other compliance Related matters.. To prepare the monthly PF statement, PF Challan & process the PF withdrawals. To prepare the remittance statement, submission of monthly & Annual return To maintain the Salary, Attendance, Deduction & OT Register To maintain the Form No. F & Process gratuity application form Managing & taking care of Shop & establishment compliance's as per the various Acts & maintaining register. Creates & execute administrative management work plans. Maintain & update all Personnel record time to time. Interested candidate can share there profile on ankleshwar@bombayintelligence.com/ hrd@bombayintelligence.com Or can walk in with updated CV from 1st to 7th March 2021, between 9.30 AM - 5.30 PM Venue Details- Bombay Intelligence Security India Pvt. Limited BIS House, Plot No.507/10 Center Point, Near GIDC Police Station, GIDC, Ankleshwar, Bharuch, Gujarat - 393 002. Contact Person- Amarjeet Singh  ","location":"Bharuch","experience":"2-5Years"},{"date":"1, 2, 3, 4, 5, 6, 7 - Mar - 2021","skills":"Customer Service, International Voice Process, Customer Care","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Colossal Infotech Private Limited, 11Th Floor, Suit - 1109. Godrej Genesis Building, EN - 34, EN Block, Sector - 5, Kolkata, West Bengal - 700091.","phone":"6289360825","profile":" Customer Support Executive \nColossal Infotech Private Limited","description":"Candidate should be Any Graduate with 0 to 3 years of experience in International voice process, solving customer queries over the phone, must be fluent in English. Walk-in Date/ Time: 1st - 7th March 2021, 3.30 PM - 6.30 PM Venue Details- Colossal Infotech Private Limited 11Th Floor, Suit - 1109. Godrej Genesis Building, EN - 34, EN Block, Sector - 5, Kolkata, West Bengal - 700091. Contact - Suchismita Das (6289360825)  ","location":"Kolkata","experience":"0-3Years"},{"date":"1, 2, 3, 4, 5, 6, 7 - Mar - 2021","skills":"Customer Support, Domestic/ Tele calling, Voice Process, Customer Handling","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Tech Mahindra Limited, Delta 1, 2nd floor, GIGA SPACE IT Park, Viman Nagar, Pune.","phone":"9096561522","profile":" Customer Support (Voice Process) \nTech Mahindra Limited","description":"Educational Qualification Required: Any Graduate Work Experience : Minimum 1 Year of Voice process Experience Skills Required : Good Communication skills and basic computer knowledge Shift- Day Shift (One Week off-rotational) Job Responsibility- 1) Voice process, professionally to provide information about products and services, take/cancel orders or obtain details of complaints. 2) Keep records of customer interactions, details of inquiries, complaints and comments as well as actions taken. 3) Follow up to ensure that appropriate actions were taken on customers' requests. 4) Refer unresolved customer grievances or special requests to designated departments for further investigation. Walk-in Date/ Time: 1st to 7th March 2021, 9.30 AM - 4.00 PM Venue Details- Tech Mahindra Limited, Delta 1, 2nd floor, GIGA SPACE IT Park, Viman Nagar, Pune. Contact Person : Nilesh: 9893224757 Shabana: 9096561522 Abhishek: 7066444670 Email : NV00703098@techmahindra.com (interested candidates can send their resume for Interview)  ","location":"Pune","experience":"1-3Years"},{"date":"1, 2, 3, 4, 5, 6, 7 - Mar - 2021","skills":"Customer Support, Customer Service, Customer Care, Email Process, Chat Process","qualification":"Diploma, B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"[24]7 Customer Private Limited, Prestige Tech Platina, Kadubeesanahalli, Marathahalli Outer Ring Road, Bangalore - 560 087.","phone":"Not Provided","profile":" Customer Support Executive \n[24]7 Customer Private Limited","description":"[24]7 Customer Private Limited is hiring Customer Support Executive for International Voice and Non Voice Process at Bangalore. Qualifications: PUC (12th)/ Diploma/ Undergraduates/ BE/ B.Tech and Graduates from any stream are eligible to apply. Freshers & candidates with prior relevant (BPO) and non-relevant (other domain) experience are eligible to apply. Master Graduates should have at least 1 year experience in BPO sector. Required Skills- Excellent Verbal and Written Communication skills with 25 WPM/85% accuracy in Typing, Able to interact with customers via chat, should be able to answer servicing questions. Must have good logical reasoning & analytical skills, excellent customer service skills, Perks and Benefits- Salary Range : INR 2,50,000 - 3,50,000 P.A (13,000 - 19,000) Take Home Salary) Incentives Minimum of Rs.1400 eligible from 4th month onwards Broadband Reimbursement Rs.1300 (if own Broadband connection is chosen) Self to work (STW) Rs.2200 if choosing own mode of travel to work) Walk-in Date/ Time: 1st March - 7th March from 9.30 AM onwards Venue Details- [24]7 Customer Private Limited Prestige Tech Platina, Kadubeesanahalli, Marathahalli Outer Ring Road, Bangalore - 560 087.  ","location":"Bangalore","experience":"0-3Years"},{"date":"1, 2 - Mar - 2021","skills":"Java/ J2Ee, Spring, Hibernate, Multithreading, Collections","qualification":"Diploma, B.A., B.Com, B.B.A, B.Sc","address":"Zebronics India Private Limited, No. 118 Ponnamallee High Road, Vepery, Chennai - 60084","phone":"Not Provided","profile":" Front Office Executive (Female) \nZebronics India Private Limited","description":"We are looking for Receptionist / Front Office Executive Educational Qualification: Any Graduate/ Diploma Work Experience: 0 to 3 Years Age: Below 35 Years Languages: English, Tamil & Hindi (Preferred) Location: Chennai (residing close to office) Salary: Best In Industry Fluency & Communication skills in English & Hindi Must. Female candidate preferred. Immediate joiners only will be considered. Duties & Responsibilities- Responsible for attending all the incoming calls, responding to them and transferring the call to the appropriate department. Responsible for greeting the visitors at the office, registering their names and contact details. Providing assistance to the heads in the administration department Responsible for supervising the housekeeping department and ensuring that all the items are there in the stock Walk-in Date/ Time: 1st March - 2nd March 2021, 9 AM onwards Venue Details- Zebronics India Private Limited No. 118 Ponnamallee High Road, Vepery, Chennai - 60084 Landmark: Opposite to Sudha Hotel Contact - Khushboo / Ashwini  ","location":"Chennai","experience":"0-3Years"},{"date":"1, 2, 3, 4, 5 - Mar - 2021","skills":"Core Java, J2EE, Angular JS, HTML5, Spring, SQL and Database","qualification":"B.E./B.Tech, M.Tech","address":"Vertilink Technologies, 203, 3RD Floor, Moghal Emami Mansion, Opposite Shadan College, Khairtabad, Hyderabad, Telangana - 500 004.","phone":"9581022022","profile":" Software Developers (Java/ Python) \nVertilink Technologies","description":"We have multiple openings for Training and Development. JAVA DEVELOPER Candidate must have strong knowledge in Core Java and J2EE Strong knowledge of Database and SQL Knowledge of Angular JS, HTML5, Spring PYTHON DEVELOPER Candidate must have strong knowledge in Python Programming Strong knowledge in Algorithm Development, R-Language, Anaconda, Python 3.0 and 2.7, Must Knowledge in Deep Learning (TensorFlow), Keres, OpenCV, SKLearn, DJango Knowledge of Artificial Intelligence, Machine Learning, and Other Classification based concepts EMBEDDED DEVELOPER Hands-on development experience of Hardware Based Design using MCU (89S52, 89C52), PIC Controller, Arduino UNO, Arduino Mega, ARM Controller. Added knowledge of working with Raspberry Pi. Knowledge of Sensors, Development Boards, Windows/ Linux OS. Professional Requirements: Need for Development and Training A strong desire to collaborate and work within a team. Ability to define requirements and work in a concept-to-design model Good Communication & Interpersonal Skills. Qualification: BE/ B.Tech, ME/ M.Tech Work Experience: 0 to 3 Years Job Location: Hyderabad If interested, Please apply with your Updated profile & the below mentioned details to info@vertilinktech.com Name: Mail-ID: Phone No: Current Organization: Current CTC: Expected CTC: Mail ID:  ","location":"Hyderabad","experience":"0-3Years"},{"date":"27 - Feb - 2021","skills":"Demat Account Opening, Broking, Banking, Third Party Products","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"SBICAP Securities Limited, C/o Seva Sadan Branch, C.A. Road, Nagpur- 440 013.","phone":"Not Provided","profile":" Relationship Officer- Demat \nSBICAP Securities Limited","description":"We have job opening for Relationship Officer- Demat with SBICAP Securities Limited Candidate should be Any Graduate/ Post Graduate with 0 to 2 years of experience in Demat Account Opening, Broking, Banking, Third Party Products. Must have excellent communication skills. Freshers can also apply Job Responsibility- To source the business via allotted bank branches. Key focus areas Acquiring broking clients (primarily on line) Activating clients for trading post acquisition Greet and Re-direct customers to the appropriate counters based on their service needs Providing clients with Demo & handhold to initiate trading activities after account opening. Maintain a list of FAQ by customers and proactively seek clarification Promote Demat & Trading account. Selling of third party products. Walk-in Date/ Time: 27th February 2021, 10.30 AM - 3.30 PM Venue Details- SBICAP Securities Limited C/o Seva Sadan Branch, C.A. Road, Nagpur- 440 013. Contact - Nikhil Agarwal  ","location":"Nagpur","experience":"0-2Years"},{"date":"27 - Feb - 2021","skills":"Government Liaisoning, Real Estate Conveyance & Redevelopment","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Accord Selection Services, 402, 4th Floor, Centre Square, Opp. Bharat Petrol Pump, S.V. Road, Near Station, Andheri (West), Mumbai - 58","phone":"022-40144716","profile":" Liaisoning Assistant \nAccord Selection Services","description":"Candidate should be Any Graduate with 1 year experience as a Liaisoning Assistant Knowledge of Real Estate Conveyance & Redevelopment Must have good communication skills in English Knowledge of Marathi must Field Job - Visiting Govt. Offices Place of work- Andheri West - Near Station Salary- Rs. 12000 per month Candidates staying between Khar to Malad will be preferred Walk-in Date/ Time: 27th February 2021, 11.00 AM - 4.00 PM Venue Details- Accord Selection Services 402, 4th Floor, Centre Square, Opp. Bharat Petrol Pump, S.V. Road, Near Station, Andheri (West), Mumbai - 58 Tel no. : 40144716 / 26283616 / 26287682  ","location":"Mumbai","experience":"1-2Years"},{"date":"27 - Feb - 2021","skills":"BPO Recruitment, Bulk Hiring","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Policybazaar Insurance Brokers Pvt. Limited, Policy Bazaar, Plot 110 Sector 44, Gurgaon, Haryana. Landmark: Near Ramada Hotel","phone":"Not Provided","profile":" HR Recruiter/ Executive \nPolicybazaar Insurance Brokers Pvt. Limited","description":"Candidate should be Any Graduate/ HR with minimum 1 year of experience in BPO Recruitment, Bulk Hiring. Must have excellent communication skills. What do we offer? Amazing work culture Complete Day shift 6 Days working Shift Timing - 10:00 AM to 07:00 PM Job Responsibilities- To achieve the target assigned within agreed quality & timelines. Independently manage recruitment for all positions across all verticals. Co-ordinate / liaison with placement consultants / institutions etc. Conducting skill testing & interviews Planning & Sourcing for specific recruitment within defined time frames Ensuring that documentation and salary fitment is as per agreed guidelines, to maintain Green status in compliance front Contribute to creating an organizational image, which would help in attracting and recruiting the best talent Seek to expand the talent pool by evaluating new employee profiles and assess their suitability Stakeholder management Walk-in Date/ Time: 27th February 2021, 11.00 AM - 4.00 PM Venue Details- Policybazaar Insurance Brokers Pvt. Limited Policy Bazaar, Plot 110 Sector 44, Gurgaon, Haryana Landmark: Near Ramada Hotel  ","location":"Gurgaon","experience":"1-3Years"},{"date":"26 - Feb - 2021","skills":"Recruitment, Talent Acquisition, Talent Engagement, Mass Recruitment/ Hiring","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Symmetrical Global Search Private Limited, 69/ 375, VT Road, Mansarovar, Jaipur - 302 020","phone":"9928177444","profile":" Recruitment Executive \nSymmetrical Global Search Private Limited","description":"We have Urgent Opening for IT Recruiter/ Executive role for Jaipur Experience: 0 to 2 Years Working Day: 5 Days in a week Salary: Best in industry Candidate must have strong knowledge on End to End recruitment. Should have excellent communication skills. Preferable in IT/ ITE recruitment. MS office exposure required. Freshers can also apply. Walk-in Date/ Time: 26 February , 11.00 AM - 5.30 PM Venue Details- Symmetrical Global Search Private Limited 69/ 375, VT Road, Mansarovar, Jaipur - 302 020 Contact - Divya Sharma (M) +91 9928177444  ","location":"Jaipur","experience":"0-2Years"},{"date":"26 - Feb - 2021","skills":"IT Recruitment, Screening, Induction, Selection, Hiring, Mass Mailing","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Mounttalent Consulting Private Limited, A-51, Block A, A Block, Sector 16, Noida, Uttar Pradesh - 201 301.","phone":"7042562227","profile":" IT Recruiter \nMounttalent Consulting Private Limited","description":"We are looking for an IT Recruiter to join our HR department and help us grow our IT teams. Looking for Immediate Joiner to 15 days Work Experience 1-6 Years Job Responsibilities- Handling end-to-end recruitment for both fresher and laterals. Should have a very good understanding of IT requirements. Ability to communicate and to convince people for the rights cause. Source and recruit appropriate candidates by using databases, social media, etc by understanding the nature and importance of the requirement. Source passive candidates through a cold call, scheduling. Screen candidate's resume and job applications. Handholding the candidates till they join. Ability to work both independently and within a team environment, with focus and high attention to detail. Walk-in Date/ Time: 26th February 2021, 9.30 AM - 7.30 PM Venue Details- Mounttalent Consulting Private Limited A-51, Block A, A Block, Sector 16, Noida, Uttar Pradesh - 201 301. Contact - Rahul ( 7042562227 )  ","location":"Noida","experience":"1-6Years"},{"date":"26 - Feb - 2021","skills":"HR/ Recruitment, Screening, Interview Scheduling, Sourcing, Mass Hiring","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"SpiceJet Limited Building no. 321, Udyog Vihar, Phase 4, Gurgaon, Haryana - 120 016","phone":"Not Provided","profile":" HR Executive (Female Only) \nSpiceJet Limited","description":"We are conducting walk-in interviews for the position of Executive in Human Resources Department (Female Candidates Only) on 26th Feb'21 from 10:00 am till 11:00 am (Friday). Educational Qualification: MBA(HR) Work Experience : 0 - 2 Years Location: Gurugram Job Responsibilities: Screening and shortlisting of CVs Scheduling candidates for interviews Conducting and managing walk in interviews Conducting interviews Posting vacancies on job portal Coordinating with vendors/candidate for premedicals Coordinating with department manager on interviews Travelling to other location for interviews Maintaining MIS Daily task assigned Requirements: Excellent written and verbal communication skills Excellent in MS Excel Ability to Multi task Willing to travel Pan India Kindly report at the below mentioned address and do carry a copy of below listed documents: Dress Code - Formals Walk-in Date - 26th Feburary 2021 (Friday) Timing -10 am to 11 am Venue Details- SpiceJet Limited Plot No. 321, Udyog Vihar, Phase-4 Gurugram, Haryana - 122 016  ","location":"Gurgaon","experience":"0-2Years"},{"date":"26 - Feb - 2021","skills":"HR Operations, Recruitment","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"I-Process Service India Private Limited Plot 313, 1st Floor Udyog Vihar Phase 4, Gurgaon, Haryana","phone":"8295063319","profile":" HR Executive \nI-Process Service India Private Limited","description":"We are looking for Recruitment Specialist for an organization based out of Delhi/ NCR. Candidate should be Graduate with 1 year experience in HR Domain Can join on immediate basis. Basic excel knowledge Interested candidates can walk-in at our Office with updated resume or mail us your resume at undersign Address: I-Process Service India Private Limited Plot 313, 1st Floor Udyog Vihar Phase 4, Gurgaon, Haryana Contact Person: Himanshu Gosain / 8295063319 Email id: himanshu.gosain@iprocess.in Walk-in Date/ Time: 26 February 2021, 10.00 AM - 2.00 PM  ","location":"Gurgaon","experience":"2-4Years"},{"date":"26 - Feb - 2021","skills":"Front Office, Email Writing, Office Administration, E-Tendering","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"GeneX India Bioscience Private Limited, No.7, Shanti Street, Dr. Seethapathy Nagar, Velachery, Chennai - 600 042.","phone":"Not Provided","profile":" Front Office Executive \nGeneX India Bioscience Private Limited","description":"Education or Equivalence of Experience Any Diploma, Bachelor's Degree or Master's degree. Fresher or Minimum of 2 - 4 years experience. Experience in sending quotes using Excel Strong knowledge in Email communication. Other Attributes: Strong communication skills with Fluency in speaking English Excellent presentation and troubleshooting skills Efficient work organizational skills Any other official task as & when required. Team player Job Responsibilities: Preparing price quotations and replying to customers requirement. Registering and Applying Govt. Tenders (Online) Check, sort and forward emails Coordinating with sales team Answer all incoming calls & queries and redirect them or keep messages Keep updated records and files Walk-in Date/ Time: 26th February 2021, 10.30 AM - 5.30 PM Venue Details- GeneX India Bioscience Private Limited, No.7, Shanti Street, Dr. Seethapathy Nagar, Velachery, Chennai - 600 042. Contact - Rozario Prashanth ( 9600040288 )  ","location":"Chennai","experience":"0-4Years"},{"date":"26 - Feb - 2021","skills":"Customer Support, Inbound Process, Customer Service, Customer Care, Voice Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Zoom ID - 6370393166","phone":"Not Provided","profile":" Email/ Voice/ Chat - Process Associate \nLenskart Solutions Private Limited","description":"Lenskart Solutions Private Limited is Hiring Freshers and Experienced for below processes : Voice Process Email Process Chat Process Social Media Process Job Responsibilities: Manage large amounts customer queries and in a timely manner Follow communication scripts when handling different topics. Identify customers needs, clarify information, research every issue and provide solutions and/or alternatives. Build sustainable relationships and engage customers by taking the extra mile. Keep records of all conversations in our call center database in a comprehensible way. Meet personal/team qualitative and quantitative targets Requirements : Must Have Laptop/ Desktop and Wifi . Should be comfortable to travel/ relocate to Gurgaon Must have good communication skills Walk-in Date: 26th February 2021, Friday Time : 10:30 AM Venue : Zoom ID - 6370393166  ","location":"Gurgaon","experience":"1-5Years"},{"date":"2, 3, 4 - Mar - 2021","skills":"Java, Core Java, Hibernate, Spring, etc","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Realcoderz Technologies Private Limited, 815, Tower 2, Plot No 22, Assotech Business Cresterra, Sector 135, Noida, Uttar Pradesh - 201 305","phone":"9675424343","profile":" Junior Java Developer \nRealCoderZ Technologies Pvt. Limited","description":"Candidate should be BE/ B.Tech or MCA with 0 to 3 years experience in Software Development using Java, Core Java, Hibernate, Spring, etc. Must have excellent communication skills. Job Responsibilities- Software Development, Analysis, Architecture. Project scrum, agile activities. Participating, Leading and engaging with team of Junior Developers Attending & conducting training & promotional activities. Active participation in all company's events. Walk-in Date/ Time: 2nd - 4th March 2021, 10.00 AM - 4.00 PM Venue Details- Realcoderz Technologies Private Limited 815, Tower 2, Plot No 22, Assotech Business Cresterra, Sector 135, Noida, Uttar Pradesh - 201 305 Contact - Mansi Tripathi (9675424343)  ","location":"Noida","experience":"0-3Years"},{"date":"27 - Feb - 2021","skills":"Java, Java Script, HTML5, CSS, AngularJS, React JS, jQuery or Backbone JS","qualification":"B.E./B.Tech, MCA/PGDCA","address":"SHARDA CENTRE, SHARDA CENTRE, OFF KARVE ROAD, ERANDWANA, PUNE","phone":"Not Provided","profile":" Core Java Developers \nTech Mahindra Limited","description":"Candidate should have a minimum of 3 to 8 years\u0092 experience as a developer with deep and thorough knowledge on Core JAVA. At least 2-years\u0092 experience in front-end technologies such as Java Script, HTML5, CSS Expertise in JavaScript frameworks like AngularJS, React JS, etc. Expertise in writing unit test cases using tools like JUnit Familiarity with libraries like jQuery or Backbone JS. Front end frameworks like Foundation or Bootstrap Expertise in SQL / database technologies like MySQL, Oracle, PostgreSQL, and MongoDB. Expertise in Web server technologies like Node.js, J2EE, Apache, Nginx, ISS, etc. Proficient in API design and development, RESTful services, Swagger Know-how of object-oriented programming concepts Knowledge and understanding of design principles behind building a scalable application Proficient understanding of code versioning tools such as Git Familiarity with JIRA/ JQL is an added advantage Being able to work and contribute in Agile/ scrum way of working Excellent team player with good social and communicative skills Being able to think as the end user and having customer focus Having an experience working in international teams with varied cultures Excellent problem solving/ troubleshooting skills Being able to translate business requirements into technical specifications and solutions Excellent team player with good social and communicative skills Flexible and committed to work. No 9-5 mentality and prepared to go for the extra mile when needed Experience and knowledge of SDLC. Date of Interview \u0096 27th Feb 2021 (10 am to 6 PM) Venue: Tech Mahindra Limited SHARDA CENTRE, SHARDA CENTRE, OFF KARVE ROAD, ERANDWANA, PUNE  ","location":"Bangalore, Pune","experience":"3-8Years"},{"date":"24 - Feb - 2021","skills":"HR/ Recruitment, Attendance/ Screening, Joining Formalities","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"SBICAP Securities Limited, 502, 5th Floor, Ishant Arcade-2, Opposite Gaodevi Temple, Gokhale Road, Thane (West) - 421 601","phone":"Not Provided","profile":" HR/ Recruitment Officer \nSBICAP Securities Limited","description":"Person will be Responsible in managing onboarding for Employees involving pre-joining and post joining formalities for regional hiring Document Checking. Handle joining formalities and documentation of new joinees MIS - Maintaining database Coordination with regional HR for data Recruitment Eligibility/ Qualification:- Graduation & Any Master degree Must know the English, Hindi & Local language Candidates with minimum one year experience in HR Vertical. Walk-in Date: 24th February 2021 Time: 10.00 AM - 5.00 PM Venue Details- SBICAP Securities Limited, 502, 5th Floor, Ishant Arcade-2, Opposite Gaodevi Temple, Gokhale Road, Thane (West) - 421 601 Contact Person - Gladisa Dmello  ","location":"Mumbai","experience":"1-5Years"},{"date":"23 - Feb - 2021","skills":"MIS, Documentation, Credit Risk, Advanced Excel","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Aavas Financiers Limited, 301 & 305, REGENT SQUARE, ABOVE D-MART, ADAJAN, SURAT - 395 009, GUJARAT","phone":"Not Provided","profile":" Credit Risk Executive \nAavas Financiers Limited","description":"Candidate must have good knowledge of MS Excel Should have good communication skills Must have basic knowledge about loan processing Good communication & presentation skills Interested candidates can share their CV on ritika.kaul@aavas.in or can directly go for Walk-In interview at mentioned address. Walk-in Date/ Time: 23rd February 2021, 10.00 AM - 5.00 PM Venue Details- Aavas Financiers Limited 301 & 305, REGENT SQUARE, ABOVE D-MART, ADAJAN, SURAT - 395 009, GUJARAT. Job Location: Surat - Adajan Contact Person at Branch: Krishnakumar Singh * Local male candidates should apply & kindly mention 'Credit Risk' on the top of your CV.  ","location":"Surat","experience":"0-4Years"},{"date":"23 - Feb - 2021","skills":"HR/ Recruitment, Human Resource Management","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Tech Mahindra Limited, DLF 2, Tower B, 3rd Floor, Rajarhat New Town, Kolkata - 700 156.","phone":"Not Provided","profile":" Management Trainee - HR Internship \nTech Mahindra Limited","description":"We are glad to inform you that we are offering you a great exposure to get hands on experience with HR team from a multinational organization. Mandatory Criteria- MBA (HR) Must have excellent verbal English & Hindi communication skill Should have a decent knowledge of MS office. Other requirement- People Management Ready to work in in a 9 HR shift in between 8 am to 8 pm No planned leave for upcoming 3 months after joining 9 hour of the day, 8 hrs. work and 1-hour break Walk-in Date/ Time: 23rd February 2021, 11.00 AM - 3.00 PM Venue Details- Tech Mahindra Limited DLF 2, Tower B, 3rd Floor, Rajarhat New Town, Kolkata - 700 156. Documents Required Education Mark sheet Aadhar Card Pan Card  ","location":"Kolkata","experience":"0-1Years"},{"date":"23 - Feb - 2021","skills":"Backend, Back Office Activities, Non Voice Process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Service 1st BPM Private Limited, 4th floor, Ag Trade Center, Ramnagar, Pune. Near Bavdhan Police Station, Bavdhan","phone":"9075448989","profile":" Back Office Executive \nService 1st BPM Private Limited","description":"We have an opening for Back office Executive with Usource Data Service LLP at Bavdhan Eligibility- Any Graduate/ Fresher with Typing speed of 27-30 WPM Must have good understanding of English language Not consider appearing candidates Walk-in Date/ Time: 23rd February 2021, 11.30 AM - 5.00 PM Venue Details- Service 1st BPM Private Limited 4th floor, Ag Trade Center, Ramnagar, Pune. Near Bavdhan Police Station, Bavdhan Contact - Jayashree (9075448989)  ","location":"Pune","experience":"0-1Years"},{"date":"23 - Feb - 2021","skills":"Induction Program, Joining Formalities, Attendance Management, Exit Formalities, Leave Management","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Rudrabhishek Enterprises Limited, A-6, Sector-58, Noida - 201 301","phone":"Not Provided","profile":" HR-Operations Executive \nRudrabhishek Enterprises Limited","description":"Candidate should have 2 to 3 years of hands on experience in documentation, leave attendance management & other operational work. HR Software knowledge. Must have excellent written and verbal communication skills. *Only those candidates are welcomed who have 2-3 years of experience in operations Walk-in Date/ Time: 23rd February 2021, 2.00 PM - 5.00 PM Venue Details- Rudrabhishek Enterprises Limited A-6, Sector-58, Noida - 201 301 Contact Person- Seema Pathak  ","location":"Noida","experience":"2-3Years"},{"date":"23 - Feb - 2021","skills":"Non IT Recruitment, Volume Hiring, Talent Acquisition, Mass Recruitment","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"1mg Technologies Private Limited, 5th Floor, Tower B, Presidency Building, Sector 14, Gurgaon.","phone":"Not Provided","profile":" HR Recruiter (Contractual) \n1mg Technologies Private Limited","description":"You are cordially invited for a face to face interaction. Below are the details : Date : 22nd Feb, 2021 - 23rd Feb,2021 Time: 12:00 pm - 3:00 PM Venue Details- 1mg Technologies Private Limited 5th Floor, Tower B, Presidency Building, Sector 14, Gurgaon. Near Kalyani Hospital Nearest Metro: MG Road Contact Person : Shalini Thakur Work Experience: 1 to 6 Years  ","location":"Gurgaon","experience":"1-6Years"},{"date":"22, 23, 24, 25, 26, 27 - Feb - 2021","skills":"Procurement/ Purchase, Import, Supply Chain Management, Logistics Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Himalayan Solar Private Limited, Plot No. 237, HSIIDC, Industrial Estate, Alipur, Barwala, Dist. Panchkula, Haryana- 134 118.","phone":"Not Provided","profile":" Purchase Executive \nHimalayan Solar Private Limited","description":"Looking for a Purchase Executive with Min 2.5 years of experience in the same field. Fresher with Extreme Sincerity and a sense of Responsibility is allowed. Purchase and Procurement of Material. Supply Chain Management. Coordination of Custom Clearance of Imported Material The candidate should be able to work under pressure. Roles & Responsibilities- Evaluate vendor quotations to ensure that they are in line with the technical and commercial specifications required. Job Benefits & Perks The vast scope of Knowledge enhancement Walk-in Date/ Time 22nd February - 3rd March 2021, 10.00 AM - 5.00 PM Venue Details- Himalayan Solar Private Limited, Plot No. 237, HSIIDC, Industrial Estate, Alipur, Barwala, Dist. Panchkula, Haryana- 134 118. Contact - Sakshi Sharma (8295867546)  ","location":"Others","experience":"2-5Years"},{"date":"22, 23, 24, 25, 26, 27 - Feb - 2021","skills":"Admission Counselling, Student Counselling, Education/ Career Counselling","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Technoscripts, Office No. 86 To 89, Fifth Floor, C Wing Shrinath Plaza, Dyaneshwar Paduka Chowk, FC Road, Shivaji Nagar, Pune","phone":"7058132562","profile":" Education Counsellor \nTechnoscripts","description":"Candidate should be Any Graduate with excellent communication skills. someone who is sincere, honest and capable of handling work pressure Should be target oriented and enthusiastic towards the role Should be excellent in Communication and Soft Spoken Must Have Pleasing Personality , Roles & Responsibilities- Communication & Follow up on leads generated through various sources. Explain courses offered to the prospective enquiries through phone calls, emails and face to face meetings. Counselling students about training programs offered . Maintain regular communication with students, coordinating for admission activities and resolving problems. Maintaining proper records and daily, weekly and monthly status reporting to the management Experience: 1 to 5 years (Freshers with excellent skills can be considered) Job Location: FC Road, Pune. Perks and Benefits: Attractive salary will be provided. Good incentives offered depend on work performance. Walk-in Date/ Time: 20th February - 1st March 2021, 10.00 AM - 2.00 PM Venue Details- Technoscripts Office No. 86 To 89, Fifth Floor, C Wing Shrinath Plaza, Dyaneshwar Paduka Chowk, FC Road, Shivaji Nagar, Pune Contact - HR ( 7058132562 )  ","location":"Pune","experience":"0-5Years"},{"date":"22, 23, 24, 25, 26 - Feb - 2021","skills":"HR Administration/ HR Functions, Office Administration","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"People Prime Worldwide Private Limited, 2nd Floor, Above Bank of India, Plot No. 138, HIG, KPHB Phase 6, Kukatpally, Hyderabad - 500 072.","phone":"040-47842240","profile":" HR Recruiter/ Executive \nPeople Prime Worldwide Private Limited","description":"We at People Prime Worldwide Private Limited are Looking for HR Recruiter/ Executive Work Experience :- 0- 1 Years Job Location :- Hyderabad Responsibility: The recruiting, interviewing, and screening responsibilities of HR recruiters can be further broken down by daily responsibilities, which include: Partnering with hiring managers to determine staffing needs. Screening resumes on Job Portals Performing phone interviews with candidates Administering appropriate company assessments Performing reference and background checks Making recommendations to company hiring managers Coordinating interviews with the hiring managers Following up on the interview process status Maintaining relationships both internally and candidates to ensure staffing goals are achieved Communicating employer information and benefits during screening process Completing timely reports on employment activity Job location: KPHB, Kukatpally Interested candidates can walk-in to below address with 1 copy of resume between Monday to Friday (9.30 AM - 5.30 PM) Or Share your resume on anusha.g@people-prime.com Venue Details- People Prime Worldwide Private Limited 2nd Floor, Above Bank of India, Plot No. 138, HIG, KPHB Phase 6, Kukatpally, Hyderabad - 500 072. Point of Contact: Anusha. G Tel- 040-47842240  ","location":"Hyderabad","experience":"0-1Years"},{"date":"20 - Feb - 2021","skills":"Back Office Operations, Non- Voice Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Log in to Zoom with below meeting details: Meeting ID: 938 6373 9844 Passcode: EHJdv3","phone":"Not Provided","profile":" Backend Process Associates \nCongruent Solutions Private Limited","description":"Students from B.Com, BSc Maths, Engineering & any other allied courses that has Maths subject with >65% in academics & without any standing arrears. Excellent in aptitude Algorithm, logical reasoning. Good in Maths & Accounts with good communication & MS office skills. Self-traits like dependability, dedication and discipline should be highly innate. Passion to enter KPO - need to have ability to adapt to perpetual changes in KPO sector. Should be flexible for shifts & timings based on business needs. Role:- Designation:- Trainee Process Associate Area/ Industry:- KPO CTC 2L to 3 L; based on competency of the student. Negotiable for deserving candidates; Job Profile: US retirement pension plan process - a niche process (Non- Voice) in India that has high scope of career development. Congruent is the CORE provider in this Retirement domain. Involves series of steps in processing the plans. Error free processing of the plans. Involves high level of concentration and flair for math & numbers. Interview Levels:- 1. Aptitude (Zoom Application) 2. Technical Discussion - Video Call Interview Details - Virtual Walk- in: Date: 20th February, 2021 Time: 05:00 PM India Log in to Zoom with below meeting details: Meeting ID: 938 6373 9844 Passcode: EHJdv3 NOTE: Engineering candidates interested to work in KPO/ BPO sector can apply. This is not a IT job. Only immediate joiners should apply for this job , who is ready to relocate to Chen  ","location":"Chennai","experience":"0-1Years"},{"date":"20 - Feb - 2021","skills":"Good communication and pleasing personality.","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"HDB Financial Services Limited, 1st Floor, Wilson House, Near Amboli Subway, Andheri (East), Mumbai","phone":"Not Provided","profile":" Collection Associate & Collection Officer \nHDB Financial Services Limited","description":"We have arranged Walk in Interview for Collection Associate & Collection Officer - Flows on 20th February' 2021 between 10:00 AM to 4:00 PM on below Locations. Location :- MUMBAI (Central, Western & Harbor Line) Contact Person :- Mr. Dinesh Nalawade & Mr. Mansoor Golandhaj Address :- HDB Financial Services Limited 1st Floor, Wilson House, Near Amboli Subway, Andheri (East), Mumbai Location :- PUNE Contact Person :- Mr. Nilesh Naik Address :- HDB Financial Services Limited 3rd & 4th Floor, Geetai Sankul, Sqare Gurha Slathia, Ideal Colony, Paud Road, Kothrud, Pune. Candidate should be Any Graduate with 2 to 4 years experience in Collection Must have good communication and pleasing personality. High level of Self Drive/ Enthusiasm. Males candidates only & Two wheeler Compulsory Key Responsibility: Taking care of collection and recovery in Lending portfolio. Handling individual Collection portfolio. Updating visit trails and money collection details on Mobile App. 100% visit on all cases and tracking asset utilization and availability. Managing daily and weekly targets as to facilitate the monthly targets. Ensuring adherence to processes, compliance and audit related activities. No delay in deposition. Responsible for collection efficiency on timely manner. Responsible for Effective Cost Management. Understanding & Managing Healthy Portfolio.  ","location":"Pune, Mumbai","experience":"2-4Years"},{"date":"20 - Feb - 2021","skills":"Back Office Operations, Chat Process/ Email Support","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Tech Mahindra Limited, 2nd Floor Delta One Giga Space IT Park Internal Road Viman Nagar Pune Maharashtra - 411014","phone":"9096561522","profile":" Backend Executive/ Email Support \nTech Mahindra Limited","description":"The primary responsibilities of a Customer Service specialist would be: Handling escalations and complex queries. Manage large amounts of emails & chats Answer calls professionally to provide information about products and services, take/ or obtain details of complaints. Identify and assess customers needs to achieve satisfaction Build sustainable relationships and trust with customer accounts through open and interactive communication Minimum Qualification- Any Graduation Work Experience- Minimum 1 years Age criteria - 18 to 35 max Key skills Required: Proven customer support experience or experience as a client service representative Excellent English communications skills Ability to listen and active problem solving skills Good interpersonal skills Ability to handle pressure Ability to multi-task, prioritize, and manage time effectively Walk-in- from Monday to Saturday Time - 11am - 4pm Address - Tech Mahindra Limited 2nd Floor Delta One Giga Space IT Park Internal Road Viman Nagar Pune Maharashtra - 411 014. Contact Shabana Mulla - +91 9096561522 (Call/ WhatsApp) Email ID- SM00719332@techmahindra.com Mention 'Shabana' on top of the resume  ","location":"Pune","experience":"1-5Years"},{"date":"22, 23, 24, 25, 26 - Feb - 2021","skills":"Technical Support, Customer Support, Technical Process, Troubleshooting","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Accel Limited, SFI Complex, 3rd Floor, 178, Valluvar Kottam High Road, Nungambakkam, Chennai, Tamil Nadu - 600 034.","phone":"8939333599","profile":" Technical Support Associate \nAccel Limited","description":"Answering phone calls, Email Ticket Responses as per the defined TAT Level 1 Diagnosis through phone or remote tools. To resolve technical issues reported by the customers Diagnoses hardware and operating system problems over the phone/ Remote Troubleshoot technical issues related to OS, H/W and N/W technologies Delight customers by resolving the problems on the same call and seek closure confirmation of the case from the customer. Follow step-by-step troubleshooting approach in order to resolve the issue from the root level Logging customer complaints and resolution details in the CRM tool Give all the best possible options to the customers in case looking for assistance on a 3rd party issue or OOS product Document case information. Demonstrate commitment to client/ customer satisfaction Enhance the technical and process skills by undergoing training programs Implement the training inputs accordingly Key Requirements: Preferably English and Hindi Speaking, Added advance if knows any regional language. Having Logical approach and willingness to learn Experience: 1 year+ CTC Max 1,92,500 Shift timing (Male \u0096 9am to 6pm & 12 noon to 9 pm) (Female only 9 am to 6 pm) 2nd and 4th Saturday and All Sunday\u0092s Leave NOTE: Hindi and English communication Mandatory Walk-in Date/ Time: 22nd - 26th February 2021, 10.30 AM - 5.00 PM Venue Details- Accel Limited SFI Complex, 3rd Floor, 178, Valluvar Kottam High Road, Nungambakkam, Chennai, Tamil Nadu - 600 034. Contact - Katheeja (8939333599)  ","location":"Chennai","experience":"1-4Years"},{"date":"20 - Feb - 2021","skills":"Technical Support, Customer Support, Troubleshooting","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Arun Oil Trade, No.53, Rajasekaran Street, R K Salai, Mylapore, Chennai - 600004","phone":"7397481722","profile":" Technical Support Executive \nArun Oil Trade","description":"We are a leading edible oil manufacturing company based in Southern India and are looking at hiring Technical Support Executive for Chennai Corporate Office. Candidate should be Any Graduate with 3 to 5 years of work experience in Technical Support (Preferably from FMCG/ Manufacturing industries). Must have good knowledge in trouble shooting with basic knowledge in SQL and Basic Sales Knowledge. Must be proficient in Tamil & English Interested candidates are advised to appear for walk-in interview with their CV's & 3 passport size photo to below venue: Arun Oil Trade No.53, Rajasekaran Street, R K Salai, Mylapore, Chennai - 600004 Date & Timings: 20th Feb 2021 - 10 AM to 12 PM Contact Person- C Senthilkumar (7397481722) Email -hrarunoiltrade@gmail.com  ","location":"Chennai","experience":"3-5Years"},{"date":"22, 23, 24 - Feb - 2021","skills":"Customer Support, Technical Support, Domestic BPO/ Voice Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Allsec Technologies Limited, 46 C, Velachery Main Road, Velachery, Chennai- 42. (Next to Velachery EB Office)","phone":"Not Provided","profile":" Technical Support Associate \nAll Sec Technologies Limited","description":"We are hiring for Tamil Technical Support for Day shift at All Sec Technologies Limited in Chennai. Candidate should have proper graduation without any standing Arrears will be consider. Direct Work No Work from Home. Candidates should have good communication skill in English. Should be Fluent Tamil communication language Interacting with Clients/ Customers - Over Call. Understanding the queries. Resolving the queries. Education - Graduation Must (2017, 2018, 2019 and 2020 Fresher's can also apply). Fresher's & Experienced can apply. Age Criteria: 20 - 27 Years Perks and Benefits : Salary + Incentives. Interested candidate kindly come for Direct face to face interview with updated Resume. Walk-in Date/ Time: 22nd February - 24th February from 10 AM onwards Venue Details- Allsec Technologies Limited, 46 C, Velachery Main Road, Velachery, Chennai- 42. (Next to Velachery EB Office)  ","location":"Chennai","experience":"0-2Years"},{"date":"20, 22, 23, 24, 25 - Feb - 2021","skills":"Customer Support, Networking, Desktop Support, Technical Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"For more details Contact or Whatsapp Rohit Bind- 7397397288","phone":"7397397288","profile":" Desktop Support Engineer \nEnsure Support Services","description":"Position: Desktop Support Engineer/ System Administrator/ Customer Support Engineer/ Technical Support Engineer Qualification: Any Graduate/ Post Graduate Work Experience: 6 Months to 5 Years Location: Pune & Mumbai. Salary: Max 2.06 LPA.CTC depends on technical interviews. Immediate joiners required to contact for the video conference calls. Required Skills: 1- Knowledge of trouble shooting in desktop (Both Hardware & OS level) 2- Knowledge of trouble shooting in Laptops (Both Hardware & OS level) 3- Basic knowledge in Networking Send your updated resumes to rohit.bind@ensureservices.in For more details contact or whatsapp me Rohit Bind- 7397397288  ","location":"Mumbai, Pune","experience":"0-5Years"},{"date":"20 - Feb - 2021","skills":"Back Office Operations, Email & Chat Process Process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Tech Mahindra Limited, Delta 1, Giga Space, 2nd floor, Vimanagar, Pune","phone":"9168637999","profile":" Backoffice Executive (Email & Chat Process) \nTech Mahindra Limited","description":"Tech Mahindra BPS - Pune is hiring for Premium Telecom Domain for Backend/ Email Process Qualification Required : Any Graduate Experience Required : 1 Year BPO Experience (Email & Chat Process) Shift: 8 Am to 8 Pm Rotational Shift ( One Week off-rotational) Key Skills Required: Proven customer support experience or experience as a client service representative Excellent English communications skills Ability to listen and active problem solving skills Good interpersonal skills Ability to handle pressure Ability to multi-task, prioritize, and manage time effectively The primary responsibilities of a Customer Service specialist would be: Handling escalations and complex queries. Manage large amounts of emails & chats Answer calls professionally to provide information about products and services, take/ or obtain details of complaints. Identify and assess customers needs to achieve satisfaction Build sustainable relationships and trust with customer accounts through open and interactive communication Salary: 180000-220000 LPA Interview Process- Telephonic/ Walk-in( Kothrud/ Viman Nagar) Walk-in Date/ Time: 20th February 2021, 11.00 AM - 4.00 PM Venue Details- Tech Mahindra Limited Delta 1, Giga Space, 2nd floor, Vimanagar, Pune Contact Mayuresh J - +91 9168637999 ( Call/ WhatsApp) Email ID- mj00642401@techmahindra.com  ","location":"Pune","experience":"1-5Years"}]}