{"Walkins":[{"date":"3 - Dec - 2019","skills":"Backend Operations, Policy Management, Claims Processing","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"AXA XL (Formerly Known as XL Catlin) 5th Floor, 2A Building, West Tower Vrindavan Tech Village (Embassy Tech Village), SEZ Devarabeesanahalli, Varthur Hobli Outer Ring Road, Bengaluru - 560 103","phone":"8042524554","profile":"Backend Process Executive \nXL India Business Services Pvt. Limited","description":"Candidate should have University Degree with minimum aggregate of 50% Should have 1 to 4 years of experience in BFSI or IT/ ITES or insurance oriented roles. Must have excellent communication skills. Basic MS Excel skills. Attention to details, analytical thinking skills, Ability to investigate, open-mind: Ability to search for new solutions, proactive, team player. Walk In Drive on Tuesday, 3rd December 2019, Timing: 9.30 AM to 12.30 PM Address- AXA XL (Formerly Known as XL Catlin) 5th Floor, 2A Building, West Tower Vrindavan Tech Village (Embassy Tech Village), SEZ Devarabeesanahalli, Varthur Hobli Outer Ring Road, Bengaluru - 560 103","location":"Bangalore","experience":"1 - 4 Years"},{"date":"2, 3, 4, 5, 6, 7 - Dec - 2019","skills":"Data Processing, Publishing, Backend/ Non Voice Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Patel Information Technology Services, 4th Floor, DN-11, DN Block, Sector V, Bidhannagar, Kolkata, West Bengal - 700 091.","phone":"Not Provided","profile":"Data Processing Executive \nPatel Information Technology Services","description":"Candidate should have Any Degree/ Diploma able to read basic English. Must have good command over keyboard and mouse. Should know Ms Office and Photoshop. Job Work: Copy / Paste and Edit data from source files into word files. Edit images from source file into jpeg files. Use basic software and tools provided by the company. Job has a basic target and incentive for crossing tragets, Walk-in Date/ Time: 2nd - 7th December 2019, 10 AM onwards Interview Venue: Patel Information Technology Services 4th Floor, DN-11, DN Block, Sector V, Bidhannagar, Kolkata, West Bengal - 700 091. Contact Person- AKSHAT PANDEY","location":"Kolkata","experience":"0 - 2 Years"},{"date":"2, 3, 4, 5, 6, 7 - Dec - 2019","skills":"Email Support, International Voice Process, Customer Service, Content Writing","qualification":"Diploma, B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"IGT Solutions Private Limited, 3rd Floor, InfoTech Centre, 14/2 Old Delhi Gurgaon, Dundahera, Gurgaon Haryana - 122 016","phone":"7838661787","profile":"Back Office Associate \nIGT Solutions Private Limited","description":"IGT is hiring for Travel executives for an International process, the profiles includes B2C, B2G, B2T & Loyality Membership handling for customers through Calls, emails and back office activities including- Claim Re-issue/ Cancellation/ Refund New Reservation Claim Handling Loyality Membership Management Transport: Both side transport facility Shifts: Rotational/ Night Requirements: Graduate/ Undergraduate/ Drop out Fresher /Experience can apply Excellent Verbal and written skills Required Walk-in Date/ Time 2nd - 7th December 2019, 12 PM onwards Interview Venue: IGT Solutions Private Limited 3rd Floor, InfoTech Centre, 14/2 Old Delhi Gurgaon, Dundahera, Gurgaon Haryana - 122 016 Contact Person-Jaspreet Kaur Tel: 7838661787","location":"Gurgaon","experience":"1 - 3 Years"},{"date":"2, 3, 4, 5, 6, 7, 9, 10, 11, 12, 13, 14 - Dec - 2019","skills":".NET MVC/ Web API, C#, Microsoft Azure, SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Cuembux Software Solutions Pvt. Limited, Vatika Business Centre, Level-5, Panchsheel Tech Park One Shashtri Nagar, Yerwada, Pune, Maharashtra - 411 006","phone":"8263072261","profile":"Senior .Net Developer \nCuembux Software Solutions Pvt. Limited","description":"Minimum 3-5 years of experience in .NET MVC/ Web API, C# Basic knowledge of Microsoft Azure. Candidate should have worked on Entity framework 6.0 Candidate should have working experience with SQL Server. Candidate should be expert in C#, REST APIs. Good to Have skills: .NET Core is added advantage. Knowledge of Any other cloud platform is again added. Angular 2.0+, JavaScript/ jQuery. Good communication skill. Walk-in Date/ Time: 15th November - 31st December , 10 AM onwards Interview Venue: Cuembux Software Solutions Pvt. Limited, Vatika Business Centre, Level-5, Panchsheel Tech Park One Shashtri Nagar, Yerwada, Pune, Maharashtra - 411 006 Contact - HR (8263072261)","location":"Pune","experience":"3 - 8 Years"},{"date":"3 - Dec - 2019","skills":".Net, ASP .Net, MVC, Angular JS","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Congruent Info-Tech Private Limited, Type II/4, Dr.V.S.I. Estate, Thiruvanmiyur Chennai - 600 041.","phone":"Not Provided","profile":".Net Developer/ Fresher \nCongruent Info-Tech Private Limited","description":"Candidate should have 0 to 2 years of experience in Software Development using .Net, ASP .Net, MVC, Angular JS. Substantially contribute to the development efforts for a product through the entire software development lifecycle - including architecture, development and QA. Support the development and maintenance of the project schedule based on individual as well as project team availability. Actively manage project scope to keep project on schedule. Exercise judgment within generally defined best practices and policies in selecting methods and techniques for providing solutions. Troubleshoot, debug, and sustain product through lifecycle. Walk-in Date/ Time: 3rd December 2019, 10 AM onwards Interview Venue: Congruent Info-Tech Private Limited Type II/4, Dr.V.S.I. Estate, Thiruvanmiyur Chennai - 600 041. Contact Person- K. Priya","location":"Chennai","experience":"0 - 2 Years"},{"date":"7 - Dec - 2019","skills":"ASP .NET/ C#.NET, SQL Server, AJAX","qualification":"B.E./B.Tech, MCA/PGDCA","address":"ProPhoenix Technologies Pvt. Limited, Campus Tek Meadows, C Block First Floor, No: 51 Rajiv Gandhi Salai, Sholinganallur, Chennai - 600 119","phone":"48686111","profile":".Net Developer/ Team Lead \nProPhoenix Technologies Pvt. Limited","description":"We have excellent immediate openings for .Net developers/ Senior Software Engineers/ Team Lead/ Tech Lead . Required skills: ASP .NET/ C#.NET, SQL Server, AJAX Excellent in Design, Programming, Analyzing, Debugging and implementing new features. Should be able to do peers code review. Should have SDLC Process. Good communication skills. If interested, please directly Walk-in to the below mention address: Interview Date: 7th Dec 2019 (Saturday) Time: 9:00 AM to 12:00 PM Interview Venue: ProPhoenix Technologies Pvt. Limited Campus Tek Meadows, C Block First Floor, No: 51 Rajiv Gandhi Salai, Sholinganallur, Chennai - 600 119 Land mark: Opposite to Accenture Bus Stop: Dollar Bus stop (next to Karapakkam) Contact Person: Asha Asha@prophoenix.com or 9003999546 Divya - divya@prophoenix.com or 9003999597","location":"Chennai","experience":"4 - 9 Years"},{"date":"2, 3, 4, 5, 6, 9, 10, 11, 12, 13 - Dec - 2019","skills":".Net, OOP's, Java Script, Jquery, RDLC, SQL, MVC","qualification":"B.E./B.Tech, MCA/PGDCA","address":"INNOWAVE COMPANY, Office No. 501 504 5th floor Pentagon 3 Magarpatta City, Hadpasar Pune - 411 013.","phone":"020 67000000","profile":".Net Developer \nS2 Infotech International Limited","description":"Person must have strong knowledge of OOP's, Java Script, Jquery, RDLC, Reports Design. Should have basic knowledge of SQL, MVC and Third Party control Like Telerik. Walk-in Date: 2nd - 30 December (Monday to Friday) Timing : 10.30 AM to 5.30 PM Venue: INNOWAVE COMPANY Office No. 501 504 5th floor Pentagon 3 Magarpatta City, Hadpasar Pune - 411 013. Contact Person- Ms Ashwini Contact No: 020 67000000","location":"Pune","experience":"1 - 5 Years"},{"date":"2, 3 - Dec - 2019","skills":"Java, OOPS, .Net","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Mystifly Consulting India Private Limited, Azygos Building, No. 885, 1st Stage 4th Block, HBR Layout Bangalore - 560 043.","phone":"Not Provided","profile":"Software Engineers (Java/ .Net) \nMystifly Consulting India Private Limited","description":"Qualification: BE/ B.Tech/ ME/ M.Tech (2019 Passout Only) Very good programming skills Knowledge of OOPs concept Good Aptitude, analytical and problem solving skills are necessary Very good communication skills Willing to learn new skills Walk-in Date/ Time: 2nd - 3rd December 2019, 12 PM onwards Interview Venue: Mystifly Consulting India Private Limited Azygos Building, No. 885, 1st Stage 4th Block, HBR Layout Bangalore - 560 043. Contact Person- Benoy J K","location":"Bangalore","experience":"0 - 1 Years"},{"date":"2, 3, 4, 5, 6 - Dec - 2019","skills":"ASP .NET, C#, MVC, SQL, Web API, Angular JS, HTML, CSS, JQuery, Bootstrap.","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Digital Minds Software Solutions Private Limited, 2nd Floor, A-Wing, Softsol Building, #4 Infocity, Beside Mindspace, Hi-tech City, Madhapur, Hyderabad, Telangana - 500 081.","phone":"040 66885669","profile":"Software Engineers (.Net) \nDigital Minds Software Solution Pvt. Limited","description":"Educational Qualification: B. Tech/ MCA Work Experience: 2 to 3 Years Process: .Net Domain Shift Timings: 9:00 am to 6:00 pm. Experience in designing web applications using HTML, CSS, Bootstarp, JQuery, Angular JS. Experience on Developing applications using ASP .Net MVC & C#. Writing and Consuming Web services & Web API. Experience on SQL Server and dealing database using Entity Framework. Knowledge on Kentico is an added advantage. Interview Date: 2nd to 6th December 2019 Timings: 10:00 Am to 4:00 Pm Interview Venue: Digital Minds Software Solutions Private Limited 2nd Floor, A-Wing, Softsol Building, #4 Infocity, Beside Mindspace, Hi-tech City, Madhapur, Hyderabad, Telangana - 500 081. Contact Person- Kalpna G Contact No. 9063610208/ 040 66885669","location":"Bangalore","experience":"2 - 3 Years"},{"date":"7 - Dec - 2019","skills":".NET Core 2.0, MVC, SQL, Azure, Bootstrap, Angular, WebAPI","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Wipro Limited, EC4, Tower-15, GF, B-Wing, Electronics City, Bangalore","phone":"Not Provided","profile":".Net MVC Professional \nWipro Limited","description":"Work Experience : 4 years to 10 years Required Skills- ASP .NET Core (Mandatory) Primary Skills: .NET Core 2.0 (Mandatory) MVC (Mandatory) SQL Azure Bootstrap for .Net MVC 5 Angular WebAPI Walk-In Date : 7th December 2019 (Sat) Time : 9:30 AM onwards Walk In Location: Wipro Limited, EC4, Tower-15, GF, B-Wing, Electronics City, Bangalore","location":"Bangalore","experience":"4 - 10 Years"},{"date":"2, 3, 4, 5, 6, 9, 10, 11, 12, 13 - Dec - 2019","skills":"General Administration, Front Office/ Receptionist Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"GGS Information Services (India) Pvt. Limited, Trifecta Adatto Techpark, No 66/2. 67/1, 10th Floor, Whitefield Main Road, Garudacharpalya, Mahadevpura Post, Bangalore - 560 048","phone":"8050369001","profile":"Front Office/ Admin Executive \nGGS Information Services (India) Pvt. Limited","description":"Candidate should be Any Graduate with 0 to 1 year of experience in General Administration, Front Office/ Receptionist Activities. Must have excellent communication skills. Duties & Responsibilities: Greeting and attending to inquires HR Activities Admin Activities Organise and maintain files and records; update when necessary Basic Computer Knowledge Strong communication and people skills Good organizational and multi-tasking abilities Walk IN with your CV/ Resume between 10:30 Am to 5 Pm Date: 2nd - 13th December 2019 (Monday to Friday) Interview Venue: GGS Information Services (India) Pvt. Limited Trifecta Adatto Techpark, No 66/2. 67/1, 10th Floor, Whitefield Main Road, Garudacharpalya, Mahadevpura Post, Bangalore - 560 048 Landmark: Next to Phoenix Mall (Near Decathlon)","location":"Bangalore","experience":"0 - 1 Years"},{"date":"2, 3, 4, 5, 6, 9, 10, 11, 12, 13 - Dec - 2019","skills":"Software Testing, SDLC, Waterfall and Agile/ SCRUM Methodologies","qualification":"B.E./B.Tech, MCA/PGDCA","address":"INNOWAVE COMPANY, Office No. 501 504 5th floor Pentagon 3, Magarpatta City Hadpasar, Pune - 411 013","phone":"020 67000000","profile":"Software Tester \nS2 Infotech International Limited","description":"Person must have excellent understanding of Software Development Lifecycle (SDLC), including Waterfall and Agile/ SCRUM methodologies. Should have experience in creating Test plans, implementing automation frameworks and converting Functional Specifications into test scenarios. Experience with SW lifecycle tools like defect management, test case management, release management etc. Knowledgeable in database applications and data management with the skills to manipulate test data and experience with SQL. Experience with RDBMS, preferably SQL Server and technology background in .Net, C# Walk-in Date: 2nd - 30th December 2019 (Monday to Friday) Timing : 10.30 AM to 5.30 PM Interview Venue: INNOWAVE COMPANY Office No. 501 504 5th floor Pentagon 3, Magarpatta City Hadpasar, Pune - 411 013 Contact No : 020 67000000 Contact Person - Ms Ashwini","location":"Pune","experience":"1 - 6 Years"},{"date":"7 - Dec - 2019","skills":"Php, LAMP Stack, HTML, CSS, JavaScript, AJAX, jQuery, JSON and XML","qualification":"B.E./B.Tech, MCA/PGDCA","address":"We Work, C/o Muvi LLC , 5th Floor, Spectrum Tower, Chincholi Bunder Road, Rajan Pada, Mindspace, Malad West, Mumbai - 400 064","phone":"Not Provided","profile":"PHP Developers \nMuvi Entertainment Private Limited","description":"We are hiring multiple positions at mid-senior level PHP Developers to join Muvis growing Engineering team. You will be working on some latest and greatest technology stack like Big Data, AI, Blockchain. To be successful at this role, you should be a self driven problem solver and excellent coder. Responsibilities: Build modular, testable, and reusable PHP modules Contribute in all phases of the feature release cycle Contribute ideas on using latest technologies Solve complex performance problems and architectural challenges Pay strong attention to DB designing and module dependencies Basic Requirements: 1+ years development experience on LAMP stack Front-End development with technologies such as HTML, CSS, JavaScript, AJAX, jQuery, JSON and XML Experience on any framework like Zend, YII, Symfony, Laravel, CodeIgniter, CakePHP Strong knowledge of databases modelling and design Strong experience in API design and REST based services Good understanding of Accessibility and Security Compliance Knowledge of Cloud Services and Clusters like AWS EC2, S3 Knowledge of Service Oriented Architecture would be a bonus Have Self-directed work ethic with attention to detail and good communication skills Walk-in Date/ Time: 7th December 2019, 9 AM onwards Interview Venue: We Work, C/o Muvi LLC , 5th Floor, Spectrum Tower, Chincholi Bunder Road, Rajan Pada, Mindspace, Malad West, Mumbai - 400 064 Contact - Manisha Singh","location":"Mumbai","experience":"1 - 6 Years"},{"date":"2, 3 - Dec - 2019","skills":"Software Testing, QA methodologies, Testing fundamentals and STLC process.","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Contrado Imaging India Pvt. Limited, B-1908, 1909, 1910, Westgate, Near YMCA Club, S.G. Road, Ahmedabad (Gujarat),","phone":"Not Provided","profile":"QA Engineer/ Manual Tester \nContrado Imaging India Pvt. Limited","description":"Educational Qualifications: Atleast Bachelor's Degree in Computer Experience: 1-4 years of experience in QA Essential Skills - Abilities Proven work experience in Software testing and quality assurance. Strong knowledge of S/W QA methodologies, Testing fundamentals and STLC process. Strong understanding of SDLC and methodologies. Experience writing clear, comprehensive and concise test cases/scenarios. Hands on experience with Black-box testing and grey-box should be added advantage. Good analytical skill is essential to make the testing work easier. Well versed with any defect tracking tool and added advantage if test management tool is known. Experience working in AGILE/Scrum methodology. Should have basic understanding and knowledge on any Database system. Automation knowledge will be an added advantage. Experience with performance and/or security tool will be an added advantage. Benefits- Enjoyable atmosphere, fast-paced, fun, and creative environment Competitive salary to skill level with potential 10-15% overtime bonus 50% preferential staff discount Employee of the month bonus Walk-in Date: 2nd - 3rd December 2019 Reporting Time: 9 AM to 11 AM (Mon-Tues) Interview Venue: Contrado Imaging India Pvt. Limited B-1908, 1909, 1910, Westgate, Near YMCA Club, S.G. Road, Ahmedabad (Gujarat), Contact Person- Pooja","location":"Ahmedabad","experience":"1 - 4 Years"},{"date":"30 - Dec - 2019","skills":"Manual & Functional testing, Design, write and execute","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Xavient Digital-Powered by Telus International, Plot No - 54NSEZ Phase - 2, Sector 81 Noida, Uttar Pradesh","phone":"Not Provided","profile":"Testing Engineer (Telecom) \nXavient Software Solutions India Pvt. Limited","description":"Candidate should have experience in Manual & Functional testing. Should have experience in Telecom domain in any of the components such as Billing, Provisioning, Order management etc. Design, write and execute repeatable test cases/ scripts using Quality Center. Experience of working in Agile. Create or modify test data and expected results to be used for validation using a variety of tools. Should have fair knowledge of database - SQL. Must have good understanding of entire Software Testing Life Cycle. Candidates should have good logical and analytical skills to comprehend business requirements and convert them to test cases independently. Should have good communication skills with strong client handling capabilities. Should be flexible with timings as per Project Requirements. Flexible to support different shifts as per project requirements. Experience required: 2 to 5 Years Notice Period: 30- 45 days Shift timings :- 2 pm - 11 pm Walk-in Date/ Time: 30th November 2019, 10 AM onwards Interview Venue: Xavient Digital-Powered by Telus International Plot No - 54NSEZ Phase - 2, Sector 81 Noida, Uttar Pradesh SPOC :- Jaspreet Gill/ Anchal Sharma","location":"Noida","experience":"2 - 5 Years"},{"date":"2, 3 - Dec - 2019","skills":"IT Fresher/ Tester","qualification":"B.E./B.Tech, MCA/PGDCA","address":"ThinkSys Software Private Limited, Discovery Tower, A-17, Block A,7th Floor, Sector 62, Noida, Uttar Pradesh - 201 301.","phone":"0120-4562034","profile":"Trainee Developer/ Tester \nThinkSys Software Private Limited","description":"Looking for B.Tech, BE & MCA (2019 Batch) students for Three months In house Training programme for Software Development & Software Testing. Freshers of 2019 Batch Pass outs only. Academics 70% throughout (In 10th, 12th & Graduation) Mandatory Must have good communication skills Selected candidates have to undergo an in house Training. (Training Duration: Initial 3 months) Stipend (during training period): Rs. 12,000 per month During training period candidates will work on live projects. After Training Period one assessment test will be there, candidates who will clear this test will be taken on roll. Selection process 1. Written Test comprising Math, Reasoning and English questions. 2. Technical Interview Walk-in Date: 27th November - 3rd December, 2019 Timings:10:30 AM - 4 PM Interview Venue: ThinkSys Software Private Limited Discovery Tower, A-17, Block A,7th Floor, Sector 62, Noida, Uttar Pradesh - 201 301.","location":"Noida","experience":"0 - 1 Years"},{"date":"2, 3, 4, 5, 6 - Dec - 2019","skills":"C/ C++, PHP, JavaScript, JQuery, HTML, CSS, Jquery, WordPress, Codeigniter","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Council of Education & Development Pvt. Limited, 5th Floor, New English High School, Ram Maruti Road, Thane (Weat) - 400 602","phone":"9152013064","profile":"PHP Developer \nCouncil of Education & Development","description":"Council of Education and Development Programmes Private Limited is looking for PHP Developer Web Technologies. HTML, CSS, Jquery, WordPress, Codeigniter Languages C, C++, PHP, JavaScript, JQuery, Database My SQL Candidates having relevant experience may walk in for an interview at our Thane office. Date - 29 Nov 2019 - 6 December 2019 Time : 11:00 AM - 3:00 PM Interview Venue: Council of Education & Development Pvt. Limited 5th Floor, New English High School, Ram Maruti Road, Thane (West) - 400 602 Contact Person: Ms . Swati Tel No - 9152013064 Please mail your cv at jobs@cedp-edu.com before coming for interview.","location":"Mumbai","experience":"1 - 3 Years"},{"date":"2, 3, 4, 5, 6, 7, 9, 10 - Dec - 2019","skills":"Front Desk/ Receptionist Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Hamstech India Private Limited, HR , 2nd Floor, RK Plaza, above PAVN Mor Jewellers, Panjagutta, Hyderabad","phone":"9100910278","profile":"Front Office Executive (Female) \nHamstech India Private Limited","description":"We are hiring Smart Female candidates for various profiles. Counsellor, Telecalling Executive, Front office, Admin. Must be Smart and good communication skills. On call experience/ freshers also can apply and walk-in for interview Walk-in Date/ Time: 2nd to 10th December , 10 AM onwards Interview Venue: Hamstech India Private Limited HR , 2nd Floor, RK Plaza, above PAVN Mor Jewellers, Panjagutta, Hyderabad Contact HR - Gazla 9100910278 / Anitha 9100445953","location":"Hyderabad","experience":"0 - 5 Years"},{"date":"2, 3, 4, 5 - Dec - 2019","skills":"General Administration, Travel Desk, Hotel Booking & Vendor Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Shubhalakshmi Polyesters Limited, 6th Floor, Deluxe House B/50, Off New Link Road, Opposite City Mall, Andheri West, Mumbai - 400053","phone":"Not Provided","profile":"Administration Executive \nShubhalakshmi Polyesters Limited","description":"Candidate should be minimum Graduate in any stream with 2 to 4 years of experience in General Administration, Travel Desk, Hotel Booking & Vendor Management. Should have excellent communication skills Job Responsibilities- Vendor Management Travel Desk Making all Travel arrangement & Booking, Hotel booking, Car booking All Office administrative work Managing stationary, Housekeeping, all AMC etc. Walk-in Date/ Time: 2nd - 5th December , 11 AM onwards Interview Venue: Shubhalakshmi Polyesters Limited 6th Floor, Deluxe House B/50, Off New Link Road, Opposite City Mall, Andheri West, Mumbai - 400053 Contact Person - Anamika","location":"Mumbai","experience":"2 - 4 Years"},{"date":"2, 3 - Dec - 2019","skills":"Back Office Operations, Non Voice Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"EXL Services India Private Limited, A- 18, Noida Sector 59 Near Noida Sector 59 Metro Station","phone":"Not Provided","profile":"Back Office Executive (Female) \nEXL Services India Private Limited","description":"EXL Services India Private Limited is hiring for Non Voice/ Back Office Associates (Special Walk-in for Female Candidates) Qualification Required - Any Graduate can apply Experience: Minimum 6 months of any experience Fresher can apply Candidate should have excellent communication skills Should be OK with night/ rotational shifts Should have typing speed of 25-30+ wpm Only Female candidates need to apply Interested can walk-in on 2nd & 3rd December 2019 Time: 11:00 AM to 3 PM Interview Venue: EXL Services India Private Limited A- 18, Noida Sector 59 Near Noida Sector 59 Metro Station Contact Person - Kritika Madan Resume and Aadhar Card (original + 2 photocopy) along with 2 passport size photographs is mandatory to carry to enter inside the premises.","location":"Noida","experience":"1 - 3 Years"},{"date":"2 - Dec - 2019","skills":"Back Office, Data entry, Insurance/ Banking Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Datamatics Global Services Limited, 5th Floor, The Great Oasis Building, Road No.21, MIDC, Andheri - East, Mumbai","phone":"Not Provided","profile":"Back Office/ Data Entry (Male Only) \nDatamatics Global Services Limited","description":"We have an excellent opportunity in Insurance Data entry for Reputed Bank Process: Desired Skills : H.S.C. pass / Any Graduate Freshers are welcome Basic Typing speed Employment Type : Contractual (6 months) Work Experience : 0 to 1 year No of Openings : 30 Shifts: (Rotational) : Night - 11.30 pm to 6.30 am (Major) Afternoon - 3 pm to 11.30 pm Job Responsbility: Medical Data entry for Bank insurance process Process Training will be provided Salary : Net - 10,000/- per month Walk-in Date: Monday, 2nd December Interview Time: 2 pm to 5 pm Interview Venue : Datamatics Global Services Limited 5th Floor, The Great Oasis Building, Road No.21, MIDC, Andheri (East) Mumbai Landmark : Passport Office building Near Sainath Nagar Bus stop (Bus from station - 434)","location":"Mumbai","experience":"0 - 1 Years"},{"date":"2, 3, 4, 5, 6, 7 - Dec - 2019","skills":"PHP/ Codeigniter Framework MySQL/ Jquery)","qualification":"B.E./B.Tech, MCA/PGDCA","address":"FinInfocom Private Limited, VNR Arcade, Plot No 20A, 4th Floor, X Road, Nagole, Hyderabad, Telangana - 500 068.","phone":"7981744087","profile":"PHP Developer \nFinInfocom Private Limited","description":"Candidate should have 2 to 5 years of experience in PHP/ Codeigniter Framework MySQL/ Jquery with proficiency in at least one of the frameworks (CodeIgniter) Should have experience in jQuery, REST APIs, etc. Experience in handling projects independently Good language and communication skills Walk-in Date/ Time: 27 November - 31st January , 10 AM onwards Interview Venue: FinInfocom Private Limited VNR Arcade, Plot No 20A, 4th Floor, X Road, Nagole, Hyderabad, Telangana - 500 068. Contact Person- Joseph Phone: 7981744087","location":"Hyderabad","experience":"2 - 5 Years"},{"date":"3 - Dec - 2019","skills":"PHP, Perl, Ruby, Shell Scripting, MySQL","qualification":"B.E./B.Tech","address":"Ebizon Net Info Private Limited, 7th Floor, Tower A, Logix Cyber Park, C-28-29, Industrial Area, Sector 62, Noida","phone":"Not Provided","profile":"PHP Developer \nEbizon Net Info Private Limited","description":"Candidate should be B.Tech (CS/ IT) with 70% throughout academics Good communication, ability to perform in team environment. Must have strong coding and Strong analytical skills Familiarity with at least one modernPHP-based web or application development framework. Experience with at least one modern programming or scripting languages. PHP, Perl, Ruby, Shell Scripting is preferable. Database experience (preferably MySQL) Enthusiasm for open-source philosophy and community involvement. Hard working, motivated and driven by an unknown force to improve the web. Intellectual curiosity and passion for making really cool apps for web. WALK-IN Details: Date - 3rd December 2019/ Tuesday Time - 11:00 AM - 3:00 PM Interview Venue- Ebizon Net Info Private Limited 7th Floor, Tower A, Logix Cyber Park, C-28-29, Industrial Area, Sector 62, Noida","location":"Noida","experience":"1 - 3 Years"},{"date":"14 - Dec - 2019","skills":"PHP, Java Script, MySQL, Oops, Ajax, Jquer","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Biztech IT Consultancy Private Limited, C/ 801, Dev Aurum Commercial, Near Anandnagar Cross Roads, Prahlad Nagar, Ahmedabad, Gujarat - 380 015.","phone":"9537117529","profile":"PHP Developer - Trainee \nBiztech IT Consultancy Private Limited","description":"PHP - Trainee (Passout Year - 2019-2020) Benefits with Biztech: 6 M Training (stipend: Rs. 4,000 p.m) + 1.5 Yr Job Offer Live Project Work Basic to Advanced level training Soft Skill Training Guidance from experieced TL/Sr. Developers Walk-in Date/ Time: 14th December 2019, 10 AM onwards Interview Venue: Biztech IT Consultancy Private Limited C/ 801, Dev Aurum Commercial, Near Anandnagar Cross Roads, Prahlad Nagar, Ahmedabad, Gujarat - 380 015. Contact Person- Ms. Vidhi Mehta Tel: 9537117529 Note : Those who have applied before at Biztech can not reapply for the same) Role","location":"Ahmedabad","experience":"0 - 1 Years"},{"date":"3, 4, 5, 6 - Dec - 2019","skills":"Automation Testing, Test engineering, Automation tools, Selenium, testing tools","qualification":"B.E./B.Tech, MCA/PGDCA","address":"India IS Global Service Center (GSC), 10th, Floor Prestige Centre Court,, Chennai, Tamilnadu - 600 026","phone":"66051102","profile":"Automation Test Engineer \nExpeditors International (India) Pvt. Limited","description":"Qualifications: Preferably MCA/ B Tech/ BE/ Bachelors Degree in Computer Science Essential Experience: 5+ years of experience in a technical Quality Assurance role Proficient in at least one object-oriented programming language (Preferably Java Proficient in automation tool Protractor with Jasmine for Angular application Proficient at scripting in one or more languages(Preferably TypeScript/JavaScript) Proficient at working with databases, web application frameworks and command line interfaces Proficient at developing test automation framework from scratch Good to have experience in Selenium with Cucumber Should train and enhance other QA team members Preferred Experience: Strong object-oriented design and coding skills Working knowledge of Java application development and Windows/ UNIX/ Linux systems Experience in Agile development Understanding of the transportation/global logistics industry Walk-in Date/ Time: 3rd - 6th December , 10 AM onwards Interview Venue: The Forum Vijaya Mall, 10th Floor, Prestige Center Court, 183, N.S.K. Salai, Kumaran Colony, Vadapalani, Chennai, Tamil Nadu - 600 026 Contact Person- Sindhuja Amilthamozhian Tel: 66051102","location":"Chennai","experience":"4 - 7 Years"},{"date":"2, 3, 4, 5, 6, 9, 10, 11, 12, 13 - Dec - 2019","skills":"PHP 5+, LINUX, APACHE, MYSQL, MVC, HTML","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Greynium Information Technologies Pvt. Limited, # 74/2, 2nd Floor, Sanjana Plaza, Elephant Rock Road, 3rd Block, Jayanagar, Bengaluru - 560 011","phone":"9886610338","profile":"Web Developer (LAM/ PHP) \nGreynium Information Technologies Pvt. Limited","description":"Candidate must have experience on LAMP (Linux, Apache, MySQL, PHP) Should have experience PHP 5+ and MVC Framework Experience with web development using HTML, CSS3, JavaScript, Jquery and AJAX Experience with modern development techniques such as memcaching and REDIS Experience using a JavaScript framework such as jQuery. Experience with smarty templates and version control mechanisms Knowledge in NoSQL databases like Couchbase Walk-in Date: 25th Nov - 13th Dec, 11 AM onwards Interview Venue: Greynium Information Technologies Private Limited # 74/2, 2nd Floor, Sanjana Plaza, Elephant Rock Road, 3rd Block, Jayanagar, Bengaluru - 560 011 Contact - Ms. Vidya (9886610338) If Interested, Please contact company HR at vidya.m@oneindia.co.in Or contact on 9886610338 (WhatsApp / Call)","location":"Bangalore","experience":"1 - 6 Years"},{"date":"30 - Nov - 2019","skills":"Java, J2EE, HTML, CSS, Java Script and AngularJS, SQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Atria Convergence Technologies Limited, ACT Fibernet Head office, 8-2-618/B, Mithila Nagar, Banjara Hills Road Number 11, Hyderabad - 500 034","phone":"9513206011","profile":"Java Developers \nAtria Convergence Technologies Limited","description":"We are looking for an Server Side Java developer responsible for the development and maintenance of applications. Your primary focus will be development of applications and their integration with other services along with constant eye of improvements through customer/user feedback. Candidate should have 1+ years of development experience Proficient with Linux, Java, J2EE, SQL Familiarity with HTML, CSS, JavaScript and AngularJS Experience with frameworks such as spring, SpringBoot and hibernate Experience with Eclipse IDE Familiarity with RESTful and SOAP APIs Knowledge of other web technologies and UI/ UX standards Knack for benchmarking and optimization Proficient understanding of code versioning tools {such as Git, Mercurial or SVN} Experience with Agile and Waterfall SDLC models Walk-in Date/ Time: 30th November 2019, 10 AM onwards Interview Venue: Atria Convergence Technologies Limited ACT Fibernet Head office, 8-2-618/B, Mithila Nagar, Banjara Hills Road Number 11, Hyderabad - 500 034 Landmarks : Care Hospital-Outpatient Center & Karvy Data Contact Person- Ranjit Joshi Tel: 9513206011","location":"Hyderabad","experience":"1 - 3 Years"},{"date":"30 - Nov - 2019","skills":"Core Java, Hibernate, Spring boot, Microservices","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"HCL Technologies Limited, New Cafeteria, Sholinganallur Campus, Chennai","phone":"Not Provided","profile":"Java Developer \nHCL Technologies Limited","description":"We are pleased to inform you that we currently have opening for Java Developer @ Chennai Educational Qualification: BE/ B.Tech/ MCA Work Experience: 3 - 9 Years Required Skills: Core Java, Hibernate, Spring boot, Microservices The candidates who are interested & ready to attend interview, please share your resume with below details to ahmed_s @hcl.com Walk-in Date: 30th November 2019 Timing: 9:00 to 12:00 PM Interview Location : HCL Technologies Limited New Cafeteria, Sholinganallur Campus, Chennai Spoc: Shaik Ahmed","location":"Chennai","experience":"3 - 9 Years"},{"date":"30 - Nov - 2019","skills":"Software Testing, Support, Testing Execution, Software Engineering","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Concerto Software & Systems Private Limited, Building No. 305, 2nd Floor, A- Wing, Sector 2, Millennium Business Park, Mahape, Navi Mumbai - 400 710.","phone":"Not Provided","profile":"Trainee - Software Tester \nConcerto Software & Systems Pvt. Limited","description":"Candidate will be involved in Software Testing, Support, Execution of the tasks related to support and testing. Must be clear with Basic Technology, concepts & Logic Skills Required: Should have analytical and logic skills Candidate must have good communications and interpersonal skills Should have positive & proactive attitude Candidate has to sign the service level agreement for specified tenure with the company (Mandatory). Walk-in Date: 30 November 2019 Time: 10 AM to 12 PM. Interview Venue- Concerto Software & Systems Private Limited Building No. 305, 2nd Floor, A- Wing, Sector 2, Millennium Business Park, Mahape, Navi Mumbai - 400 710. Contact Person - Komal Gavali Please carry Adhar card and Pan card.","location":"Mumbai","experience":"0 - 1 Years"},{"date":"22, 25, 26, 27, 28, 29 - Nov - 2019","skills":"OOPS and .Net Concepts, C#, ASP .Net, and MS SQL 2008/ 2012","qualification":"B.E./B.Tech, MCA/PGDCA","address":"nThrive Global Sloutions Private Limited (Formerly e4e Healthcare Business Services Pvt. Limited), 15th Floor, Tower C Unitech Cyber Park Sector 39, Gurugram, Haryana - 122 002.","phone":"Not Provided","profile":"Software Engineers (.Net) \nnThrive Global Solutions Private Limited","description":"Candidate should have good knowledge of OOPS and .Net Concepts. Must have strong programming and troubleshooting skills using C#, ASP .Net, and MS SQL 2008/ 2012. Good knowledge of MVC framework. Good experience of working on JavaScript and jQuery, HTML, CSS. As a part of the technology team, member is expected to perform end-to-end development/maintenance of Microsoft .Net based applications. Member will be engaged in coding, unit testing, and build readiness activities related to assigned tasks. Walk-in Date/ Time: 22nd - 29th November from 1 PM onwards Interview Venue: nThrive Global Sloutions Private Limited (Formerly e4e Healthcare Business Services Pvt. Limited) 15th Floor, Tower C Unitech Cyber Park Sector 39, Gurugram, Haryana - 122 002.","location":"Gurgaon","experience":"1 - 3 Years"},{"date":"2, 3 - Dec - 2019","skills":"Java, .Net, OOPs Concept","qualification":"B.E./B.Tech, M.Tech","address":"Mystifly Consulting India Private Limited, Azygos Building, No. 885, 1st Stage 4th Block, HBR Layout Bangalore - 560 043.","phone":"Not Provided","profile":"Software Engineers (Java/ .Net) \nMystifly Consulting (India) Pvt. Limited","description":"Educational Qualification: BE/ B.Tech/ ME/ M.Tech Batch: 2019 Passout Only Work Experience: Fresher Very good programming good communication skills Good Aptitude, analytical and problem solving skills are necessary Must have good knowledge of OOPs Concept Willing to learn new skills Walk-in Date/ Time: 2nd - 3rd December 2019, 12 PM onwards Interview Venue: Mystifly Consulting India Private Limited Azygos Building, No. 885, 1st Stage 4th Block, HBR Layout Bangalore - 560 043. Contact Person- Benoy J K","location":"Bangalore","experience":"0 - 1 Years"},{"date":"30 - Nov - 2019","skills":"Azure, dot net, javascript, jquery, sql, Angular 8","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Technovert Solutions Pvt. Limited, Plot No 104, Kavuri Hills, Hyderabad (Land Mark - State Art Gallery/ Maa TV)","phone":"Not Mentioned","profile":"Senior .Net Developer \nTechnovert Solutions Pvt. Limited","description":"The candidate must understand very well the HTTP protocol and web app nuances. Well versed with internal workings of MVC engine Routing, Action Filters, HTTP Helpers etc. Solid C# coding skills and understanding of .NET framework Linq, Lambda, Generics, Async etc. Work Experience: 3 to 5 Years Location: Dubai/ UAE, Hyderabad Salary: INR 5,00,000 - 12,00,000 P.A. Must have strong SQL Design and development skills. Advanced Programming Principles Dependency Injection, Unit Test are plus. Experience in developing and deploying onto Azure Environment is great plus! Walk-in Date/ Time: 30 November 2019, 10 AM onwards Interview Venue: Technovert Solutions Pvt. Limited, Plot No 104, Kavuri Hills, Hyderabad (Land Mark - State Art Gallery/ Maa TV)","location":"Hyderabad","experience":"3 - 5 Years"},{"date":"2 - Dec - 2019","skills":"Java Trained/ Fresher","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Snap-on Business Solutions India Pvt. Limited, 1st floor, Tower C, Logix Techno Park Plot No. 5, Sector 127, Noida.","phone":"0120-4508462","profile":"Software Engineer/ Java Trainee \nSnap-on Business Solutions India Pvt. Limited","description":"Applicant must be B.Tech/ B.E/ MCA/ M.Tech from 2018-19 batch with 60% overall and regular academic background. Any project / Internship / certification course on Java is mandatory. Should have good communication and analytical Skills Positive and learning attitude Angular is preferred. Walk-in Date/ Time: 2nd December 2019, 11 AM onwards Interview Venue: Snap-on Business Solutions India Pvt. Limited 1st floor, Tower C, Logix Techno Park Plot No. 5, Sector 127, Noida. Contact Person- Priyanshi Tel: 01204508462 Please Note: 1. Candidates reaching after 11.00 AM will not be entertained in any condition. 2. Candidate should be ready to sign a service agreement of 1.5 years. 3. Please do not apply if you have already attended any interview process at our company in last 6 months.","location":"Noida","experience":"0 - 1 Years"},{"date":"21, 22, 25, 26, 27, 28, 29 - Nov - 2019","skills":"Core Java, OOP Concepts","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Tacktile Systems, 2nd Floor Above Ochre Furnitures Hiwary Layout Wardhman Nagar, Nagpur Opposite Old INOX Poonam Mall","phone":"2766150","profile":"Java Developer - Freshers \nTacktile Systems","description":"We are looking to hire fresh graduates with good aptitude, basic programming skills and strong OOP concepts. You would be trained for 2-3 months and hired with Tacktile Systems itself as JAVA developer on successful completion of training You should be good with - OOP Concepts - Core Java - Strong Aptitude - Basic Programming skills - Ability to learn quickly - Good Communication Skills Walkins from Monday to Saturday (10 AM - 4 PM) 21st - 29th November 2019 Interview Venue: Tacktile Systems, 2nd Floor Above Ochre Furnitures Hiwary Layout Wardhman Nagar, Nagpur Opposite Old INOX Poonam Mall Contact - HR ( 2766150 )","location":"Nagpur","experience":"0 - 1 Years"},{"date":"2, 3, 4, 5, 6, 7, 9, 10, 11, 12, 13, 14 - Dec - 2019","skills":"Core Java, Stored Procedure, Web Services SOAP/ REST APIs, SQL Queries","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Prospecta Soft Private Limited, IRIS Tech Park, Unit No. 206, 2nd Floor, Block A, Sector 48, Gurugram","phone":"Not Provided","profile":"Java (API) Developer \nProspecta Soft Private Limited","description":"Person must have strong hands-on experience with Core Java Must and Strong knowledge of SQL Queries and Stored Procedure Must have knowledge of API's Good to have experience on Web Services SOAP/ REST APIs Should have good communication skills Job Responsbility- To produce high quality documentation for our customers related to assigned work To decompose technical tasks and provide accurate estimates To undertake project related API/Development tasks without supervision, including programming and testing within a Test-Driven process Walk-in Date/ Time: 30 November - 15th December , 9 AM onwards Interview Venue: Prospecta Soft Private Limited IRIS Tech Park, Unit No. 206, 2nd Floor, Block A, Sector 48, Gurugram Contact Person- Isha Sharma Interested candidates can share their updated resume on shalini.singh@prospecta.com","location":"Gurgaon","experience":"2 - 4 Years"},{"date":"29, 30 - Nov - 2019","skills":"Core Java, Hibernate, SpringBoot, RestAPI, MySQL, Angular, Multi-threading","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Amazin Automation Solutions India Pvt. Limited, Unit No. 50, 51, Ground Floor, JMD Megapolis, Sohna Road, Sector 48, Gurgaon - 122 018","phone":"9711454083","profile":"Java Developer \nAmazin Automation Solutions India Pvt. Limited","description":"Candidate should have 3 to 7 years of experience in Software Development using Core Java, Hibernate, Spring Boot, RestAPI, MySQL, Angular, Multi-threading, OOPs Concept, Java Swing, AWT Preferred Skills - Adapts to changes in work (i.e. new client requirements or specifications). Adjusts working hours to accommodate busy periods. Walk-in Date/ Time: 29th - 30th November , 10 AM onwards VENUE: Amazin Automation Solutions India Pvt. Limited Unit No. 50, 51, Ground Floor, JMD Megapolis, Sohna Road, Sector 48, Gurgaon - 122 018 Contact Person- Prachi Khurana Tel: 9711454083","location":"Gurgaon","experience":"3 - 7 Years"},{"date":"29 - Nov - 2019","skills":"Back-Office Operations, Insurance/ Banking Process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"GENPACT India Private Limited, Sector-18, Udyog Vihar, Gurgaon Nearest Metro - M.G. Road","phone":"9667357055","profile":"Back-Office Associate \nGENPACT India Private Limited","description":"GENPACT India Private Limited is Inviting applications for Back-Office Operations Job Location: Noida/ Gurgaon Shifts: 24*7 Educational Qualification: Any Non-Technical Graduate can apply. Any Graduate with an experience in Back-Office Operations is applicable. Freshers are eligible to apply Skills & Responsibilities: Insurance/ Banking exposure Good client servicing skills Knowledge of excel/ advanced excel/ V-look/ H-look up Good analytical and problem solving skills Able to communicate verbally and through emails Input appropriate categories Your role will require you to utilize your knowledge in the insurance and reinsurance fields to manage and process transactions, interact with clients, manage processes and data, and improve processes. Walk-in Date - 29th November, 2019 Timings - 11 am to 2 pm Interview Location - GENPACT India Private Limited Sector-18, Udyog Vihar, Gurgaon Nearest Metro - M.G. Road Contact - HR MANEESHA @ 9667357055 MENTION 'HR MANEESHA' AS YOUR REFERENCE ON THE TOP OF YOUR CV Documents to be carried: 2 UPDATED COPIES OF RESUME ORIGINAL AADHAR And PAN CARD IS MANDATORY 2 XEROX COPIES OF ID PROOF 2 PASSPORT SIZE PHOTOGRAPHS LAST 3 MONTHS PAY SLIPS ( IF ANY )","location":"Gurgaon","experience":"0 - 2 Years"},{"date":"30 - Nov - 2019","skills":"Java, Application Development","qualification":"B.E./B.Tech, MCA/PGDCA","address":"eCIFM Solutions India Private Limited, Plot No-507 Udyog Vihar Phase 5 Gurgaon, Haryana","phone":"Not Provided","profile":"Software Engineer - Freshers \nTech Mahindra Limited","description":"eCIFM are looking for an Application Developer engineer to develop TRIRIGA applications with quality. Candidate will be responsible for the implementation of customization within the TRIRIGA application platform, including Data validation, Form Builder, Workflow and integration and TRIRIGA Report Builder development. Developer's responsibilities include designing and implementing technical solutions along with unit testing the code developed. Desired candidate should hold a College or University degree in Computer Science or a related discipline required. Must have excellent communication skills and strong desire to learn.˜ Strong analytical and numerical skills. Must have strong programming skills. Fresher's from a good B .School are preferred. Should be ready to join at earliest. Walk-in Date: 30th November 2019 Time: 10 am-12 pm Interview Venue: eCIFM Solutions India Private Limited Plot No-507 Udyog Vihar Phase 5 Gurgaon, Haryana Contact Person- Pooja Gupta","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"30 - Nov - 2019","skills":"Java Trained/ Freshers","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Ionidea Interactive Private Limited, # 38-40, EPIP, Besides SAP LABS Whitefield, Bangalore - 560 066.","phone":"080-66581500","profile":"Java Developer/ Freshers \nIonidea Interactive Private Limited","description":"Educational Qualification: BE/ B-TECH/ MCA/ M-TECH Eligibility : Above 60% in UG, PG, 12th and 10th Year of Pass out: 2017/ 2018/ 2019 Walk-in Date: 30 November - 1st December 2019 Time : 9.00 AM to 12.00 PM Interview Venue: Ionidea Interactive Private Limited # 38-40, EPIP, Besides SAP LABS Whitefield, Bangalore - 560 066. Landmark: KTPO Stop, Near Ginger Hotel Contact Person- Mercia ( 66581500 )","location":"Bangalore","experience":"0 - 1 Years"},{"date":"28, 29, 30 - Nov - 2019","skills":"Java MVC frameworks like Spring, Struts2, Play, etc.","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Spring Computing Technologies Pvt. Limited, Vijay Commercial Complex, DP Road, Near Guruganesh Nagar, Kothrud, Pune - 411 038","phone":"Not Provided","profile":"Java Developer \nSpring Computing Technologies Pvt. Limited","description":"Candidate should be BE or ME in CS / IT, MSc CS, MCS, MCA 3 to 10 years of hands-on experience in Java MVC frameworks like Spring, Struts2, Play, etc. Good experience in working with Databases, Schema Design, SQL Queries, ORM frameworks like Hibernate, etc. Exposure to web security features like SSL, OAuth2, etc. and web security frameworks like Spring Security, Apache Shiro, etc. Thorough understanding of Object Oriented Designing Experience on HTML/ HTML5, CSS/ CSS3, JSP, JavaScript & JQuery is desired Nice to have knowledge of Bootstrap, Thyme leaf and Angular JS Familiarity with Unit Testing frameworks Excellent logic development and analytical skills Good written and verbal communication Experience in banking domain (BFS) is an added advantage Key Responsibilities: Requirements understanding and analysis Assistance in creating software specification and software design Software development on server platforms Writing high quality optimized code Effective use of development, debugging and testing tools Guidance to other team members Walk-in Date: 28th - 30th November 2019 Time : 10.00 am to 3.00 pm Interview Venue: Spring Computing Technologies Pvt. Limited Vijay Commercial Complex, DP Road, Near Guruganesh Nagar, Kothrud, Pune - 411 038 Contact - Ms. Anushree Chaubal Important Notes : 1) Please do come for the interview with mentioned documents at scheduled date & time. 2) Work Location : Kothrud, Pune. Request you to apply if the location is convenient. 3) PLease apply if your notice period is 30 days or less (for longer notice period, please apply only if it can be negotiated)","location":"Pune","experience":"4 - 10 Years"},{"date":"7 - Dec - 2019","skills":"Java, J2ee, JSP, Servlet, JQuery, JavaScript, JSON, SQL Server","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"SHL (India) Private Limited, Tower 10B, 9th Floor, DLF Cyber City, Gurgaon, Haryana - 122 002.","phone":"Not Provided","profile":"Java Developers \nSHL (India) Private Limited","description":"Candidate should have 4 to 8 years of relevant experience with thorough understanding of OO concepts & its application in development. Should have previously worked in the position as a Java/ Web Developer developing web site/ applications. Hands-on with Spring 3.0 + Hands-on with Hibernate / JPA Hands-on with AOP Hands-on with JSP, Servlet, JQuery, JavaScript, JSON Hands-on with SQL Server Hands-on with REST Services Must have worked on one application or Web server like Glassfish, Tomcat. Experience with RDBMS database SQL Server 2012 or later, Knowledge of Oracle/ My SQL will be add-ons. Strong understanding and practical knowledge of distributed version control systems like Git. Strong knowledge of DevOps technologies and processes related to cloud solutions. Good hands on experience in using cloud based development platforms such as AWS or Azure. Walk-in Date/ Time: 7th, December 2019 from 10 AM onwards Interview Venue: SHL (India) Private Limited Tower 10B, 9th Floor, DLF Cyber City, Gurgaon, Haryana - 122 002","location":"Gurgaon","experience":"4 - 8 Years"},{"date":"30 - Nov - 2019","skills":"Core Java, J2EE, OOPs Concept, Web Services (SOAP/ REST)","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Zenmonics software Private Limited, ITPL, Discoverer Building 10th Floor ITPL Tech Park, Whitefields, Bangalore.","phone":"9160510091","profile":"Java Developer/ Tech Lead \nZenmonics Software Private Limited","description":"An exciting opportunity awaits you as Zenmonics a Product Based and FINTECH TOP 100 Company is hiring for UI Developers/ Tech Leads at Bangalore. Work Experience: 4 to 8 Years Job Location: Bangalore. Preferred who can join early. Person must have strong experience in design and development of Core Java and J2EE based applications. Excellent knowledge of OOPs Concept. Hands on experience in developing web services (SOAP/ REST). Experience on working with Frameworks like Struts/ Spring. Should have worked on Hibernate/ iBatis. Working knowledge of databases such as DB2/ Oracle/ any other databases. Should have participated in, and be familiar with, SDLC and Agile (Scrum) project methodologies. Should have excellent communication, presentation and client management skills. Should be a good problem solver, quick learner. Notice Period: 15-30 days Max Walk-in Date/ Time: 30 November 2019, 11 AM onwards Interview Venue: Zenmonics software Private Limited ITPL, Discoverer Building 10th Floor ITPL Tech Park, Whitefields, Bangalore. Contact Person- Jagan Pamu Tel: 9160510091 Interested ones can share their updated resume to Jagan.Pamu@zenmonics.com","location":"Bangalore","experience":"4 - 8 Years"},{"date":"30 - Nov - 2019","skills":"Hadoop, Sqoop, Hive, Pyspark, Spark, Java, Unix Shell Scripting","qualification":"B.E./B.Tech, MCA/PGDCA","address":"CenturyLink Technologies India Private Limited, Salarpuria Touchstone, Fourth Floor, Survey No. 15/3 & 16, Kadubeesana Halli, Varthur Hobli, Outer Ring Road, Bangalore - 560 087","phone":"Not Mentioned","profile":"Hadoop/ Java Developer \nCenturyLink Technologies India Pvt. Limited","description":"Candidate should have good knowledge Hadoop ecosystem with hands-on experience in Hive, Sqoop, Pyspark, Spark, Unix Shell Scripting. Should have good knowledge of Java. Good written and verbal communication skills are required to interact with offshore and onshore counter parts (scrum masters / business analysts / managers. Work Experience: 2 to 6 Years Primary Skills: Hadoop, Sqoop, Hive, Pyspark, Spark, Java, Unix Shell Scripting Job involves, 16x7 Shifts (Sunday to Saturday, 365 days, India day time) Ability to code, unit test, support system testing and user acceptance Awareness of configuration management and release process Interview Date & Time: 30th November 2019 @ 10:30 AM to 5:00 PM Mode of Interview: Face 2 Face Interview Venue: CenturyLink Technologies India Private Limited Salarpuria Touchstone, Fourth Floor, Survey No. 15/3 & 16, Kadubeesana Halli, Varthur Hobli, Outer Ring Road, Bangalore - 560 087 Contact Person: Mary Vinutha Note : Looking for candidates who can join us less than 30 days","location":"Bangalore","experience":"2 - 6 Years"},{"date":"30 - Nov - 2019","skills":"C#, .NET Framework 4.0/ 4.5, ASP .Net, AJAX, CSS 2.0/ 3.0, JQuery, LINQ MVC","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Configurator Solutions - Sahir Projects, Shoppers Orbit, Office No. 212 - 213, 2nd Floor, D - Wing, Above Big Bazar, VISHRANTWADI, PUNE - 411 015","phone":"Not Mentioned","profile":".NET Developer \nConfigurator Solutions - Sahir Projects","description":"Work Experience: 0 - 3 Years Skills & Abilities: C#, .NET Framework 4.0/ 4.5 ASP .Net, AJAX, CSS 2.0/ 3.0, JQuery, LINQ, MVC MS SQL SERVER & Other RDBMS Strong OOPS Concepts & SQL Strong problem solving & Analytical Skills Job Responsibilities: Coding & Unit Testing System Documentation Candidates with .Net & SQL Skills will be only entertained. Walk-in Date/ Time: 30 November 2019, 10 AM onwards Interview Venue: Configurator Solutions - Sahir Projects, Shoppers Orbit, Office No. 212 - 213, 2nd Floor, D - Wing, Above Big Bazar, VISHRANTWADI, PUNE - 411 015","location":"Pune","experience":"0 - 3 Years"},{"date":"30 - Nov - 2019","skills":"Core Java, Servlets, JSPs, J2EE, Spring, Hibernate etc.","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Hetero Healthcare Limited, Sy. No.80-84, Melange Towers, 5th Floor, B Wing, Patrikanagar Madhapur, Hyderabad - 500 081.","phone":"040 40473500","profile":"Java Developers \nHetero Healthcare Limited","description":"Candidate must have strong knowledge of Core Java, Servlets, JSPs and J2EE Should have Java framework knowledge such as Spring, Hibernate etc. Experience with web services is an advantage. JavaScript, HTML, CSS knowledge required. Experience in integrating web services with mobile clients such as iPhone/ iPad applications is optional. Walkin Interview on 30th November from 9 AM onwards Interview Venue: Hetero Healthcare Limited Sy. No.80-84, Melange Towers, 5th Floor, B Wing, Patrikanagar Madhapur, Hyderabad - 500 081. Tel No. 040 40473500","location":"Hyderabad","experience":"2 - 4 Years"},{"date":"29 - Nov - 2019","skills":"Manual - Automation Testing","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"NIIT Technologies Limited, 223 -224, Udyog Vihar, Ph-I, Gurgaon, Haryana - 122 002. Land Mark: MDH and S&D Building","phone":"Not Provided","profile":"Software Testing Engineer \nNIIT Technologies Limited","description":"Candidate should have B-Tech/ BCA or MCA with 1 to 4 years Experience / Diploma / Training in Manual - Automation Testing. Should have knowledge / experience specific to software testing or Database testing. Should be comfortable working in 24*7 shifts (Mainly Evening Shifts) and bond for 1 year. Work Location- Gurgaon Both side free cab facility will be provided within Hiring Zone. Key Competencies TESTING: Solid experience with testing tools, techniques, processes, methodologies Experience in managing testing utilizing both manual and with automated testing tools Experience with development and implementation of business and applications systems testing strategy and framework, including functional, system integration and performance testing, GUI testing, regression testing and smoke testing Know-how of Applications systems testing with automation tools, white box and black box, and the preparation of Automation framework for testing Experience in defining test strategy, RTM & test planning, test cases Exposure to ETL/ DW/ BI testing Data Analysis skills TECHNICAL: Expertise in back end querying with PL SQL Ability to write and execute simple to medium complexity Queries and joins in PL SQL Experience in testing and validation of Data Extracts, File based loaders and APIs Requirements, Test and Defect management tools experience User oriented perspective to be able to successfully envision and execute test cases Requirement Analysis skills PROJECT/ SOFT SKILLS: Solid experience with Agile as well as Waterfall methodologies with the knowledge on SDLC & STLC Experience with Test effort estimation and ability meet multiple challenging deadlines Team player Excellent oral and written communication skills Walk in Date: 29th November, 2019 Interview Timing: 12:30 PM to 4:00 PM Interested candidates are requested to directly visit us at the below mentioned address and schedule: NIIT Technologies Limited, 223 -224, Udyog Vihar, Ph-I, Gurgaon, Haryana - 122 002. Land Mark: MDH and S&D Building Contact Person: Anika","location":"Gurgaon","experience":"1 - 4 Years"},{"date":"30 - Nov - 2019","skills":"Technical Support, Customer Service/ Voice Process","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"HCL Technologies Limited, AMB 6 South Phase, MTH Road, SIDCO Industrial Estate, Ambattur, Chennai, Tamil Nadu - 600 058","phone":"Not Provided","profile":"Technical Support/ IT Service Desk \nHCL Technologies Limited","description":"HCL hiring for Service desk L1 Technical Support (Voice) Candidate should have 6 months - 3 years of Service desk (voice) Global support experience mandatory Technical support,active directory ,voice customer service, and support experience with problem solving involving troubleshooting hardware, involving hardware, software, and networks issues. Job Responsbility- Provide hardware / software / network problem diagnosis / resolution via telephone/email/chat for customers end users Route problems to internal 2nd and 3rd level IT support staff. Coordinate and manage relationships with vendors and support staff that provide hardware / software / network problem resolution. Administer and provide User account provisioning. Walkin Interview on 30th November from 10 AM onwards Venue Details: HCL Technologies Limited AMB 6 South Phase, MTH Road, SIDCO Industrial Estate, Ambattur, Chennai, Tamil Nadu - 600 058","location":"Chennai","experience":"0 - 3 Years"},{"date":"29, 30 - Nov - 2019","skills":"Technical Support, International Voice Process, Customer Service","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"One Point One Solutions Limited, 3rd floor, AKR Infinity Park, 46/1, 1st Main Road, Garvebhavipalya, 1st Main Rd, Garvebhavipalya, Krishna Reddy Industrial Area, Hosapalaya, Muneshwara Nagar, Bengaluru - 560 068","phone":"7001425466","profile":"Technical Support Executive \nOne Point One Solutions Limited","description":"Educational Qualification - 10+2 or Any Degree Language Skills - Good in English, Hindi and south indian language skills Shift - Day shift (9:30 am to 6:30 pm) Sunday OFF Job location - Bangalore Good in Communication skills Good knowledge in customer service Flexible to work in day shift Required Languages: English,Tamil English, Telugu English, Hindi, Kannada English, Hindi, Odiya English, Hindi Interview Address One Point One Solutions Limited AKR Infinity, 3rd Floor, Near Kudlu gate bus stop, Hosur Main road, Bangalore - 68 Walk-in Date/ Time: 27th - 30th November , 9 AM onwards One Point One Solutions Interview Venue: One Point One Solutions Limited, 3rd floor, AKR Infinity Park, 46/1, 1st Main Road, Garvebhavipalya, 1st Main Rd, Garvebhavipalya, Krishna Reddy Industrial Area, Hosapalaya, Muneshwara Nagar, Bengaluru - 560 068 Contact - HR MIR ( 7001425466 ) If you are really interested, Kindly contact HR Satya 8498896070 Azam 9916900778","location":"Bangalore","experience":"0 - 2 Years"},{"date":"29, 30 - Nov - 2019","skills":"Technical Support, International Voice Process, Customer Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"HCL Technologies Limited, Surya Sapphire, Electronic City Phase 1 Near D- Mart, Bangalore - 560 100","phone":"Not Provided","profile":"Technical Support (Voice Process) \nHCL Technologies Limited","description":"Work Experience: 6 months - 3 years of Service Desk (Voice) Global support experience mandatory Technical support,active directory ,voice customer service, and support experience with problem solving involving troubleshooting hardware, involving hardware, software, and networks issues. Job Responsbility- Provide hardware / software / network problem diagnosis / resolution via telephone/email/chat for customers end users. Route problems to internal 2nd and 3rd level IT support staff. Coordinate and manage relationships with vendors and support staff that provide hardware / software / network problem resolution. Walk-in Details:- Date:26th to 30th Nov- 2019 Time - 10:00 AM to 1:30 PM Venue: HCL Technologies Limited Surya Sapphire, Electronic City Phase 1 Near D- Mart, Bangalore - 560 100 Spoc: Shobhana Mandatory* Doc's:- Hard Copy of your updated Resume. Printout / Screenshot of this walk-in post One Government ID proof Xerox copy (Preferable Passport ) One Passport size photograph.","location":"Bangalore","experience":"0 - 3 Years"},{"date":"29, 30 - Nov - 2019","skills":"Technical Support, Networking, Desktop Troubleshooting, Hardware Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"HCL Technologies Limited, A-22, Sector 60, Noida (Near Noida Sector 59 Metro Station)","phone":"8586077296","profile":"Hardware Support Engineers \nHCL Technologies Limited","description":"HCL is hiring for Hardware Support Engineers with good technical knowledge and command over spoken English language. The client is a prestigious US based Healthcare Equipment Manufacturer organization. Education: Technical Graduates (Preferably B.Tech (Mechanical / EEE / ECE / CS / IT) / BCA / MCA / B.SC (IT) background) Work Experience: 1-year experience in hardware troubleshooting mandatory (International process must be there ) Job Responsbility: #Analyse and resolve moderately complex Hardware / application problems faced by clients in Timely manner #Assist in identification, validation, review and approval of customer support procedures #Documents problem and resolution accurately #Escalates or hands-off issues to other areas appropriately #Follows established Procedures and process in resolving the issues Walk-in Date: 28th - 29th November 2019 Timings: 11:00 am to 5 pm Venue: HCL Technologies Limited, A-22, Sector 60, Noida (Near Noida Sector 59 Metro Station) Contact Person: Jyoti Gupta Kindly carry: 1. A copy of your updated resume 2. A govt. address/Id proof 3. A print out of this email Please write HR Jyoti Gupta on the top of your resume for gate entry","location":"Noida","experience":"1 - 6 Years"},{"date":"29 - Nov - 2019","skills":"Technical Support, IT Helpdesk/ Service Desk, Voice Process","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"DXC Technology India Private Limited, Surya Tech Park, Electronic City, Bengaluru, Karnataka - 560 100.","phone":"Not Provided","profile":"Technical Support - Voice Process \nDXC Technology India Private Limited","description":"Candidate should have Graduation with 10+2+3/4 preferably. Typically requires 0 - 3 years general experience, or equivalent combination of experience and college level education. Knowledge and Skills: Superior skills in both written and verbal communication. Experience in customer facing role either remote or face to face. Computer proficiency with applicable software applications (for example Microsoft Office, CAD, Adobe Suite, programming. Should have good problem solving skills Accuracy in data entry. Interview Details: Date: 29th November 2019 (Friday). Time: 10:00 AM to 12:00 PM Interview Venue: DXC Technology India Private Limited, Surya Tech Park, Electronic City, Bengaluru, Karnataka - 560 100. Point of Contact: Anantha Sricharan","location":"Bangalore","experience":"0 - 3 Years"},{"date":"28, 29 - Nov - 2019","skills":"Front Office Acvtivities, Facility Management, General Administration","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"TRESPECT India Private Limited, 1002, 10th Floor, B-Wing, ONE BKC Bandra Kurla, Complex, Bandra East, MUMBAI, Maharashtra - 400 051","phone":"022-42934293","profile":"Front Office Cum Admin Executive \nTRESPECT India Private Limited","description":"Urgent opening for the post of Front office cum Admin Executive for Real Estate Company. Candidate must have excellent communication and good personality Should be able to handle both the role as Front office and Admin Must be willing to work for 6 days a week FEMALE CANDIDATES Only Job Responsbility- Attending Incoming & Outgoing calls with proper etiquettes and maintaining records for them and Greeting and assisting visitors and Guests. Ensure Visitor and Guest entry in register and Maintenance of Attendance Register. Being the mirror of the organization, to behave in a very professional manner and always acquiring the professional ethics. Taking care of dispatch, keeping records for incoming and outgoing couriers and further distribution to office employees. Monitor, respond to and distribute incoming communications Interact with external clients Maintaining required registers & filing work Assist HR in interviews of candidates Walk-in Date/ Time: 28 - 29 November , 11 AM onwards Interview Venue: ANAROCK Property Consultants Pvt. Limited. 1002, 10th Floor, B Wing, ONE BKC, G Block Bandra Kurla Complex, Bandra East, Mumbai - 400 051. Contact - Malem Thokchom ( 02242934293 )","location":"Mumbai","experience":"1 - 5 Years"},{"date":"28, 29, 30 - Nov - 2019","skills":"General Administration, Back Office Activities, Facility Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Crux Management Services Pvt. Limited 410 Life Style Building, Begumpet, Hyderabad","phone":"9848330460","profile":"Administration Executive \nCrux Management Services Pvt. Limited","description":"Candidate should be Any Graduate with 1 to 5 years of experience in General Administration, Back Office Activities, Facility Management. Should have excellent communication skills Job Responsbility- Coordinate and manage all administration work Help various project leads in coordination their work across all department Manage statutory process Walk-in Date/ Time: 28th - 13th December , 10 AM onwards Interview Venue: Crux Management Services Pvt. Limited 410 Life Style Building, Begumpet, Hyderabad Contact Person- Dande Vishnuvardhan Reddy Tel: 9848330460","location":"Hyderabad","experience":"1 - 5 Years"},{"date":"28, 29 - Nov - 2019","skills":"General Administration, Front Office/ Receptionist Activities, Vendor Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Grovalue Insurance Broker Pvt. Limited, 03, Enterprise Centre, Off Nehru Road, Near Domestic Airport Vile Parle (East) Opp Airlink Hotel, Mumbai- 400 099","phone":"022-62166623","profile":"Receptionist Cum Admin Executive \nGrovalue Insurance Broker Pvt. Limited","description":"Candidate should be Any Graduate with 2 to 5 years of experience in General Administration, Front Office/ Receptionist Activities, Vendor Management. Should have excellent communication skills. Job Responsbility- 1. Taking care of office assistance with their performance, attendance and over time. 2. Vendor management & maintaining payment reports of vendors. 3. Knowledge of Travel bookings including Domestic and International Flights/ Hotels / Trains. Walk-in Date/ Time: 25th - 29th November , 10 AM onwards Interview Venue: Grovalue Insurance Broker Pvt. Limited 03, Enterprise Centre, Off Nehru Road, Near Domestic Airport Vile Parle (East) Opp Airlink Hotel, Mumbai- 400 099 Landmark-Orchid Hotel Contact :HR Yash Pandya","location":"Mumbai","experience":"2 - 5 Years"},{"date":"28, 29, 30 - Nov - 2019","skills":"Front Office, Tele Sales, Guest Relation, Counselling, Store Incharge","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Hamstech India Private Limited, 2nd Floor, RK Plaza, Above PAVN Mor Jewellers, Panjagutta, Hyderabad.","phone":"9100445953","profile":"Counsellor/ Front Office Executive \nHamstech India Private Limited","description":"We are hiring Smart Female candidates for various profiles. Counsellor , Telecalling Executive, Front office, Admin. Required Candidate profile Smart and good communication skills. On call experience/ freshers also can apply and walkin for interview Walk-in Date/ Time: 23rd November - 10th December, 10 AM onwards Interview Venue: Hamstech India Private Limited 2nd Floor, RK Plaza, Above PAVN Mor Jewellers, Panjagutta, Hyderabad. Contact - Anita HR ( 9100445953 )","location":"Hyderabad","experience":"0 - 5 Years"},{"date":"28, 29, 30 - Oct - 2019","skills":"Office Administration, File System, Stock Management, Petty Cash Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Schbang Digital Solutions Private Limited, #613/614, 5th Floor, Schbang Digital, Oxford Tower, Kodihalli, Old Airport Road, Bangalore, Karnataka.","phone":"Not Provided","profile":"Office Administrator \nSchbang Digital Solutions Private Limited","description":"Candidate should be Any Graduate with 0 to 2 years of experience in Office Administration, File System, Stock Management, Office Management, Petty Cash Management. Should have excellent communication skills. Job Responsbility- Manage office supplies stock and place orders Prepare regular reports on expenses and office budgets Maintain and update company databases Organize a filing system for important and confidential company documents Distribute and store correspondence Walk-in Date/ Time: 25th - 30th November , 12 PM onwards Interview Venue: Schbang Digital Solutions Private Limited #613/614, 5th Floor, Schbang Digital, Oxford Tower, Kodihalli, Old Airport Road, Bangalore, Karnataka.","location":"Bangalore","experience":"0 - 2 Years"},{"date":"29, 30 - Nov - 2019","skills":"Technical Support, IT Helpdesk/ Service Desk, Desktop Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Brennan IT India Private Limited, Rupa Solitaire, Atrium E, Level 14, Suite 1418 Building No A - 1, Sector 1 Millennium Business Park, Mahape","phone":"Not Provided","profile":"Technical Support/ IT Service Desk \nBrennan IT (India) Private Limited","description":"Person must be Any Graduate/ Pursuing graduate with 2 to 6 years of experience in IT Helpdesk or IT Service Desk - Global Support, or Desktop Support. Must have a good command of the English language in order to provide effective phone, desk-side, and email support. Must be able to learn and support new and quickly changing technologies. Ability to research solutions or information regarding technical issues. Excellent interpersonal skills. Good work habits under pressure. Familiarity with a wide range of standard office automation products. High energy level. Detail oriented. Desirable Skills- The following Competencies and Experience would be an advantage in this role; ITIL V3 Foundations certified. Previous experience in MSP helpdesk. Good understanding of ITSM. Understanding of Technical Support role, Windows Sever 2008/2012, Active Directory, VMware, DHCP, DNS, Outlook Configuration, O365 Interview Date: 29th (Friday) & 30th (Saturday) Nov'19 Timings: 8:00 AM Till 1:00 PM ONLY. Venue Details : Brennan IT India Private Limited Rupa Solitaire, Atrium E, Level 14, Suite 1418 Building No A - 1, Sector 1 Millennium Business Park, Mahape Landmark: Next to Mastek Building. Nearest Railway St: Ghansoli Navi Mumbai Contact Person: Dilip Joshi - HR","location":"Mumbai","experience":"2 - 6 Years"},{"date":"25, 26, 27, 28, 29 - Nov - 2019","skills":"Backend Operations, hlookup, MIS Preparation, Vlookup, MIS Reporting","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Computer Age Management Services Limited, ITC Park 1st floor, Tower No. 8, Belapur Railway Station Complex. CBD Belapur, Navi Mumbai - 400 614","phone":"022-27579022","profile":"Back Office (MIS) Executive \nComputer Age Management Services Pvt. Limited","description":"Candidate should be Any Graduate with good communication skills Must have good knowledge in MIS, MS Excel, MS Word, Pivot, etc. Should have previous experience in MIS, Data Management, etc. Shift- General Shift Only Male candidates needed Walk-in Date/ Time: 25th - 29th November , 9 AM onwards Interview Venue: Computer Age Management Services Limited ITC Park 1st floor, Tower No. 8, Belapur Railway Station Complex. CBD Belapur, Navi Mumbai - 400 614 Interested candidate please share your CV on sa_ankita@camsonline.com Or can call on - 7358382212/ 022-27579022.","location":"Mumbai","experience":"0 - 3 Years"},{"date":"23, 25, 26, 27, 28 - Nov - 2019","skills":"Back Office Operations, Office Coordination","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Tulip Elastics Private Limited, C-15, Hoisery Complex, Phase-2, Extension, Noida - 201 305","phone":"Not Provided","profile":"Back Office Assistant \nTulip Elastics Private Limited","description":"WE NEED THE CANDIDATE WHO CAN WORK IN MANUFACTURING UNIT, FOLLOW UP FOR THE PRODUCTION GIVE THE DATES TO THE BUYERS DOMESTIC AND DISPATCH THE SAMPLES TO THE BUYERS , DAILY FOLLOW UP MAKING THE PI AND PO AS THE ORDERS SEND ALL COMMUNICATION ON EMAIL CANDIDATE SHOULD BE ANY GRADUATE CONFIDENT, WORK INDEPENDENT, WORK ON EMAIL AND FOLLOWS UP, MAKE PO AND PI MEMORY MUST Walk-in Date/ Time: 22nd - 28 November , 11 AM onwards Interview Venue: Tulip Elastics Private Limited C-15, Hoisery Complex, Phase-2, Extension, Noida - 201 305 Contact Person- ASHISH MITTAL","location":"Noida","experience":"2 - 4 Years"},{"date":"25, 26, 27, 28, 29 - Nov - 2019","skills":"Computer Operations, Office Assistance, Telesales/ Calling","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"3i Infotech Limited, Tower No. 5, 4th floor International Infotech Park, Vashi Navi Mumbai, Above Vashi Railway Station","phone":"Not Provided","profile":"Banking Process Associate \n3i Infotech Limited","description":"Education: HSC Pass/ Any Graduate Minimum Typing Speed 25 Wpm Rotational sift Walk-in Date: 22nd - 29 November (Monday to Friday) Interview Timings 11 am to 1.PM Interview Venue: 3i Infotech Limited Tower No. 5, 4th floor International Infotech Park Vashi Navi Mumbai, Above Vashi Railway Station Contact person - Ankit Mota","location":"Mumbai","experience":"0 - 5 Years"},{"date":"23 - Nov - 2019","skills":"Java, Performance Testing, Networking Protocols, Tomcat, Database, JMeter","qualification":"B.E./B.Tech","address":"Eclinicalworks India Private Limited, Brigade Nalapad Centre, 5th Floor, Garudachar Palya, Mahadevapura, Bengaluru, Karnataka - 560 048","phone":"45114412","profile":"Software Testing Engineer \nEclinicalworks India Private Limited","description":"Skills/ Abilities: 1. Hands on Experience in Java, SQL 2. Experience in application performance testing and database performance testing. 3. Knowledge of Tomcat, JConsole, chrome developer tools 4. Basic knowledge of networking layers and networking protocols. OSI, TCP etc. 5. Should have hands-on experience in Jmeter, along with above skills. The employee will be responsible for creating Jmeter scripts, running tests, analyzing results and reporting issues. 6. Should be a team player and approachable. 7. Should have strong communication skills 8.Can work under pressure. Educational Requirements: BE/ B.Tech Responsibilities: The job entails the team member to support eCW cloud hosted clients and self-hosted clients to resolve their application performance issues. The candidate needs to have strong technical knowledge, communication skills and ability to work under pressure. Have out of the box thinking approach to be able to correlate issues between multiple modules and layers of the application. The candidate should be eager to learn and take new initiatives to solve the problem. Walk-in Date: 23rd November 2019 Timings: 10:00 am - 2:00 pm Interview Venue: Eclinicalworks India Private Limited Brigade Nalapad Centre, 5th Floor, Garudachar Palya, Mahadevapura, Bengaluru, Karnataka - 560 048 Contact Person: Staney William Tel: 45114412","location":"Bangalore","experience":"1 - 4 Years"},{"date":"22, 23, 24, 25 - Nov - 2018","skills":"Automation Testing, Selenium with Java","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Extramarks Education India Pvt. Limited, D-180 , Sector 63 Noida - 201 301","phone":"Not Provided","profile":"Automation Test Engineer \nExtramarks Education India Pvt. Limited","description":"Candidate should have strong experience of 3 to 5 years of automation experience in Selenium, Core Java and Appium. Good understanding of basic testing concepts, covering user experience, APIs and business workflows. Good understanding of software test life cycles Good communication skills- able to interact directly with the dev and the BA teams. Good to Have- exposure to performance testing and working knowledge of JMeter tool Must have Exposure to DevOps practices (CI/CD) Key Responsibilities: Automation of functional and non-functional requirements To create test cases and data (manual and automated) Scripting and executing the Selenium automation scripts Walk-in Date/ Time: 20th - 25th November from 11 AM onwards Interview Venue: Extramarks Education India Pvt. Limited D-180 , Sector 63 Noida - 201 301","location":"Noida","experience":"3 - 5 Years"},{"date":"22, 23 - Nov - 2019","skills":"Software Testing, Manual Testing & Quality Assurance","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Mobiocean Technologies Pvt. Limited, A 12 3rd floor, Mohan Corporative. Near Metro Station, Sarita Vihar","phone":"Not Provided","profile":"Manual Testing Engineer \nMobiocean Technologies Pvt. Limited","description":"Candidate should be BE/ B.Tech or MCA with 2 to 6 years of experience in Software Testing, Manual Testing & Quality Assurance. Job Responsbility- End to end responsibility to create, design and deliver a robust testing framework. End to end responsibility to setup and maintain QA environment. Establish and document the manual/automated testing approach for the product, including tools, Walk-in Date/ Time: 20th - 23 November , 9 AM onwards Interview Venue: Mobiocean Technologies Pvt. Limited A 12 3rd floor, Mohan Corporative Near Metro Station, Sarita Vihar Contact Person- Kiran","location":"Delhi","experience":"2 - 6 Years"},{"date":"23 - Nov - 2019","skills":"Software Testing, QA/ Regression Testing, Defect Tracking Tool, Black Box Testing","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Contrado Imaging India Pvt. Limited, B-1908, 1909, 1910, Westgate, Near. YMCA Club, S.G. Road, Ahmedabad","phone":"Not Provided","profile":"QA Engineer/ Manual Tester \nContrado Imaging India Pvt. Limited","description":"Qualifications and training required Should hold at least Bachelor degree in Computer Science Work Experience 1-4 years of experience in QA/ Manual Testing Essential Skills - Abilities Proven work experience in Software testing and quality assurance. Strong knowledge of S/W QA methodologies, Testing fundamentals and STLC process. Strong understanding of SDLC and methodologies. Experience writing clear, comprehensive and concise test cases/scenarios. Hands on experience with Black-box testing and grey-box should be added advantage. Good analytical skill is essential to make the testing work easier. Walk-in Date/ Time: 23rd November 2019, 9 AM onwards Reporting Time: 9 AM to 10 AM Interview Venue : Contrado Imaging India Pvt. Limited B-1908, 1909, 1910, Westgate, Near. YMCA Club, S.G. Road, Ahmedabad Contact Person - Pooja","location":"Ahmedabad","experience":"1 - 4 Years"},{"date":"23 - Nov - 2019","skills":"Web application testing, Automation testing (Selenium) and Framework","qualification":"B.E./B.Tech","address":"Paragon Digital Services Private Limited, 4 CeeDeeYes Fayola Towers, S, 3A, 200 Feet Radial Road, Pallikaranai, Chennai, Tamil Nadu - 600 100","phone":"044-66929713","profile":"Software Testing Engineer \nParagon Digital Services Private Limited","description":"Education: BE/ B.Tech (Preferably from ECE & IT background) Work Experience: 3 to 5 Years Specific Skills: Candidate should have strong knowledge in web application testing Must be proficient in Automation testing (Selenium) and frame work Additional Information: Should be flexible for shifts Provide valuable insights to the team to achieve the Quality deliverable Must be an excellent Team player with 'Can do' attitude Excellent written and verbal communication skills Excellent problem solving and troubleshooting skills Should have excellent Analytical skills Walk-in Date/ Time: 23 November 2019, 10 AM onwards Interview Venue: Paragon Digital Services Private Limited 4 CeeDeeYes Fayola Towers, S, 3A, 200 Feet Radial Road, Pallikaranai, Chennai, Tamil Nadu - 600 100 Contact Person : Malathi (Senior HRD) Phone: 044-66929713","location":"Chennai","experience":"3 - 5 Years"},{"date":"25, 26, 27 - Nov - 2019","skills":"Manual testing, Black Box Testing, White Box Testing.","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Enzigma Software Private Limited, 111/10/3, Opposite D-Mart, Baner Road, Baner, Pune","phone":"Not Mentioned","profile":"QA Trainee/ Junior Test Engineer \nEnzigma Software Private Limited","description":"Position: QA Trainee, Junior Quality Assurance Engineer Experience: Freshers (0-1 years will be considered as Freshers) Candidate must be ready to work in any shift. Skill Set: Manual testing, Black Box Testing, Excellent communication- Written and Verbal, Good to have Skills: Knowledge on OOPS, Dot Net, Networking, White Box Testing. 2.5 Year employment bond is compulsory. Walk-in Date: 25th - 27th November 2019 Time: 9 AM to 11 AM Interview Venue: Enzigma Software Private Limited, 111/10/3, Opposite D-Mart, Baner Road, Baner, Pune Contact Person- Pratik Note: Candidates who have applied in the past 3 months for any position in Enzigma will not be eligible to apply.","location":"Pune","experience":"0 - 1 Years"},{"date":"23 - Nov - 2019","skills":"Software testing, Test case Authoring, Test Execution, Selenium, Webdriver","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Capgemini Technology Services India Limited, No.14, Phase III, Rajiv Gandhi Infotech Park, Village Man, Taluka, Mulshi, Haveli, Hinjewadi, Pune","phone":"Not Provided","profile":"Selenium Test Analyst/ Lead \nCapgemini Technology Services India Limited","description":"Candidate should have 2+ years experience with Selenium Webdriver with In-depth knowledge of testing Web-based applications. Familiarity with SDLC, quality standards and test methodologies. Experience working in an Agile development environment SCRUM is a plus Experience in Software testing, which includes Test case Authoring, Test Execution Should have experience writing front end test harnesses. Experience with Selenium frameworks preferred Walk-in Date/ Time: 23rd November 2019, 9 AM onwards Interview Venue: Capgemini Technology Services India Limited No.14, Phase III, Rajiv Gandhi Infotech Park, Village Man, Taluka, Mulshi, Haveli, Hinjewadi, Pune Contact Person: Jenifer Noronha Please carry a Government Approved Photo ID Original & Photo Copy while coming for the interview, without these you will not be allowed to attend the interview","location":"Pune","experience":"2 - 7 Years"},{"date":"23 - Nov - 2019","skills":"C/ C++, CSS, Java, XML, HTML, Javascript","qualification":"B.Sc, BCA/BCS","address":"Prime Focus Technologies Limited, 5B, RMZ Eco World, Bellandur, Devarabeesanahalli, Bangalore.","phone":"Not Provided","profile":"Implementation Engineer Trainee \nPrime Focus Technologies Limited","description":"Canddiate sjould ahve Bachelors Degree (BCA/ BSC Computer Science) with basic to intermediate knowledge of database concepts & SQL. Must have good experience using Windows and/or Linux commands. Exposure to XML, JSON, YAML, CSV, CVS, SVN, GIT, Windows PowerShell, Shell Scripting, AWK, SED is an added advantage Must have excellent energy levels and a go-getter attitude Excellent communication skills written, oral and presentation Must have excellent analytical and problem solving skills Experience in technical support roles, testing is an added advantage. Walk-in Date/ Time: 23 November 2019, 9 AM onwards Interview Venue: Prime Focus Technologies Limited 5B, RMZ Eco World, Bellandur, Devarabeesanahalli, Bangalore. Contact Person- Mownika Reddy A","location":"Bangalore","experience":"0 - 1 Years"},{"date":"23 - Nov - 2019","skills":"Selenium, Webdriver, Software testing, Test case Authoring, Test Execution","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Capgemini Technology Services (I) Limited, IT 1 / IT 2, Thane-Belapur Road, Airoli, Navi Mumbai, Maharashtra - 400 708.","phone":"Not Provided","profile":"Selenium Test Analyst/ Lead \nCapgemini Technology Services India Limited","description":"Candidate should have 2+ years experience with Selenium Webdriver with In-depth knowledge of testing Web-based applications. Familiarity with SDLC, quality standards and test methodologies. Experience working in an Agile development environment SCRUM is a plus Experience in Software testing, which includes Test case Authoring, Test Execution Should have experience writing front end test harnesses. Experience with Selenium frameworks preferred Experience in Automation Framework Designing, Executing and maintaining automated test scripts. Good working experience and knowledge of Selenium Webdriver & strong SQL knowledge. Good Java script knowledge, Tracking, Bug Reporting activities and Risk Analysis. Having Very good knowledge SDLC, QA process and AGILE methodology. Walk-in Date/ Time: 23rd November 2019, 9 AM onwards Interview Venue: Capgemini Technology Services (I) Limited IT 1 / IT 2, Thane-Belapur Road, Airoli, Navi Mumbai, Maharashtra - 400 708. Landmark - Road opposite to Mukand Company Contact - Anil Kumar Singh Please carry a Government Approved Photo ID Original & Photo Copy while coming for the interview, without these you will not be allowed to attend the interview.","location":"Mumbai","experience":"2 - 7 Years"},{"date":"21, 22, 23 - Nov - 2019","skills":"HR Administration, Recruitment, Office Administration","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Greeva Software Solutions Pvt. Limited, No-73/1, A.C.Block, First Street, Anna Nagar, Chennai - 600 040. Landmark : Opposite to Hotel Saravana Bhavan.","phone":"9003071280","profile":"Admin Cum HR Executive \nGreeva Software Solutions Pvt. Limited","description":"Currently we have a immediate opening for Admin cum HR Executive position in our own firm. DESIGNATION: ADMIN Cum HR EXECUTIVE Preferred only Female candidates Qualification- Any Degree with Ms office & Good Communication skills. Basic knowledge of Recruitment. Should be able to work under pressure Preferred Experienced [0 to 2 Years] Freshers can also apply. Roles and Responsibility: Handling of Payroll Process Knowledge and knowing to work on ESI and pf Maintaining Accounts. Sourcing profiles from portals, database, references based on CLIENT requirement Follow up with candidates. Salary Package - Upto Rs.15000/-PM interested candidates can walk in between 10am - 4pm from 20.11.2019 to 23.11.2019. GREEVA SOFTWARE SOLUTIONS (P) LTD No-73/1, A.C.Block, First Street, Anna Nagar, Chennai - 600040. Landmark : Opposite to Hotel Saravana Bhavan. Or Call & Forward your updated CV to the person. Ms. Divya 9003071280 hrm@greeva.com","location":"Chennai","experience":"0 - 2 Years"},{"date":"26 - Nov - 2019","skills":"Core Java/ Http/ J2EE fundamentals, Java, JDBC, JTA, RESTful Services","qualification":"B.E./B.Tech","address":"FTD India Private Limited, Block D - Wing II, 5th Floor, Cyber Gateway Building, HitechCity, Madhapur Village, Hyderabad Telangana - 500 081","phone":"040-66030303","profile":"Software Engineer/ Java Lead \nFTD India Private Limited","description":"We are seeking passionate software application developers to work with our highly talented team of young dedicated professionals who aim to give our customers a memorable shopping experience. Education: BE/ B.Tech in circuitry branches from premier institutions Candidate must have secured 70% throughout academics Experience Range: 6 to 9 years in software development Knowledge, Skills and Abilities: Strong in Core Java/ Http/ J2EE fundamentals. Good hands on skills in Java, JDBC, JTA, RESTful Services Good experience with frameworks like Spring core, Spring MVC and Hibernate Strong Experience with Relational databases like Oracle or MySQL Working experience in Unix/Linux environment Good problem solving and excellent communication skills. Experience in JavaScript, JQuery, CSS, Bootstrap, HTML, Ajax. Walk-in Date/ Time: 26 November 2019, 9 AM onwards Interview Venue: FTD India Private Limited Block D - Wing II, 5th Floor, Cyber Gateway Building, HitechCity, Madhapur Village, Hyderabad Telangana - 500 081 Contact Person- Naga Kumar Phone: 040-66030303","location":"Hyderabad","experience":"6 - 9 Years"},{"date":"22 - Nov - 2019","skills":"JAVA, Core Java, Data Structure, Algorithm","qualification":"B.E./B.Tech, MCA/PGDCA","address":"SDG Software India Private Limited, A-10, Sector-2, Noida","phone":"Not Provided","profile":"Java Professionals \nSDG Software India Private Limited","description":"SDG Software India Private Limited, is Looking to hire a group of 10-15 candidates with Core Java skills and willingness to get trained & work in Identity Access Management (SailPoint Development) domain. Ideally Java skilled 1 to 4 years experienced candidates are invited. Freshers with Computers background or relevant Java Certifications can also apply. Interview Process will include: 1. Written Test on Java 2. Technical Interview with Panel 3. HR Round Walk-in Date/ Time: 22nd November 2019, 10 AM onwards Interview Venue- SDG Software India Private Limited A-10, Sector-2, Noida To appear, book your slot by reverting with your updated resume and time slot for 22nd November on priyanka.purwar@sdgc.com","location":"Noida","experience":"0 - 4 Years"},{"date":"22 - Nov - 2019","skills":"Java, SQL, Rest APIs","qualification":"B.E./B.Tech, MCA/PGDCA","address":"CSS Corp Private Limited, Unit - B (2) First Floor, Victor Building, ITPB Bangalore - SEZ Whitefield Road, Bangalore - 560 066","phone":"Not Provided","profile":"Java Developer/ Fresher \nCSS Corp Private Limited","description":"CSS Corp Private Limited is hiring for Enthusiastic, Aspiring and Career Oriented Freshers at ITPL Bangalore. Year of Passing - 2017 to 2019 (No standing Arrears/ Backlogs) Strong written and verbal communication, soft skills along with inter-personal skills Basic knowledge on Java, SQL, Rest APIs Enthusiast for continual learning, attention to details Willingness to work unsociable hours (1 AM to 10 AM) with rotational/ Split day offs Investigating, Diagnosing and solving issues with Retail IT equipment's and applications Interested candidates can walk-in directly to the below address on 22nd November 2019 (Friday). Time - 11 AM to 5 PM Venue: CSS Corp Private Limited Unit - B (2) First Floor, Victor Building, ITPB Bangalore - SEZ Whitefield Road, Bangalore - 560 066 Contact Person: Abhishek Sao Please carry your Original ID card and the copy of this call letter without which you will not be allowed inside the ITPL.","location":"Bangalore","experience":"0 - 1 Years"},{"date":"21, 22 - Nov - 2019","skills":"Java and Linux (Support and Maintenance)","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Ionidea Interactive Private Limited, # 38-40, EPIP, Besides SAP LABS Whitefield, Bangalore 560 066.","phone":"080-66581500","profile":"Java Support Engineer \nIonidea Interactive Private Limited","description":"Education : BE/ B.TECH/ MCA/ M.TECH Year of pass out : 2017/2018/2019 Eligibility : Above 60% in UG, PG, 12th and 10th Experience : Freshers Skill : Trained in Java and Linux (Support and Maintenance) Job Location : Bangalore Walk-in Date: 21st - 22nd November 2019 Time: 9.00 AM to 12.00 PM Interview Venue: Ionidea Interactive Private Limited # 38-40, EPIP, Besides SAP LABS Whitefield, Bangalore 560 066. Landmark: KTPO Stop, Near Ginger Hotel Contact - Merina ( 66581500 )","location":"Bangalore","experience":"0 - 1 Years"},{"date":"21, 22, 23 - Nov - 2019","skills":"General Administration, Back Office Assistance","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Vindhya e-Infomedia Private Limited, No. 3, 4th Main Road, 2nd Cross, 4th Stage, Industrial Town, Rajajinagar, Bangalore.","phone":"9535019153","profile":"Administration Executive \nVindhya e-Infomedia Private Limited","description":"Educational Qualification: Any Graduate/ B.com Skills: Should have basic computer knowledge Languages Preferred : English Shift Timings: 8:00 am to 5:00 PM Job Location : Electronic City Salary: 10k - 15K Walk-in Date/ Time: 20th November - 23 November , 9 AM onwards Interview Venue: Vindhya e-Infomedia Private Limited No. 3, 4th Main Road, 2nd Cross, 4th Stage, Industrial Town, Rajajinagar, Bangalore. Contact Person- Farha (9535019153)","location":"Bangalore","experience":"0 - 1 Years"},{"date":"21, 22 - Nov - 2019","skills":"General Administration/ Facility Management, Back Office Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Saisystems Health Tech Private Limited, No. 35/ 60,Venkatanarayana Tower 2nd Floor, Venkatanarayana Road, (Near Nandhanam Metro) CIT Nagar West, Nandhanam, Chennai","phone":"044-45508466","profile":"Administration Executive \nSaisystems Health Tech Private Limited","description":"Candidate should be Any Graduate with experience in Day to Day office Administration. Should have experience in Booking Airline tickets, Cabs and Travel management Must be proficient in MS excel, work, PowerPoint Excellent verbal and written communication skills Walk-in Date/ Time: 21st - 22nd November , 9 AM onwards Interview Venue: Saisystems Health Tech Private Limited No. 35/ 60,Venkatanarayana Tower 2nd Floor, Venkatanarayana Road, (Near Nandhanam Metro) CIT Nagar West, Nandhanam, Chennai Contact Person: Elakkiya Contact No: 044-45508466 If Interested kindly forward your CV to eelangovan@health.saisystems.com with below mentioned details- Current CTC: Expected CTC: Total Yrs of Experience: Notice Period:","location":"Chennai","experience":"2 - 7 Years"},{"date":"21, 22, 25, 26, 27, 28, 29 - Nov - 2019","skills":"Java EE (JSP, Servelets, JPA), J2EE, JVM internals, AJAX","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Marolix Technology Solutions Pvt. Limited, 3 Cube Towers, Kondapur, Whitefield Road, Beside watermark building, Hyderabad - 500084","phone":"Not Provided","profile":"Java Developers \nMarolix Technology Solutions Pvt. Limited","description":"Applicant must have Practical demonstrated experience in design and development of applications with major web development frameworks, including Java EE (JSP, Servelets, JPA), J2EE, JVM internals, AJAX. Must have experience designing and implementing with Struts or Spring or other MVC framework. Hands on experience on Jasper reports development or similar to Jasper reports. Reasonably good at UI with fundamental exposure to the technologies like HTML5, JSP, Java Script, JQUERY, CSS, Bootstrap, etc. Should have hands on experience on advanced JS frameworks like Angular2 is must. Walk-in Date/ Time: 20th - 29 November , 10 AM onwards Interview Venue: Marolix Technology Solutions Pvt. Limited, 3 Cube Towers, Kondapur, Whitefield Road, Beside watermark building, Hyderabad - 500084 Contact Person - Sai Krishna Boddu","location":"Hyderabad","experience":"3 - 6 Years"},{"date":"23 - Nov - 2019","skills":"Android Studio, Java, SQLite, Android SDK, JSON, XML, Rest, SOAP","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Inogic Tech (india) Private Limited, Everest Nivara Infotech Park 1. Office No-301, 3rd Floor, B Wing, Plot No D-3, TTC Industrial Area, Indira Nagar, Turbhe, MIDC, Navi Mumbai- 400 705","phone":"Not Mentioned","profile":".Net Developer/ Freshers \nInogic Tech (india) Private Limited","description":"Fresher's Mega drive on 23rd November' 2019 (Saturday) from 9:30 AM till 3:30 PM Eligibility Criteria:- Certification In Asp, .Net is Mandatory Throughout First Class will be preferable Must be ready to sign a bond for 3 Years Interview Process:- 1. Aptitude Test 2. HR Round Walk-in Date/ Time: 23 November 2019, 10 AM onwards Interview Venue: Inogic Tech (india) Private Limited Everest Nivara Infotech Park 1. Office No-301, 3rd Floor, B wing, Plot no D-3, TTC Industrial Area, Indira Nagar, Turbhe, MIDC, Navi Mumbai- 400 705 Contact Person- Ms. Shraddha","location":"Mumbai","experience":"0 - 1 Years"},{"date":"22 - Nov - 2019","skills":".Net and WPF, Angular, ASP. NET MVC, JQUERY, WEB API","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Wipro Limited, Candor Tech space, Building Number 2, Near Subhash Chowk, Tikri, Sohna Road, Sector 48, Gurgaon","phone":"9650220715","profile":".Net/ WPF Developer \nWipro Limited","description":"Wipro Limited is hiring for Software Developer (.Net and WPF) Experience: 2.5 to 7 Years Job Location: Gurgaon Candidate must be experienced C# programmer (.Bet 4.5 and above) Exposure/ Experience in WPF and Windows Forms based application (MUST TO HAVE) Should have worked on at least 2 WPF based projects in last 1 -2 years (MUST TO HAVE). Exposure/ Experience in Angular, ASP. NET MVC, JQUERY, WEB API (Added advantage). Must have good exposure to OOPS/ design patterns Experience in RDBMS (preference SQL server) Familiarity with Agile processes and estimation is a plus. NOTE: We are looking for candidates who can join in 30-45 days. Interested candidates can attend Walk-in on 22nd November at 9:30 AM till 1:00 PM. Time to report: 9:30 AM till 12 PM Wipro Limited, Candor Tech space, Building Number 2, Near Subhash Chowk, Tikri, Sohna Road, Sector 48, Gurgaon Contact Person: Satbir Kaur Please reply with updated resume at satbir.kaur@alight.com / satbir.kaur@wipro.com In case of any queries, please Call at +91-9650220715","location":"Gurgaon","experience":"2 - 7 Years"},{"date":"23 - Nov - 2019","skills":".Net Core / .Net Bootstrap/ .Net MVC","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Wipro Limited, CDC3, Annasalai Road, Guindy, Chennai.","phone":"Not Provided","profile":".Net Professionals \nWipro Limited","description":"Work Experience : 4 to 10 years Primary Skills: .NET Core2.0 (Mandatory) MVC (Mandatory) SQL Azure Bootstrap for .Net ASP.NET MVC 5 Azure Angular WebAPI Walk-In Date : 23rd November 2019 (Sat) Time : 9:30 AM onwards Walk In Location: Wipro Limited CDC3, Annasalai Road, Guindy, Chennai. Please carry your resume & a government ID proof - Mandatory","location":"Chennai","experience":"4 - 10 Years"},{"date":"21, 22 - Nov - 2019","skills":"Core Java, Java 8, Spring/ Spring boot, MySQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Channelplay Limited, Plot No. 800, Udyog Vihar, Phase 5, Sector-19, Gurugram, Haryana","phone":"8448482741","profile":"Software Engineer - Java \nChannelplay Limited","description":"Required Skills Core Java (Mandatory), Java 8 (Preferred) Spring (Mandatory)/ Spring boot (Good to have) MySQL (Mandatory) Hibernate (Mandetory) NoSQL - MongoDB (Preferred) Open sources - Redis/ Memcached/ RabbitMQ/ Kafka/ ELK (Preferred) Git (Preferred) Walk-in Date/ Time: 20th November - 22nd November , 10 AM onwards Interview Venue: Channelplay Limited Plot No. 800, Udyog Vihar, Phase 5, Sector-19, Gurugram, Haryana Contact Person- Riddhi Sehgal Phone: 8448482741","location":"Gurgaon","experience":"2 - 5 Years"},{"date":"21, 22, 23 - Nov - 2019","skills":"C# .NET, ASP .NET, Windows Forms, Web Forms, MS SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Shivashakthi Bio Technologies Limited, 7-1-621/98-621/34, Sanjeev Reddy Nagar, Hyderabad - 500 038.","phone":"66687275","profile":".Net Developer \nLister Technologies Private Limited","description":"Shivashakti Bio Technologies Limited is a Product based company. We are hiring DOT NET DEVELOPERS for our In-house projects. Interested candidates can attend this Interview... Job Role: Software Developer (.Net) Qualification: Any Degree Experience: 0-2 Years Location: Corporate Office, Hyderabad Required Skills: Should have Good Knowledge / Experience in C# .NET, ASP .NET, Windows Forms, Web Forms, MS SQL Server Walk-in Date/ Time: 20th November - 23 November , 10 AM onwards Interview Venue: Shivashakthi Bio Technologies Limited 7-1-621/98-621/34, Sanjeev Reddy Nagar, Hyderabad - 500 038. Landmark: Opposite AXIS Bank Limited Contact Person- Ajay Kumar Phone: 66687275","location":"Hyderabad","experience":"0 - 2 Years"},{"date":"21, 22 - Nov - 2019","skills":"HR Administration, Recruitment, Office Administration","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"ICA Edu Skills Private Limited, C1, Madhavhari Apartment, Near Shital Hotel, Karve Statue, Kothrud, Pune","phone":"8149256111","profile":"Admin / HR Executive \nICA Edu Skills Private Limited","description":"Candidate should be graduate with good communication & ready to learn new things Age - 20 to 25 Year Responsibilities- Tele-Counselling to students Students coordination Making Reports in Excel File Location - Kothrud & Camp Job Timings - 9 am to 6 pm Salary - Rs 10,000 PM Walk-in Date/ Time: 18th - 22nd November , 11 AM onwards Interview Venue: ICA Edu Skills Private Limited C1, Madhavhari Apartment, Near Shital Hotel, Karve Statue, Kothrud, Pune Contact Person- Vinod Mahale Mobile: 8149256111","location":"Pune","experience":"0 - 1 Years"},{"date":"21, 22, 23 - Nov - 2019","skills":"Android Application Development, Java, Android SDK","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Mobiocean Technologies Pvt. Limited, A 12 3rd floor, Mohan Corporative Near Metro Station Sarita Vihar","phone":"Not Provided","profile":"Android Developer \nMobiocean Technologies Pvt. Limited","description":"We are looking for an Android developer responsible for the development and maintenance of applications aimed at a vast number of diverse Android devices. Your primary focus will be the development of Android applications and their integration Walk-in Date/ Time: 20th November - 23 November , 9 AM onwards Interview Venue: Mobiocean Technologies Pvt. Limited A 12 3rd floor, Mohan Corporative Near Metro Station Sarita Vihar Contact Person- Kiran","location":"Delhi","experience":"2 - 4 Years"},{"date":"23 - Nov - 2019","skills":"Java / J2EE including frameworks like Spring boot, Hibernate etc","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"PurpleTalk India Private Limited, 11th &12th Floors, Watermark Technopark, Survey No.9, Whitefields, Kondapur, Hyderabad, Telangana - 500 084","phone":"Not Mentioned","profile":"Java Developer \nPurpleTalk India Private Limited","description":"Person should have 3 years of minimum experience in Java software development. Strong in Java/ J2EE including frameworks like Spring boot, Hibernate etc. Experience with Microservices based architecture including building Good knowledge on SQL (MySQL/ Oracle/ SQL Server / Postgres), NoSQL (MongoDB/ Cassandra), App server Knowledge (Tomcat/ JBoss etc.), OSGi, REST Web Services Working / Usage experience of Docker, Jenkins, Multi threading, Design paterns, Java 1.8 and Container Experience with Cloud computing in added advantage (AWS / Azure) Assist production support team with any system issues as they arise. Strong Debugging and Troubleshooting Expertise. Strong communication skills (oral and written). Walkin Interview on 23rd November from 10 AM onwards Interview Venue: PurpleTalk India Private Limited 11th &12th Floors, Watermark Technopark, Survey No.9, Whitefields, Kondapur, Hyderabad, Telangana - 500 084","location":"Hyderabad","experience":"3 - 8 Years"},{"date":"23 - Nov - 2019","skills":"Java, Spring, Hibernate","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Mindgate Solutions Private Limited, 14th Floor, Damji Shamji Business Galleria, LBS Marg, Kanjurmarg (West), Mumbai- 400 078","phone":"022-61966196","profile":"Java Developer (Freshers) \nMindgate Solutions Private Limited","description":"Candidate must be BE or MCA only. Work Experience: Fresher/ 0 to 1 Year If Candidate is Java certified will be an advantage. Walk-in Date/ Time: 23rd November 2019 11 AM onwards Interview Venue: Mindgate Solutions Private Limited 14th Floor, Damji Shamji Business Galleria, LBS Marg, Kanjurmarg (West), Mumbai- 400 078 (5 min Walkable from Kanjurmarg West station) Contact - HR ( 022-61966196 ) Needs to Carry: 1. Updated CV 2. Passport Size photos","location":"Mumbai","experience":"0 - 1 Years"},{"date":"21, 22 - Nov - 2019","skills":"Java, C#, Ping Identity Suite, Oracle IAM","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Like Minds Software India Private Limited, #143/6C, 2nd Floor, Eswaran Salai, Karapakkam, Chennai - 600 097","phone":"044-61721100","profile":"Trainee Engineers - IDM/ Java \nLike Minds Software India Pvt. Limited","description":"Candidates are invited for a walk-in interview for the position of IdM Engineer Trainee from 21 to 22 November from 10:30 am to 1:00 pm. The first round is an online test for 60 minutes consisting of aptitude and java questions. More weightage is given to aptitude and a minimum of 70% score is required. The candidate should also possess good communication skills. ESSENTIAL RESPONSIBILITIES: Implement one or more of the following from the Ping Identity Suite, Oracle IAM. The IDM Engineer Trainee will implement Identity and Access Management products and provide production support to Identity Management system developed. Complete training (on-job/dedicated) will be provided to the IDM Engineer Trainee on cutting edge Identity and Access Management systems. The selected trainee is expected to be a versatile person and with knowledge of programming languages like Java, C#. Walk-in Date: 21st - 22nd November 2109 Timings: 10:30 am to 1:00 pm Interview Venue: Like Minds Software India Private Limited #143/6C, 2nd Floor, Eswaran Salai, Karapakkam, Chennai - 600 097 Contact - Aishwarya Phone: 044-61721100 Please Bring along with you a copy of your resume. The candidates selected in the first round will face two more rounds of interview.","location":"Chennai","experience":"0 - 1 Years"},{"date":"22 - Nov - 2019","skills":"General Administration, Back Office Activities, Facility Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"SpiceJet Limited, Building No. 319, Udyog Vihar, Phase 4, Gurgaon, Haryana - 120 016","phone":"Not Provided","profile":"Administration Executive \nSpiceJet Limited","description":"SpiceJet Limited is conducting walk-in interviews for the position of Executive/ Sr. Executive in our Administration Department on 22nd November' 2019 from 10 am Till 12 Noon (Friday) Educational Qualification: Graduate Work Experience: 2 - 3 Years Job Location: Gurgaon Required Skills: Minimum Admin Experience for 2-3 years. Able to speak, write and communicate in English. Should have good Computer skills. Good Knowledge on SAP. Job Responsbility: Managing the housekeeping and security guard staffs' data and duties. Responsible for checking the cleanliness of office. Responsible for checking the office's assets are in good condition. Responding the mails. Kindly report at the below mentioned address and do carry a copy of your updated resume along: Dress Code : Formals Interview Venue: SpiceJet Limited Building No. 319, Udyog Vihar, Phase 4, Gurgaon, Haryana - 120 016 Walk-in Date/ Time: 22nd November 2019, 10 AM onwards","location":"Gurgaon","experience":"2 - 3 Years"},{"date":"21, 22, 23, 25, 26, 27, 28, 29, 30 - Nov - 2019","skills":"General Administration, Grievance Handling, Patient Care","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Narayana Hrudayalaya Limited, 1-1A, Keshavrao Khadye Marg, Haji Ali, Haji Ali Government Colony, Mahalakshmi, Mumbai, Maharashtra - 400 034","phone":"8657474977","profile":"Admin/ Floor Co-ordinator \nNarayana Hrudayalaya Limited","description":"Candidate should be Any Graduate with 0 to 3 years of experience in General Administration, Grievance Handling, Patient Care Job Responsbility- To co- ordinate for Admission & Discharge processes. To solve patient & their attendants' queries & issues. To check for cleaning status of the rooms & toilets, availability of all amenities; coordinate with the respective stakeholders/ reporting superior from Operations team in case of any concern. To provide healthy and comfortable environment to the Patient & their attendants. Walk-in Date/ Time: 21st November - 30 November , 9 AM onwards Interview Venue: Narayana Hrudayalaya Limited 1-1A, Keshavrao Khadye Marg, Haji Ali, Haji Ali Government Colony, Mahalakshmi, Mumbai, Maharashtra - 400 034 Contact Person- Apurva Jathar Mobile: 8657474977","location":"Noida","experience":"0 - 3 Years"},{"date":"23 - Nov - 2019","skills":"C#, Angular, React, MVC, .NET Framework","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"CGI Information Systems & Management Consultant Pvt. Limited, Divyasree Technopolis, Yemlur Main Road, Off HAL Airport Road, Bangalore - 560 037","phone":"Not Provided","profile":".Net Developer \nCGI Information Systems & Management Consultants","description":"CGI Information Systems & Management Consultants Pvt. Limited is looking for .Net Developer with C# and MVC Work Experience: 4-9 years Work Location: Bangalore F2F Interview on 23 Nov 19(Saturday) Walk-in Date/ Time: 23 November 2019, 10 AM onwards Interview Venue: CGI Information Systems & Management Consultant Pvt. Limited Divyasree Technopolis, Yemlur Main Road, Off HAL Airport Road, Bangalore - 560 037 Contact Person -Sonam Kindly share your below required details - sonam.singh@cgi.com else your profile will not be processed Total Experience: Rel exp(Dot Net Development) exp on( MVC): exp on( C#): CTC: ECTC: Contact number: Official Notice period: Current organization: Current Location: PAN Card no.- Available on F2F Interview on 23 Nov 19(Saturday) [Y/N]:","location":"Bangalore","experience":"4 - 9 Years"},{"date":"21, 22 - Nov - 2019","skills":"Php, Mysql, firebase, Mongodb, CSS, Codeigniter, Javascript","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Avplat India Private Limited, 4th Floor, KTC Illumination, Mind Space, Madhapur, Hyderabad.","phone":"9618755050","profile":"Software Engineer (PHP) \nAvplat India Private Limited","description":"Avplat is seeking an PHP/ Full-Stack Developer to join us in developing premium native experiences for our consumers. In this role, you will deliver well designed, highly testable, and resilient applications. You will also be instrumental in driving our mobile technology roadmap forward and evangelizing mobile development and testing practices. The successful candidate is both deeply experienced with mobile development and a team player that thrives in a collaborative agile environment. Walk-in Date/ Time: 20th - 22nd November , 10 AM onwards Interview Venue: Avplat India Private Limited 4th Floor, KTC Illumination, Mind Space, Madhapur, Hyderabad. Contact Person- Naveen Tel: 9618755050","location":"Hyderabad","experience":"2 - 5 Years"},{"date":"21, 22 - Nov - 2019","skills":"Software Testing, MySQL","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Clover Infotech Private Limited, Radius Plot No. 61, 3rd Floor, Road No. 13, MIDC Opposite Paradise by Tunga Hotel / Orkay Mills Bus Stop lane Opp Nexa Service Centre, Andheri East, Mumbai - 400 093","phone":"9004131365","profile":"IT Trainee/ Software Testing \nClover Infotech Private Limited","description":"We have Excellent Job Opportunity for freshers who are looking to make career in IT field Eligibility : B.E /B.Tech / MCA /M.Sc /B.Sc / BCA / B.Com / BA Need to be effective in verbal & written communication Agree to be a part of Clover Retention Agreement for a period of min 2.6 years to max 3.6 years Should be willing to relocate anywhere in India Should be willing to work in rotational shifts Interested candidates can directly Walkin on below mentioned date and venue With Ref to :- Aniket Naik Date - 21st - 22nd November 2019 (Thursday & Friday) Walk-in Time : 9:30 AM - 12:00 PM Venue: Clover Infotech Private Limited Radius Plot No. 61, 3rd Floor, Road No. 13, MIDC Opposite Paradise by Tunga Hotel / Orkay Mills Bus Stop lane Opp Nexa Service Centre, Andheri East, Mumbai - 400 093","location":"Mumbai","experience":"0 - 1 Years"},{"date":"25 - Nov - 2019","skills":".Net Trained/ Freshers","qualification":"B.E./B.Tech, MCA/PGDCA","address":"SA Global, Salapuria Windsor, # 3, 2nd Floor, Ulsoor Road, Yellappa Chetty Layout, Ulsoor, Bengaluru - 560 042","phone":"Not Mentioned","profile":".Net Developer/ Fresher \nSystems Advisers Software Services Pvt. Limited","description":"Systems Advisers Software Services Pvt. Limited, is hiring Freshers who have got trained on Dot Net Technologies Interested candidates can walk-in to our office on 25th November 2019 anytime between 10 AM to 6 PM. Venue: SA Global, Salapuria Windsor, # 3, 2nd Floor, Ulsoor Road, Yellappa Chetty Layout, Ulsoor, Bengaluru - 560 042","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"21 - Nov - 2019","skills":"C#, ASP .NET, .Net Framework & Database","qualification":"B.E./B.Tech, MCA/PGDCA","address":"eMudhra Limited, Survey No. 80/2 , Plot No. 23 , 24 - 25, 2nd Floor Bellandur Village Varthur Hobli , Bangalore - 560 103","phone":"42275316","profile":"Junior .Net Developer \neMudhra Limited","description":"The following skills are preferred for the role: C# (Mandatory) ASP .NET .Net Framework Database Walk-in Date/ Time: 21st November 2019, 9 AM onwards Interview Venue: eMudhra Limited Survey No. 80/2 , Plot No. 23, 24 - 25, 2nd Floor Bellandur Village Varthur Hobli, Bangalore - 560 103 Landmark: above ICICI Bank, Bellandur Branch Opposite to Akme Apartment, before Toyota Showroom Contact Person- Ramya Choudary ( 42275316 )","location":"Bangalore","experience":"0 - 1 Years"},{"date":"25, 26, 27, 28, 29, 30 - Nov - 2019","skills":"PHP 5+, LINUX, APACHE, MYSQL, MVC, HTML","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Greynium Information Technologies Pvt. Limited, # 74/2, 2nd Floor, Sanjana Plaza, Elephant Rock Road, 3rd Block, Jayanagar, Bengaluru - 560 011","phone":"9886610338","profile":"LAMP (Php) Developer \nGreynium Information Technologies Pvt. Limited","description":"Candidate should have 1+ year of experience developing on a LAMP (Linux, Apache, MySQL, PHP) environment. Experience PHP 5+ and MVC Framework. Experience with web development using HTML, CSS3, JavaScript, Jquery and AJAX. Experience with modern development techniques such as memcaching and REDIS Experience using a JavaScript framework such as jQuery. Experience with smarty templates and version control mechanisms Knowledge in NoSQL databases like Couchbase Walk-in Date/ Time: 25 November - 13th December , 11 AM onwards Interview Venue: Greynium Information Technologies Pvt. Limited # 74/2, 2nd Floor, Sanjana Plaza, Elephant Rock Road, 3rd Block, Jayanagar, Bengaluru - 560 011 Contact Person- Ms. Vidya If Interested, Please contact company HR at vidya.m@oneindia.co.in / 9886610338","location":"Bangalore","experience":"1 - 6 Years"},{"date":"30 - Nov - 2019","skills":"Php, LAMP Stack, HTML, CSS, JavaScript, AJAX, jQuery, JSON and XML","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Muvi Entertainment Private Limited, 3rd Floor, IDCO Tower 2000, Mancheswar Industrial Estate Rasulgarh, Bhubaneswar - 751 010","phone":"Not Provided","profile":"PHP/ Fullstack Developer \nMuvi Entertainment Private Limited","description":"We are hiring multiple positions at mid-senior level PHP/ Fullstack Developers to join Muvis growing Engineering team. You will be working on some latest and greatest technology stack like Big Data, AI, Blockchain. To be successful at this role, you should be a self driven problem solver and excellent coder. Basic Requirements: 1+ years development experience on LAMP stack Front-End development with technologies such as HTML, CSS, JavaScript, AJAX, jQuery, JSON and XML Experience on any framework like Zend, YII, Symfony, Laravel, CodeIgniter, CakePHP Strong knowledge of databases modelling and design Strong experience in API design and REST based services Good understanding of Accessibility and Security Compliance Knowledge of Cloud Services and Clusters like AWS EC2, S3 Knowledge of Service Oriented Architecture would be a bonus Have Self-directed work ethic with attention to detail and good communication skills Job Responsibilities: Build modular, testable, and reusable PHP modules Contribute in all phases of the feature release cycle Contribute ideas on using latest technologies Solve complex performance problems and architectural challenges Pay strong attention to DB designing and module dependencies Walk-in Date/ Time: 30 November 2019, 9 AM onwards Interview Venue: Muvi Entertainment Private Limited 3rd Floor, IDCO Tower 2000, Mancheswar Industrial Estate Rasulgarh, Bhubaneswar - 751 010 Landmark - In front of Bharat Motors Contact Person - Sheel Jena","location":"Bhubaneshwar","experience":"1 - 6 Years"}]}