{"Walkins":[{"date":"27, 28, 29, 30 - Jan - 2021","skills":"JavaScript, JQuery, Php, Opencart, MySQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Recenturesoft Infotech Private Limited, A-125, 1st Floor, Sector 63, Noida, Uttar Pradesh - 201 301","phone":"9654880668","profile":" PHP Developers/ Lead \nRecenturesoft Infotech Private Limited","description":"PHP DEVELOPERS - 2-4 years experience - 3 positions LEAD PHP DEVELOPERS - 5-8 years experience - 2 positions Candidate must have strong experience in PHP web development Strong knowledge of Core PHP, Any framework. Understanding the fully synchronous behaviour of PHP. Knowledge on REST API Development. Working on Product based Development. Good understanding and knowledge on various database: 1) JavaScript 2) JQuery 3) Php 4) Opencart 5) Mysql 6) LAMP Environment Team Management experience for lead position Work from office only preferred immediate joiners Interview will take place at office only Desired Candidate Profile Must have Good Communication Skills Should be logically sharp and have great problem solving skills Walk-in Date/ Time: 27th - 30th January 2021, 11.00 AM - 5.00 PM Venue Details- Recenturesoft Infotech Private Limited A-125, 1st Floor, Sector 63, Noida, Uttar Pradesh - 201 301 Contact - ( 9654880668 )  ","location":"Noida","experience":"2-7Years"},{"date":"25 - Jan - 2021","skills":".Net framework, C#, ASP .Net & MS SQL Server, PHP and MySQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Infomaze Elite Private Limited, # 286-A, Hebbal Industrial Area, Mysuru, Karnataka - 570 018 Land Mark: Opposite Oasis Hotel, Behind L&T Technology","phone":"Not Provided","profile":" .Net/ PHP Developers \nInfomaze Elite Private Limited","description":"1) Dotnet Developer/ Fresher: Qualification: Graduate/ Post Graduate in (CS/ IS/ IT) Added Advantage = Dot net Certified Fresher with .Net framework, C#, ASP .Net & MS SQL Server Strong knowledge of OOPS Concepts. Knowledge of Software development life cycle. Java Script, JQuery, and Ajax will be added advantage. Good communication skills, attitude and Logical thinking 2) PHP Developer/ Fresher: Qualification: Graduate / Post Graduate in (CS/ IS/ IT) Work Experience: 0 - 5 Years Added Advantage: Relevant certification Candidate must have good knowledge of PHP and MySQL Basic understanding of technologies such as HTML, CSS, PHP, Laravel, CodeIgniter, Familiarity with SQL databases. Walk-in Date/ Time: 25th January 2021, 9.30 AM - 1.00 PM Venue Details- Infomaze Elite Private Limited # 286-A, Hebbal Industrial Area, Mysuru, Karnataka - 570 018 Land Mark: Opposite Oasis Hotel, Behind L&T Technology Contact - Bhagyavathi Interested candidate can share your resume to jobs@infomazeapps.com  ","location":"Mysore","experience":"0-5Years"},{"date":"20 - Jan - 2021","skills":"Customer Support, Mall Management, Product Demonstration, Retail Sales, Payment Collection","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Ample Technologies Private Limited, N-1, Connaught Place, New Delhi - 110 001.","phone":"8056279641","profile":" Demonstration Specialist \nAmple Technologies Private Limited","description":"We have vacancies for Demonstration Specialist for Delhi location : N-1, Connaught Place, New Delhi - 110001 Desired Profile- Adaptability Communication Contributes to Team Success Customer Orientation Presentation of Self Please Note- Only candidates with fluent English speaking skills will be eligible. Candidates from Hotel industry can also apply. Job Responsibility- * Maximize the sale of Audio/ Video Products at the store, ensuring optimum customer satisfaction. * Achieve sales goals relative to store target. * Evaluating the customer's requirement by following the Bose customer engagement standards to provide best solutions. * Model excellence in theater show presentation/product demonstration to walk-in customers as per predefined script. * Ensuring store hygiene and presentability/ functioning of products on display. * Coordinating activities at the back office, managing inventory and managing payment reconciliation with bank. * Responsible for executing post sales activities like payment collection, invoicing, product delivery and installation * Managing external vendors like Mall management team or SIS partners, logistics and stationary vendors on a daily basis. * Handling pre/post sales customer escalations and queries. *Respond to customer e-mails within 24 hours from receipt as per guidance provided by supervisor. * Interaction with cross-functional departments for operational support. Walk-in Date/ Time: 20th January 2021, 11.00 AM - 4.00 PM Venue Details- Ample Technologies Private Limited N-1, Connaught Place, New Delhi - 110 001. Contact - Archana (8056279641) Interested candidates can send in your updated resume to archana.melchoir@ample.co.in Or watsapp to 8056279641  ","location":"Delhi","experience":"0-4Years"},{"date":"20 - Jan - 2021","skills":"Lead Generation, Admissions, Business Development, Revenue Generation","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"VLCC Institute Of Beauty & Nutrition, 101, City Pride, Building B/H Nalanda Hotel, Mithakhali Six Road, Navrangpura, Ahmedabad, Gujarat - 380 006.","phone":"7302467497","profile":" Academic Counsellor (Female Only) \nVLCC Health Care","description":"Roles and Responsibilities To promote the institute and its courses & ensure proper handling of walk-ins, counselling prospective students and Converting enquiries to registrations Tie-up with local Colleges, Schools, Tuition houses To provide relevant information to clients or refer them to appropriate departments within the centre To reconfirm appointments or make reminder calls to clients who have specifically requested for a particular service. To attend all staff meetings as and when directed by the Center Head and to attend Trainings as and when nominated by the Corporate Office / Centre Head. To perform outdoor duties whenever Company organizes event beyond the centre premises. Desired Candidate Profile- Under the guidance of the Head of Institute and in co-ordination with Sales Team and within the limits of established Company policies advise and monitor the clients for achieving the desired object. Walk-in Date/ Time: 20th January 2021, 10.30 AM - 5.30 PM Venue Details- VLCC Institute Of Beauty & Nutrition 101, City Pride, Building B/H Nalanda Hotel, Mithakhali Six Road, Navrangpura, Ahmedabad, Gujarat - 380 006. Contact - Shilpa ( 7302467497 )  ","location":"Ahmedabad","experience":"1-6Years"},{"date":"20 - Jan - 2021","skills":"Customer Care, International Voice Process, Customer Support","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Global Gateway Towers, Tower-B, 7th Floor, Sector 26, M.G. Road, Sikanderpur Ghosi, Gurgaon \u0096 122002 (Near Guru Dronacharya Metro Station)","phone":"9625643762","profile":" Customer Service Executive \nIDP Education (India) Private Limited","description":"Educational Qualification: Under Graduate/ Graduate (Prefer Graduates) Work Experience: Minimum 1 year in International Voice Process Good Communications Skills- English has to be fluent Language- English & Hindi (Mandate) Current Location: Gurgaon/ NCR Perks and Benefits- Fixed day shift Timings : 9am to 5:30pm Walk-in Date/ Time: 20th January 2021, 10.00 AM - 4.00 PM Venue Details- IDP Education (India) Private Limited Global Gateway Towers, Tower-B, 7th Floor, Sector 26, M.G. Road, Sikanderpur Ghosi, Gurgaon \u0096 122 002. (Near Guru Dronacharya Metro Station) Contact - Hemant S Narang ( 9625643762 )  ","location":"Gurgaon","experience":"1-4Years"},{"date":"20 - Jan - 2021","skills":"IT Recruitment, Product Hiring, Technical Hiring","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Anzy Careers Private Limited, 315 Work Avenue, 2nd Floor, 16th Cross, 5th Main Road, 6th Sector, HSR Layout, Bengaluru, Karnataka - 560 102.","phone":"9513921761","profile":" IT/ Technical Recruiter \nAnzy Careers Private Limited","description":"Currently we are having openings for #Freshers with MBA background for the role of IT/ Technical Recruiters. We are conducting a drive on 20th January 2021 i.e. on Wednesday. Interested can walk in to our office also you can share your CV to chandana@anzycareers.com Walk-in Date/ Time: 20th January 2021, 10.30 AM - 5.30 PM Venue Details- Anzy Careers Private Limited, 315 Work Avenue, 2nd Floor, 16th Cross, 5th Main Road, 6th Sector, HSR Layout, Bengaluru, Karnataka - 560 102. Contact - Chandana (9513921761) Note: Only MBA and Work from office only.  ","location":"Bangalore","experience":"0-1Years"},{"date":"20 - Jan - 2021","skills":"Customer Service, Customer Support, Inbound Process, BPO","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Walkin Venue : Zoom ID - 6370393166","phone":"Not Provided","profile":" Customer Service Executive \nLenskart Solutions Private Limited","description":"Lenskart Solutions Private Limited is Hiring Customer Support Executive/ Freshers Key Requirements- Must Have Laptop/ Desktop and Wifi . Should be comfortable to travel/ relocate to Gurgaon Must have good communication skills Job Responsibilities- Manage large amounts of inbound and outbound calls and live chats in a timely manner Follow communication scripts when handling different topics. Identify customers needs, clarify information, research every issue and provide solutions and/or alternatives. Build sustainable relationships and engage customers by taking the extra mile. Keep records of all conversations in our call center database in a comprehensible way. Meet personal/team qualitative and quantitative targets Virtual Walk-in Drive on 20th January 2021, Timing: 11.00 AM - 11.30 AM Walkin Venue : Zoom ID - 6370393166 Contact - Jayati Mahajan  ","location":"Delhi, Noida, Gurgaon","experience":"0-5Years"},{"date":"20 - Jan - 2021","skills":"HR/ Recruitment, End to End Recruitment, Volume/ Bulk hiring","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Allsec Technologies Limited, 46 C, Velachery Main Road, Velachery, Chennai- 42. Landmark: Next to Velachery EB Office","phone":"Not Provided","profile":" HR Executive/ Recruiter \nAllsec Technologies Limited","description":"We are hiring for HR Executive (Malayalam) - Recruitment - Male Candidate Preferable Eligibility Criteria: Should possess Excellent communication skills in English and Malayalam (Must) Experience: 1 - 2 Years Immediate joiners preferred. Candidate should have end to end recruitment experience in volume/ bulk hiring. Should have International Voice hiring experience (must) Sourcing candidates through various portals, resume database, referrals, networking sites etc. Screening the resumes and scheduling for interviews. Experience in handling both International and Domestic requirements. Negotiating job offers with candidates. On time closure of open positions. Walk-in Date/ Time: 20th January, 2021 from 10 AM onwards Venue Details- Allsec Technologies Limited, 46 C, Velachery Main Road, Velachery, Chennai- 42. Landmark: Next to Velachery EB Office Note: Candidate from Consultancy background with Domestic voice Hiring experience will be preferable.  ","location":"Chennai","experience":"1-2Years"},{"date":"23 - Jan - 2021","skills":"Project Management, Excel, IT Operations, Office Administration, MS Office","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Clarity Travel Solutions Private Limited, No. 27A, 2nd Floor, 163/ 18, 2nd Street, River View Residency, OMR, Karapakkam, Chennai \u0096 600 097","phone":"9949591245","profile":" PHP Developers \nClarity Travel Solutions Private Limited","description":"Candidate need to have strong knowledge in PHP with any one framework. Good to have Travel domain knowledge (Not Mandatory) Good to have React JS/ Node JS/ Vue JS knowledge Immediate Joiners preferred Experience 2 - 3 Years - 10 Openings Experience 4 - 6 Years - 10 Openings Experience 7 - 10 Years - 10 Openings Walk-in Date/ Time: 23rd January 2021, 9.30 AM - 5.30 PM Venue Details- Clarity Travel Solutions Private Limited No. 27A, 2nd Floor, 163/ 18, 2nd Street, River View Residency, OMR, Karapakkam, Chennai \u0096 600 097 Please contact Vignesh - 9949591245  ","location":"Chennai","experience":"2-7Years"},{"date":"20, 21, 22 - Jan - 2021","skills":"C#, ASP .Net, MVC, MVVM","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Colan Infotech Private Limited, Unit-2, Block-1, 4th Floor, No. 84, Murugesa Naicker Complex, Greams Road, Thousand Lights, Chennai, Tamil Nadu - 600006","phone":"Not Provided","profile":" .Net Developer/ Fresher \nColan Infotech Private Limited","description":"Candidate must have completed Course Certification in Dotnet Should have good analytical and logical skills Must have basic coding and problem-solving skills Should have good communication skills Passed outs only from 2018, 2019 & 2020 Walk-in Date/ Time: 20th January - 22nd January , 10.30 AM - 5.30 PM Venue Details- Colan Infotech Private Limited, Unit-2, Block-1, 4th Floor, No. 84, Murugesa Naicker Complex, Greams Road, Thousand Lights, Chennai, Tamil Nadu - 600006 Landmark: Opposite Road to Sea shell Hotel  ","location":"Chennai","experience":"0-1Years"},{"date":"20, 21, 22, 23, 25, 26, 27, 28, 29, 30 - Jan - 2021","skills":"Java Dotnet Mobile Application (Android, iOS) SQL","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Appsource Services Private Limited, No 12, Ramanuja Plaza 1st Floor Malleshwaram 5th Cross, Bangalore - 560 003.","phone":"9663863321","profile":" Software Engineer (Java/ .Net/ Android, iOS) \nAppsource Services Private Limited","description":"Appsource Services Private Limited, is looking for Software Engineers. Candidates with the below mentioned skills can apply : Java Dotnet Mobile Application (Android, iOS) SQL Walk-in Date/ Time: 20th - 30th January 2021, 10 AM onwards Venue Details- Appsource Services Private Limited No 12, Ramanuja Plaza 1st Floor Malleshwaram 5th Cross, Bangalore - 560 003. Contact - Shwetha ( 9663863321 )  ","location":"Bangalore","experience":"0-4Years"},{"date":"18, 19, 20, 21, 22, 23, 24 - Jan - 2021","skills":"Purchase of Raw / Packaging Materials Handling Vendors, Taking Quotations & Price Negotiations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Accord Selection Services, 402, 4th Floor, Centre Square, Opp. Bharat Petrol Pump, S.V. Road, Near Station, Andheri (West), Mumbai - 58","phone":"022-40144716","profile":" Purchase Assistant \nAccord Selection Services","description":"Person should be Any Graduate with 2 to 5 years experience as a Purchase Assistant with a Manufacturing Company. Must be good in computer Work with good communication skills in English. Diploma in Material Management would be preferred. Age below 30 years Place of work : Vile Parle - West - JVPD Salary : Rs.15000 to 18000 per month Candidates staying between Khar to Goregaon Key Responsibilities- Purchase of Raw / Packaging Materials Handling Vendors, Taking Quotations & Price Negotiations Purchase of Rubber Parts, Adhesives Raw Material Walk-in Date/ Time: 18th January - 24 January , 11.00 AM - 4.00 PM Venue Details- Accord Selection Services 402, 4th Floor, Centre Square, Opp. Bharat Petrol Pump, S.V. Road, Near Station, Andheri (West), Mumbai - 58 Tel no. : 022-40144716 / 26283616 / 26287682 Free Service to Candidates Office Time : 11am to 4 pm  ","location":"Mumbai","experience":"2-5Years"},{"date":"18, 19, 20, 21, 22, 23, 24 - Jan - 2021","skills":".NET framework, 3-tier/ N-tier Architecture, MVC, JavaScript, CSS, HTML, Ajax and jQuery","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"HAUT IT Solutions Private Limited, 424C 2nd Floor, Sant Nagar, East of Kailash, New Delhi - 110 065","phone":"9717077795","profile":" .Net Developer (Web) \nHAUT IT Solutions Private Limited","description":"We are seeking a .NET developer responsible for building .NET applications using below technical expertise. Eligibility criteria Any Graduate (IT Graduate preferable) Technical Skills- Strong knowledge of .NET framework (Web as well as Windows) 3.5 onwards. Proficient in C# and Familiarity with the 3-tier/ N-tier Architecture, MVC. Advanced skills in JavaScript, CSS and HTML essential, Ajax and jQuery Strong understanding of object-oriented programming Strong proficiency with Microsoft SQL Server and writing SQL Queries. Hands on experience with database objects such as tables, views, stored procedures, triggers, temporary tables, joins etc. Need to have good knowledge of Asp .Net with other supporting languages for web development such as HTML 5, CSS, JavaScript libraries such as jQuery, extJS etc. Good to have knowledge of DOM i.e. Document Object Model and BOM i.e. Browser Object Model. Soft Skills- Problem solving attitude. Being flexible and focused. Being creative and innovative. Taking initiative with pro-activeness. Good in written and verbal communication skills. Responsibilities- Understand requirement from functional specifications received in requirement document. Design, build, and maintain efficient, reusable, and reliable code Ensure the best possible performance, quality, and responsiveness of applications Identify bottlenecks and bugs, and devise solutions to mitigate and address these issues Help maintain code quality, organization, and automatization Walk-in Date/ Time: 18th January - 24th January , 9.30 AM - 5.30 PM Venue Details- HAUT IT Solutions Private Limited 424C 2nd Floor, Sant Nagar, East of Kailash, New Delhi - 110 065 Contact - N K Singh ( 9717077795 )  ","location":"Delhi","experience":"0-1Years"},{"date":"18, 19, 20, 21, 22, 23, 24 - Jan - 2021","skills":"MIS Preparation, Manpower Analysis, Rostering, Conditional Formatting, Shrinkage, MIS Reporting","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"iSON Xperiences India Private Limited, Second Floor, Concord@ Mantri 10 Richmond Road, Bangalore - 560 025","phone":"7012940431","profile":" MIS Executive \niSON BPO India Private Limited","description":"We are hiring for MIS Executive for our Bangalore office. Candidate should have minimum 6 months to 1 year experience as MIS Executive in any BPO Domain. Must have a good knowledge of Excel. Age Bar: 18 - 30 years only. Should be proficient with MS Excel, knowledge of Advanced Excel will be an added advantage as we will be assigning MIS work. MIS reporting to management daily. Experience with Workforce Management software (performance tracking, reporting), Aspect, and Genesis preferred. Candidates with advanced excel skills can apply. Must be aware of basic Terminology such as Attrition, Shrinkage, CSAT, SLA, Overtime Pay Calculation, Ageing, etc. Should have good knowledge on Data mining, Data Analysis, Report Management. Immediate joiners preferred. Roles and Responsibilities- To maintain all data related to the process Ensuring that all relevant data is received from process in- charge to allow timely preparation and circulation of report through follow ups. The person would be responsible for preparing Daily/Weekly/Monthly reports using intermediate/advanced excel. Interested candidates are requested to walk in directly to the address mentioned below with the resume and ID proof. Walk-in Date/ Time- 18th January - 24 January , 10.00 AM - 5.00 PM Venue Details- iSON Xperiences India Private Limited Second Floor, Concord@ Mantri 10 Richmond Road, Bangalore - 560 025 Landmark: Opposite Indian Bulls Home Loans, Nearby IIFL Office Contact - Akhil RS ( 7012940431 )  ","location":"Bangalore","experience":"1-5Years"},{"date":"18, 19, 20, 21, 22, 23, 24 - Jan - 2021","skills":"Ad Posting, Mobile Marketing, Promotions, Digital Marketing, Online Sales","qualification":"Diploma, B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Seven Wonders, Block -A 61, Sector -16 Near Metro Station Sector -16, Noida","phone":"9971487321","profile":" Part time/ Add Posting Executive \nContinent Trip Services Private Limited","description":"We are looking for candidates who want to work 2 to 3 hours and earn 2.5k to 7.5k per week. Complete training will be provided to all candidates before starting up their work. Well before services are provided, we go to great lengths to seek to understand our customer\u0092s preference & priorities. We customize our business to fit yours. We are flexible, responsive and easy to do business with. Walk-in Date/ Time: 18th January - 24th January , 9.30 AM - 5.30 PM Venue Details- Seven Wonders, Block -A 61, Sector -16 Near Metro Station Sector -16, Noida Contact - DEEPAK (HR) Phone: 9971487321  ","location":"Noida","experience":"1-5Years"},{"date":"18, 19, 20, 21, 22 - Jan - 2021","skills":"Java, Tableau, Matlab, C, C++, Angular, Android","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Workez Coworking Space, Door No.3, Hansa Building: RK Swamy Centre, Block-B, 147, Pathari Rd, Thousand Lights, Chennai, Tamil Nadu - 600 006.","phone":"7305216088","profile":" Java Developer/ Fresher \nBonbloc Technologies Private Limited","description":"Candidate should be BE/ B.Tech/ BCA or MCA Fresher and must be able to work on Java technologies. Skills like R, Tableau, Matlab, C, C++, Angular, Android will be an added advantage. Walk-in Date/ Time: 18th January - 22nd January , 9.30 AM - 5.30 PM Venue Details- Workez Coworking Space, Door No.3, Hansa Building: RK Swamy Centre, Block-B, 147, Pathari Rd, Thousand Lights, Chennai, Tamil Nadu - 600 006. Contact - Jessy Reshma John (7305216088)  ","location":"Chennai","experience":"0-1Years"},{"date":"15, 16, 18, 19, 20, 21, 22 - Jan - 2021","skills":"Customer Support, Voice Process, International BPO, International Voice Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Sevika Tech Private Limited, Old No. 7, New No. 41, 6th Floor, Jayanth Tech Park,, Mount Poonamallee Road, Nandambakkam, Chennai, Tamilnadu.","phone":"7339438388","profile":" Customer Support Executive \nSevika Tech Private Limited","description":"Candidate should be Any Graduate with Basic computer knowledge and good communication skills. An effective communicator, probably fluid with what he/ she is speaking. Should be flexible enough to adapt to any environment or changes happening in the sector. Should be patient enough and quite motivated towards learning new things and execute it effectively on day to day basis. Should also have a clear view of what the current market trend is. People with average communication also accepted Night shift (8 pm to 5 am) Saturday sunday off Walk-in Date/ Time: 13th January - 22nd January , 6.00 PM - 8.00 PM Venue Details- Sevika Tech Private Limited, Old No. 7, New No. 41, 6th Floor, Jayanth Tech Park,, Mount Poonamallee Road, Nandambakkam, Chennai, Tamilnadu. Contact - Ancy Aivin ( 7339438388 )  ","location":"Chennai","experience":"0-5Years"},{"date":"15, 16, 18, 19, 20, 21, 22 - Jan - 2021","skills":"Pre & Post Export Import Documentation","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Accord Selection Services, 402, 4th Floor, Centre Square, Opp. Bharat Petrol Pump, S.V. Road, Near Station, Andheri (West), Mumbai - 58","phone":"022-40144716","profile":" Import Export Executive - Documentation \nAccord Selection Services","description":"Qualification: Graduate/ Diploma - Export Import Management Experience: 6 to 8 years experience a Senior Import Export Executive Age below 35 Job Responsibility- Handling Pre & Post Export Import Documentation Coordinating with CHA for Shipments & Duty Drawback Online & Physical Submissions to DGFT & Follow up Knowledge of EXIM Policy & Post Export Incentives Candidates staying between Khar to Goregaon Place of work : Andheri West - Veera Desai Road Salary : Rs.25000 to 30000 Walk-in Date/ Time: 13th January - 22nd January , 11.00 AM - 4.00 PM Venue Details- Accord Selection Services 402, 4th Floor, Centre Square, Opp. Bharat Petrol Pump, S.V. Road, Near Station, Andheri (West), Mumbai - 58 Tel no. : 40144716 / 26283616 / 26287682 Free Service to Candidates  ","location":"Mumbai","experience":"6-8Years"},{"date":"18, 19, 20, 21, 22 - Jan - 2021","skills":"Php, Mysq, HTML, Javascript, Jquery, CSS, OOPS","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Novalnet e-Solutions Private Limited, 131 Erikarai Street, East Tambaram, Chennai - 600 059.","phone":"7708222259","profile":" PHP Developer Trainee \nNovalnet e-Solutions Private Limited","description":"Novalnet e-Solutions Private Limited is hiring PHP Developer Trainee for Creating & modifying the custom themes and plugin (payment plugin) for e-commerce shop system. Design, develop, maintain, analyse and troubleshoot the plugin & themes. A strong ability to understand the project requirements & Execute project plans. Walk-in Date/ Time: 18th January - 22nd January , 11.00 AM - 1.00 PM Venue Details- Novalnet e-Solutions Private Limited, 131 Erikarai Street, East Tambaram, Chennai - 600 059. Contact - Salomi Mable (7708222259)  ","location":"Chennai","experience":"0-1Years"},{"date":"15, 16, 18, 19, 20, 21, 22 - Jan - 2021","skills":"Back Office, Voice Process, Email Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"BDO NSDL Office, Mantri Sterling Near Deep Bungalow Chowk, Model Colony, Shivaji Nagar, Pune Maharashtra - 411 016","phone":"Not Provided","profile":" Voice & Back Office Process Associate \nBDO India LLP","description":"Candidate should be Minimum 10+2 /diploma from a recognized Board Working knowledge of Basic Computers with a fair knowledge of MS Word and Excel Ability to draft a letter with proper grammar, content, format Good communication skills Women employees will be working only for day shift Key Responsibilities- Resolving customer query/complaints of the customers through inbound calls Escalate cases as per escalation matrix given by the respective manager on scenarios wherein immediate resolution cannot be given to the customer to win customer confidence Daily interaction with reporting manager to understand the performance baseline & the ways to achieve the important metrics which are critical to business Efficiently & effectively navigate the website, CRM, and other systems & technologies provided by Client. Provide an excellent level of customer service driven by professionalism, timeliness and accuracy. Ensure targets for service levels, quality and customer satisfaction are achieved Support the Team Leader in the practical day to day management and control of customer service Other duties from time to time that may be assigned Perks and Benefits- Performance based incentives Night shift allowance Interested candidates can walk-in with their updated resume. (Note - mask and hand sanitizers compulsory for entering the office premises for interview) Walk-in Date/ Time: 13th January - 22nd January , 12.00 PM - 3.30 PM Venue Details- BDO NSDL Office, Mantri Sterling Near Deep Bungalow Chowk, Model Colony, Shivaji Nagar, Pune Maharashtra - 411 016 Contact - Jay Mistry Note - Please ensure all the Co-vid safety protocols are followed.  ","location":"Pune","experience":"0-2Years"},{"date":"15, 16 - Jan - 2021","skills":"HR/ Recruitment, Talent Acquisition, Staffing, Job Posting","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Black and White Business Solutions Pvt. Limited, 721, 2nd floor Chinmaya Mission Hospital Road, Binnamangala, Stage 1, Indiranagar, Bengaluru, Karnataka - 560 038","phone":"9036001069","profile":" HR Analyst/ Executive - Recruiter \nBlack and White Business Solutions Pvt. Limited","description":"Graduates : Any Graduate Work Experience - Fresher Shift : Day Shift We are looking for the best candidate who can show their skills in HR (ITES/ BPO Recruitment) Best opportunity for fresher to upgrade your skills with the leading firm Sourcing candidates from various Job portals based on the company requirements. Screening the candidates resumes and contacting relevant candidates. Assess knowledge, skills, Excellent communication skill, aptitudes and experience of the applicant. Arranging interviews for selected candidates with the chosen company. Strong work ethic and sense of commitment. Excellent communication - oral and written. Self driven to achieve assigned targets. Ability to research, understand the business process Excellent learning skills, and maintaining good relationships with candidates. Positive attitude, and interpersonal skills along with excellent rapport building are the traits for the right candidate. End to end recruitment. & Computer skills (Word, Excel, Outlook, Internet etc) Additional Info: We are hiring for TOP BPO in Bangalore for Domestic & international (Male & Females can apply for BPO) Candidates from Bangalore location can only apply Walk-in Date/ Time: 15th January - 16th January , 9.30 AM - 5.30 PM Venue Details: Black and White Business Solutions Pvt. Limited 721, 2nd floor Chinmaya Mission Hospital Road, Binnamangala, Stage 1, Indiranagar, Bengaluru, Karnataka - 560 038 For more quires Contact : Sukanya @ 9036001069 Email id: sukanya@blackwhite.in Please share this job for suitable candidates who might be interested to apply for the job  ","location":"Bangalore","experience":"0-1Years"},{"date":"14 - Jan - 2021","skills":"MIS reports, preparing Minutes of the Meet, Document Mgmt. Inventory Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Epicminds Information Technology Pvt. Limited, #19, 2nd Floor, 1st Main Road, 3rd Block, 3rd Stage, Basaveshwar Nagar, Bengaluru, Karnataka - 560 079","phone":"9380736110","profile":" Business Co-Ordinator/ Freshers \nEpicminds Information Technology Pvt. Limited","description":"Candidate should have Excellent Communication Skills (Written/ Verbal is a MUST) Hands on experience in MS Office (Word, Excel, Power Point, Access, Outlook etc.). Basic Accounting Knowledge Enthusiastic & well organized Upkeep of office records and correspondence. Organize Internal/External Appointments and Meetings. Maintaining MIS reports, preparing Minutes of the Meet, Document Mgmt. Inventory Management To handle Admin related activities Education: B.Com (Fresher) Preferably a MALE Candidate Job Location: Prefer candidates in and around Rajajinagar or ready to relocate. Walk-in Date/ Time: 14th January 2021, 10.30 AM - 5.30 PM Venue Details- Epicminds Information Technology Pvt. Limited #19, 2nd Floor, 1st Main Road, 3rd Block, 3rd Stage, Basaveshwar Nagar, Bengaluru, Karnataka - 560 079 Contact - Karthik ( 9380736110 )  ","location":"Bangalore","experience":"0-1Years"},{"date":"14 - Jan - 2021","skills":"Customer Care, Inbound Process, Customer Support","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Elcotek India Private Limited, J2, 2nd Floor, RDC Raj Nagar, Ghaziabad. Near Gaur Mall, Above Bercos Restaurant.","phone":"9810698014","profile":" Customer Care Executive \nElcotek India Private Limited","description":"Required customer care executive for domestic inbound process call center for an eCommerce company in RDC Raj Nagar, Ghaziabad. Provide information about order status to customers. Understand customer complaints and forward them to relevant department. Customer Satisfaction. Hindi / English. Day shift. Should have knowledge of computers. Fix salary, No targets. Regular incentives & rewards for performers. Walk-in Date/ Time: 14th January 2021, 9 AM onwards Venue Details- Elcotek India Private Limited J2, 2nd Floor, RDC Raj Nagar, Ghaziabad. Near Gaur Mall, Above Bercos Restaurant. Contact - Kritika ( 9810698014 )  ","location":"Ghaziabad","experience":"1-6Years"},{"date":"14 - Jan - 2021","skills":"Email Support, US Shift, Back Office","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Virtual-Zoom Walk-in 14th January from 11.00 AM onwards","phone":"Not Provided","profile":" Backend Process Executive \nGENPACT India Private Limited","description":"Minimum qualifications: B.com graduate except technical Freshers are eligible. Preferred Qualifications/ Skills Good analytical and problem-solving skills. Prior experience in Banking and/or Insurance industry Ability to communicate verbally and through emails with businesses. Job Responsibilities- Transcribe contents inventories into the proprietary evaluating platform Research and resolve Like Kind Quality replacements Input appropriate categories, depreciation and pricing sources Insurance/ banking exposure. HR Name - Arpita Mishra Email- arpita.mishra1@genpact.com  ","location":"Noida, Gurgaon","experience":"1-2Years"},{"date":"14 - Jan - 2021","skills":"MIS Reporting, Data mining, Data Analysis, Report Management","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"iSON Xperiences, Second Floor, Concord@ Mantri 10 Richmond Road, Bangalore - 560 025. Landmark: Opposite Indian Bulls Home Loans, Nearby IIFL Office.","phone":"7012940431","profile":" MIS Executive \niSON Bpo India Private Limited","description":"We are hiring for MIS Executive for our Bangalore office. Candidate should be Any Graduate with minimum 6 months to 1 year experience as MIS Executive in any BPO Domain. Must have a good knowledge of Excel. Must be aware of basic Terminology such as Attrition, Shrinkage, CSAT, SLA, Overtime Pay Calculation, Ageing, etc. Should have good knowledge on Data mining, Data Analysis, Report Management. Immediate joiners preferred. Age Bar: 18 - 30 years only. Roles and Responsibilities- To maintain all data related to the process Ensuring that all relevant data is received from process in- charge to allow timely preparation and circulation of report through follow ups. Should be proficient with MS Excel, knowledge of Advanced Excel will be an added advantage as we will be assigning MIS work. MIS reporting to management daily. Experience with Workforce Management software (performance tracking, reporting), Aspect, and Genesis preferred. Candidates with advanced excel skills can apply. The person would be responsible for preparing Daily/Weekly/Monthly reports using intermediate/advanced excel. Walk-in Date/ Time: 14th January 2021, 10.00 AM - 5.00 PM Venue Details- iSON Bpo India Private Limited iSON Xperiences, Second Floor, Concord@ Mantri 10 Richmond Road, Bangalore - 560 025. Landmark: Opposite Indian Bulls Home Loans, Nearby IIFL Office. Contact - Akhil RS ( 7012940431 )  ","location":"Bangalore","experience":"1-5Years"},{"date":"14 - Jan - 2021","skills":"IT Staffing, IT Recruitment, Sourcing Profiles, Screening, Volume Hiring","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Toppersedge.com India Private Limited, 3rd Floor, #65, LRDE Layout, Kartik Nagar, Marathahalli-KR Puram Outer Ring Road Bangalore - 560 037.","phone":"9971240179","profile":" HR Executive/ IT Recruiter \nToppersedge.com India Private Limited","description":"Candidate should have 1 to 3 years experience in Technical Recruitment, Sourcing Profiles, Screening, IT Staffing, IT Recruitment, Volume Hiring, Leadership Hiring, Shortlisting, Head Hunting and Talent Acquisition. Must have Good Communication Skills Walk-in Date/ Time: 14th January 2021, 9.30 AM - 5.30 PM Venue Details- Toppersedge.com India Private Limited 3rd Floor, #65, LRDE Layout, Kartik Nagar, Marathahalli-KR Puram Outer Ring Road Bangalore - 560 037. Contact - Sakshi ( 9971240179 )  ","location":"Bangalore","experience":"1-3Years"},{"date":"14 - Jan - 2021","skills":"Charge Posting, AR, Demo, Cash Posting, US Healthcare, Charge Entry","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Savi Infoservices India Private Limited, Savi Group 135, 1st Floor, Udyog Vihar, Phase - 1, Gurgaon - Haryana - 122 016.","phone":"9999755083","profile":" Payment/ Charge Posting Executive \nSavi Infoservices India Private Limited","description":"We are hiring for below position on an urgent basis : Payment Posting Executive Charge Posting Executive AR Analyst Candidate should have minimum 6 months of relevannt experience. Should have good knowledge of Charge posting. Should have relevant knowledge in US Healthcare. Candidate should be well aware about RCM process. Should have knowledge of Medical Billing. Required Skills: Excellent communication Good in MS Office. Must have Excellent Communication skills Immediate joiner would be preferred. Perks & Benefits- 5 Days working Free meals Incentives** Walk-in Date/ Time: 14th January 2021, 2.00 PM - 5.30 PM Venue Details- Savi Infoservices India Private Limited Savi Group 135, 1st Floor, Udyog Vihar, Phase - 1, Gurgaon - Haryana - 122 016. Contact - Govind ( 9999755083 )  ","location":"Gurgaon","experience":"1-4Years"},{"date":"11 - Jan - 2021","skills":"HR/ Recruitment, Talent Management, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"DIN Engineering Services LLP, B-106, Sector - 2, NOIDA, Nearest Metro Station Sector 15","phone":"Not Provided","profile":" HR Recruiter/ Senior HR Recruiter \nDIN Engineering Services LLP","description":"Candidate should be Any Graduate with excellent spoken/ written English communication skills Should have thorough knowledge of Naukri.com and other job portals Male candidates will be preferred. Should be able to provide 24*7 support. Need immediate joiners( who can join in couple of days after selection) Candidates who have worked in a Consultancy would be preferred. Should be able to handle work pressure Roles and Responsibilities Manage full life cycle of recruitment process Must have an exposure of technical hiring and bulk hiring Sourcing, screening candidates and conduct first round of interviews Sourcing candidates via different job portals such as Naukri.com, LinkedIn etc. Coordinate interviews with hiring manager and update all the parties involved via email/phone as required Participate in drives and other hiring events Should be able to release offers/ appointment letters in a timely manner. Should be able to work within stringent timelines and on monthly targets Prepare and share reports/ updated data (MIS) on a regular / daily basis Hands on experience on MS-Office would be an added advantage Walk-in Date/ Time: 11th January 2021, 10.30 AM - 1.30 PM Venue Details- DIN Engineering Services LLP, B-106, Sector - 2, NOIDA, Nearest Metro Station Sector 15 Contact Person- Ashu/ Priti  ","location":"Noida","experience":"3-6Years"},{"date":"11 - Jan - 2021","skills":"Customer Service, Domestic BPO, Customer Satisfaction, Voice Process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"iEnergizer (Granada Services Private Limited), Plot-270, AIHP Tower, First Floor, Udhyog Vihar Phase-2, Gurgaon, Haryana.","phone":"Not Provided","profile":" Insurance Process Associate \niEnergizer (Granada Services Pvt. Limited)","description":"We are looking for Insurance Process Associate to provide a seamless experience addressing customer's questions and make successful Sales over the phone, efficiently fulfilling all the assigned job responsibilities as per the prerequisites. Minimum Qualification Criteria:- 1. Any Graduate/ Undergraduate 2. Minimum 6 months Insurance Sales/ Outbound Sales BPO Experience required 3. Candidate should be flexible to work in 24/7 Environment. Desirable qualifications: 1. Good customer service skills & should display good analytical abilities 2. Prior experience in BPO voice process (Insurance Sales) is preferable. Job Responsibilities: 1. Provide splendid interactions with customers in a friendly and courteous manner at all times. 2. Have sufficient knowledge about the products and services so as to make a successful sale. 3. Ensure that all the Company Policies and procedures, code of conduct and regulatory guidelines are strictly complied to while interacting with the customers. 4. Suggest effective ways through which the Client can promote its products and services and increase customer satisfaction. 5. Ensure that customers confidential information is properly protected and only used for official purposes. Walk-in Date/ Time: 11th January 2021 from 9.30 AM onwards Venue Details- iEnergizer (Granada Services Private Limited) Plot-270, AIHP Tower, First Floor, Udhyog Vihar Phase-2, Gurgaon, Haryana.  ","location":"Delhi, Gurgaon","experience":"0-5Years"},{"date":"11, 12 - Jan - 2021","skills":"Business Partnering, Employee Engagement, Performance Management, Grievance Handling, Induction, Exit Interviews, Employee Grievances","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"DIN Engineering Services LLP, B-106, Sector - 2, Noida.","phone":"Not Provided","profile":" HR Business Partner \nDIN Engineering Services LLP","description":"Candidate should be a MBA/ PGDM with 2-3+ Years experience in HR Business partnering role Should have thorough knowledge of above mentioned works Should be ready to work in night shifts specifically Male candidates will be preferred. Should be able to provide 24*7 support. Need immediate joiners( who can join in couple of days after selection) Candidates who have worked in night shifts would be preferred Should be able to handle work pressure Excellent spoken / written English communication skills Should have good personality and interpersonal skills Roles and Responsibilities- Will be responsible for Employee Engagement Activities Will Handle Employee Database Will take care of Induction & Training Will take care of employee Confirmation and Performance Management System To manage Employee Grievances with proper timelines and solutions Will process Exit Interviews & Employee retention Activities like employee satisfaction survey, employee retention strategies Should be able to manage Full & Final Settlement Event management as and when required with proper planning and budgeting Walk-in Date/ Time: 11th - 12th January 2021, 10.30 AM - 3.00 PM Venue Details- DIN Engineering Services LLP, B-106, Sector - 2, Noida, Nearest Metro Station - Sector 15 Contact - Ashu/ Priti  ","location":"Noida","experience":"2-4Years"},{"date":"11 - Jan - 2021","skills":"Customer Service, Audit & Compliance, Monthly Reports, Cash Handling","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Citizen Co-operative Bank Limited, C-25, Stellar IT Park, Tower-II, 5th Floor Sector-62 Noida","phone":"Not Specified","profile":" Assistant Manager - Branch Operations \nCitizen Co-operative Bank Limited","description":"Candidate should be Any Graduate with good communication Skills. Must be able to multi-task, follow up on tasks and complete projects on time. Should have the ability to analyze, compare, and interpret facts and figures quickly; and be able to make sound judgments based on this information. Must have an positive attitude to dealing with people. Must be a highly motivated and pleasing personality. Experience of working in any Banks would be required Candidate should have the knowledge of Loans documentation process & disbursal of loan. Job Benefits & Perks- Salary Negotiable Medical & Accidental Insurance Other benefits as per industries norms. Walk-in Date/ Time: 11th January 2021, 11.00 AM - 1.00 PM Venue Details- Citizen Co-operative Bank Limited C-25, Stellar IT Park, Tower-II, 5th Floor Sector-62 Noida Contact Person- Nisha  ","location":"Noida","experience":"1-4Years"},{"date":"11 - Jan - 2021","skills":"HR/ Recruitment, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"PES HR Services (Amal Infosystems Pvt. Limited), Sector 3, Building - 6, Unit No. 108, Millennium Business Park, Mahape, Navi Mumbai - 400 710.","phone":"8454835655","profile":" HR Executive/ Recruiter \nPES HR Services (Amal Infosystems Pvt. Limited)","description":"Candidate must be a Graduate with good communication skills Must be Confident, Aggressive & Enthusiastic, Good Convincing Skills Should be Target Oriented Freshers also can apply Job Responsibility- Handling end to end recruitment process Sourcing candidates through different channels of Recruitment like various Job Portals Conducting Pre and post interview follow-up Informing applicants about job responsibility, working conditions & Other Info Required Candidate profile Walk-in Date/ Time: 11th January 2021, 10 AM onwards Venue Details- PES HR Services (Amal Infosystems Pvt. Limited) Sector 3, Building - 6, Unit No. 108, Millennium Business Park, Mahape, Navi Mumbai - 400 710. Contact - Varsha HR ( 8454835655 )  ","location":"Mumbai","experience":"0-1Years"},{"date":"11, 12 - Jan - 2021","skills":"HR/ Recruitment, Grievance Handling, Payroll Administration, Employee Engagement, Joining formalities","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Soft Suave Technologies Private Limited, 100, Lake View Estate, 3rd floor, Kundrathur Main Road, M. S. Nagar, Next to Rajan Tiles Building, Porur, Chennai - 600 116.","phone":"Not Provided","profile":" Corporate HR Executive/ Freshers \nSoft Suave Technologies Private Limited","description":"What'll you do - HR Executive Conducting recruitment interviews and providing the necessary inputs during the hiring process Maintaining HR records, such as those related to compensation, Incentives, health and medical insurance Managing workplace safety issues Communicating and explaining the organization's HR policies to the employee Preparation of Payroll Conducting various games & celebration activities, engagement activities, employee recognition acts Conducting employee orientation and facilitating newcomers joining formalities Maintaining and regularly updating master database (personal file, personal database, etc.) of each employee in HR module of ERP software Resolving grievances or queries that any of the employees have. Walk-in Date/ Time: 11th January - 12th January , 10.30 AM - 2.30 PM Venue Details- Soft Suave Technologies Private Limited 100, Lake View Estate, 3rd floor, Kundrathur Main Road, M. S. Nagar, Next to Rajan Tiles Building, Porur, Chennai, Tamilnadu - 600 116. Contact Person- Keerthana  ","location":"Chennai","experience":"0-1Years"},{"date":"11 - Jan - 2021","skills":"Java, Spring, Hibernate, JSP & MVC Frameworks","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Global Healthcare Billing Partners Pvt. Limited, No. 70, Rhitherdon Road, Vepery, Chennai - 600 007.","phone":"Not Provided","profile":" HR/ Recruitment Executive \nGlobal Healthcare Billing Private Limited","description":"Currently We are Hiring HR Executive/ HR Senior Executive - Talent Acquisition for our Internal Recruitment. Qualification: MBA (HR) or MHRM or equivalent Masters Degree Experience required: 6 months to 4 years in Recruitment Shift: General Shift Experience in US Healthcare/ Medical Billing Hiring is added advantage. Possess good communication and interpersonal skills. Have a passion for recruitment. Extend support during weekends as and when required. Healthcare ITES Recruitment Experience will be an added advantage. Locations - Vepery & Velachery Note: ONLY MALE CANDIDATES CAN APPLY. Job Responsibilities : Design and update job description. Source potential candidates from various online channels (e.g. social media and professional platforms like Naukri, Indeed and Monster etc..) Craft recruiting emails to attract passive candidates. Screen incoming resumes and application forms. Advertise job openings on company's careers page, social media, job boards and internally Provide shortlists of qualified candidates to hiring managers. Bulk Hiring / Campus Hiring/Salary Negotiations Monitor key HR metrics, including time-to-fill, time-to-hire and source of hire. Collaborate with managers to identify future hiring needs. Act as a consultant to new hires and help them on board. Immediate joiners preferred Walk-in Date/ Time: 11th January 2021, 12.00 PM - 5.30 PM Venue Details- Global Healthcare Billing Partners Pvt. Limited No. 70, Rhitherdon Road, Vepery, Chennai - 600 007. Land mark: Next to Dhina Color Lab Studio, Near to Niligris Super market Road connecting from Egmore Railway Station (YWCA bus stop) to Pursaiwakkam Contact Person- POOJA  ","location":"Chennai","experience":"1-4Years"},{"date":"0, 11, 12, 13, 14, 15, 16, 18, 19, 20 - Jan - 2021","skills":"C# .Net, ASP .Net, MVC","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Xplore Centre: First Academy Durgam Cheruvu Metro Station, 2nd Floor, Oyester Uptown, Yum Yum Tree Building Opposite Krishe Sapphire Alongside Durgam Cheruvu, Hitech City Rd, Hyderabad, Telangana - 500 081","phone":"Not Mentioned","profile":" .Net Developer/ Fresher \nAceline Tech Solutions Private Limited","description":"We are hiring for .Net Developers (Freshers) for our esteemed client based out of Hyderabad location for permanent positions. Candidates need well trained in dotnet platform Must have good communication skills Excellent skills in C# .Net, ASP .Net, MVC Candidates who ever selected need to give 3 years commitment with the company. If interested please email to infohr@acelinetech.com or direct walk-in for below address Walk-in Date/ Time: 11th January - 20th January , 10.00 AM - 6.00 PM Venue Details- Xplore Centre: First Academy Durgam Cheruvu Metro Station, 2nd Floor, Oyester Uptown, Yum Yum Tree Building Opposite Krishe Sapphire Alongside Durgam Cheruvu, Hitech City Rd, Hyderabad, Telangana - 500 081 Contact Person- Akhil  ","location":"Hyderabad","experience":"0-1Years"},{"date":"11, 12, 13, 14, 15, 16, 18, 19, 20 - Jan - 2021","skills":"Customer Support, Voice Process, Telecalling, Outbound Calling","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Dezmindz Technology Services Private Limited, #Sourabha Complex,1st Floor Kudlu Gate, Bangalore.","phone":"9513156714","profile":" Customer Support Executive \nDezmindz Technology Services Pvt. Limited","description":"Candidate should be a Graduate with good communication skills Fluency in English BCom fresher Being thorough and analytical. Attractive performance incentives and rewards on achieving goals. (FRESHERS WITH GOOD ENGLISH COMMUNICATION SKILLS WILL ALSO BE CONSIDERED, TRAINING WILL PROVIDED FOR THE POSITION). Roles and Responsibilities- Build sustainable relationships of trust through open and interactive communication; Identifying and assessing customers needs to achieve customer satisfaction. Maintain records of customer interactions, customer accounts, and file documents. Provide accurate, valid and complete information to the customer by using the right methods/tools. Walk-in Date/ Time: 11th January - 20th January , 10.00 AM - 5.30 PM Venue Details- Dezmindz Technology Services Private Limited #Sourabha Complex,1st Floor Kudlu Gate, Bangalore. Contact - Rashmi (9513156714)  ","location":"Bangalore","experience":"0-1Years"},{"date":"10, 11, 12, 13, 14, 15, 16, 17, 18, 19 - Jan - 2021","skills":"Technical Support, Windows Support, Software Support, International Voice Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Friends IT Services Private Limited, B 70 3rd floor Sector 64, Noida.","phone":"9582224261","profile":" Technical Support Executive \nFriends IT Services Private Limited","description":"The candidate should have a minimum of 6 months experience in an international voice process (UK/ US); Must have excellent communication skills. Should be ready to do 24x7 rotational shifts, 8 weekly offs per month. Candidates from Noida will be preferred. Job Responsibilities- To resolve computer technical issues and address billing inquiries over the phone or chat. Your job requires multitasking (fixing multiple remote PCs with proper case notes, handling chats and calls, keeping internal documentation updated in real-time) Address user tickets regarding computer issues and operating systems Windows7/8/10/Mac Walk customers through installing applications, computer peripherals, and troubleshooting steps. Ask targeted questions to diagnose common computer problems and conduct remote troubleshooting to fix Windows errors, to test alternative pathways until you resolve an issue. Ability to troubleshoot Mac issues will be an added advantage Walk-in Date/ Time: 10th January - 19th January , 4.00 PM - 8.00 PM Venue Details- Friends IT Services Private Limited, B 70 3rd floor Sector 64, Noida. Contact - Nishant Singh (9582224261) Our office is situated in Sector 64, about 6 minutes walking distance from NOIDA Sector 62 metro station. PLEASE NOTE that we do not provide transport, Candidates who have their own transport will be preferred. Walk-in for an interview between 10 January - 31 January 2021.  ","location":"Noida","experience":"1-3Years"},{"date":"10, 11, 12, 13, 14, 15, 16, 17, 18 - Jan - 2021","skills":"Customer Service, Inbound Process, Customer Support, Voice/ Non Voice Process","qualification":"Diploma, B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Avanze Group @ 403, 3rd Floor, Above Reliance Digital, Kammanahalli Main Road, 3rd Block, HRBR Layout, Kalyan Nagar, Bengaluru.","phone":"Not Provided","profile":" Customer Support Executive/ Freshers \nAvanze Technologies (India) Pvt. Limited","description":"Candidate should be Any Graduate/ Uber Graduate with 0 to 5 years of experience in Customer Service, Inbound Process, Customer Support, Voice/ Non Voice Process. Must have excellent communication skills. Walk-in Date/ Time: 10th January - 18th January , 9.30 AM - 7.30 PM Venue Details- Avanze Group @ 403, 3rd Floor, Above Reliance Digital, Kammanahalli Main Road, 3rd Block, HRBR Layout, Kalyan Nagar, Bengaluru. Landmark: Reliance Digital/Jal Vayu Vihar / Cafe Coffee Day Contact - Anjitha ( 7012871455 )  ","location":"Bangalore","experience":"0-5Years"},{"date":"11, 12, 13, 14, 15, 16, 18, 19, 20 - Jan - 2021","skills":"Technical Support, Voice/ Non Voice Process, Customer Support","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Wings International Group, D.No. 60-20-4, 1st floor, Twinkle Residency, Back side lane of Heritage Building, Sunnapubattila Centre, Vijayawada - 520 008.","phone":"9032233456","profile":" Technical Support Engineer \nWings International Group","description":"Qualification : B.Tech / M.C.A./BCA / B.Sc.-IT (with 60% in all academics) Pass out Batch- 2018, 2019, 2020, 2021 Must have good communication skills Job Location : Bangalore, Chennai Rotational Shift Ready to Relocate Package : 2.20 Lakhs P.A. Walk-in Date/ Time: 11th January - 20th January , 10.00 AM - 5.30 PM Venue Details- Wings International Group, D.No. 60-20-4, 1st floor, Twinkle Residency, Back side lane of Heritage Building, Sunnapubattila Centre, Vijayawada - 520 008. Contact - Suman Chandra ( 9032233456 ) Mail your resumes to cmd@wingsinternational.in  ","location":"Bangalore, Chennai, Guntur, Vijayawada","experience":"0-1Years"},{"date":"11, 12, 13, 14, 15, 16, 18 - Jan - 2021","skills":".Net, ASP .Net, MVC, SQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Vaps Technosoft Private Limited, No. 58, Kamakshi Palya, Basaveshwaranagar, Bangalore - 560 079.","phone":"9110205013","profile":" .Net Developer/ Trainees \nVaps Technosoft Private Limited","description":"Internship for Dot Net Developers at Vaps Technosoft Private Limited Candidate must have undergone training from any certified training Institution Fresher only need to apply Location: Bengaluru (Basaveshwara Nagar) Walk-in Date/ Time: 11th January - 18th January 2021, 11.00 AM - 5.00 PM Venue Details- Vaps Technosoft Private Limited No. 58, Kamakshi Palya, Basaveshwaranagar, Bangalore - 560 079. Contact - Geetha (9110205013)  ","location":"Bangalore","experience":"0-1Years"},{"date":"8 - Jan - 2021","skills":"Desktop Support, Technical Support, Customer Support","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Apple Authorised Service Provider - iCare, LG 16 Vasant Square Mall, Pocket 5, Sector B, Vasant Kunj, New Delhi - 110 070","phone":"Not Provided","profile":" Technical Support Consultant \nAmple Technologies Private Limited","description":"We have walk-in drive for Technical Support Consultant (Freshers/ Experienced) BE/ B-Tech Freshers are not eligible to apply for this job Job Responsibility: Customer service/ Front-end customer handling. Handling customer queries/ issues in the store related to (Mobile, Laptop & Desktop) Troubleshooting of technical related issues and ensure to resolve the issues/ queries Escalate problems when unable to resolve customer issues. Knowledge on computer hardware & software is added advantage. Excellent language fluency, excellent verbal & written communication skills. Should be able to handle customer queries and should aim at customer delight. Self driven & goal oriented and willing to work on Weekends Should be technically sound. Duration: Contract Basis Your consultation period is 1 year and and this period may be extended or pre-closed as per the business needs. If you are interested please attend the walk-in happening on 8th January 2021. Time - 11:00 am to 4:00 pm Venue Details- Apple Authorised Service Provider - iCare, LG 16 Vasant Square Mall, Pocket 5, Sector B, Vasant Kunj, New Delhi - 110 070 Contact Email- jiddu.manoharan@ample.co.in  ","location":"Delhi","experience":"0-3Years"},{"date":"8 - Jan - 2021","skills":"Banking Process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Teleperformance Private Limited, ASPEE House. Near SNDT College, Opposite Overseas Bank, Near Kotak Mahindra Bank, Marve Road, Near Orlem Church, Malad West, Mumbai.","phone":"8928013505","profile":" Banking Process Executive \nIntelenet Global Services Private Limited","description":"Intelenet Global Services Private Limited (Teleperformance) is having huge opening for Banking Process/ Voice and Non-Voice Process Minimum Qualification: HSC Fresher/ Experience any one can apply Candidate should be fluent in English and Hindi. Opening for linguistic also (Malayalam, Telugu, Tamil, Kannada). Rotational shift / rotational week off Work From office (Location Malad west) Salary upto - 20 ctc Walk-in Date/ Time: 8th January 2021, 2.00 PM - 5.30 PM Venue Details- Teleperformance Private Limited ASPEE House. Near SNDT College. Opp Overseas Bank, Near Kotak Mahindra Bank,. Marve Road, Near Orlem Church, Malad West, Mumbai. Interested can call or watsap - 8928013505 ( HR Preeti) you can email your Resume - 2019preetij@gmail.com  ","location":"Mumbai","experience":"0-5Years"},{"date":"8 - Jan - 2021","skills":"Customer Relationship, Customer Handling, Inventory Management","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Valuedrive Technologies Private Limited, Spinny Car Hub - NSP, Delhi, 7th Floor, PP Trade Center, Netaji Subhash Place, Wazirpur, Delhi - 110 034.","phone":"7002632038","profile":" Relationship Manager \nValuedrive Technologies Private Limited","description":"Candidate should be Any Graduate with 1 to 4 years of relevant experience. Automobile (Car sales) experience is preferred. Designation - Relationship Manager Location- Gurgaon and NSP Experience in Car sales required. Job Description: \u0095 Handle sales at our retail hub. Front line selling- 4 wheeler only \u0095 Customer handling and negotiation \u0095 Pitching Products knowledge to customers. \u0095 Be customer champion by ensuring a superb experience with the company. \u0095 Meet and engage with customers, show them the cars, and conduct test drives. \u0095 Manage inventory at the hub. Benefits: Attractive Incentives Opportunity to grow and manage a hub of 100+ cars in the Assign Area. Enjoy working with young and similar minded people. Will be given a promising position in the Sales Department. Requirements and Responsibilities o Must have good analytical skills o Should be smart and quick to respond to customers o Liking cars a must. Must know driving. Walk-in Date/ Time: 8th January 2021, 10.00 AM - 1.30 PM Address- Valuedrive Technologies Private Limited Spinny Car Hub - NSP, Delhi, 7th Floor, PP Trade Center, Netaji Subhash Place, Wazirpur, Delhi - 110 034. Contact - Sushmita Kar (7002632038) If Interested please apply for the posting we will reach out to you shortly or share cv at sushmita.kar@spinny.com  ","location":"Delhi","experience":"1-4Years"},{"date":"8 - Jan - 2021","skills":"Payment posting, Charge entry, Radio diagnosis, Denial management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Global Healthcare Billing Partners, No 70, Ritherdon Rd, A Block, Vepery, Purasaiwakkam, Chennai - 600 007. Landmark- Near Nilgiris & Dina Lab","phone":"8939844747","profile":" Charge Entry Executive \nGlobal Healthcare Billing Partners Pvt. Limited","description":"Educational Qualification : Any Graduate Work Experience : 6 Months to 5 Years Job Location: Vepery, Chennai Essential Requirement- Associate should have worked for a minimum of 6 months in Charge entry & Demo. Walk-in Date/ Time: 8th January 2021, 11.00 AM - 4.00 PM Venue Details- Global Healthcare Billing Partners Pvt. Limited No 70, Ritherdon Rd, A Block, Vepery, Purasaiwakkam, Chennai - 600 007. Landmark- Near Nilgiris & Dina Lab Contact - Pooja HR (8939844747)  ","location":"Chennai","experience":"0-5Years"},{"date":"8 - Jan - 2021","skills":"HR Operations, Interviewing, Talent Acquisition, Recruitment, HR Generalist","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"IIFL Finance Limited, IIFL House, Plot No. 98, Udyog Vihar, Phase IV, Near Maruti Gate no. 3, Gurgaon, Haryana - 122 015.","phone":"Not Provided","profile":" Project Trainee - HR \nIIFL Finance Limited","description":"Looking out for young, energetic fresher / a beginner who wants to build his/her career in HR & is thus looking for a platform to start with. Job Responsibility:- Identifying the potential candidates through various sources like job portals, employee referral, head hunting, reference generation, etc Analyze the CVs and shortlist the candidates based on the pre-set criteria Scheduling the interviews of candidates Co-coordinating with the shortlisted candidates for interview lineups with the business head. Conducting the interviews by different ways (Personal & Telephonic Interview). Taking follow up for salary negotiation and Processing the offer letter/ Offer details of the candidate as per the schedule Following up with the candidates till he/she comes on board Maintaining a systematic and comprehensive database of all candidates/ applicants Develop and maintain all recruitment related MIS on a regular basis. Resolving salary queries and explaining HR policies. Handle end to end recruitment along with day to day operational work. Job Type - Contractual Job (6 Months) Stipend - 15 k Job Location - Gurgaon Walk-in Date/ Time: 8th January 2021, 11.00 AM - 3.00 PM Venue Details- IIFL Finance Limited IIFL House, Plot No. 98, Udyog Vihar, Phase IV, Near Maruti Gate no. 3, Gurgaon, Haryana - 122 015. Contact - Mehak Ahluwalia  ","location":"Gurgaon","experience":"0-2Years"},{"date":"4, 5, 6, 7, 8, 9 - Jan - 2021","skills":"Techincal Support, Desktop Support, Voice Process, Troubleshooting skills","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Not Provided","phone":"Not Provided","profile":" IT Support/ Service Desk Analyst \nInspiration Manpower Consultancy Pvt. Limited","description":"Candidate should be Any Graduate with 0 to 5 years of experience in IT Service Desk/ Active Directory/ IT Help desk/ Networking. Must have excellent communication skills. Job Responsibility- Installing/ Configuring computer hardware operating Systems/ Applications/ IT service desk Analyst/ Service desk Management/ Active Directory Monitoring and maintaining computer systems and networks Troubleshooting System/ Network problems and diagnosing/solving hardware or software faults Evaluating new Technology To Apply Call Hadiya- 9900073504/ 7259027295/ 7760984461/ 7624843555/ 7624842555  ","location":"Bangalore, Chennai, Kolkata","experience":"0-5Years"},{"date":"11, 12, 13, 14, 15 - Jan - 2021","skills":"Cheque Data Entry, Banking Process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Cameo Corporate Services Limited, No. 1, Subramanian Buliding, 1st Floor, Club House Road, Anna Salai, Chennai.","phone":"Not Provided","profile":" Data Entry Operator - Only Male \nCameo Corporate Services Limited","description":"Immediate Opening for Data Entry Operator for Banking Process (Night Shift - Work from Office) - Only Male Candidates Preferred. Roles and Responsibilities- Cheque Data Entry Any Degree Fresher or Experienced (0-1 year) Office Timing = 8.30 PM to 5.30 AM Perks and Benefits Salary Based on Targets Achieve Salary Per Cheque = 0.19/- Paise 2000 cheques per day target 24 days working Sunday, 2nd and 4th Saturday Holiday Salary you can earn from 9000 to 15000 per month based on targets achieve as take home If any Error in Cheque Typing, Error Amount will be deducted based on error occured. Walk-in Date/ Time: 11th - 15th January 2021, 9.30 AM - 5.30 PM Venue Details- Cameo Corporate Services Limited No. 1, Subramanian Buliding, 1st Floor, Club House Road, Anna Salai, Chennai. Landmark:- Near Spencer Plaza, Opp. building to Senthur Hotel, Bank of Baroda Bank.  ","location":"Chennai","experience":"0-1Years"},{"date":"11, 12, 13, 14, 15 - Jan - 2021","skills":"Typesetting, Content Creation, Publishing, Proof Reading","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Techbooks International Private Limited, Aptara, A-37, Sector - 60, NOIDA, Uttar Pradesh - 201 301","phone":"Not Mentioned","profile":" QC/ Proof Reader \nTechbooks International Private Limited","description":"Techbooks International Private Limited, Aptara is currently hiring QC/ Proof Reader. Candidate should be Any Graduate with 3 to 8 years experience in QC/ Proof reading. Knowledge of Windows Operating systems and MS office (Windows 2000/XP/Vista/ 7/ windows 8). Should be willing to work in night shifts. Confident and self-motivated with positive attitude. Immediate joiners would be preferred. Walk-in Date/ Time: 11th - 15th January 2021, 9 AM onwards Venue Details- Techbooks International Private Limited Aptara, A-37, Sector - 60, NOIDA, Uttar Pradesh - 201 301 Contact - Prakash Singh  ","location":"Noida","experience":"3-8Years"},{"date":"11, 12, 13, 14, 15 - Jan - 2021","skills":"HR, Recruitment, Sourcing Profiles/ Screening, Shortlisting","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"PGM Services, Unit No-135, DLF City Court, First Floor Sector 24, Near Sikanderpur Metro Station, Gurgaon","phone":"Not Provided","profile":" HR Recruiter \nPGM Services","description":"Candidate should have 0 to 3 years of experience in handling End to End Recruitment. Sourcing and conducting Telephonic & Face to Face Interview from Executive to Managerial Level through different portals like Naukri. Must have excellent communication skills. Walk-in Date/ Time: 11th January - 15th January , 10.00 AM - 5.00 PM Venue Details- PGM Services Unit No-135, DLF City Court, First Floor Sector 24, Near Sikanderpur Metro Station, Gurgaon Contact - Nishi Vashistha Share cv at aayushisingh.pgm@gmail.com  ","location":"Gurgaon","experience":"0-3Years"},{"date":"12, 13, 14, 15 - Jan - 2021","skills":"HR Administration/ HR Functions, Office Administration","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Technospecs Technologies Pvt. Limited, C-133, Industrial Area, Phase 8, Mohali, Punjab","phone":"Not Provided","profile":" HR Executive \nTechnospecs Technologies Pvt. Limited","description":"Technospecs is seeking a fresher candidate with the following skills and capabilities to join us. Experience working on computer operating system running Windows 10. Knowledge of Excel, Word, PowerPoint with good writing speed and be able to setup documents, spreadsheets (including formulas, graphs etc.) and presentation. Excellent written English with ability to write an article on a chosen topic. Good confidence and be able to talk to the employees in one-to-one and in group. Be able to get trained on various HR related tools like HRMS, Bio-metric attendance, CCTV logs and others. Ability to pull the profiles from various job portals like Naukri, Monster, Indeed etc. for various technical positions Technospecs would open. Collect employee feedback and have fair understanding of various policies we have implemented or we might implement in future. Administering various online social networking and marketing portals we use like LinkedIn, Clutch etc. Work alongside the sales and business development person to lay out the roadmap and resource allocation for any upcoming project. Team roster setup and management for a 24x7 working environment. Following are some important points for the position we are offering. Candidates with no experience or with an internship in any IT company. Salary up-to 20k per month. Monday to Friday daytime shift (9am 5:30 pm) with a 30 mins break. Management of a team size of up-to 25 employees. Reporting to the HR head and companys CEO. Walk-in Date/ Time: 12th January - 15th January , 12.00 PM - 3.00 PM Venue Details- Technospecs Technologies Pvt. Limited C-133, Industrial Area, Phase 8, Mohali, Punjab Contact - Harjit Kaur  ","location":"Mohali","experience":"0-1Years"},{"date":"8 - Jan - 2021","skills":"Student Activities, Back Office Operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"PRIMUS Techsystems Private Limited, 5th Floor, B-Junction, Above Kotak Mahindra Bank, Behind Karve Statue, Kothrud, Pune - 411 029.","phone":"Not Provided","profile":" Back Office & Operations Executive \nPRIMUS Techsystems Private Limited","description":"Candidate should be Any Graduate with 0 to 3 years of experience in Back Office & Operations Work Must have Excellent Communication Skills Should have good grasping & learning skills Females Candidate would be preferred Walk-in Date/ Time: 8th January 2021, 12.00 PM - 6.00 PM Venue Details- PRIMUS Techsystems Private Limited 5th Floor, B-Junction, Above Kotak Mahindra Bank, Behind Karve Statue, Kothrud, Pune - 411 029. Contact - Anjali Supare  ","location":"Pune","experience":"0-3Years"},{"date":"7, 8 - Jan - 2021","skills":"General Administration, Front Office/ Receptionist Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Digital Track Solutions Private Limited, No: 543, I Floor, Accord Building, Anna Salai, Nandanam, Chennai - 600 035. Landmark: Opposite/ Near Audi Showroom","phone":"Not Provided","profile":" Front Office/ Admin Executive \nDigital Track Solutions Private Limited","description":"Person should be Any Graduate with 1 to 2 years of experience in General Administration, Front Office/ Receptionist Activities. Must have excellent communication skills. Required Female Candidate only Job Responsibility- Maintaining administration and operation records Answering all incoming calls and redirecting to the correct department Supervising the housekeeping department, preparing a list of stock Interested can walk-in for interview on 7th - 8th January , 9.30 AM - 3.30 PM Address- Digital Track Solutions Private Limited No: 543, I Floor, Accord Building, Anna Salai, Nandanam, Chennai - 600 035. Landmark: Opposite/ Near Audi Showroom  ","location":"Chennai","experience":"1-2Years"},{"date":"8 - Jan - 2021","skills":"Handling Customer Queries, Office Administration, Telecommunication","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Patliputra Builder Private Limited, INS 02, CHI - V, Greater Noida","phone":"9771417081","profile":" Female Office Administrator \nPatliputra Builder Private Limited","description":"Walk-In Interview for Admin Profile, Female candidates only. Candidate should be Any Graduate with 2 to 5 years of experience in Office Administration, Telecommunication and Handling Customer Queries. Must have excellent communication skills. Walk-in Date/ Time: 8th January 2021, 11.30 AM - 5.00 PM Venue Details- Patliputra Builder Private Limited INS 02, CHI - V, Greater Noida Contact Details: Ashish Kumar Singh 9771417081 hr@patliputrahotels.com  ","location":"Noida","experience":"2-5Years"},{"date":"6, 7, 8, 9, 11, 12, 13, 14, 15, 16 - Jan - 2021","skills":"Core Java, JSP Servlet, Javascript, Jquery, Hibernate, Maven","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Appsource Services Private Limited, No. 12, Ramanuja Plaza 1st Floor Malleshwaram 5th Cross, Bangalore - 560 003.","phone":"9663863321","profile":" Core Java Developer \nAppsource Services Private Limited","description":"Candidates with below skills can apply : Java Dotnet Mobile Application (Android, iOS) Python Walk-in Date/ Time: 6th - 16th January 2021, 10 AM onwards Venue Details- Appsource Services Private Limited No. 12, Ramanuja Plaza 1st Floor Malleshwaram 5th Cross, Bangalore - 560 003. Contact Person- Shwetha (9663863321)  ","location":"Bangalore","experience":"0-4Years"},{"date":"12 - Jan - 2021","skills":"Core Java, Springs and Hibernate","qualification":"B.E./B.Tech, MCA/PGDCA","address":"C-Edge Technologies Limited, 2nd Floor, Nitco Business Park. Road No. 16U, Wagle Industrial Estate, Thane (West) - 400 604","phone":"9769682373","profile":" Java Developers \nC-Edge Technologies Limited","description":"Candidate should be BE/ B.Tech or MCA with 1 to 3 years of experience in Software Development using Core Java, Springs and Hibernate. Walk-in Interview on 12th January 2021, 11.00 AM - 5.00 PM Venue Details- C-Edge Technologies Limited 2nd Floor, Nitco Business Park . Road No.16U, Wagle Industrial Estate, Thane (West) - 400 604 Contact - Rakesh Uchil (9769682373)  ","location":"Mumbai","experience":"1-3Years"},{"date":"6 - Jan - 2021","skills":"Accounts Payable, Credit Control Operations, Forecasting, MS Excel (Vlook up)","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Zebronics India Private Limited, No. 118 Ponnamallee High Road, Vepery, Chennai - 600 084","phone":"Not Provided","profile":" Accounts Executive \nZebronics India Private Limited","description":"We are actively looking for Accounts Executive for Chennai Location Candidate must have basic knowledge in MS Excel (Vlook up) Education Qualification- B Com, M.com Freshers with internship(s) experience may also apply. Walk-in Date/ Time: 6th January 2021, 10 AM onwards Venue Details- Zebronics India Private Limited No. 118 Ponnamallee High Road, Vepery, Chennai - 600 084 Landmark: Opposite to Sudha Hotel. (view on Map) Contact - Khushbu mehta  ","location":"Chennai","experience":"1-2Years"},{"date":"6 - Jan - 2021","skills":"IT Recruitment, Screening, Induction, Selection, Hiring, Mass Mailing","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Saiva System India Private Limited, 38K, A Block, Sector- 64 Noida. Nearest Metro Station: Noida Sector-59","phone":"Not Provided","profile":" HR Recruiter/ Executive (Fresher) \nSaiva System (India) Private Limited","description":"Candidates should have technical qualification (i.e B.Tech, M.Tech, BCA, MCA etc). Screening the resume as per the clients specification. Responsible for hiring IT skills, Need to achieve the targets assigned by the respective team leads. Job Responsibilities- Responsible for End to End Recruitment C2H and Permanent Hiring. Analyzing job specification. Provide daily/weekly reports to Team leads on a timely basis regarding status relating to all positions. Perks and benefits- Alternate Saturdays off office hours 9 am to 6 pm. Walk-in Date/ Time: 6th January 2021, 11.00 AM - 3.00 PM Venue Details- Saiva System India Private Limited 38K, A Block, Sector- 64 Noida Nearest Metro Station: Noida Sector-59 Contact person: Monika Contact No: 9667230694  ","location":"Noida","experience":"0-1Years"},{"date":"6 - Jan - 2021","skills":"IT Recruitment/ Sourcing, Hiring, Selection, End to End Recriitment Process","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"V-Soft Consulting Corporation Pvt. Limited, Incor 9, 3rd Floor, Kavuri Hills, Madhapur Hyderabad - 500 033","phone":"Not Provided","profile":" US IT Recruiter - Freshers \nV-Soft Consulting Corporation Pvt. Limited","description":"We do have the Immediate requirement for freshers for the 'US IT Recruiter' Position. Work Experience : 0 to 2 Years Job Location: Hyderabad Shift Timings: 07:30 PM to 04:30 AM (Night shift) Candidate should have very good communication skills Must be interested in working in night shifts Interested candidates can share their profiles with sravani@vsoftconsulting.com Walk-in Date/ Time: 6th January 2021, 11.00 AM - 4.00 PM Venue Details- V-Soft Consulting Corporation Pvt. Limited Incor 9, 3rd Floor, Kavuri Hills, Madhapur Hyderabad - 500 033. Contact Person- Sravani  ","location":"Hyderabad","experience":"0-3Years"},{"date":"6 - Jan - 2021","skills":"Customer Service, Sales/ Business Development (B2B)","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Madhukar Domestic Appliances Pvt. Limited, #94, 2nd Main Road, 8th Cross, near Vijaya Bank ATM, Chamrajpet, Bengaluru, Karnataka - 560 018.","phone":"8861007105","profile":" Sales & Service Executive \nStovekraft Private Limited","description":"Required Female Executives who are interested to pursue their career in Sales (B2B) Designation: Executive Sales Location: Regional Office, Chamrajpet Education: Any Graduates - Freshers, knowledge in computers Linguistic Skills: Kannada, English & Hindi CTC: 3 LPA + other benefits Walk-in Date/ Time: 6th January 2021, 9.30 AM - 5.00 PM Venue Details- Madhukar Domestic Appliances Pvt. Limited, #94, 2nd Main Road, 8th Cross, near Vijaya Bank ATM, Chamrajpet, Bengaluru, Karnataka - 560 018. Contact No. 8861007105 Note: Only Female candidates can apply.  ","location":"Bangalore","experience":"0-1Years"},{"date":"6 - Jan - 2021","skills":"IT Recruitment, Screening, Induction, Selection, Hiring, Mass Mailing","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Saiva System India Private Limited, 38K, A Block, Sector- 64 Noida. Nearest Metro Station: Noida Sector-59","phone":"Not Provided","profile":" HR Recruiter/ Executive (Fresher) \nSaiva System (India) Private Limited","description":"Candidates should have technical qualification (i.e B.Tech, M.Tech, BCA, MCA etc). Screening the resume as per the clients specification. Responsible for hiring IT skills, Need to achieve the targets assigned by the respective team leads. Job Responsibilities- Responsible for End to End Recruitment C2H and Permanent Hiring. Analyzing job specification. Provide daily/weekly reports to Team leads on a timely basis regarding status relating to all positions. Perks and benefits- Alternate Saturdays off office hours 9 am to 6 pm. Walk-in Date/ Time: 6th January 2021, 11.00 AM - 3.00 PM Venue Details- Saiva System India Private Limited 38K, A Block, Sector- 64 Noida Nearest Metro Station: Noida Sector-59 Contact person: Monika Contact No: 9667230694  ","location":"Noida","experience":"0-1Years"},{"date":"6 - Jan - 2021","skills":"IT Recruitment/ Sourcing, Hiring, Selection, End to End Recriitment Process","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"V-Soft Consulting Corporation Pvt. Limited, Incor 9, 3rd Floor, Kavuri Hills, Madhapur Hyderabad - 500 033","phone":"Not Provided","profile":" US IT Recruiter - Freshers \nV-Soft Consulting Corporation Pvt. Limited","description":"We do have the Immediate requirement for freshers for the 'US IT Recruiter' Position. Work Experience : 0 to 2 Years Job Location: Hyderabad Shift Timings: 07:30 PM to 04:30 AM (Night shift) Candidate should have very good communication skills Must be interested in working in night shifts Interested candidates can share their profiles with sravani@vsoftconsulting.com Walk-in Date/ Time: 6th January 2021, 11.00 AM - 4.00 PM Venue Details- V-Soft Consulting Corporation Pvt. Limited Incor 9, 3rd Floor, Kavuri Hills, Madhapur Hyderabad - 500 033. Contact Person- Sravani  ","location":"Hyderabad","experience":"0-3Years"},{"date":"6 - Jan - 2021","skills":"Customer Service, Sales/ Business Development (B2B)","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Madhukar Domestic Appliances Pvt. Limited, #94, 2nd Main Road, 8th Cross, near Vijaya Bank ATM, Chamrajpet, Bengaluru, Karnataka - 560 018.","phone":"8861007105","profile":" Sales & Service Executive \nStovekraft Private Limited","description":"Required Female Executives who are interested to pursue their career in Sales (B2B) Designation: Executive Sales Location: Regional Office, Chamrajpet Education: Any Graduates - Freshers, knowledge in computers Linguistic Skills: Kannada, English & Hindi CTC: 3 LPA + other benefits Walk-in Date/ Time: 6th January 2021, 9.30 AM - 5.00 PM Venue Details- Madhukar Domestic Appliances Pvt. Limited, #94, 2nd Main Road, 8th Cross, near Vijaya Bank ATM, Chamrajpet, Bengaluru, Karnataka - 560 018. Contact No. 8861007105 Note: Only Female candidates can apply.  ","location":"Bangalore","experience":"0-1Years"},{"date":"6 - Jan - 2021","skills":"IT Recruitment, Screening, Induction, Selection, Hiring, Mass Mailing","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Saiva System India Private Limited, 38K, A Block, Sector- 64 Noida. Nearest Metro Station: Noida Sector-59","phone":"Not Provided","profile":" HR Recruiter/ Executive (Fresher) \nSaiva System (India) Private Limited","description":"Candidates should have technical qualification (i.e B.Tech, M.Tech, BCA, MCA etc). Screening the resume as per the clients specification. Responsible for hiring IT skills, Need to achieve the targets assigned by the respective team leads. Job Responsibilities- Responsible for End to End Recruitment C2H and Permanent Hiring. Analyzing job specification. Provide daily/weekly reports to Team leads on a timely basis regarding status relating to all positions. Perks and benefits- Alternate Saturdays off office hours 9 am to 6 pm. Walk-in Date/ Time: 6th January 2021, 11.00 AM - 3.00 PM Venue Details- Saiva System India Private Limited 38K, A Block, Sector- 64 Noida Nearest Metro Station: Noida Sector-59 Contact person: Monika Contact No: 9667230694  ","location":"Noida","experience":"0-1Years"},{"date":"6 - Jan - 2021","skills":"IT Recruitment/ Sourcing, Hiring, Selection, End to End Recriitment Process","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"V-Soft Consulting Corporation Pvt. Limited, Incor 9, 3rd Floor, Kavuri Hills, Madhapur Hyderabad - 500 033","phone":"Not Provided","profile":" US IT Recruiter - Freshers \nV-Soft Consulting Corporation Pvt. Limited","description":"We do have the Immediate requirement for freshers for the 'US IT Recruiter' Position. Work Experience : 0 to 2 Years Job Location: Hyderabad Shift Timings: 07:30 PM to 04:30 AM (Night shift) Candidate should have very good communication skills Must be interested in working in night shifts Interested candidates can share their profiles with sravani@vsoftconsulting.com Walk-in Date/ Time: 6th January 2021, 11.00 AM - 4.00 PM Venue Details- V-Soft Consulting Corporation Pvt. Limited Incor 9, 3rd Floor, Kavuri Hills, Madhapur Hyderabad - 500 033. Contact Person- Sravani  ","location":"Hyderabad","experience":"0-3Years"},{"date":"6 - Jan - 2021","skills":"Customer Service, Sales/ Business Development (B2B)","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Madhukar Domestic Appliances Pvt. Limited, #94, 2nd Main Road, 8th Cross, near Vijaya Bank ATM, Chamrajpet, Bengaluru, Karnataka - 560 018.","phone":"8861007105","profile":" Sales & Service Executive \nStovekraft Private Limited","description":"Required Female Executives who are interested to pursue their career in Sales (B2B) Designation: Executive Sales Location: Regional Office, Chamrajpet Education: Any Graduates - Freshers, knowledge in computers Linguistic Skills: Kannada, English & Hindi CTC: 3 LPA + other benefits Walk-in Date/ Time: 6th January 2021, 9.30 AM - 5.00 PM Venue Details- Madhukar Domestic Appliances Pvt. Limited, #94, 2nd Main Road, 8th Cross, near Vijaya Bank ATM, Chamrajpet, Bengaluru, Karnataka - 560 018. Contact No. 8861007105 Note: Only Female candidates can apply.  ","location":"Bangalore","experience":"0-1Years"},{"date":"6 - Jan - 2021","skills":"IT Recruitment, Screening, Induction, Selection, Hiring, Mass Mailing","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Saiva System India Private Limited, 38K, A Block, Sector- 64 Noida. Nearest Metro Station: Noida Sector-59","phone":"Not Provided","profile":" HR Recruiter/ Executive (Fresher) \nSaiva System (India) Private Limited","description":"Candidates should have technical qualification (i.e B.Tech, M.Tech, BCA, MCA etc). Screening the resume as per the clients specification. Responsible for hiring IT skills, Need to achieve the targets assigned by the respective team leads. Job Responsibilities- Responsible for End to End Recruitment C2H and Permanent Hiring. Analyzing job specification. Provide daily/weekly reports to Team leads on a timely basis regarding status relating to all positions. Perks and benefits- Alternate Saturdays off office hours 9 am to 6 pm. Walk-in Date/ Time: 6th January 2021, 11.00 AM - 3.00 PM Venue Details- Saiva System India Private Limited 38K, A Block, Sector- 64 Noida Nearest Metro Station: Noida Sector-59 Contact person: Monika Contact No: 9667230694  ","location":"Noida","experience":"0-1Years"},{"date":"6 - Jan - 2021","skills":"IT Recruitment/ Sourcing, Hiring, Selection, End to End Recriitment Process","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"V-Soft Consulting Corporation Pvt. Limited, Incor 9, 3rd Floor, Kavuri Hills, Madhapur Hyderabad - 500 033","phone":"Not Provided","profile":" US IT Recruiter - Freshers \nV-Soft Consulting Corporation Pvt. Limited","description":"We do have the Immediate requirement for freshers for the 'US IT Recruiter' Position. Work Experience : 0 to 2 Years Job Location: Hyderabad Shift Timings: 07:30 PM to 04:30 AM (Night shift) Candidate should have very good communication skills Must be interested in working in night shifts Interested candidates can share their profiles with sravani@vsoftconsulting.com Walk-in Date/ Time: 6th January 2021, 11.00 AM - 4.00 PM Venue Details- V-Soft Consulting Corporation Pvt. Limited Incor 9, 3rd Floor, Kavuri Hills, Madhapur Hyderabad - 500 033. Contact Person- Sravani  ","location":"Hyderabad","experience":"0-3Years"},{"date":"6 - Jan - 2021","skills":"Customer Service, Sales/ Business Development (B2B)","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Madhukar Domestic Appliances Pvt. Limited, #94, 2nd Main Road, 8th Cross, near Vijaya Bank ATM, Chamrajpet, Bengaluru, Karnataka - 560 018.","phone":"8861007105","profile":" Sales & Service Executive \nStovekraft Private Limited","description":"Required Female Executives who are interested to pursue their career in Sales (B2B) Designation: Executive Sales Location: Regional Office, Chamrajpet Education: Any Graduates - Freshers, knowledge in computers Linguistic Skills: Kannada, English & Hindi CTC: 3 LPA + other benefits Walk-in Date/ Time: 6th January 2021, 9.30 AM - 5.00 PM Venue Details- Madhukar Domestic Appliances Pvt. Limited, #94, 2nd Main Road, 8th Cross, near Vijaya Bank ATM, Chamrajpet, Bengaluru, Karnataka - 560 018. Contact No. 8861007105 Note: Only Female candidates can apply.  ","location":"Bangalore","experience":"0-1Years"},{"date":"6 - Jan - 2021","skills":"IT Recruitment, Screening, Induction, Selection, Hiring, Mass Mailing","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Saiva System India Private Limited, 38K, A Block, Sector- 64 Noida. Nearest Metro Station: Noida Sector-59","phone":"Not Provided","profile":" HR Recruiter/ Executive (Fresher) \nSaiva System (India) Private Limited","description":"Candidates should have technical qualification (i.e B.Tech, M.Tech, BCA, MCA etc). Screening the resume as per the clients specification. Responsible for hiring IT skills, Need to achieve the targets assigned by the respective team leads. Job Responsibilities- Responsible for End to End Recruitment C2H and Permanent Hiring. Analyzing job specification. Provide daily/weekly reports to Team leads on a timely basis regarding status relating to all positions. Perks and benefits- Alternate Saturdays off office hours 9 am to 6 pm. Walk-in Date/ Time: 6th January 2021, 11.00 AM - 3.00 PM Venue Details- Saiva System India Private Limited 38K, A Block, Sector- 64 Noida Nearest Metro Station: Noida Sector-59 Contact person: Monika Contact No: 9667230694  ","location":"Noida","experience":"0-1Years"},{"date":"6 - Jan - 2021","skills":"IT Recruitment/ Sourcing, Hiring, Selection, End to End Recriitment Process","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"V-Soft Consulting Corporation Pvt. Limited, Incor 9, 3rd Floor, Kavuri Hills, Madhapur Hyderabad - 500 033","phone":"Not Provided","profile":" US IT Recruiter - Freshers \nV-Soft Consulting Corporation Pvt. Limited","description":"We do have the Immediate requirement for freshers for the 'US IT Recruiter' Position. Work Experience : 0 to 2 Years Job Location: Hyderabad Shift Timings: 07:30 PM to 04:30 AM (Night shift) Candidate should have very good communication skills Must be interested in working in night shifts Interested candidates can share their profiles with sravani@vsoftconsulting.com Walk-in Date/ Time: 6th January 2021, 11.00 AM - 4.00 PM Venue Details- V-Soft Consulting Corporation Pvt. Limited Incor 9, 3rd Floor, Kavuri Hills, Madhapur Hyderabad - 500 033. Contact Person- Sravani  ","location":"Hyderabad","experience":"0-3Years"},{"date":"6 - Jan - 2021","skills":"Customer Service, Sales/ Business Development (B2B)","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Madhukar Domestic Appliances Pvt. Limited, #94, 2nd Main Road, 8th Cross, near Vijaya Bank ATM, Chamrajpet, Bengaluru, Karnataka - 560 018.","phone":"8861007105","profile":" Sales & Service Executive \nStovekraft Private Limited","description":"Required Female Executives who are interested to pursue their career in Sales (B2B) Designation: Executive Sales Location: Regional Office, Chamrajpet Education: Any Graduates - Freshers, knowledge in computers Linguistic Skills: Kannada, English & Hindi CTC: 3 LPA + other benefits Walk-in Date/ Time: 6th January 2021, 9.30 AM - 5.00 PM Venue Details- Madhukar Domestic Appliances Pvt. Limited, #94, 2nd Main Road, 8th Cross, near Vijaya Bank ATM, Chamrajpet, Bengaluru, Karnataka - 560 018. Contact No. 8861007105 Note: Only Female candidates can apply.  ","location":"Bangalore","experience":"0-1Years"}]}