{"Walkins":[{"date":"19, 20, 21, 22, 23 - Aug - 2019","skills":"Software Development Life Cycle, Java, Regression Testing, Test Management","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"NTT DATA Global Delivery Services Pvt. Limited, DLF IT Park, 7th Block 2nd Floor, Ramapuram, Chennai- 89","phone":"Not Provided","profile":"Quality Analyst/ Software Tester @ NTT DATA Global Delivery Services Pvt. Limited","description":"Technical skills: 4 to 6 years of relevant experience as tester Should have solid knowledge of XML, Java Script, service (SOAP/ REST) concepts Desired Skills: Proven experience as a QA tester or similar role Experience in project management and QA methodology Familiarity with Agile frameworks and regression testing is a plus Ability to document and troubleshoot errors Working knowledge of test management software (e.g. qTest, Zephyr) and SQL Excellent communication skills Attention to detail Analytical mind and problem-solving aptitude Strong organizational skills Walk-in Date: 19th - 23rd August 2019 Timing : 12 PM to 2 PM Interview Venue: NTT DATA Global Delivery Services DLF IT Park, 7th Block 2nd Floor, Ramapuram, Chennai- 89 Please Carry your original ID Proof","location":"Chennai","experience":"4 - 6 Years"},{"date":"21, 22, 23 - Aug - 2019","skills":"Technical Support, IT Helpdesk, Customer Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Adecco Group, No. 2, NAL Wind Tunnel Road, Murugeshpalya, Bangalore - 560017","phone":"Not Provided","profile":"Technical Support Engineer @ Adecco India Private Limited","description":"Qualifications: Any Graduate Location : Bangalore, Koramangala Ability to communicate both orally and in writing with internal and external business partners Intermediate level knowledge of MS applications such as Excel, Word and PowerPoint Excellent written and verbal communication; experienced with crafting and delivering presentation material to Senior Management Ability to work in a very fast-paced transitioning environment; able to juggle multiple, competing priorities Demonstrated leadership skills; Ability to establish clear criteria or standards for effective performance and measurement Ability to work independently and use independent judgment to follow through on tasks Excellent time management and organizational skills; detail oriented Able to follow complex processes/procedures in routine and non-routine tasks Ability to work flexible schedules/shifts to cover hours of operation Interested candidates, please walk-in to the below address: 21st August - 23rd August , 10 AM onwards Adecco Group No. 2, NAL Wind Tunnel Road, Murugeshpalya, Bangalore - 560017 Contact Person: Ekta Supkar","location":"Bangalore","experience":"0 - 1 Years"},{"date":"20, 21 - Aug - 2019","skills":"Front office Management, Guest Relationship","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Ample Technologies Private Limited, NCC Windsor Jakkur Next to Renault Showroom","phone":"Not Provided","profile":"Guest Relation Officer (Female) @ Ample Technologies Private Limited","description":"Key Requisites:- Strong customer service skills Ability to manage sensitive and critical client information. Excellent verbal and written communication skills. Problem solving skills. Relationship building skills. Should have an inclination towards technology Job Responsbility:- Greet and welcome guests as soon as they arrive at the centre. Answer queries, resolve complaints and provide basic and accurate information for the challenges faced by the customers. Work basis the feedback mechanism Work with Team Members to ensure coordination and 100%CSAT. Deliver consistent Customer service experience. Empathise with the customers and get the problems solved. Walk-in Date/ Time: 20th - 21st August , 10 AM onwards Interview Venue: Ample Technologies Private Limited NCC Windsor Jakkur Next to Renault Showroom Interested candidates can send in their resume to ashwini.prasad@ample.co.in","location":"Bangalore","experience":"1 - 3 Years"},{"date":"20, 21, 22, 23, 24, 25, 26, 27 - Aug - 2019","skills":"Telecom Process, Order Management, Delivery Management","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Hexaware Technologies Limited, Chennai One IT Park, Phase 2, 3rd Floor, Pallavaram 200 Feet Ring Road, Thoraipakkam, Chennai - 600097","phone":"9884903575","profile":"Backend Executive (Telecom Process) @ Hexaware Technologies Limited","description":"We have an immediate opening in Backend Executive for Telecom process. Work Experience: 1 - 4 Years in Telecom Preferably from any Telecom Background. UK Shift and Drop would be provided Domain Knowledge in Telecom, Delivery, Delivery Management, Order Management, Service Delivery Coordinator. Interested candidates kindly walk-in directly from 20th August - 27th August , 12 PM onwards at the below given address- Hexaware Technologies Limited Chennai One IT Park, Phase 2, 3rd Floor, Pallavaram 200 Feet Ring Road, Thoraipakkam, Chennai - 600097 Reach me @ Vignesh (9884903575) Ramya (8939703058)","location":"Chennai","experience":"1 - 4 Years"},{"date":"21, 23 - Aug - 2019","skills":"Test Engineering, Impact Analysis, Manual Testing","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"QualityKiosk Technologies Private Limited, 4th Floor,419A, C Wing, Rupa Solitaire, Sector-1, Millennium Business Park, Mahape, Kopar Khairane, Navi Mumbai, Maharashtra - 400 710","phone":"022-41288260","profile":"Software Testing Engineer @ QualityKiosk Technologies Private Limited","description":"Urgent Opening for Manual Testing Engineer or Senior Test Engineer (Indian General Insurance Domain Mandatory) Role: Test Engineer or Senior Test Engineer Relevant Experience: 1 to 5 years Number of opening: 2 Required Skills- Manual testing experience Indian General Insurance domain experience (Core Policy System Domain) Fire/ Motor/P & C/ Health product insurance experience Experience in Genesis Configurator added advantage Impact Analysis Capabilities Knowledge on Insurance Workflow Systems Job Location: Base Location Navi Mumbai (Client location can be anywhere in central or western or harbour line or Onsite or within India) Walk-in Date: 21st & 23rd August 2019 Date: 11:00 AM to 3:00 PM Interview location: QualityKiosk Technologies Private Limited, 4th Floor,419A, C Wing, Rupa Solitaire, Sector-1, Millennium Business Park, Mahape, Kopar Khairane, Navi Mumbai, Maharashtra - 400 710 (Lift Number 24 & 25) There will be 3 Levels of interviews (technical, managerial round & HR round faced to face)","location":"Mumbai","experience":"1 - 5 Years"},{"date":"21 - Aug - 2019","skills":"Selenium Testing, System Testing, Manual Testing, JMeter, Performance Testing, Web Services Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Ingram Micro (India) Private Limited, G-2, Akruti Corporate Park, Ground Floor, Kanjurmarg West, Mumbai","phone":"022-66872325","profile":"Software Engineer/ Tester @ Ingram Micro (India) Private Limited","description":"Candidate should have 3 to 5 years of experience in Manual testing of web applications. Independently prepare Test Cases, Execute and Report test cycles for both Manual and Automated tests using Selenium or any other related. Must have good understanding of API architecture and testing the same. Understanding of Web services testing using REST tools Involves functional system testing and exposure to non-functional tests with end to end testing. Work closely with the QA Team, Development Team & Project Manager and IT resources Understanding of SDLC and role of QA in STLC Understanding of web based application and architecture. Experience in Selenium with PHP is an addon. Need Candidates who can join immediately or 20 days max! Walk-in Date/ Time: 21st August , 10 AM onwards Interview Venue: Ingram Micro (India) Private Limited G-2, Akruti Corporate Park, Ground Floor, Kanjurmarg West, Mumbai Contact No: +91 2266872325","location":"Mumbai","experience":"3 - 5 Years"},{"date":"20, 21, 22, 23, 24 - Aug - 2019","skills":"Client Application Support, Security Testing, Manual Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Awapal Solutions Private Limited, E-38, First floor, Sector-63, Noida - 201 301","phone":"9911886563","profile":"Software Tester (Manual) @ Awapal Solutions Private Limited","description":"Candidate should have 6 months to 1 year experience of relevant experience. Must have Positive attitude to do WORK and having good Knowledge of Manual testing, Automation Testing and Security testing . And Must comfortable in client support & software training to clients. Walk-in Date/ Time: 20th August - 16th September, 11 AM onwards Interview Venue: Awapal Solutions Private Limited E-38, First floor, Sector-63, Noida - 201 301","location":"Noida","experience":"1 - 2 Years"},{"date":"25 - Aug - 2019","skills":"Software Testing, Automation Testing, Manual Testing","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Shriram City Union Finance Limited, 1st Floor, Vijay Krishna Plaza, No.1, Lake Area, Mattuthavani, Madurai - 625 007.","phone":"044-42913006","profile":"Testing Engineer Trainee @ Shriram Value Services Pvt. Limited","description":"Candidate with 65% above in 10th,12th, UG, PG are only eligible BE/B Tech (CSE/ IT/ ECE), MCA, MSC (CS) from 2018 & 2019 batch only Bsc-Cs & BCA from 2018 & 2019 batch only Experience: Fresher Good knowledge in Asp .Net/ Testing is preferred Age criteria Not more than 25 Years. Job Location: Chennai Interview Location: Madurai Walk-in Date: 25th August 2019 Timing:9.30 am to 3 pm Venue: Shriram City Union Finance Limited 1st Floor, Vijay Krishna Plaza, No.1, Lake Area, Mattuthavani, Madurai - 625 007. Landmark: Next to Mattuthavani Omni Bus Stand/ Upstairs of Karur Vysya Bank Selection Process: Aptitude Test Technical Round Documents To Be Carried: Resume Passport Size Photo ID Proof Note: If you have attended this interview process in last 6 months you won't be eligible.","location":"Madurai","experience":"0 - 1 Years"},{"date":"24 - Aug - 2019","skills":"Manual Testing, Test Scenarios/ Test cases/ Defect Life Cycle","qualification":"B.E./B.Tech","address":"Sheorey Digital Systems Limited, Anjaneya Techno Park, 1st Floor 147, HAL Airport Road, Kodihalli, Bengaluru - 560 008","phone":"080-67188383","profile":"Manual Testing Engineer @ Sheorey Digital Systems Limited","description":"Educational Qualification : Only B.E/ B.tech Graduates Minimum 3+ years in Manual Testing EPR/ Software Products. Good knowledge in Test Scenarios/ Test cases/ Defect Life Cycle Must have good communication skills. Walk-in Date/ Time: 24th August 2019, 10 AM onwards Interview Venue: Sheorey Digital Systems Limited Anjaneya Techno Park, 1st Floor 147, HAL Airport Road, Kodihalli, Bengaluru - 560 008 Tel : +91 80-67188383","location":"Bangalore","experience":"3 - 5 Years"},{"date":"24 - Aug - 2019","skills":"Test Planning, Javascript, Agile Selection Process, Automation Testing, Selenium","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Hexaware Technologies Limited, S EZ,Plot No 19, Rajiv Gandhi Infotech Park Phase III, MIDC, Hinjewadi, Pune - 411 057","phone":"Not Provided","profile":"Automation Testing (Selenium/ Java) @ Hexaware Technologies Limited","description":"Hexaware Technologies is looking for Automation testing - Selenium Java professionals with 7 to 9 years experience. The candidate should be able to join within 1 month. Good Selenium resource with Java Should have good experience in Java & JavaScript Should have hands on experience in BDD/ Behavior-Driven Development framework like Cucumber, JBehave. Should have experience in Agile Methodologies Experience in Junit are highly preferred. Expertise in debugging code and exception handling Good knowledge in API calls through jar and capture response Fair understanding of Automation Test plan/ Strategy Knowledge in SQL is added advantage Preferred Immediate Joiners Open to work in 2nd shifts (1pm - 10pm) Good English communication skills Interview Date: 24th August 2019 Time: 9.00 am - 1.00 pm Venue Details: Hexaware Technologies Limited, S EZ,Plot No 19, Rajiv Gandhi Infotech Park Phase III, MIDC, Hinjewadi, Pune - 411 057 Contact Person: M. Dhamodaran Please forward your resumes to DhamodaranM@hexaware.com","location":"Pune","experience":"7 - 9 Years"},{"date":"21, 22, 23, 24 - Aug - 2019","skills":"Customer Support, Technical Support, Voice Process","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Tech Mahindra Business Services, Ground Floor, Spectrum Towers, Mindspace, Malad (West), Mumbai - 400 064","phone":"7989155994","profile":"Customer Support (Voice Process) @ Tech Mahindra BS Limited","description":"Huge Hiring for Associates/ Sr Associates (Customer Support) at Tech Mahindra BS Limited Eligibility Criteria: Any Graduate & UG with minimum 6 months of experience in calling domain. SSC pass outs are also eligible with minimum 1 of voice experience. Need excellent communication skills. Looking for immediate joiners only Shift Timing : Rotational shift & UK PKG : 2.5- 4.0 LPA + Incentives Upto 30,000 Age Limit : 44 Should have ability to resolve customer related issues and ensure to resolve the issues or queries over the call. Research, diagnose, and identify solutions to resolve customer issues Candidate should be flexible to work for Rotational Shift. comfortable to work in early morning shifts. Transportation Facilities: Both way 5 days working. Walk-in Date: 21st to 24th August 2019 Timings: 6 PM onwards Interview Venue: Tech Mahindra Business Services, Ground Floor, Spectrum Towers, Mindspace, Malad (West), Mumbai - 400 064 Documents required for walk-in: Copy of CV Original ID proof (Aadhaar - Mandate) SPOC : Contact Person: Ranjeetha Contact Number: 7989155994 Mail Id: RX00570649@techmahindra.com","location":"Mumbai","experience":"0 - 3 Years"},{"date":"22 - Aug - 2019","skills":"Database Management, Customer Support, Technical Support, Service Engineering","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"CMS Info Systems Limited, S P 8 Industrial Estate, Ambattur Industrial Estate, Chennai - 600 058","phone":"Not Provided","profile":"Technical Support Engineer @ CMS Info Systems Limited","description":"Qualification - Diploma Electrical & Electronics Engineering, Communication Engineering, BSC Electronics, Computer Science, BE. IT, BSC IT Male candidates will only be preferred Working Days - 6 days (Monday-Saturday) Job Responsibility: * Perform repairs as required to install base * Perform PM and schedule assignments * Assist customer with training when requested. * Customer Relationship * 24/7 Availability * Spare parts-optimum consumption/faulty dispatch & request -TAT Job Location - Chennai & Kumbakonam Interested candidates please walk-in at the given address on 22nd August , 10 AM onwards- CMS Info Systems Limited S P 8 Industrial Estate, Ambattur Industrial Estate, Chennai - 600 058 Contact Person - SENTHIL S Walk-in timings-10:00 am-5:00 pm","location":"Chennai","experience":"0 - 3 Years"},{"date":"20, 21, 22, 23 - Aug - 2019","skills":"Non Voice Process, Back Office Process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"305, Elite Transbay, Mitcon Road, Opp. SKP Campus Balewadi,Baner, Pune - 411 045","phone":"Not Mentioned","profile":"Back Office Executive @ Pratyin Infotech Consulting Pvt. Limited","description":"Minimum 1 to 3 years of back office typing experience. Must be able to write in and understand English Accuracy of typing 99% - Typing speed 30+ wpm Should have Good Reading abilities Salary Package Max: 2 lacs 5 Days Working Day shift Only This opening is for the Medical Insurance Process. Walk-in Date/ Time: 20th - 23rd August , 10 AM onwards Venue Pune Office: 305, Elite Transbay, Mitcon Road, Opp. SKP Campus, Balewadi, Baner, Pune - 411 045 Mumbai Office: 102/103, Raghuleela, 150 Feet Road, Bhayander (West), Thane - 401 101","location":"Pune, Mumbai","experience":"1 - 3 Years"},{"date":"20, 21, 22, 23 - Aug - 2019","skills":"Customer Service, Back Office Administration, Customer Support","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"WNS Global Services Private Limited, 11th FL Block A2 & A3 Building, DLF IT SEZ, Sector 30 NH8, Gurgaon (Near Star Mall)","phone":"Not Provided","profile":"Backend - Admin Support @ WNS Global Services Private Limited","description":"WNS Looking for Backend - Admin Support - Freshers can also apply Join on Immediate basis. Qualification - Any Graduate Years of experience - 1+ Year Freshers can also apply Candidate should be flexible with the shift Timings. Job Responsbility: The role involves B2B interaction, providing Administrative support (arranging, travel, filing expenses, data entry) using the client tools remotely. Skills Required: Ability to multi-task and to work within a framework of standard processes Good communication skills (both written and verbal) Ability to grasp requirement and deliver as per understanding Proactive team oriented, flexible approach. Walk In Details: Date - 20th to 23rd August 2019 Timings: 1:00 PM to 4:00 PM Venue Details: WNS Global Services Private Limited 11th FL Block A2 & A3 Building, DLF IT SEZ, Sector 30 NH8, Gurgaon (Near Star Mall) Contact Person: Shalini","location":"Gurgaon","experience":"1 - 3 Years"},{"date":"20, 21 - Aug - 2019","skills":"General Administration, Housekeeping, Travel/ Security Infrastructure, Vendor Management","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Welcome Hotel Dwarka, ITC Hotel Group Plot No. 3, Sector 10 District Centre Dwarka, New Delhi","phone":"9819616066","profile":"Administration Executive @ Bombay Swadeshi Stores Limited","description":"Person should be Any Garduate with 2 to 5 years of experience in Housekeeping, General Administration, Travel/ Security Infrastructure, Vendor Management, Hotel Arrangement facilities and Transport Management. Managing employee concerns by providing timely and relevant solutions Sincere dedicated punctual Ready to extend working hours Prompt and responsive This is Junior level Contract & Vendor Management-co-ordination with Mumbai Head office, Facility Management,travel & meeting arrangement, infrastructre, housekeeping. Timely responding to employee emails & query addressal, Coordination with Architect. Job Location: Noida & Gurgaon Walk-in Date: 19th - 21st August 2019 Time: 5.00 pm to 8.00 pm Interview Venue: Welcome Hotel Dwarka, ITC Hotel Group Plot No. 3, Sector 10 District Centre Dwarka, New Delhi Carry updated cv and 1 passport size pic with salary slips is mandatory (To confirm your interview schedule call on 9819616066 - Geeta from HR)","location":"Delhi","experience":"0 - 1 Years"},{"date":"21, 22 - Aug - 2019","skills":"Housekeeping Pest Control Administration Travel Desk Amc Front Office Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Kotak Mahindra Life Insurance Company Limited, #337, 1st Floor, 27th Main Road, HSR Layout Sector 2, Bangalore - 560 102","phone":"022-66057050","profile":"Admin Executive @ Kotak Mahindra Life Insurance Co. Limited.","description":"Candidate should be a Graduate with min 6 month work-experience. Age should not be more than 28 Knowledge of Admin role is a must Aware of Local language must Preferences -(Only Female Candidates can apply) Candidates with experience in the below profiles will not be suitable - (Tele calling or customer care profiles (Insurance, Credit card, Holiday Selling etc), Sales background, Account Assistant/ Purchase Assistant, Secretaries/Receptionists, Telephone Operators and Admin profiles from educational institutions.) Job Responsbility- Managing Front Office / Reception/ Housekeeping /Security/Courier services/Vendors Maintaining Registers & Reports. Budgeting and working for cost reduction/saving. Printing & Purchase of Stationeries Repairs and upkeep of branch infrastructure (AC, DG , telephone lines), Engineering Services(AC, UPS Electricity etc). Arranging all the required items for routine operations. Managing On time Vendor Payment Process Interview Date: 21st - 22nd August 2019 Time : 11:00 AM - 3:00 PM Interview Address: Kotak Mahindra Life Insurance Company Limited, #337, 1st Floor, 27th Main Road, HSR Layout Sector 2, Bangalore - 560 102, Karnataka Landmark: Opposite to KLM MALL Interviewer Details: Priyanka Prakash Email ID - kli.jayshree-bhati@kotak.com Contact Number - 022-66057050","location":"Bangalore","experience":"0 - 1 Years"},{"date":"22 - Aug - 2019","skills":"Customer Relationship, Backend Activities, Sales, Back Office","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"InterGlobe Aviation Limited, Global Business Park, Tower C, 2nd Floor, Gurgaon","phone":"Not Provided","profile":"Customer Relations Executive @ InterGlobe Aviation Limited","description":"Educational Qualification: Any Graduate Work Experience: 0 - 2 Years Job Location: Gurgaon Required Skills- Excellent verbal communication skills English and Hindi Excellent English written business communication skills Ability to work in teams Knowledge of travel/air travel industry/ reservations/ booking etc Ability to work in back office continuously for 8 hours Must be detail oriented Essential Requirements- Work in shift (days shifts with different timings) Function coverage will be 9am to 7 pm 6 days a week Walk-in Date: 22nd August 2019 Timings : 10 am - 3 pm Venue details : InterGlobe Aviation Limited Global Business Park, Tower C, 2nd Floor, Gurgaon","location":"Gurgaon","experience":"0 - 2 Years"},{"date":"20, 21, 22, 23, 24, 26, 27, 28, 29, 30, 31 - Aug - 2019","skills":"Customer Relationship, Front Office, Help Desk Operations, Guest Relation","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Sodexo Food Solutions India Private Limited, P. No.7, H.No.1-65/2/7, Sy.No. 40 & 41, Kakatiya Hills, 100 feet road, Madhapur, Hyderabad - 500 033.","phone":"040-44214421","profile":"Front Office Executive (Male) @ Sodexo Food Solutions India Pvt. Limited","description":"Qualification : Any Graduate. Bachelor of Hotel Management Preferred. Minimum 6 months of experience in hospitality industry. Experience in Handling Guest Rooms Excellent knowledge of Microsoft word & Excel. Excellent customer service skills. Strong and excellent Communication skills. Ability to deal with various types of people. Attending Clients with pleasing Manner Immediate Joining Job Role: Responsible for coordinating all work requests coming in through e mail, phone or any other form of communication regarding the services provided to the Client. Walk-in Date/ Time: 20th - 31st August , 9 AM onwards Interview Venue: Sodexo Food Solutions India Private Limited P. No.7, H.No.1-65/2/7, Sy. No. 40 & 41, Kakatiya Hills, 100 Feet Road, Madhapur, Hyderabad - 500 033. Land Mark - Opposite to Orchid International School. Tel : +91- 40 44214421 Please share your resume to sukeshkumar.gudavalli@sodexo.com or feel free to reach me on 9553953444.","location":"Hyderabad","experience":"0 - 3 Years"},{"date":"24 - Aug - 2019","skills":"Technical Support, Configuration, Installation, Desktop Support, IT Service Desk","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Hexaware Technologies Limited, Plot No.H5 SIPCOT IT Park, Navallur Post, Siruseri, Chennai - 603 103.","phone":"Not Mentioned","profile":"IT Service Desk/ Support Executive @ Hexaware Technologies Limited","description":"Candidate should have basic knowledge on ITIL process and international Client handling over the phone and email. Excellent verbal and written communication in English is must. Should be open to work in 24*7 shifts environment. Provide Help Desk Support for End users and Level 1/2 support of IT Infrastructure and Applications. Meet established service level metrics for call response, technical support and customer service. Log Incidents/call tickets into Ticketing tool, monitor incoming customer ticket queues for assignment, follow-up and resolution Interested candidates can walk-in for the interview on 24th August 2019 @ 10:00AM to the below mentioned venue with your updated resume and meet your contact person HR Dinesh. Venue: Hexaware Technologies Limited, Plot No.H5 SIPCOT IT Park, Navallur Post, Siruseri, Chennai - 603 103. Perks and Benefits- Salary is not a constraint for deserving and promising candidates with strong knowledge in the required skills or even interest and eager to learn them.","location":"Chennai","experience":"2 - 5 Years"},{"date":"20, 21, 22, 23, 24 - Aug - 2019","skills":"Technical Support, Web/ Email Process, Customer Service","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Sykes Enterprises Business Services Pvt. Limited, 6 floor, Raheja Mindspace, Building No. 12B, Hi-tech city, Hyderabad","phone":"9963249393","profile":"Technical Support (Email Process) @ SYKES Business Services Pvt. Limited","description":"1) Any Under Graduate & Graduate (Fresher & Experience) both can apply. 2) Excellent Written skills are mandatory. 3) Good communication skills. 4) Should be able to handle customer query through emails. 5) Should have a positive attitude and ability to work in collaborative and changing environment. 6) Should be flexible to travel by self to office. 7) Complete day shift process. Walk-in Date: 20th - 24th August 2019 Timings: 12 PM to 5 PM Interview Venue : Sykes Enterprises Business Services Pvt. Limited 6 floor, Raheja Mindspace, Building No. 12B, Hi-tech city, Hyderabad Mention HR Priya on your resume for reference","location":"Hyderabad","experience":"0 - 3 Years"},{"date":"20, 21, 22, 23, 24 - Aug - 2019","skills":"Technical Support, Desktop Support, IT Service desk","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"HCL Technologies Limited, Surya Sapphire, Plot No. 3 1st Phase Electronic City Hosur Road, Bengaluru, Karnataka - 560 100","phone":"Not Provided","profile":"L1 Technical Support (Voice Process) @ HCL Technologies Limited","description":"Candidate should have 6 months - 3 years of Service desk, voice customer service, and support experience with problem solving involving hardware, involving hardware, software, and networks. Technical Requirements Phone support experience necessary. Technical Service desk or technical call center experience is necessary. Disciplined, systematic problem solving skills required. Hands-on work experience with the following: Windows Operating systems Clients: Windows 7, Windows Vista, Windows XP, Windows 2000 Servers: Windows 2000, Windows 2003, Windows 2008, Knowledge of Active Directory, Exchange 2003/ 2007 Soft Skills Excellent communication and conversation skills (Verbal and Written) Good documentation skills Good working knowledge of MS OFFICE (Including MS Project and Visio) Should have a great customer handling skills Able to handle unforeseen situations High level of acceptance Can drive HCLs value and its methodology Walk-in Interview Date: 20th to 24th August 2019 Time: 10:00 AM to 2:00 PM Interview Venue: HCL Technologies Limited Surya Sapphire, Plot No.3 1st Phase Electronic City Hosur Road, Bengaluru, Karnataka - 560 100 Spoc: Shobana Documents to Carry(Mandatory)* Hard Copy of your updated Resume. Printout / Screenshot of this walkin post One Government ID proof Xerox copy (Preferable Passport ) One Passport size photograph.Record form and at the top of your resume.","location":"Bangalore","experience":"1 - 3 Years"},{"date":"20, 21, 22, 23 - Aug - 0","skills":"Quality Analysis, Software Testing, Mobile Testing","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Mobulous Technologies Private Limited, H-146/147, Ground Floor, Sector-63, Noida - 201 307","phone":"Not Provided","profile":"Quality Analyst/ Software Tester @ Mobulous Technologies Private Limited","description":"Candidate should have 1 to 2 years of experience as QA Engineer/ Software testing or quality assurance role in mobile and web. Have strong technical skills, both functional and non-functional, manual and ideally in a continuous delivery environment. Should have good exposure to Testing using tools Walk-in Date/ Time: 20th - 23rd August , 11 AM onwards Interview Venue: Mobulous Technologies Private Limited H-146/147, Ground Floor, Sector-63, Noida - 201 307","location":"Noida","experience":"1 - 2 Years"},{"date":"19, 20, 21, 22 - Aug - 2019","skills":"Java, Software Development Life Cycle (SDLC), JSP, HTML, CSS and JQuery","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Redington Gulf FZE - India Branch, 1st Floor, Block B-6, Gateway Office Park, No. 16, G.S.T Road, New Perungalathur, Chennai - 600 063","phone":"044 30604040","profile":"Java Developer - Freshers @ Redington Gulf FZE","description":"Freshers or Minimum 1 to 2 Years of Experience into Java Development Any Educational Background Must have good experience into analysis, design, development, research and implementation of Software Development Life Cycle (SDLC), object oriented software systems, development of Web based applications. Good experience in developing various applications using JAVA/J2EE technologies like Java, JDBC, Servlets, Jsps, Spring MVC, Hibernate. Experience with Software Development Processes &Models: Agile, Waterfall Models. Experience in developing front-end User Interfaces using JSP, HTML, CSS and JQuery. Experience in working with batches to perform business operations in bulk. Walk-in Date/ Time: 19th - 22nd August 2019, 11 AM onwards Interview Venue: Redington Gulf FZE - India Branch 1st Floor, Block B-6, Gateway Office Park, No. 16, G.S.T Road, New Perungalathur, Chennai - 600 063 (Shriram Properties and Infrastructure Pvt. Ltd. SEZ) Raj (HR) - 7200237981/ 044 30604040 Must Carry: * Updated resume (2 copies of your updated resume) * Printout of this Call Letter - (Mandatory) * 1 original ID proof (PAN card, Voter ID card etc.) & Original Marksheets * Please bring pen & pencil with you; however use of calculator is prohibited. * Please do not hesitate to contact undersigned if you have any queries. Note: Age not more than 35 Years, Those who attended already are not eligible to Reattend the interview next 3 months from the date of an interview. Preferably from Any Educational Background Looking for Immediate Joinee or 30 days Notice Period","location":"Chennai","experience":"0 - 1 Years"},{"date":"19, 20, 21, 22, 23 - Aug - 2019","skills":"HR, Recruitment, General Administration, IR","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"IRIS KPO Resourcing (India) Private Limited, 77, Potti Pati Plaza, 5th Floor, Nungambakkam High Road, Nungambakkam, Chennai - 600 034.","phone":"95566133433","profile":"HR Executive - Trainee @ IRIS KPO Resourcing (India) Pvt. Limited","description":"2019 MBA / MSW Passout only with a high level of confidentiality Must have excellent communication skills (written and verbal) The ability to work accurately, with attention to detail Team player and enjoys working within a team environment Willingness to work in UK Shift. Job Responsibilities- To deliver an effective and professional HR administration service to the wider HR team. The role will include working to strict deadlines and communicating regularly with the HR Team. Administer HR related documentation relating to the employee life cycle such as Offer generation Contract generation Change letters Resignation Processing Probation Pass Processing Carry out all pre-employment checks (References and Experian) Process all UK reference requests (Date confirmation and Mortgage/ Rental References) Support in the management of the shared inbox as needed Adhoc project work as requested General administration, such as filing, photocopying and scanning Walk-in Date/ Time: 19th - 23rd August 2019, 11 AM onwards Interview Venue: IRIS KPO Resourcing (India) Private Limited 77, Potti Pati Plaza, 5th Floor, Nungambakkam High Road, Nungambakkam, Chennai - 600 034. Landmark: Opposite to ICICI Bank","location":"Chennai","experience":"1 - 6 Years"},{"date":"19 - Aug - 2019","skills":"HR/ Recruitment, General Administration, Employee Welfare, Induction","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Hexaware BPS, Building No. 3, Sector 2 MBP, Mahape, Near Ghansoli Station","phone":"Not Provided","profile":"Senior Executive/ HR Officer (Male) @ Hexaware Technologies Limited","description":"The candidate should have had at least 2-3 years of work experience as HR generalist preferably in a BPM environment Soft Skills: (Job related) 1. Excellent communication & presentation skills 2. Logical reasoning & analytical skills 3. Mature enough to take decisions independently 4. Understands IT/ITES culture 5. Integrated knowledge and understanding of human resources concepts, practices, systems, and procedures. 6. Ability to make administrative/procedural decisions and judgments. 7. Flexible to work in shifts. Summary/ Objective: The position encompasses the role of an ELCM-HR focusing on all activities related to HRMIS in the life cycle of the employee role. The potential recruit is expected to have a solid experience in HR practices, statutory compliance and a sound knowledge in employee life cycle. Walk in interested walk for the interview as below mentioned address: Walk-in Date: 19th August 2019 Time: 12 pm to 5 pm Address: Hexaware BPS Building No. 3, Sector 2 MBP, Mahape, Near Ghansoli Station Contact Person: Kavita Kulal","location":"Mumbai","experience":"2 - 7 Years"},{"date":"19 - Aug - 2019","skills":"Content Creation Social Media Selection Hiring Data Entry Recruitment Onboarding","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Deluxe Entertainment Services India Pvt. Limited, 4th floor, Smartworks, Tower C, Global Technology Park, B ellandur, Outer Ring Road, Bangalore - 560 103","phone":"Not Provided","profile":"HR Executive/ Recruiter @ Deluxe Entertainment Services India Pvt. Limited","description":"Source and select applicants for a variety of positions, both internal and external. Communicate with candidates, embodying the Deluxe core values in every conversation. List job ads on job boards, social media, and other possible channels. Troubleshoot and provide a solution to various queries freelancers might have during their application/ recruitment/ onboarding process. Strategize and implement creative recruitment and selection processes on a case-by-case basis. Assist in other administrative and data entry duties as assigned. If interested Please come down for interview on 19th August 2019 from 11 am to 4 pm. Deluxe Entertainment Services India Pvt. Limited, 4th floor, Smartworks, Tower C, Global Technology Park, B ellandur, Outer Ring Road, Bangalore - 560 103 Contact Person: Rasna Nair","location":"Bangalore","experience":"1 - 4 Years"},{"date":"19, 20 - Aug - 2019","skills":"Leadership, Training Needs, Team Building, Back Office, Team Motivation","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"3i Infotech Limited, Akruti Trade Centre, 3rd Floor, Plot .10, Road No. 7, MIDC Marol, Bhim Nagar, Andheri (East ), Mumbai - 400 093","phone":"Not Specified","profile":"Team Leader - Back Office @ 3i Infotech Limited","description":"Create an inspiring team environment with an open communication culture Set clear team goals Delegate tasks and set deadlines Oversee day-to-day operation Monitor team performance and report on metrics Motivate team members Discover training needs and provide coaching Listen to team members feedback and resolve any issues or conflicts Recognize high performance and reward accomplishments Encourage creativity and risk-taking Suggest and organize team building activities Walk-in Date: 19th - 20th August 2019 Interview Time 11 to 3 PM Interview Venue: 3i Infotech Limited Akruti Trade Centre, 3rd Floor, Plot .10, Road No. 7, MIDC Marol, Bhim Nagar, Andheri (East ), Mumbai - 400 093 Phone No: 022-7126 9000","location":"Mumbai","experience":"3 - 7 Years"},{"date":"19 - Aug - 2019","skills":"Data Entry Operations, Back Office Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Nucsoft Limited, Sagar Tech Plaza 3rd Floor, 301/302, Near Sakinaka Metro Station Near Safed Pool.","phone":"9004479658","profile":"Back Office Executive @ Nucsoft Limited","description":"Nucsoft Limited, is looking for fresher candidate for Back Office Executive Male candidates are preferred B.Com and BA candidates preferred Should be able to work in Roational Shift Non Technical Work. Walk-in Date/ Time: 19th August , 10 AM onwards Interview Venue: Nucsoft Limited, Sagar Tech Plaza 3rd Floor, 301/302, Near Sakinaka Metro Station Near Safed Pool. Contact Person : Namrata Birare Tel: 9004479658","location":"Mumbai","experience":"0 - 1 Years"},{"date":"19, 20, 21 - Aug - 2019","skills":"Back Office Assistance, Data Entry, Customer Support","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"EXL Services.com ( I ) Pvt. Limited, A-18, Sector 59, Noida - 201 301","phone":"9555892610","profile":"Back Office Associate @ EXL Services.com (India) Pvt. Limited","description":"Candidates should at least be a Graduate with good communication skills Should be good in communication skills Must be Ok with night shifts Walk-in Date: 19th - 21st August 2019 Timings:11 am-3 pm Interview Venue: EXL Services.com ( I ) Pvt. Limited, A-18, Sector 59, Noida - 201 301 Interested candidates can walk in at the above mentioned address along with the updated resume,3 passport size photographs and original Aadhar card proof in which Date of Birth is correctly mentioned.In case ful Date of Birth is not mentioned on Adhar Card then carry any other id proof alongwith Aadhar Card Contact Person-Neda Sarfaraz","location":"Noida","experience":"0 - 5 Years"},{"date":"19, 20, 21, 22, 23, 24 - Aug - 2019","skills":"HR Generalist Activities, Grievance Handling, Induction, Joining Formalities, Employee Engagement","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"KMI Business Technology Private Limited, 1008 Dalamala House, Nairman Point, Mumbai - 400 021","phone":"022-22023021","profile":"HR Generalist @ KMI Business Technologies Pvt. Limited","description":"Job Responsbility: Recruitment, Conduct telephonic and preliminary round of interviews. Scheduling interviews and follow up with candidates Planning & Execution for recruitment activities Joining Formalities and Induction. Maintaining database / personal files of employees Creating Employee Master in company software Attendance and Leave Management Exit Formalities Employee Engagement Activities Performance Appraisal Management Statutory Compliance Employee grievances handling Preparing MIS Reports Walk-in Date/ Time: 19th - 24th August , 9 AM onwards Interview Venue: KMI Business Technology Private Limited, 1008 Dalamala House, Nairman Point, Mumbai - 400 021","location":"Mumbai","experience":"3 - 4 Years"},{"date":"17, 19, 20, 21, 22, 23, 24 - Aug - 2019","skills":"Back Office, Data Entry, Back Office Processing, Customer Service","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Info-X Software Technology Private Limited, 335 Udyog Vihar Phase 2, Gurugram - 122 016","phone":"9910768257","profile":"Back Office Executive @ Info-X Software Technology Pvt. Limited","description":"Candidate should be Graduate (BA, B Com, BSc, etc) with minimum 1 to 6 years of experience. Should be good at Typing speed with Good Accuracy (Typing speed of less than 20 wpm is not eligible). Candidates with experience is Voice Campaigns/ Blended Process can also apply. Job Responsbility- US based Back Office process (Business to Business Campaign) Processing of Documents for US based clients. Free Meal Kindly Walk-in for Interview from 16th August 2019 till 6th September 2019 Timings 4:00 PM to 6:00 PM at below mention address. (No Interviews on Saturday and Sunday) Info-X Software Technology Private Limited 335 Udyog Vihar Phase 2, Gurugram - 122 016 Contact Person: Sanjay (9910768257) Email: pramod@infoxwebware.net","location":"Delhi","experience":"1 - 6 Years"},{"date":"19, 20, 21, 22, 23 - Aug - 2019","skills":"Core Java/ J2EE, JSP, JSF, Servlets, JDBC, Struts 2.0, GIT, MySQL","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Evelyn learning Systems Pvt. Limited, Building No. 382, Ghitorni, 2nd Floor, New Delhi","phone":"9873814760","profile":"Java Developer @ Evelyn learning Systems Pvt. Limited","description":"Candidate should have 2 to 5 years of experience in Core Java/ J2EE, JSP, JSF, Servlets, JDBC, Struts 2.0, GIT. Experience in developing Java applications for MS-Word and MS-Excel using Apache POI would be a bonus. Must be proficient in working on either Linux or Windows Environment Knowledge of working with at least one database: Oracle or MySql or MongoDB etc. Candidate should have good communication skills Walk-in Date/ Time: 19th - 23rd August, 10 AM onwards Interview Venue: Evelyn learning Systems Pvt. Limited Building No. 382, Ghitorni, 2nd Floor, New Delhi","location":"Delhi","experience":"2 - 5 Years"},{"date":"19, 20, 21, 22, 23 - Aug - 2019","skills":"Core Java, J2EE, JSP, JSTL, JDBC, Struts, Spring MVC, Hibernate","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"VSH Solutions Private Limited, 1087, First Floor, Nrusinha Sadan Apartments, Thorle Bajirav Peshwe Road, Near Shanipar Temple, Sadashiv Peth, Pune, Maharashtra - 411 030.","phone":"Not Provided","profile":"Java Developer @ VSH Solutions Private Limited","description":"Candidate should have a Bachelors degree in Computer Science (CS), Software Engineering (SE) or related technical field with minimum of 2+ years of Java development experience. A strong understanding of object-oriented design and programming. Demonstrated experience and knowledge of core Java and J2EE including Thymeleaf, JSP, JSTL, JDBC, Struts, Spring MVC, Hibernate, Web Services. Experience with Apache, Tomcat, and SQL (preferably MySQL) including complex SQL queries. Solid understanding of web services and web development technologies. Some experience in front-end technologies such as HTML, CSS, JavaScript, jQuery, and Bootstrap. Working experience in Eclipse IDE in Windows environment. Experience with JSON, REST and SOAP is mandatory. Familiar with Junit for automated test, Ant for the structured build. Work in the Agile and Dynamic environment. IMMEDIATE JOINER PREFERRED. Walk-in Date/ Time: 19th - 23rd August , 11 AM onwards Interview Venue: VSH Solutions Private Limited 1087, First Floor, Nrusinha Sadan Apartments, Thorle Bajirav Peshwe Road, Near Shanipar Temple, Sadashiv Peth, Pune, Maharashtra - 411 030.","location":"Pune","experience":"2 - 4 Years"},{"date":"24 - Aug - 2019","skills":"Java/ J2ee, Spring, Hibernate/ JPA, AOP, JSP, Servlet, JQuery, JavaScript, SQL Server","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"SHL (India) Private Limited, 9th Floor, Building No. 10B, DLF Cyber City, Gurgaon -122 002","phone":"Not Provided","profile":"Java Developer @ SHL (India) Private Limited","description":"Candidate should have 6 to 8 years of experience and Thorough understanding of OO concepts & its application in development. Must have previously worked in the position as a Java/ Web Developer developing web site/applications Hands-on with Spring 3.0 +, Hibernate / JPA, AOP Hands-on with JSP, Servlet, JQuery, JavaScript, JSON Hands-on with SQL Server & REST Services Must have worked on one application or Web server like Glassfish, Tomcat Experience with RDBMS database SQL Server 2012 or later, Knowledge of Oracle/My SQL will be add-ons. Strong understanding and practical knowledge of distributed version control systems like Git. Strong knowledge of DevOps technologies and processes related to cloud solutions. Good hands on experience in using cloud based development platforms such as AWS or Azure. Day & Date: Saturday August 24th, 2019 Interview Venue: SHL (India) Private Limited 9th Floor, Building No. 10B, DLF Cyber City, Gurgaon -122002","location":"Gurgaon","experience":"6 - 8 Years"},{"date":"31 - Aug - 2019","skills":"Java/ J2EE, JSP, AJAX using Spring MVC, JSON, JQuery","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"VirStra-i Technology Services Limited, Marisoft-I (Business Unit of Nucleus Software) 6th Floor, Marigold Premises, Kalyani Nagar, Vadgaon Sheri, Pune- 411 014","phone":"Not Provided","profile":"Java Professionals @ Nucleus Software Exports Limited","description":"Pure Hands-on technology and development professional. Primarily Java, J2EE, Spring, Hibernate and tools including open source tools and platforms, web services and open interfaces to build software that is state-of-the-art. Experience with SOA concepts and Integrations (EAI/ Hub-Spoke). Should have thorough experience in integration with middleware like ESB; Good knowledge of Web Services and related frameworks in Java like JAX-WS; Extensive experience of the object-oriented analysis and design patterns/ techniques with emphasis on Java/ J2EE technology; Good Experience in JSP, AJAX using Spring MVC, JSON, JQuery. Should be aware of Spring MVC, controllers, interceptors, filters and other framework features Experience Range: 2 to 10 years Work Location: Noida, Sector-62 Interview Venue: Pune Walk-in Date: 31st August 2019 (Saturday) Timings: 9 am to 1 pm Interview Venue: VirStra-i Technology Services Limited, Marisoft-I (Business Unit of Nucleus Software) 6th Floor, Marigold Premises, Kalyani Nagar, Vadgaon Sheri, Pune- 411 014 Interested candidates may send their profiles along with their confirmation to sachin.sharma@nucleussoftware.com","location":"Pune","experience":"2 - 10 Years"},{"date":"16, 17 - Aug - 2019","skills":"Java, J2EE, HTML, CSS, JavaScript and AngularJS, SQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"ACT (Atria Convergence Technologies Limited), ACT Golden Heights, 1st Floor, 59th C Cross, 4th M Block, Near Sujatha, Rajaji Nagar, Bengaluru - 560 010","phone":"Not Provided","profile":"Java Developer @ ACT (Atria Convergence Technologies Limited)","description":"We are looking for an Server Side Java Developer responsible for the development and maintenance of applications. Your primary focus will be development of applications and their integration with other services along with constant eye of improvements through customer/ user feedback. Person must have 1+ years of development experience Proficient with Linux, Java, J2EE, SQL Familiarity with HTML, CSS, JavaScript and AngularJS Experience with frameworks such as spring, SpringBoot and Hibernate Experience with Eclipse IDE Familiarity with RESTful and SOAP APIs Knowledge of other web technologies and UI/ UX standards Knack for benchmarking and optimization Proficient understanding of code versioning tools {such as Git, Mercurial or SVN} Experience with Agile and Waterfall SDLC models Walk-in Date/ Time: 16th - 17th August , 10 AM onwards Interview Venue: ACT (Atria Convergence Technologies Limited) ACT Golden Heights, 1st Floor, 59th C Cross, 4th M Block, Near Sujatha, Rajaji Nagar, Bengaluru - 560 010","location":"Bangalore","experience":"1 - 3 Years"},{"date":"19, 20, 21, 22, 23 - Aug - 2019","skills":"Java, JSP, SQL, Monitoring of Logs, Technical Support","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Evelyn Learning Systems Pvt. Limited, A/23, 1st Floor, Tower 23, Sector 9, Noida - 201 301","phone":"9873814760","profile":"Java Programmer @ Evelyn Learning Systems Pvt. Limited","description":"Required Skills: 1. Data Structure (Array, List, Linked List, Stack, Queue, Graph, Tree) 2. Any Programming language (Java/ C/ C++/ Python) 3. Sorting techniques 4. Basic knowledge of database Should have good communication & writing skills Knowledge of Computer is mandatory. Attractive incentives Job Responsbility- Creating, reviewing, and fixing content for American textbooks Offering 24/7 online assistance with questions posted by high school and college students Thinking out of the box to create innovative ways of imparting education and assessing the understanding and learning of students Work on cutting-edge projects and learning to work with new software through KT sessions Adapting to new teaching methodologies and preparing learning objectives for any course. Walk-in Date/ Time: 19th - 23rd August , 10 AM onwards Interview Venue: Evelyn Learning Systems Pvt. Limited A/23, 1st Floor, Tower 23, Sector 9, Noida - 201 301","location":"Noida","experience":"0 - 2 Years"},{"date":"17 - Aug - 2019","skills":"Core Java, C++/ C, Javascript","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Iopex Technologies, 6th Floor, Umiya Business Bay-1, CESSNA Business Park, Near New Horizon College, Bangalore - 560 103","phone":"Not Provided","profile":"JAVA Developer/ Fresher @ MTAP Technologies Private Limited","description":"We have an immediate job opportunity for 'JAVA Developer/ Fresher' to work with Product based company MTAP Technologies. Experience : Fresher/ 1+ Years of Experience Job Location: Bangalore Salary - Upto 4 L Shift - General Shift Required Skills- Must be having knowledge in Java and Javascript JAVA Certificated will be an added advantage Should have good problem-solving skills Good analytical skills, Quick learner Individual contributor Perks and Benefits- Attractive Salary, Awesome Culture, Other reimbursement If you are interested , Please walk in to office for face to face interview at below mentioned venue. Walk-in Date: 17th August 2019 Time : 10 am to 3:00 pm Venue Details- Iopex Technologies 6th Floor, Umiya Business Bay-1, CESSNA Business Park, Near New Horizon College, Bangalore - 560 103","location":"Bangalore","experience":"0 - 1 Years"},{"date":"17 - Aug - 2019","skills":"ASP .NET, C#, SQL, MVC, AJAX, JQuery, HTML/CSS, Angular, Web.API","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Hetero Learning Center-1, 1st Floor, Above Honda Showroom, Beside Gokul Theatre. Erragada, Hyderabad","phone":"9515128773","profile":".Net Developer @ Hetero Drugs Limited","description":"Qualification: B.Tech/ M.Tech/ MCA/ BSC Work Experience: 1 to 5 Years Key Skills: ASP .NET, C#, SQL, MVC, AJAX, JQuery, HTML/CSS, Angular, Web.API Interested candidates can walk-in on 17th August 2019 (Saturday) @ 9.30AM Interview Venue: Hetero Learning Center-1, 1st Floor, Above Honda Showroom, Beside Gokul Theatre. Erragada, Hyderabad Please carry an updated Resume along with your Photograph.","location":"Hyderabad","experience":"1 - 5 Years"},{"date":"17, 18, 19, 20, 21, 22, 23, 24 - Aug - 2019","skills":"C#, ASP.NET, MVC ,WCF, JQuery, MS - SQL Server, JavaScript","qualification":"B.E./B.Tech, MCA/PGDCA","address":"MPS Limited, 4th Floor, RR Tower-4, Guindy Industrial Area, SIDCO Industrial Estate, Chennai - 600 032","phone":"044-49162244","profile":".Net Developers @ MPS Limited","description":"Experience in Entity Framework C#, ASP .NET, MVC ,WCF, JQuery, MS - SQL Server, JavaScript. Solid knowledge of user interface design, usability methodology, information architecture, industry standards and trends, platform and browser capabilities. Analyzing and gathering requirements for the framework and creating a design for the final software output. Walk-in Date/ Time: 17th - 24th August , 10 AM onwards Interview Venue: MPS Limited 4th Floor, RR Tower-4, Guindy Industrial Area, SIDCO Industrial Estate, Chennai - 600 032","location":"Chennai","experience":"1 - 4 Years"},{"date":"21 - Aug - 2019","skills":"OOPS Concepts, MVC, Web API, C#, Entity Framework, Ado.Net","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Agile Cockpit Software Private Limited, 15th Floor Ocus Quantum, Sector 51 Gurgaon, Haryana - 122 003","phone":"Not Provided","profile":".Net Developers @ Agile Cockpit Software Private Limited","description":"Person must have very strong in OOPS Concepts, Web applications (MVC, Web API, C#, Entity Framework, Ado .Net) Should have good hands on experience on Design Patterns Should have hands on experience on SOLID Principles Should be able to understand and develop Web Architecture Experience: 2 to 6 Years Walk-in Date/ Time: 21st August 2019, 9 AM onwards Interview Venue: Agile Cockpit Software Private Limited 15th Floor Ocus Quantum, Sector 51 Gurgaon, Haryana - 122 003","location":"Gurgaon","experience":"2 - 6 Years"},{"date":"17 - Aug - 2019","skills":"ui path","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Elcot Sez No. 138, Old Mahabalipuram Road, Sholinganallur, Chennai - 600 119","phone":"9940436388","profile":"RPA Developer - ui Path with .Net @ Tech Mahindra Limited","description":"We have an Urgent Opening for RPA Developer (UiPath) in Chennai( Only Immediate Joiners or less than 15 days) Required Skills- Strong experience in RPA Development (UiPath) Experience:- 3 years (Minimum 2 years in RPA Uipath) UiPath & .Net+ any Programming Language Experience in Customer handling in day to day basis. Strong Development Knowledge on RPA UiPath. Prior experience as a core dot net developer. Need to be comfortable for shift Looking only for immediate joiner or 30days -negoiable candidate is recommended Walk-in Date/ Time: 17th August , 10 AM onwards Interview Venue: Elcot Sez No. 138, Old Mahabalipuram Road, Sholinganallur, Chennai - 600 119 For Further Process, Priyanka -HR Recruiter Call me : 9940436388 OR Text me with your NAME, Experience, CTC , ECTC and Notice period Mention my name on Top of resume NOTE : 1. Two copies of Resumes 2. Original government ID Proof","location":"Chennai","experience":"3 - 8 Years"},{"date":"17 - Aug - 2019","skills":".NET 3.5/4.5, AJAX, Java Script, jQuery, Bootsrap, XML, MS-SQL, SSRS, Crystal Reports","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"ITWare India Private Limited, 8-2-618/2/ DC/ B202, Delta Seacon Road No 11, Banjara Hills, Hyderabad \u0096 34","phone":"044-40425812","profile":".Net Developer @ Net Access India Limited","description":"Primary Skills: - DOT NET 3.5/4.5-Sound Knowledge - AJAX, Java Script, jQuery, Bootsrap, XML Secondary Skills: - MS-SQL, SSRS, Crystal Reports - Good written and verbal communication - Flexible, team player, get-it-done personality - Ability to organize and plan work independently - Ability to work in a rapidly changing environment - Ability to multi-task and context-switch effectively between different activities and teams - 3-8 years of relevant experience in Dot Net - Educational Qualification: BE/B.Tech/MCA/M.Sc(CS) - Location: Chennai(Taramani) Walkin Details: Date: 16-Aug & 17-Aug-2019 Time: 10AM - 5PM Venue: Net Access India Limited, IITM Research Park, 8th Floor, Kanagam Road, Taramani, Chennai 600113 Landmark: Near Ramanujam IT Park","location":"Chennai","experience":"3 - 8 Years"},{"date":"17 - Aug - 2019","skills":"Asp .Net, C#, Jquery, WCF, Webservices/ Web Api & SQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Karvy Selenium, Tower- B, Plot No 31 & 32, Financial district, Nanakramguda, Serilingampally Mandal, Hyderabad - 500 032","phone":"Not Provided","profile":".Net Developers @ Karvy Fintech Private Limited","description":"Minimum 3 to 5 years of hands-on development experience with the following technologies: ASP.NET/VB.NET projects, Web services and SQL server. Hands on experience in design using object oriented programming principles. Extensive experience in developing N-tier applications. Good experience with reporting tools. Mandatory Skills required for a different positions- 1. Asp .Net, C#, Jquery, WCF, Webservices/ Web Api & SQL. 2. Asp & C#. 3. MVC, WebServices & Jquery, Walk-in Date: 17th August 2019 Mode of Interview : Face to Face Discussion Time Slot Between: 10:00 am -3:00 pm Venue: Karvy Fintech Private Limited Karvy Selenium, Tower- B, Plot No 31 & 32, Financial district, Nanakramguda, Serilingampally Mandal, Hyderabad - 500 032 Contact Person : Sushma (HR Team)","location":"Hyderabad","experience":"3 - 7 Years"},{"date":"14, 15, 16, 17 - Aug - 2019","skills":"Java, Angular JS, Design Pattern, OOPS, Javascript","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Elico Healthcare Services Limited, B-90, C-56, A.P.I.E, Gate No. 6, Sanathnagar, Hyderabad - 18","phone":"040-44451244","profile":"Java UI Developer @ Elico Healthcare Services Limited","description":"Qualification: B.Tech/ MCA or Equivalent Work Experience: 3+ Years Job Location: Hyderabad Required Skills: Good knowledge in OOPS and Design Patterns Programming Languages: Java, Java Script , Angular JS Should have knowledge MongoDB,nodeJS. Should have good communication skills. Roles & Responsibilities: Contribute in all phases of the development lifecycle. Write well designed, testable, efficient code. Prepare and produce releases of software components. Interested candidates, Please walk-in directly with your resume at below mentioned address (Excluding Sunday) or send your updated resume to prasannam@elicohcs.com Elico Healthcare Services Limited B-90, C-56, A.P.I.E, Gate No. 6, Sanathnagar, Hyderabad - 18 Land Mark: Near Bharathanagar MMTS & Metro Rlwy Stations Contact Person: Prasanna Contact No: 8008804661","location":"Hyderabad","experience":"3 - 4 Years"},{"date":"19, 20, 21, 22, 23, 24, 26, 27, 28, 29, 30, 31 - Aug - 2019","skills":"Java, J2EE, EJB, JSP, Servlets, JMS, JMX, JDBC, XML, Struts, Hibernate, Spring","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Manuh Solutions India Private Limited, No. 58, Arihant Chambers, Seshadripuram Main Road, 1st R Block, Guttahalli, Bengaluru - 560 020","phone":"Not Provided","profile":"Java Developer @ Manuh Solutions India Pvt. Limited","description":"At least 3 years of experience in application development (Java Web/ Enterprise) Must have good understanding of OO techniques Primary Skills: Java, J2EE, EJB, JSP, Servlets, JMS, JMX, JDBC, XML, Struts, Hibernate, Spring and Hybris [5.2.0.4], Groovy, Grails, Bootstrap, jQuery, Spring Boot, Webservices [SOAP/ REST], Microservices Operating Systems: Windows 9X/ 2000/ XP, UNIX and DOS. Languages: C, C++, J2SE, J2EE, SQL, PL/SQL Development Tools: Eclipse, TOAD, Intellij Scripts: Angular JS, JavaScript , HTML and UNIX Database Connectivity: JDBC, Hibernate Walk-in Date/ Time: 19th - 31st August , 10 AM onwards Interview Venue: Manuh Solutions India Private Limited No. 58, Arihant Chambers, Seshadripuram Main Road, 1st R Block, Guttahalli, Bengaluru - 560 020","location":"Bangalore","experience":"3 - 6 Years"},{"date":"15, 16 - Aug - 2019","skills":"TestNG Framework. Application Development, Framework, Core Java","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Cenduit (India) Services Pvt. Limited, 33, 5th Floor, Ness Towers, 17th H Main Road, 6th Block, Koramangala, Bengaluru - 560 095","phone":"7982915549","profile":"Java Developers @ Cenduit (India) Services Pvt. Limited","description":"Candidate with rich experience in Core Java, coding, selenium can only attend the walk-in. Good Communication skills is required for the role. We are looking for an individual contributor so confident, energetic and one who can articulate well, these skills are preferred. 1 + Years of experience required Experience with OOPs Concepts. Experience with concepts likes collections, Strings, Exceptions, Java Streams, Property files and JDBC Connectivity. Experience with interacting/working with different APIs like Apache POI, Tom Cat Servers Experience with TestNG Framework Knowledge/experience on Maven, Jenkins or Cucumber will be an added advantage. Ability to Develop ,Implement ,Test ,Debug and maintain the scripts. Walk-in Date/ Time: 15th - 16th August from 11 AM onwards Interview Venue: Cenduit (India) Services Pvt. Limited 33, 5th Floor, Ness Towers, 17th H Main Road, 6th Block, Koramangala, Bengaluru - 560 095","location":"Bangalore","experience":"1 - 2 Years"},{"date":"16 - Aug - 2019","skills":"Software Testing, Automation Testing, Selenium Testing","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"In-Solutions Global Limited, 14-B, R Tech Park, Off. Western Express Highway, Goregaon East, Mumbai - 400 063","phone":"Not Provided","profile":"Automation Testing Engineer @ In Solutions Global Limited","description":"Educational Qualification: BE/ B.Tech/ BCA/ MCA Work Experience: 2 to 3 Years Job Location : Mumbai Creating and executing test cases, preparing automation script, defect logging and tracking. Preference will be given to card industry knowledge and Automation (Selenium & Load testing) Should have excellent communication skills Immediate joiners would have added advantage. Walk-in Date/ Time: 16th August 2019, 11 AM onwards Interview Venue: In-Solutions Global Limited 14-B, R Tech Park, Off. Western Express Highway, Goregaon East, Mumbai - 400 063","location":"Mumbai","experience":"2 - 3 Years"},{"date":"14, 16, 17, 18, 19, 20 - Aug - 2019","skills":"Customer Service, Customer Support, Technical Support, Voice Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Tech Mahindra Limited, 7th Floor, A-8, Knowledge Boulevard, Sector - 62, Noida","phone":"Not Provided","profile":"Customer Support Associate @ Tech Mahindra Limited","description":"Tech Mahindra Limited is Hiring for Voice Process for one of its premium E-Commerce Process Eligibility Criteria:- Excellent English Communication skills. Only Experience with international/ Premium domestic BPO can apply Only Graduate/ PG can apply. Shift Timing:- Rotational Shift (One sided cab provided by the company within the odd hours) Job Responsbility:- Voice Inbound Process. Have to handle customer's queries and help them with the right feedback. 5 days working Rotational day shifts Rotational off Salary: Upto 3.80 LPA Interview Date: 14th - 20th August (Weekdays) Timings: 9 am to 2 pm Interview Location :- Tech Mahindra Limited, 7th Floor, A-8, Knowledge Boulevard, Sector - 62, Noida Beside IMS College Nearest Metro Station - Noida Electronic City Mention 'Shipra' on top of your CV DONIT FORGET TO WRITE MY NAME (Shipra)ON THE TOP POF YOUR CV","location":"Mumbai","experience":"1 - 5 Years"},{"date":"16 - Aug - 2019","skills":"Technical Support, IT Helpdesk, Software Support, Troubleshooting","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"MicroWorld Software Services Pvt. Limited, (eScan) Lane Opposite Tunga Paradise and 1st Right, Plot No. 80. Road No. 15, MIDC, Marol, Andheri (East) Mumbai - 400 093.","phone":"022-67722996","profile":"Technical Support Engineer @ MicroWorld Software Services Pvt. Ltd","description":"Education: Any Graduate BA/ B.COM/ BSC/ BSC-IT/ BCA/ MCA Experience: 0-2 years work experience on Technical support Functional Area: 1) Proficient knowledge in Understanding of operating systems, Windows 2012/2008/2003/NT/XP configuration options and troubleshooting 2) Proficient knowledge in Connectivity troubleshooting, TCP/IP, Dial-up, Token Ring, Ethernet, LAN/ WAN. 3) Knowledge of Active Directory/ DNS/ DHCP. KEY Role/ Responsbility: Providing technical support to end-users via remote support or by visiting the client-end. Diagnose and resolve technical software issues. Troubleshoot and resolve client tech issues related to Product, Virus & Malware Intrusion Etc. Provide Online/Offline Technical Support to National/International Customers. Providing technical support and customer service for our clients. Providing Technical Support related to Product lines like Anti-virus. Manage support inquiries via e-mail and phone Good ability to work in a team environment with multiple team members Flexible to work in Night Shifts Walk-in Date: 16th August 2019 Interview Time: 11:30 am Interview Venue: MicroWorld Software Services Pvt. Limited (eScan) Lane Opposite Tunga Paradise and 1st Right, Plot No. 80. Road No. 15, MIDC, Marol, Andheri (East) Mumbai - 400 093. Contact Person: Rene Ferreira","location":"Mumbai","experience":"0 - 2 Years"},{"date":"14, 15, 16, 17 - Aug - 2019","skills":"Talent Acquisition, Resource Management Recruitment","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Liladhar Pasoo Forwarders Pvt. Limited, 57, Mulji House, 41-45, Devji Ratansey Marg, Dana Bunder, Masjid (East), Mumbai - 400 009","phone":"Not Provided","profile":"HR Executive @ Liladhar Pasoo Forwarders Pvt. Limited","description":"Liladhar Pasoo Forwarders Pvt. Limited, is looking for professional for the position of HR- Executive Job Responsibilities- Recruitment Utilizing various sourcing method like Web portals, Referring Internal Database, Employee referrals etc. Screening & short-listing candidates profile as per the requirements of clients. Preparing various letters like offer letter, appointment letter, confirmation letter, increment letter, transfer letter, Walk-in Date/ Time: 14th - 17th August 2019, 10 AM onwards Interview Venue: Liladhar Pasoo Forwarders Pvt. Limited 57, Mulji House, 41-45, Devji Ratansey Marg, Dana Bunder, Masjid (East), Mumbai - 400 009","location":"Mumbai","experience":"1 - 6 Years"},{"date":"12, 13, 14, 15, 16, 19, 20, 21, 22, 23 - Aug - 2019","skills":"Front Office Acvtivities, Facility Management, General Administration","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Adcanopus Digital Media Private Limited, #555 ,Axis Pedegal, 1st Floor, 9th Cross Road, 3rd Phase, Near Sony Center JP Nagar, Bengaluru - 560 036","phone":"7899770305","profile":"Front Office Executive @ Adcanopus Digital Media Pvt. Limited","description":"Any Garduate with basic knowledge of mail and excel Must be Smart with good communication skills Mandatory Language- Hindi , English & Kannada Age range -23-25 Years Handle all Reception / Front office job responsibility. Manage all the housekeeping and office process administration. Manage daily report for attendance and couriers. NORTH INDIAN Female Only Perks and Benefits As Per Company Standards Walk-in Date/ Time: 12th - 23rd August , 12 PM onwards Interview Venue: Adcanopus Digital Media Private Limited #555 ,Axis Pedegal, 1st Floor, 9th Cross Road, 3rd Phase, Near Sony Center JP Nagar, Bengaluru - 560 036 Contact No- 7899770305","location":"Bangalore","experience":"1 - 2 Years"},{"date":"12, 13, 14, 15, 16, 17 - Aug - 2019","skills":"Facility Management, General Administration, Vendor Management, Front Office","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Spectrum Offshore & Onshore Services Pvt. Limited, 712, Satara Plaza Sector 19 & 20 Sector 19 D Plam Beach Road, Vashi Navi Mumbai - 400 703","phone":"022-40736725","profile":"Admin Executive (Female) @ Spectrum Offshore & Onshore Services Pvt. Limited","description":"We are looking for a female Candidate who can Undertake the administrative within a mid size company. Candidate should have a fair knowledge of day to day office activities. Must be able to handle emails Good english for phone conversation and decent typing speed. Knowledge of basic excel sheet. Knowledge of short hand would be good. Take Dictation. Working time: 9.00 am To 6.30 pm Job Location - Navi Mumbai Working Days - 6 Days Walk-in Date/ Time: 12th August - 17th August , 9 AM onwards Interview Venue: Spectrum Offshore & Onshore Services Pvt. Limited 712, Satara Plaza Sector 19 & 20 Sector 19 D Plam Beach Road, Vashi Navi Mumbai - 400 703","location":"Mumbai","experience":"1 - 4 Years"},{"date":"10, 12, 13, 14, 15, 16, 17 - Aug - 2019","skills":".Net, ASP .NET, MVC, WCF, Web Services, SQL Server","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Spar Solutions India Private Limited, Pune IT Park, Bhau Patil Marg, 34 Aundh Road, Bopodi, Pune, Maharashtra - 411 020.","phone":"020-25810725","profile":".Net Developers @ SPAR Solutions India Private Limited","description":"Education: Graduate - B.Tech/ BE - Computers, Electronics/Telecommunication PG - M.Sc. Computers, M.Tech - Any Specialization, MCA - Computers Work Experience: 3 - 5 Years Job Location: Pune 3 to 5 years of experience in .Net, to build software using languages and technologies of the .NET framework. The primary role of the developer will be to design, develop, and maintain the software. Ability to communicate well. Fluency in written and spoken English is ESSENTIAL. Result oriented team player mindset. Be able to share knowledge at all levels. Possess valid passport. Be willing to travel to client locations abroad at short notice. Be able to join immediately. Essential Skill Set: Hands-on in coding C# with strong knowledge of ASP .NET, MVC, WCF, Web Services Good understanding of SQL server and database programming (joins, queries, procedures etc.). Knowledge of HTML, CSS, JavaScript, JQuery, OOPS Concepts. Must have good verbal and written communication skills. Walk-in Date/ Time: 9th August - 6th September , 9 AM onwards Interview Venue: Spar Solutions India Private Limited Pune IT Park, Bhau Patil Marg, 34 Aundh Road, Bopodi, Pune, Maharashtra - 411 020.","location":"Pune","experience":"3 - 5 Years"},{"date":"16, 17, 18, 19, 20, 21 - Aug - 2019","skills":"Software Testing, Manual Testing, Quality Assurance","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"4th Quarter Technologies Pvt. Limited, B-614, iThum Tower, Plot No.-A-40, 6th Floor, Sector-62, Noida","phone":"9773980990","profile":"Manual Tester - Trainee @ 4th Quarter Technologies Pvt. Limited","description":"Candidate should be able to work independently on assigned projects and finish within the expected timeline. Proactive and timely communication with manager and tech leads. Prepare the required set of documentation. Effective follow up of all defects till closure. Responsible to help business to close UAT on time. Should have percentage 70 and above in 10th & 12th Class. Good verbal and written communication skills. Should have excellent analytical skills. Ability to document the test results and log issues in the issue tracker. Ability to interface with Client, development team and get the issues to resolve. Candidate should be creative, self-motivated problem solver with the ability to analyze a broad range of technologies with good communication and writing skills, be able to effectively multi-task, and have a strong sense of project management skills. Strong knowledge of SDLC. Coordinate and participate in requirements review/story elaborations and testing activities to deliver high-quality products and incremental value with every iteration. Walk-in Date/ Time: 16th August - 30th September , 10 AM onwards Interview Venue: 4th Quarter Technologies Pvt. Limited B-614, iThum Tower, Plot No.-A-40, 6th Floor, Sector-62, Noida","location":"Noida","experience":"0 - 1 Years"},{"date":"12, 13, 14, 15, 16, 17 - Aug - 2019","skills":"Java, J2EE, EJB, JSP, Servlets, JMS, JMX, JDBC, XML, Struts, Hibernate","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Manuh Solutions India Private Limited, No. 58, Arihant Chambers, Seshadripuram Main Road, 1st R Block, Guttahalli, Bengaluru, Karnataka - 560 020","phone":"Not Provided","profile":"Java Developer @ Manuh Solutions India Pvt. Limited","description":"At least 2 years of experience in application development (Java Web/ Enterprise) Good understanding of OO techniques Experience with Architecture and design of complex industrial applications Fluent with J2EE technologies, frameworks like JSF, Richfaces, etc Expert in JavaScript, Jquery, Ajax, HTML-5. Strong DB and SQL knowledge. A strong desire to collaborate and work within a team. Ability to define requirements and work in a concept-to-design model TECHNICAL EXPERTISE: Elements Particulars Primary Skills: Java, J2EE, EJB, JSP, Servlets, JMS, JMX, JDBC, XML, Struts, Hibernate, Spring and Hybris [5.2.0.4], Groovy, Grails, Bootstrap, jQuery, Spring Boot, Webservices [SOAP/ REST] ,Microservices Operating Systems: Windows 9X/2000/XP, UNIX and DOS. Languages: C, C++, J2SE, J2EE, SQL, PL/SQL Development Tools: Eclipse, TOAD, intellij Scripts: Angular js, JavaScript , HTML and UNIX Walk-in Date/ Time: 10th - 24th August, 10 AM onwards Interview Venue: Manuh Solutions India Private Limited No. 58, Arihant Chambers, Seshadripuram Main Road, 1st R Block, Guttahalli, Bengaluru, Karnataka - 560 020","location":"Bangalore","experience":"2 - 6 Years"},{"date":"16, 17, 19, 20, 21, 22, 23, 24 - Aug - 2019","skills":"Core PHP, MySQL, Bootstrap using MVC Architecture.","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Digi Style, D-244,2nd Floor Sector 10 Noida-201301(Near Swani Furniture) Nearest Metro Station Sector 16","phone":"Not Provided","profile":"Core PHP Developer @ Digi Style","description":"Work Experience: 2 to 4 Years Strong understanding and hold on working with Core PHP. Excellent knowledge about Core PHP, MySQL, Bootstrap Excellent command on PHP and MySQL using MVC Architecture. Expertise on PHP based framework like: Codeigniter, Laravel, etc. Required Skills- Ability to adjust schedules to meet deadlines will be crucial. Must be self-motivated and take responsibilities for his/her own deliverables. Excellent written and verbal communication skills Ability to manage multiple projects & lead the development effort while meeting deadlines and maintaining high-quality results Good analytical, reasoning, logical and troubleshooting skills Walk-in Date/ Time: 16th - 31st August , 10 AM onwards Interview Venue: Digi Style D-244,2nd Floor Sector 10 Noida-201301(Near Swani Furniture) Nearest Metro Station Sector 16","location":"Noida","experience":"2 - 4 Years"},{"date":"16 - Aug - 2019","skills":"Php, MySQL, MVC, JavaScript, HTML5, and CSS3","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Infonix Weblab Private Limited, 104 - 105, Block A, Elegant Pinnacle 480 Nukkampalayam Link Road, Chennai - 600119","phone":"9025510493","profile":"Backend/ PHP Developer @ Infonix Weblab Private Limited","description":"We are looking for a PHP Developer responsible for managing back-end services and the interchange of data between the server and the users. Your primary focus will be the development of all server-side logic, definition and maintenance of the central database, and ensuring high performance and responsiveness to requests from the front-end. Required Skills- 1. Integration of user-facing elements developed by front-end developers 2. Build efficient, testable, and reusable PHP modules 3. Solve complex performance problems and architectural challenges 4. Integration of data storage solutions 5. Having a strong knowledge of PHP web frameworks 6. Understanding the fully synchronous behaviour of PHP 7. Understanding of MVC design patterns 8. Basic understanding of front-end technologies, such as JavaScript, HTML5, and CSS3 Walk-in Date/ Time: 16th August , 11 AM onwards Interview Venue: Infonix Weblab Private Limited 104 - 105, Block A, Elegant Pinnacle 480 Nukkampalayam Link Road, Chennai - 600119 Above Apollo Pharmacy/ ICICI Bank Semmancheri","location":"Chennai","experience":"1 - 3 Years"},{"date":"16, 17 - Aug - 2019","skills":"Core PHP, Wordpress / Cake PHP, HTML/ CSS/ Javascript./Jquery & MySQL","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Aavaz Contact Center (Division of Tekege Solutions), 128 B, Second Floor, Shahpur Jat, New Delhi - 110049 Landmark- Slice of Italy, Next to UCO Bank","phone":"8287854151","profile":"Core PHP Developer @ Aavaz Contact Center (Tekege Solutions)","description":"Candidate should have a good knowledge/ experience in Core PHP Excellent knowledge of HTML/ CSS/ Javascript/ Jquery & MySQL Knowledge of Wordpress / Cake PHP is an advantage. Preference will be given for command over Database skills. Experience in moodle & magento will be a plus. Walk-in Date/ Time: 16th - 17th August , 11 AM onwards Interview Venue: Aavaz Contact Center (Division of Tekege Solutions) 128 B, Second Floor, Shahpur Jat, New Delhi - 110049 Landmark- Slice of Italy, Next to UCO Bank Nearest Metro- Greenpark/ Hauzkhas/ Panchsheel Park","location":"Delhi","experience":"0 - 3 Years"},{"date":"16, 17 - Aug - 2019","skills":"Php/ MySQL, Drupal, Jhoomla & other Open Source technologies","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Netedge Computing Solutions Pvt. Limited, C-56/ 39 NetEdge Tower Sector-62, Noida - 201 301","phone":"70427-94831","profile":"PHP/ Open Source Developer @ Netedge Computing Solutions Pvt. Limited","description":"The person must have : Experience in Development using PHP based on Laravel Framework Experience in MySQL, Drupal, Jhoomla & other open source technologies. He/She must have orientation towards quality & customer satisfaction. The Person Will be Responsible for: Coding & development of programs / modules Timely delivery of programs & projects to customers Ability to work in a team environment Must meet tight deadlines & work on several projects simultaneously Walk-in Date/ Time: 16th - 17th August , 11 AM onwards Interview Venue: Netedge Computing Solutions Pvt. Limited C-56/ 39 NetEdge Tower Sector-62, Noida - 201 301","location":"Noida","experience":"2 - 3 Years"},{"date":"19 - Aug - 2019","skills":"PHP/ MySQL, Joomla, Durpal, CSS, Wordpress, PHP Design & Development","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Changepond Technologies Pvt. Limited, H 2, SIPCOT IT Park, OMR SIRUSERI, Chennai - 603 103","phone":"044-47480000","profile":"PHP Trainees - Freshers @ Changepond Technologies Pvt. Limited","description":"This is a full time position for working in exciting international projects. We are looking for candidates who have knowledge and interest to work in PHP Development Projects. Good to have knowledge in Joomla, Durpal, CSS, Wordpress, PHP Design & Development. Good communication skill and must have knowledge in interacting with clients. Must have an ability to learn new Technologies Self-Starter and motivated to excel Sound knowledge in PHP/ MySQL Eligibility Cretria: 2017 / 2018 & 2019 passed out students only. BE / B Tech and MCA with an Aggregate of minimum 60% in Class X, XII and in degree or equivalent is MANDATORY Good command over written and spoken English Certification / Course in PHP will be added advantage. Walk-in Date & Time: 19th August 2019 (Monday) from 9.30 AM to 12.30 PM Interview Venue: Changepond Technologies Pvt. Limited H 2, SIPCOT IT Park, OMR SIRUSERI, Chennai - 603 103 Contact Person: A G Rubas","location":"Chennai","experience":"0 - 2 Years"},{"date":"20 - Aug - 2019","skills":"Testing/ Manual/ Automation/ Selenium Trained or Certified Freshers","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Changepond Technologies Pvt. Limited, H-2, SIPCOT IT Park, Old Mahabalipuram Road, Siruseri, Chennai, Tamil Nadu - 603 103","phone":"044-47480037","profile":"Software Testing - Freshers @ Changepond Technologies Pvt. Limited","description":"Educational Qualification: BE/B. Tech/ MCA Year of Passing 2016, 2017, 2018 & 2019 Eligibility Criteria: Aggregate of 60% in 10th, 12th, UG & PG (if any) Should have completed a course in Testing from any training institute Good Communication Skills Required Skills: Testing/ Manual/ Automation/ Selenium Trained or Certified Freshers Male candidates preferred Walk-in Date: 20th August 2019 (Tuesday) Timings: 9:30 AM to 4:00 PM Interview Rounds: 1. Combined Apps (Testing & Logical reasoning), 2. Technical face to face 3. HR Interview. Walk-in Date/ Time: 20th August 2019, 9 AM onwards Interview Venue: Changepond Technologies Pvt. Limited H-2, SIPCOT IT Park, Old Mahabalipuram Road, Siruseri, Chennai, Tamil Nadu - 603 103 Contact Person: Kalaiselvan, Human Resources","location":"Chennai","experience":"0 - 1 Years"},{"date":"16 - Aug - 2019","skills":"MAGENTO 1. & 2., PHP, MYSQL, JQUERY, HTML, CSS, JAVASCRIPT","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Ace Turtle Services Pvt. Limited, #764, 3rd floor, 100 Ft Road, Indiranagar, Bangalore - 560 038. Landmark- Above Brooks brothers/ Steve Madden","phone":"Not Provided","profile":"Magento Developer - PHP @ August Purple Services Pvt. Limited","description":"Candidate should have B Tech/ BE/ M.Tech/ ME/ MCA or equivalent from a reputed college with 3 to 5 years of experience in developing e-commerce websites using Magento. Candidate should have good experience with and knowledge of AJAX, JavaScript, CSS, Html, JQuery, and other related web technologies. Familiarity with MySQL and one or more relational databases. Experience with version control software, such as GIT Full exposure to and understanding of all aspects of the software development lifecycle Excellent object-oriented design and programming skills, including strong working knowledge and experience in using design patterns If interested walk-in to Aceturtle office on Friday, 16th August 2019, between 12 PM- 3 PM Venue Details:- Ace Turtle Services Pvt. Limited #764, 3rd floor, 100 Ft Road, Indiranagar, Bangalore - 560 038 Landmark- Above Brooks brothers/ Steve Madden","location":"Bangalore","experience":"3 - 5 Years"},{"date":"16 - Aug - 2019","skills":"Php, MySQL, HTML, Javascript, Jquery, CSS, OOPS","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Novalnet e-Solutions Private Limited, 131 Erikarai Street, East Tambaram, Chennai - 600 059","phone":"7708222259","profile":"PHP Developer/ Trainee @ Novalnet e-Solutions Private Limited","description":"Candidate should have strong knowledge of Php, MySQL, HTML, Javascript, Jquery, CSS, OOPS. Job Responsbility- Creating & modifying the custom themes and plugin (payment plugin) for e-commerce shop system. Design, develop, maintain, analyse and troubleshoot the plugin & themes. A strong ability to understand the project requirements & Execute project plans. Walk-in Date/ Time: 16th August , 11 AM onwards Interview Venue: Novalnet e-Solutions Private Limited 131 Erikarai Street, East Tambaram, Chennai - 600 059","location":"Chennai","experience":"0 - 1 Years"},{"date":"16, 17, 19, 20, 21, 22, 23, 24 - Aug - 2019","skills":"CSS, jQuery, Html5, Wordpress, Javascript, Php, Bootstrap, Web development","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Mspire Business Solutions Pvt. Limited, No. 1564, Flat-1 1st Floor Purushothaman Towers, Hope College Bus Stop, Peelamedu, Coimbatore","phone":"0422-4370536","profile":"Web/ PHP Developer @ Mspire Business Solutions Pvt. Limited","description":"Candidate should be Any Technical Graduate with excellent knowledge of CSS, jQuery, Html5, Wordpress, Javascript, Php, Bootstrap, Web development, Web designing, Ajax, Database Administration and MySQL Walk-in Date/ Time; 16th August - 8th September , 12 AM onwards Interview Venue: Mspire Business Solutions Pvt. Limited No. 1564, Flat-1 1st Floor Purushothaman Towers, Hope College Bus Stop, Peelamedu, Coimbatore","location":"Coimbatore","experience":"0 - 5 Years"},{"date":"16, 17, 19, 20, 21, 22, 23, 24 - Aug - 2019","skills":"Android, Php, Laravel, Android Studio, Laravel","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Avaskm Technology, G-20, Sector-63, Noida","phone":"0120-4246608","profile":"Software Developer (PHP/ Android & iOS) @ Avaskm Technology","description":"MIN EXPERIENCE- 3 MONTHS TO 2 YEARS IN LARAVEL or SWIFT or ANDROID STUDIO Job Responsbility- 1. Develop App UI 2. Link JSON API 3. Complete Project Walk-in Date: 16th August - 16th September Time: 11 am - 6 pm (Monday to Saturday) Interview Venue: Avaskm Technology, G-20, Sector-63, Noida Call @ 0120-4246608 to schedule interview or direct walk-in","location":"Noida","experience":"0 - 2 Years"},{"date":"14 - Aug - 2019","skills":"HR Generalist Activities Attendance IR Issues Data Management Employee Relations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Flipkart Internet Private Limited, Tower B, Embassy technology Devarabisanahalli, Bangalore","phone":"Not Provided","profile":"Back Office Operations Executive @ Flipkart Internet Private Limited","description":"Educational Qualification: Any Degree (Mandatory) Experience: Fresher or experienced (0 to 1 year) Job Location: Devarabisanahalli, Bangalore Required Skills: v-lookup, H-look up, Basics of excel & Calculation, Sumif, Countif Route planning of grocery orders , preparing dashboards & reports. Shifts : Rotational (Day shift & night shift rotational) Salary: 20 to 22 net take home. Note: This position is on contractual role which will be extendable based on business requirement & performance Walk-in Date: 14th August 2019 Timings: 10 AM to 12 PM Interview location: Flipkart Internet Private Limited Tower B, Embassy technology Devarabisanahalli, Bangalore Meet: Jayanth/ Rekha/ Tejaswi","location":"Bangalore","experience":"0 - 2 Years"},{"date":"14 - Aug - 2019","skills":"Backend Operations, Claims processing, etc","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"AXA XL 14th Floor, World Tech Park, Block B2, (SEZ Unit-1) DLF IT/ ITES SEZ, Sector 30, Silokhera, Gurgaon","phone":"Not Provided","profile":"Back Office Executive/ Analyst @ XL India Business Services Pvt. Limited","description":"Graduate/ Post Graduate with 50% & above aggregate in highest qualification. 1-3 years of experience in Insurance domain is a mandate. For freshers education in Insurance domain is considered Experience in Claims is preferred. Strong communication & interpersonal skills. Walk-in Date/ Time: 14th August 2019 from 10 AM onwards Interview Venue: AXA XL 14th Floor, World Tech Park, Block B2, (SEZ Unit-1) DLF IT/ ITES SEZ, Sector 30, Silokhera, Gurgaon","location":"Gurgaon","experience":"1 - 3 Years"},{"date":"16, 17 - Aug - 2019","skills":"Technical Support, International Voice Process, Customer Service","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Tech Mahindra Limited, Takshasila , Ground Floor, Gate No - 1 Survey No. 62/1 A, Qutubullapur Mandal, Bahadurpally, Hyderabad - 500 043","phone":"7386174351","profile":"Technical Support Associate @ Tech Mahindra Limited","description":"Eligibility Criteria: Any Graduates, Freshers and Experienced Can Apply Should be Impeccable in Communication Skills Should be flexible to work with 24/7 shifts(Rotational shifts) Decent knowledge on customer service/ Trouble shooting of PCs and Laptops. Candidate should be aware of basic technical knowledge in LAN, WAN and handling basic Internet issues. Troubleshooting of technical related issues and ensure to resolve the issues or queries over the call. Research, diagnose, troubleshoot and identify solutions to resolve customer issues. Should be flexible to work in 24*7 environments (Rotational Shift), comfortable to work in night shifts. 5 days working. Transportation Facilities: Both way 2.5 LPA to 4.1 LPA (Basis Experience & Last CTC) Walk-in Date/ Time: 16th - 17th August , 12 PM onwards Interview Venue: Tech Mahindra Limited Takshasila , Ground Floor, Gate No - 1 Survey No. 62/1 A, Qutubullapur Mandal, Bahadurpally, Hyderabad - 500 043 Documents required for walk-in: - Copy of CV - Original ID proof (Aadhaar - Mandate) - Xerox of your ID proof - Print out of this mail. (Mandate) -Passport size photographs - All your educational certificates & Experience certificates Contact Person: M.Swathi Mail ID : MS00579820@Techmahindra.com","location":"Hyderabad","experience":"0 - 5 Years"},{"date":"14, 16, 17, 19, 20, 21, 22, 23, 24 - Aug - 2019","skills":"Enterprise Suuport, Technical Support, Customer Interaction","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Comodo Security Solutions Private Limited, 10th Floor, Prestige Centre Court, Vijaya Forum Mall, 183, NSK Salai Vadapalani, Chennai - 26","phone":"9600733833","profile":"Technical Support Engineer @ Comodo Security Solutions Pvt. Limited","description":"The ideal candidate must have excellent English skills (verbal and written). Should be proficient in the following: o Firewall and Anti-Virus programs (Usage, Installation, Configuration and Troubleshooting) o OSX and Linux o Networking o Enterprise software products (Usage, Installation, Configuration and Troubleshooting) o Ability to gather diagnostic information from customers o Enterprise SaaS products working experience (usage, installation, configuration and troubleshooting) o LAMP Stack (Apache, NGINX, other web services) o HTTP Headers, TCP/IP and BGP o MySQL, PostgreSQL, MongoDB and other databases o REST APIs o SaltStack, Puppet, Ansible and Chef, Configuration management systems in general o Python, PowerShell, VBS, Go, C, PHP and Bash Walk-in Date/ Time: 14th August - 30th August , 4 PM onwards Interview Venue: Comodo Security Solutions Private Limited, 10th Floor, Prestige Centre Court, Vijaya Forum Mall, 183, NSK Salai Vadapalani, Chennai - 26","location":"Chennai","experience":"2 - 7 Years"},{"date":"14, 18, 19, 20, 21, 22, 23 - Aug - 2019","skills":"Inbound Process, Conflict Resolution, Customer Service,Troubleshooting","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Accenture Services Private Limited, Level 6, Tower 1 & 2, Logitech Park, Andheri Kurla Rd, Sakinaka, Andheri (East), Mumbai - 400 072","phone":"9818176604","profile":"Technical Support Associate @ Amazon Development Centre (India) Pvt. Limited","description":"Eligibility Criteria: -Minimum qualification required 10+2 -Excellent written and Verbal communication, comprehension and problem solving skills. -Willing to work in a 24x7 environment. Compensation Range Digital Devices (International Voice): INR 2,82,516/- to INR 3,39,898/- LPA Additional Benefits: -Transport Allowance (Optional) INR 4000 i.e. 48,000/- PA -Zeta Meal Card INR 1100 Per month i.e. 13,200/- PA -Night Shift Allowance INR 115/shift -Overtime Allowance as per company policy -Five days working -Rotational Shifts -Each employee and their dependents (Spouse and 2 Children) are covered up to Rs.500,000 under the floater benefit scheme Interview Dates : 12th to 23rd August, 2019 Time : 10:00 AM to 2:00 PM Interview Venue : Amazon Development Centre (India) Pvt. Limited 6th Floor, Tower 1, Laxmi Infobahn Pvt. Ltd. SEZ, Survey No. 107 (p), Kokapet, Village, Gandipet Mandal, Ranga Reddy, District Hyderabad - 500 032 Contact Person: Vivin Davis Please mention 'HR Abhay' on the resume and other Registrations as your Source when you come for the interview. Documents Required -Updated Resume. -1 passport size Photograph. -Valid Government ID Proof (Aadhar Card and PAN Card) Please Note -Candidates who have applied in the last 3 months are not eligible. -Candidates currently pursuing any regular course of education will not be considered. For Job related queries, kindly contact, Abhay Saxena Contact No. : +91-9818176604 / +91-7011328383 Email : saxeabha@amazon.com","location":"Hyderabad","experience":"0 - 5 Years"},{"date":"14 - Aug - 2019","skills":"C# .Net, ASP .NET, ADO .NET, Linq, MVC, JQuery","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Sedin Technologies Private Limited, Regus Business Centre Level 2, Connaught Place Bund Garden Road, Pune - 411 001.","phone":"Not Provided","profile":"Java Developer @ Sedin Technologies Private Limited","description":"Candidate should have good hands on experience in server-side development technologies and concepts (Java/ J2EE, Angular JS, Spring Framework, Restful Web services etc.). Must have good experience with build systems like Maven & Gradle. Version control using Git Very strong programming skills Should be able to write optimized, modular code. Solid Agile Programming methodologies and general software development best practices. Experience in developing unit tests and expanding unit test coverage (TDD). Performance tuning, Groovy, Apache Thrift knowledge is a plus. Experience with any Javascript framework - preferably Angular 2+ or React or Vue and JQuery. Expert knowledge of web technologies, such as HTML5/ CSS3/ Javascript/ ES6 and possibly server-side language such as Python. Good knowledge of web frameworks such as Vue/ React, JQuery etc. Ability to work independently and proactive. Excellent problem-solving & communication skills Walk-in Date/ Time: 14th August , 9 AM onwards Interview Venue: Sedin Technologies Private Limited Regus Business Centre Level 2, Connaught Place Bund Garden Road, Pune - 411 001.","location":"Pune","experience":"1 - 2 Years"},{"date":"12, 13, 14, 15, 16 - Aug - 2019","skills":"Backend Operations, Transaction Processing, Data Entry","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"NISA Industrial Services Private Limited, 402 B, Vip Plaza, Veera Desai Industrial Estate, Off New Link Road, Andheri West, Mumbai - 400 053","phone":"022-45204506","profile":"Customer Support Executive @ NISA Industrial Services Pvt. Limited","description":"Currently we have requirement for CRE (Control Room Executive)/ CSR in Andheri (West), Mumbai. Remote monitoring Live site alarms for Bank branches and ATMs as well as other clients. Prepare and maintain daily site reports for various parameters Maintain a log for video online offline report Maintain Logbook for all open alarms. To initiate a video verification in case of any alarm/ticket and maintain a record and also escalate to the senior officials if necessary. Co -ordinating with the support team as well as software team in case of on sites problems faced by the client. Its a rotational shift job and rotational weekly off. Walk-in Date/ Time: 12th - 16th August, 12 AM onwards Interview Venue: NISA Industrial Services Private Limited 402 B, Vip Plaza, Veera Desai Industrial Estate, Off New Link Road, Andheri West, Mumbai - 400 053 Landline : 022- 45204506","location":"Mumbai","experience":"0 - 2 Years"},{"date":"12, 13, 14 - Aug - 2019","skills":"Non Voice Process, Back Office Operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Hinduja Global Solutions Limited, 15, Sri Chamundi Towers, C-2 Building, Hosur Main Road, Garvebhavi Palya, Opposite Sai Baba Temple, Bangalore - 560 068","phone":"7829533724","profile":"Back Office Executive @ Hinduja Global Solutions Limited","description":"Any Graduate-Fresher or Experienced (NO- BE, B.Tech, Post Graduates) Willing to work in rotational shifts 2 Way cab facility provided 5 Days working, 2 Days Off Desired Skills and Abilities: * Good communication skills * Good Analytical Skills * Basic computer knowledge Compensation: 1,76,000 LPA Walk-in Date/ Time: 12th - 14th August , 10 AM onwards Interview Venue: Hinduja Global Solutions Limited 15, Sri Chamundi Towers, C-2 Building, Hosur Main Road, Garvebhavi Palya, Opposite Sai Baba Temple, Bangalore - 560 068 Contact HR person: Pooja H M-7829533724","location":"Bangalore","experience":"0 - 1 Years"},{"date":"12, 13 - Aug - 2019","skills":"Back Office Assistance, General Administration","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"WNS Global Services Private Limited, Block C, Viman Nagar, Pune. Landmark: Opposite to Hyatt Hotel","phone":"9561461297","profile":"Graduate Fresher's (Backend Process) @ WNS Global Services Private Limited","description":"Mega Hiring for BACKOFFICE PROCESS ONLY GRADUATES. Only PUNE Location We are currently Hiring Graduate Fresher's for Non-Voice Process. (Meet HR Chanda) Any Graduate Fresher can apply. Candidate should be able to communicate in English . 24*7 shifts and 5 days working. Ready to work for any shift. Ready to work for Night shift. Ready to work on Contract. Immediate Joining. Walk-in Date: 12th August - 13th August Timings: 10am to 1pm Interview Venue: WNS Global Services Private Limited Block C, Viman Nagar, Pune Landmark: Opposite to Hyatt Hotel Carry an updated copy of your resume and mention HR CHANDA as a reference on your CV. For details call HR Chanda : 9561461297","location":"Pune","experience":"0 - 1 Years"},{"date":"12, 14 - Aug - 2019","skills":"backend operation, technical support, domestic process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Wipro Limited, Tower A, Tech Boulevard, Plot No 6, Sector 127, Noida Expressway, Noida","phone":"Not Provided","profile":"Process Associate/ Backend @ Wipro HR Services Private Limited","description":"Education: Graduate with a Bachelors Degree as B.Com, BBA, B.Sc., BA. Master degree holder as MA, M.com, MBA(only correspondence or part time) Except B-Tech/BE/LLB/B.Ed./ BCA/ BSc (IT) or MBA -Regular Preferred Experience: Previous experience from Outsourcing, Payroll industry and possessing good social skills Work Condition Flexibility to work in 24*5 shift environment Flexibility to occasionally extend work hours to meet business needs Flexibility to move across client teams . Good verbal and written communications required. Willingness to sign a service agreement before every overseas travel/ assignment. Interview Date:12 & 14 August 2019 Timings: 12:00 PM- 1:30 PM Interview Venue: Wipro Limited Tower A, Tech Boulevard, Plot No 6, Sector 127, Noida Expressway, Noida","location":"Noida","experience":"0 - 3 Years"},{"date":"12, 13, 14, 15, 16 - Aug - 2019","skills":"Front Office Acvtivities, Facility Management, General Administration","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"ANAROCK Property Consultants Private Limited, (Formerly Jones Lang LaSalle Residential Pvt. Limited) 1002, 10th Floor, B Wing, ONE BKC, G Block Bandra Kurla Complex, Bandra East, Mumbai - 400 051","phone":"022-42934293","profile":"Front Office/ Admin Executive @ ANAROCK Property Consultants Pvt. Limited","description":"Urgent opening for the post of Front office cum Admin Executive for Real Estate Company. Candidate should be Any Graduate with excellent communication and good Personality. Should be able to handle both the role as Front office and Admin. Candidate must be willing to work for 6 days a week. Female candidates preferred Walk-in Date/ Time: 12th - 16th August, 10 AM onwards Interview Venue: ANAROCK Property Consultants Private Limited (Formerly Jones Lang LaSalle Residential Pvt. Limited) 1002, 10th Floor, B Wing, ONE BKC, G Block Bandra Kurla Complex, Bandra East, Mumbai - 400 051","location":"Mumbai","experience":"2 - 3 Years"},{"date":"14 - Aug - 2019","skills":"Core Java, Java J2ee, Spring, Hibernate","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Don Bosco Institute Of Technology, SH17, Kumbalgodu, Bangalore - 560074","phone":"9902070375","profile":"Trainee Engineers (Java) @ iPrimed Education Solutions Pvt. Limited","description":"Mega Campus Drive@ Don Bosco Institute Of Technology Hiring on Behalf of Quinnox in Bangalore Designation: Software Trainee (JAVA) Salary: 3 - 3.40 LPA Eligibility Criteria: BE/ B.Tech/ MCA (CS/IT/IS) (No year gap) 60% aggregate only 2019 Pass outs Walk-in Date/ Time: 14th August , 10 AM onwards Interview Venue : Don Bosco Institute Of Technology, SH17, Kumbalgodu, Bangalore - 560074 Contact Details: Umar A Ghaffer 9902070375 Only whtsapp for any queries.","location":"Bangalore","experience":"0 - 1 Years"},{"date":"12 - Aug - 2019","skills":"Java, J2EE, Spring, JDBC, GWT, Multithreading, SQL Server","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Estel Technologies Private Limited, #126, Sector 44, Institutional Area Gurgaon, Haryana","phone":"0124 257 8204","profile":"Sr. Java Professionals @ Estel Technologies Private Limited","description":"- 3+ years of Core JAVA in an application development environment - Well versed in core Java. Which includes Springs, Hibernate, Webservices and Multi-threading. - Knowledge of Java related technologies such as J2EE, Spring, JDBC, GWT, Multithreading - - Proficient in: SQL / Database Concepts / LINUX / UNIX / ORACLE - Development, deployment and testing - Strong Core JAVA development experience - Good understanding Architectural Design Patterns - Experience in refactoring and working with existing code - Solid database experience Walk-in Date: 12th August 2019 Timing 11:00 am to 4:00 pm Interview Venue: Estel Technologies Private Limited #126, Sector 44, Institutional Area Gurgaon, Haryana Phone No: 0124 257 8204/ 208 Contact Person - Nitanjali/ Saif","location":"Gurgaon","experience":"3 - 7 Years"},{"date":"12, 13 - Aug - 2019","skills":"Core Java, Rest, Solr, Javascript, XHTML, JQuery, Ajax","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"CNSI, Flat #709, Spencer Plaza, 7th Floor, Phase II #769, Anna Salai,, Chennai, Tamilnadu - 600 002","phone":"43937500","profile":"Software Engineer - Java @ CNSI","description":"Looking for Software Engineer -Java (Immediate joining preferable) Candidate should have 2 to 3 years of experience in Java, J2EE, Struts/ Spring Excellent team player with hands on in writing code Excellent oral & written communication skills, Good problem-solving & analytical skills No. of Openings: 40 Walk-in Date : 12th & 13th August 2019 Time : 10 AM to 6 PM Interview Venue: CNSI Flat #709, Spencer Plaza, 7th Floor, Phase II #769, Anna Salai,, Chennai, Tamilnadu - 600 002 Note: Please ignore if you have already attended the interview in past 3 months","location":"Chennai","experience":"2 - 3 Years"},{"date":"13 - Aug - 2019","skills":"Core Java, SQL/ MySQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Hurits Consulting Private Limited, No. 376/A, 1st Floor, Obeya Verve, Opposite to KLAY Play School, 5th Main, Near Rajesh Jewellery, Sector 6, HSR Layout, Bangalore - 560 102","phone":"9380322067","profile":"Software Developer (Core Java) @ Hurits Consulting Private Limited","description":"Candidate should be BE/ B.Tech or MCA (2019 Freshers) with good academic record and Sound knowledge in writing clean code in Core Java. Must be familiar with advanced principles of object oriented analysis, design and programming Familiarity with Databases like SQL/ MySQL Willingness to work in a fast-paced, start-up environment You will be asked to crack a hands-on coding assignment in the interview Walk-in Date/ Time: 13th August 2019, 9 AM onwards Interview Venue: Hurits Consulting Private Limited No. 376/A, 1st Floor, Obeya Verve, Opposite to KLAY Play School, 5th Main, Sector 6, HSR Layout, Bangalore - 560 102 Landmark: Near Rajesh Jewellery,","location":"Bangalore","experience":"0 - 1 Years"},{"date":"12, 13, 14 - Aug - 2019","skills":"US Process, Technical Support, Technical Services, Voice Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Pandaje Web Services Pvt. Limited, A/60 Sector 58, Noida","phone":"7838443631","profile":"Technical Support (US Process) @ Pandaje Web Services Pvt. Limited","description":"Any Graduate/ Pursuing Graduation / Drop outs can apply Should have 0 to 5 years of experience in Voice support in BPO/ KPO/ IT Ability to communicate effectively, both verbal as well as written. Comfortable to work in 24x7 working environment. Responsible for providing telephone and remote diagnostic technical support related to installation, operation, configuration, customization, performance, and usage of assigned products. Must have good knowledge Mac Computers,Windows, Siskey, Printer, Router, Basic Quick book. Sales and Delivery of Technical Services and Support for major Brands like Apple, Dell, IBM, Lenovo, Acer and HP Etc. Troubleshoot and resolve client tech issues related to computers, routers, and printers. Fixation of Virus and Malware intrusion Etc. Walk-in Date/ Time: 12th - 14th August , 9 AM onwards Interview Venue: Pandaje Web Services Pvt. Limited A/60 Sector 58, Noida","location":"Noida","experience":"0 - 5 Years"},{"date":"12, 13 - Aug - 2019","skills":"Technical Support, Desktop Troubleshooting, Hardware Support, Customer Service","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"HCL Technologies Limited, A-22, Sector 60, Noida (Near Noida city Center Metro Station)","phone":"8586077296","profile":"Technical Support Associate @ HCL Technologies Limited","description":"HCL Offers Great Opportunity to make a career in its Pilot Batch, A Career opportunity to work for a US based Client which is one of the Global leaders in Healthcare Division. Candidates who can join HCL immediately should only appear for the interview. Designation:- EPS (Engineer Product Support) Required Work Experience: *Technical Graduates with good experience in hardware/ Desktop troubleshooting support are eligible for this opening. Must have:- * Good Spoken & Written English. Skill set required:- Must be a technical graduate with excellent communication. ROLES & RESPONSIBILITIES:- *First point of technical troubleshooting * Channels of Support: Phone and E-mail * 24*7 support * Ability to discuss Hardware Requirement with Customers Salary- Upto 4.27 LPA Please come down for a face to face Interview. Please write HR Jyoti Gupta on the top of your resume Interview Date:- 12-13th August, 2019 Timings: 11:00 am 4 pm Interview Venue: HCL Technologies Limited, A-22, Sector 60, Noida (Near Noida city Center Metro Station) Contact Person: Jyoti Gupta Contact No: 8586077296 Kindly Carry: Copy of your updated resume Govt. address/Id proof DO NOT CARRY LAPTOPS/USB/ PHONE CHARGER as they are not allowed in the premises DISCLAIMER: HCL Technologies BSERV do not charge any amount throughout the recruitment process.","location":"Noida","experience":"1 - 4 Years"},{"date":"12 - Aug - 2019","skills":"Java C++ Software Development SE Algorithms NoSQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Azuga Telematics Private Limited, A2, 77 Town Center Yemalur Bangalore","phone":"080-67087777","profile":"Java Developers @ Azuga Telematics Private Limited","description":"A Software Engineer (SE) in Azuga would develop world-class applications and contribute to the culture of innovation via new technologies and new ideas that enhance the customer experience. You will be part of a talented software team that works on mission-critical applications. Basic Qualifications 1. Engineering in Computer Science or equivalent. 2. A portfolio of completed professional-grade work on proof-of-concepts (PoCs) or innovative ideas or open source contributions or mobile apps. 3. Experience applying Computer Science fundamentals in software development of these PoCs via data structures, algorithms, problem solving, and complexity analysis. 4. Write well designed, testable, efficient code that is in compliance with specifications. 5. Either very good understanding or experience with relational databases, ORM frameworks, NoSQL. 6. Experience with, at least, one modern programming language such as Java, C++, Python, Go, etc. 7. Excellent communication skills in English, verbal, and written. 8. Go-getter, energetic, willing to explore tech solutions and get things done fast. Preferred Additional Qualifications 1. Internship experience in working in a team and in building complex software systems that have been successfully delivered to customers. 2. PoCs or mobile apps demo apps that use concepts from distributed computing. Walk-in Date/ Time: 12th August 2019, 10 AM onwards Interview Venue: Azuga Telematics Private Limited A2, 77 Town Center Yemalur Bangalore","location":"Bangalore","experience":"0 - 2 Years"},{"date":"11 - Aug - 2019","skills":"ASP .Net/ Software Testing","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Shriram City Union Finance Limited, No. 5M, MRP Complex, 11th Cross Street, Thillai Nagar, Ramachandrapuram, Thennur, Trichy - 620 017","phone":"044-42913006","profile":"Software Test Engineer/ Trainee @ Shriram Value Services Limited","description":"Candidate with 65% above in 10th, 12th, UG, PG are only eligible BE/ B Tech (CSE/ IT/ ECE) MCA, MSC (CS) from 2018 & 2019 batch only Bsc-Cs & BCA from 2018 & 2019 batch only Experience: Fresher Good knowledge in ASP .Net/ Testing is preferred Age criteria Not more than 25 Years. Job Location: Chennai Selection Process: Aptitude Test Technical Round If interested walk-in to the below mentioned venue directly with your updated CV. Walk-in Date/ Time: 11th August 2019, 10 AM onwards Interviiew Venue: Shriram City Union Finance Limited, No. 5M, MRP Complex, 11th Cross Street, Thillai Nagar, Ramachandrapuram, Thennur, Trichy - 620 017 Contact Person: Mr. Caleb Jerome Documents To Be Carried: Resume Passport Size Photo ID Proof Note: If you have attended this interview process in last 6 months you won't be eligible.","location":"Trichy","experience":"0 - 1 Years"},{"date":"10 - Aug - 2019","skills":"Software Testing, Embedded testing, Test Case Design","qualification":"B.E./B.Tech","address":"Cyient Limited, Plot No. 2, IT Park, Nanakramguda, Manikonda, Hyderabad - 500 032","phone":"040-67489921","profile":"Embedded Testing Engineer @ Cyient Limited","description":"Qualification: BE/ B.Tech (Electronics/ Computers) Work Experience: 2 to 5 years Job Location: Hyderabad Good understanding of complete Software Test life cycle for software in real time embedded control, communication and information systems. Should able to understand system/software requirements for software testing. Create Test specification from requirements, execute testing and create test reports. Experience for creating test case as per standard Test case design techniques. Experience of integration & rig-based functional testing involving both software only and software/hardware integration configurations. Knowledge of simulation test environments. Basic knowledge on C Good understating of real time system, data communication e.g. serial RS232/485 and TCP/IP. ISTQB foundation level certification. IBM Rational tool like DOORS, ClearCase/ClearQuest or similar Requirements management tool knowledge. Good written/ oral communication skills. Walk in Date : 10th August (Saturday) Time: 10.00 AM - 12.00 PM Walk-In Venue: Cyient Limited, Plot No. 2, IT Park, Nanakramguda, Manikonda, Hyderabad - 500 032 Land Mark: Near Continental Hospital Contact Person: Manohar Burri Tel: 040-67489921 Note: Candidates who have attended the interview in last 6 months are not eligible for this walk-in","location":"Hyderabad","experience":"2 - 5 Years"},{"date":"10 - Aug - 2019","skills":"Angular 2/4/6, .Net - C#, MVC, WCF, Windows Forms, Oracle or SQL Server","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Hexaware Technologies Limited, 152, Sector III, Millennium Business Park, A Block TTC Industrial Area, Mahape, Navi Mumbai - 400 710","phone":"Not Provided","profile":".NET Professionals @ Hexaware Technologies Limited","description":"Hexaware Technologies Limited is hiring Dotnet, Angular Professionals on 10th August 2019 at Mumbai Work Experience: 4 to 12 Years Skills: Angular 2/4/6, MVC, WCF Notice Period: Immediate to 60 days Must have Skills Angular 2/4/6, .Net - C#, MVC, WCF, Windows Forms, Oracle or SQL Server Interview Date: 10th August 2019 Time: 9 am to 2 pm Interview Venue: Hexaware Technologies Limited, 152, Sector III, Millennium Business Park, A Block TTC Industrial Area, Mahape, Navi Mumbai - 400 710 Contact Person: Prethiba T","location":"Mumbai","experience":"4 - 12 Years"},{"date":"9, 10, 12, 13, 14 - Aug - 2019","skills":"Technical Support, Software Testing/ Troubleshooting Skills","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Rayna Group Private Limited, Opposite Holiday Inn Hotel, Next to Kaweri Hotel, Mumbai Pune Banglore Bypass Highway, Wakad, Pune - 411 045","phone":"Not Provided","profile":"Backend Support & Tester (Freshers) @ Rayna Group Private Limited","description":"Candidate must be from IT background with Qualification (BCA/ BCS/ MCA/ BE-IT/ Computer) Candidates should have a good communication skills. Should have knowledge good knowledge of Word, and Excel Good written and verbal English is must. Taking care of Backend of Raynatours websites. Work on Creating Discount Coupon codes. Work with software developers and get the issues done from them. Test in different environments including web and mobile Checking Hotjar (Video Recording tool) Walk-in Date/ Time: 14th August 2019, 10 AM onwards Interview Venue: Rayna Group Private Limited Opposite Holiday Inn Hotel, Next to Kaweri Hotel, Mumbai Pune Banglore Bypass Highway, Wakad, Pune - 411 045","location":"Pune","experience":"0 - 1 Years"},{"date":"12 - Aug - 2019","skills":"Software Testing, Test Planning, Automation Testing, Test Scenarios, Test Plan Creation, Manual Testing, Selenium","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Ebix Software India Private Limited, Plot No - 122 & 123 (Opp. Corporation Bank ATM), Noida Special Economic Zone (NSEZ), Near Sector 82, Phase - II, Noida","phone":"9315634728","profile":"Manual Testing Engineer @ Ebix Software India Pvt. Limited","description":"Person must have good experience of Manual Testing/ Test Documents/ SQL/ OOPS Should have good knowledge of Automation Testing / Selenium. Review system requirements specification, features descriptions and present test scenarios. Assist with test plan creation and setting up test environment. Create test cases and prioritize based on the criticality of the business operation. Proven work experience in Web and API testing. Strong knowledge of software QA methodologies and processes Excellent communication skills, good sense of teamwork. Walk-in Date/ Time: 12th August 2019, 11 AM onwards Interview Venue: Ebix Software India Private Limited Plot No - 122 & 123 (Opp. Corporation Bank ATM), Noida Special Economic Zone (NSEZ), Near Sector 82, Phase - II, Noida","location":"Noida","experience":"3 - 5 Years"},{"date":"10 - Aug - 2019","skills":"Automation Testing, Cucumber, Maven, Jenkins, Selenium","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Xpanxion International Private Limited, 3rd Floor, Server Space, A.G. Technology Park, Off ITI Road, Near Sarja Hotel, Aundh, Pune- 411 007","phone":"Not Mentioned","profile":"QA/ Automation Tester @ Xpanxion International Pvt. Limited","description":"Technical Skills - Mandatory Experience or exposure to test automation 2 to 3 Years of experience hands on experience on Java, Groovy Hands on experience on working with XML and JSON and parsing/ using them Experience in using various IDE's Eclipse/ IntelliJ Experience in using build tools like Maven/ Gradle Must be very strong in Automation Concepts Strong knowledge of software testing methodology and hands-on application test experience Ability to quickly grasp the application domain and functionality Strong experience creating and maintaining test cases/ scripts Work Location: Aundh/ Pune Station Interested candidates can walk-in directly with their updated resumes Walk-in Date/ Time: 10th August from 10 AM onwards Venue Details: Xpanxion International Private Limited 3rd Floor, Server Space, A.G. Technology Park, Off ITI Road, Near Sarja Hotel, Aundh, Pune- 411 007 Contact Person: Kashish Chauhan Interview Process: 1. Candidate will have Test & L1 Technical F2F discussion Same day. 2. If Selected in above rounds we will brief about further Client rounds.","location":"Pune","experience":"2 - 3 Years"},{"date":"8, 9 - Aug - 2019","skills":"Test Engineering, QATesting Tools, Load Runner, Automation Testing, Load Testing, Test Scripts, Testing Concepts","qualification":"B.E./B.Tech","address":"Extramarks Education India Pvt. Limited, D-180 , Sector 63, Noida","phone":"Not Provided","profile":"Software Testing Engineer @ Extramarks Education India Pvt. Limited","description":"Qualification BE/ B.Tech (IT/ CS) Expert knowledge of Testing Concepts & Methodologies Exposure to automated testing tools; Load Testing (Load Runner) Team-oriented experience highly desired Superb attention to detail Required Skills/ Experience: Experience testing complex web applications and software systems (Manual / Automated) Experience writing and maintaining test scripts Experience creating and maintaining testing environments Excellent understanding of testing concepts and the role of QA in the software development Exposure to understanding Test Plans; creating plans for small applications Good written and spoken communication skills Walk-in Date/ Time: 8th - 9th August from 11 AM onwards Interview Venue: Extramarks Education India Pvt. Limited D-180 , Sector 63, Noida","location":"Noida","experience":"4 - 8 Years"},{"date":"9 - Aug - 2019","skills":"Software Testing, Manual & Automation Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"IKS Health (Inventurus Knowledge Solutions Pvt. Ltd) M/s. Serene Properties Private Limited (SEZ), Unit No. 203, Building No. 5, 2nd Floor Mindspace Airoli (East), Navi Mumbai - 400 708","phone":"Not Provided","profile":"Software Testing Engineer @ Inventurus Knowledge Solutions Pvt. Limited","description":"Years of Exp : 2 to 4 years (Analyst) Must have skill for Automation Engineers : Selenium+C# Walk-in Date - 9th Aug 2019 Timing -11:00 AM to 5:00 PM Notice Period -Preferring Immediate to One month Interview Location:- IKS Health (Inventurus Knowledge Solutions Pvt. Ltd) M/s. Serene Properties Private Limited (SEZ) Unit No. 203, Building No. 5, 2nd Floor Mindspace Airoli (East), Navi Mumbai - 400 708 Contact Person : Deepika P Documents to carry :- Updated resume with Original Govt ID Interview Process 1. Two level of technical discussion 2. Hiring manager discussion 3. HR Discussion","location":"Mumbai","experience":"2 - 4 Years"},{"date":"10 - Aug - 2019","skills":"Automation Tools Jenkins Java JUnit Web Technologies Selenium Webdriver","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Impiger Technologies Private Limited, Sudhama Commercial Building 2nd Floor, No. 36, Vijayaraghava Road, T-Nagar, Chennai- 600 017","phone":"Not Provided","profile":"Automation Test Engineer @ Impiger Technologies Private Limited","description":"Person must have 3+ years overall experience/ with 2+ years experience in automating web applications using Selenium Web driver, Java, JUnit, JS, TestNG. Should have experience with build automation tools such as Jenkins. Good manual testing experience on Web, Mobile-web, Mobile Apps Walk-in Date/ Time: 10th August 2019, 9 AM onwards Interview Venue: Impiger Technologies Private Limited Sudhama Commercial Building 2nd Floor, No. 36, Vijayaraghava Road, T-Nagar, Chennai- 600 017","location":"Chennai, Coimbatore","experience":"3 - 8 Years"},{"date":"10 - Aug - 2019","skills":".Net, C#, SQL Server","qualification":"B.E./B.Tech, B.Sc, BCA/BCS","address":"Spider Software Private Limited, 206, Jalaram Business Center, Ganjawala Lane, Near Chamunda Circle, Borivali West, Mumbai - 400 092","phone":"022-42446400","profile":".Net Developers @ Spider Software Private Limited","description":"Person should have good knowledge/ practical handling .Net, C#, SQL Knowledge of making windows based application will be an added advantage Has good knowledge of internet and/or client server architecture Clear concepts of Multi threading Job Responsibility- Develop high quality software Develop applications to handle live streaming data Design/ Develop internet based client server data architecture Design/ develop software to work in Real-Time environment Process handling+memory management technology Walk-in Date: 10th August 2019 Timings: Fri (9 am-3 pm)/ Sat (9 am -1 pm) Interview Venue: Spider Software Private Limited 206, Jalaram Business Center, Ganjawala Lane, Near Chamunda Circle, Borivali West, Mumbai - 400 092 Landmark- Petrol Pump lane","location":"Mumbai","experience":"0 - 3 Years"},{"date":"10 - Aug - 2019","skills":"Angular JS, .Net, MVC, ASP .Net, MVC","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Hytech Professionals India Pvt. Limited, A-89 Sector-63, Noida","phone":"Not Specified","profile":".Net Developer @ Hytech Professionals India Pvt. Limited","description":"Candidate should be BE/ B.Tech/ M.Tech or MCA with 1 to 5 years of experience in Software Development using Angular JS, .Net, MVC, ASP .Net, MVC Walk-in Date/ Time: 10th August (Saturday), 10 AM onwards Interview Venue: Hytech Professionals India Pvt. Limited A-89 Sector-63, Noida","location":"Noida","experience":"1 - 5 Years"},{"date":"10 - Aug - 2019","skills":".NET 3.0+, C#, ASP .NET, SQL Server (2012), T-SQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Riversand Technologies India Pvt. Limited, IBC Knowledge Park, Tower D, 8th Floor. 4/1, Bannerghatta Main Road, Bengaluru - 560 029","phone":"080-25538669","profile":"Senior Software Engineer (.Net) @ Riversand Technologies (India) Pvt. Limited","description":"Person must have advanced level knowledge and experience is required in .NET 3.0+, C#, ASP .NET, SQL Server (2012), T-SQL Should have good experience is desired in WCF, MVC and XML and Agile Methodology Experience in previous consulting or customer facing roles is not mandatory, but preferred Any other MDM product knowledge would be an asset Walk-in Date: 10th August 2019 Timings: 9:30 AM - 1 PM only Interview Venue: Riversand Technologies India Pvt. Limited IBC Knowledge Park, Tower D, 8th Floor. 4/1, Bannerghatta Main Road, Bengaluru - 560 029","location":"Bangalore","experience":"5 - 10 Years"}]}