{"Walkins":[{"date":"12 - Dec - 2020","skills":"Core Java/ Advanced Java, Spring, Hibernate, J2Ee, Spring Boot, JPA","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Indian Eagle Private Limited, Plot No. 87, 2nd Floor, AP Productivity House, Banjara Hills, Road No - 2, Hyderabad.","phone":"040-40213111","profile":"   Java/ Software Developer \nIndian Eagle Private Limited","description":"Looking for enthusiastic young minds to join our team at Indian Eagle. We welcome candidates 2018 & 2019 passed outs with basic skills at the entry level, we provide them on-job training skills required for the permanent cadre of the company. Required Skills- Core Java/ Advanced Java, Spring, Hibernate, J2Ee, Spring Boot, JPA Walk-in Date/ Time: 12th December 2020, 9.00 AM - 4.00 PM Venue Details- Indian Eagle Private Limited Plot No. 87, 2nd Floor, AP Productivity House, Banjara Hills, Road No - 2, Hyderabad. Contact Person- Nikhila Kodam Contact No. 040-40213111/ +91 9573809465 Landmark: Opposite to Natco Pharma Limited  ","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"14, 15, 16, 17, 18 - Dec - 2020","skills":".Net & Sql","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Zenwork Labs India Private Limited, B 503, The Platina, Survey.134P, 132P, 110P, 108P S136/ 3, Gachibowli Road, Gachibowli, Hyderabad, Telangana - 500 032.","phone":"Not Provided","profile":"   .Net Trainees/ Software Engineer \nZenwork Labs India Private Limited","description":"Zenwork Labs India Private Limited, is looking for Software Engineer Trainees The candidate should have 0 to 2 years of experience in .Net & Sql Freshers with Training experience of .Net & SQL can also apply Any education background with relevant experience is preferred. People who are in Hyderabad can apply. You have to work from Office. We are looking for candidates who can join us immediately. Walk-in Date/ Time: 14th - 18th December 2020, 10.00 AM - 4.30 PM Venue Details- Zenwork Labs India Private Limited B 503, The Platina, Survey.134P, 132P, 110P, 108P S136/ 3, Gachibowli Road, Gachibowli, Hyderabad, Telangana - 500 032.  ","location":"Hyderabad","experience":"0 - 2 Years"},{"date":"14, 15, 16, 17, 18 - Dec - 2020","skills":"ASP .Net, .NET Framework, C#, XML, XSLT, Crystal Reports, JavaScript and SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Nexsus Techno Solutions Private Limited, Everest Nivara Infotech Park -1, 803, 8th Floor, Plot No.D-3, Industrial Area Turbhe MIDC, Navi Mumbai - 400 705.","phone":"022-67410300","profile":"   Trainee Software Engineer (ASP .Net) \nNexsus Techno Solutions Private Limited","description":"Candidate should have good knowledge of ASP .Net technologies, .NET Framework, C#, XML, XSLT, Crystal Reports, JavaScript and SQL Server 2000. Must have good communication & overall presentation skills. Walk-in Date/ Time- 14th - 18th December 2020, 11.00 AM - 5.00 PM Venue Details- Nexsus Techno Solutions Private Limited Everest Nivara Infotech Park -1, 803, 8th Floor, Plot No.D-3, Industrial Area Turbhe MIDC, Navi Mumbai - 400 705. Contact Person- Munisha Vashishat (022-67410300)  ","location":"Mumbai","experience":"0 - 1 Years"},{"date":"14, 15, 16, 17, 18, 19, 21, 22, 23 - Dec - 2020","skills":"Java, J2EE, SQL Technologies Servlets, JSP, JDBC, JavaScript, XML, AJAX, JQuery","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Girmiti Software Private Limited, Near Bank of Baroda #2/3, SLV Plaza Kundalahalli Gate, Marathahalli, Bangalore - 560 037.","phone":"9967917893","profile":"   Java Developer/ Fresher \nGirmiti Software Private Limited","description":"Candidate must have extensive experience in application development using Java, J2EE component and frameworks like Spring, Hibernate etc. Expertise in end-to-end development of software products from Requirement Analysis, System study, Coding, Unit Testing, Integration and Deployment, Maintenance of Software Applications Technical Skills Set: Languages Java, J2EE, SQL Technologies Servlets, JSP, JDBC, JavaScript, XML, AJAX, JQuery, JSON, AngularJS, LiveJS, ReactJS, BackBoneJS. Framework & Tools Spring, Spring-Boot, Spring-Cloud, Play framework, Hibernate. Job Location: Bangalore Male Candidates only Walk-in Date/ Time: 14th - 23rd December 2020, 9.30 AM - 5.30 PM Venue Details- Girmiti Software Private Limited Near Bank of Baroda #2/3, SLV Plaza Kundalahalli Gate, Marathahalli, Bangalore - 560 037. Contact - Rishi or Sandesh (9967917893)  ","location":"Bangalore","experience":"0 - 1 Years"},{"date":"14, 15, 16, 17, 18, 19, 21, 22, 23 - Dec - 2020","skills":"Android SDK, Java, HTML5, Javascript, AJAX, REST web services, JSON","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Girmiti Software Private Limited, Near Bank of Baroda #2/3, SLV Plaza Kundalahalli Gate, Marathahalli, Bangalore - 560 037.","phone":"9967917893","profile":"   Android Developer/ Fresher \nGirmiti Software Private Limited","description":"Candidate must have In-depth technical knowledge and knows the advantages and using these abilities. Should be able to provide technical support to developers to help them integrate these capabilities. Participate in function, architecture, and performance optimization. Technical Skills: Languages: Android SDK, Java Technologies: HTML5, Javascript, AJAX, REST Web Services, JSON Tools: CVS, SVN, ANT. Only completed Graduation will be entertained. No Backlogs. Male Candidates only Job Location: Bangalore Walk-in Date/ Time: 14th - 23rd December 2020, 9.30 AM - 5.30 PM Venue Details- Girmiti Software Private Limited Near Bank of Baroda #2/3, SLV Plaza Kundalahalli Gate, Marathahalli, Bangalore - 560 037. Contact - Rishi or Sandesh (9967917893)  ","location":"Bangalore","experience":"0 - 1 Years"},{"date":"14, 15, 16, 17, 18 - Dec - 2020","skills":"Mailing, Backend Operations, Writing Skills,","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Smart Value Products & Services Limited, IRIS Tech Park, 5th Floor, Unit 502, Sector 48, Sohna Road, Gurgaon","phone":"Not Provided","profile":"   Back Office/ Refund Executive \nSmart Value Products & Services Limited","description":"Candidate must be Any Graduate with excellent communication skills Should be good in MS Excel with excellent written skills Fresher Are most welcome Roles and Responsibilities- Mailing Backend Operations Note: 6 Days Working Walk-in Date/ Time: 14th - 18th December 2020, 9.30 AM - 4.30 PM Venue Details- Smart Value Products & Services Limited IRIS Tech Park, 5th Floor, Unit 502, Sector 48, Sohna Road, Gurgaon Contact Persom- Alka Solanki If interested candidates can drop their CV on exe.hr@svspl.in  ","location":"Gurgaon","experience":"0 - 2 Years"},{"date":"14, 15, 16, 17, 18 - Dec - 2020","skills":"Floor Management, Retail Sales, Customer Service","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"ORRA Fine Jewellers Private Limited, 1st & 2nd Floor, A-Wing, Gate No. 4, Plot No 11, Ashok Chakravarty Road, Kandivali (East), Mumbai \u0096 400 101. Maharashtra","phone":"8080050250","profile":"   Floor Executive - Mumbai \nORRA Fine Jewellers Private Limited","description":"We are looking for candidates with: Pleasing personality with good command over English, Hindi and local language. Prior Retail experience will be an added advantage. Smart Freshers are welcome. Job Responsibility- Sale of Jewellery (Diamond, Platinum, Gold) Cross-selling of the products thereby increasing the sales. Meeting the assigned targets as scheduled. Ensuring safety & accountability of the products being exhibited to the customers. Walk-in Date/ Time: 14th - 18th December 2020, 10.00 AM - 5.30 PM Venue Details- ORRA Fine Jewellers Private Limited 1st & 2nd Floor, A-Wing, Gate No. 4, Plot No 11, Ashok Chakravarty Road, Kandivali (East), Mumbai \u0096 400 101. Maharashtra Contact Person- Shraddha Mulik Phone- 8080050250  ","location":"Mumbai","experience":"0 - 5 Years"},{"date":"18 - Dec - 2020","skills":"Lead Generation, Field Sales, Customer Acquisition, Customer Retention","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Kotak Mahindra Bank Limited, 9, Birbal lane, Jungpura, Opposite Post Office, South Delhi","phone":"Not Provided","profile":"   Assistant Acquisition Manager \nKotak Mahindra Bank Limited","description":"We have Urgent openings for Assistant Acquisition Manager- CASA -Sales for South Delhi location. Designation: Assistant Acquisition Manager- CASA (Sales) Grade: M1 - Assistant Manager (On the payroll of Kotak Mahindra Bank) CTC Offered- Upto 2.7 LPA Candidate must be a Graduate with Fair English communication skills Must have Field Sales Exposure and willing to hunt in the open market Preferred candidate From banking, Insurance, Stockbroking & NBFC Maximum Age Limit- 27 Years Job Reasonability: To source customers for Current Account & Saving Account. Customers to be sourced from individuals, small businesses, trusts, associations, societies, corporates. Revenue Generation, Customer Acquisition, Customer Retention, Cost Efficiency Through Process Hardcore sales mentality. Primary motivation from the achievement of targets. A hunter by orientation. Should be well-groomed and presentable with ambassadorship qualities Note - Candidate Must have basic knowledge of Banking products & Role which he applied for. Walk-in Date/ Time: 18th December 2020, 11.00 AM - 2.30 PM Venue Details- Kotak Mahindra Bank Limited, 9, Birbal lane, Jungpura, Opposite Post Office, South Delhi Contact Person - Gaurabh Narula  ","location":"Delhi","experience":"1 - 4 Years"},{"date":"19 - Dec - 2020","skills":"billing & codingar calling, denial management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Norm Software, Flat No. 1-2-68T070 Parklane, Opposite Chenoy Trade Center Beside Brand Factory, above Canara Bank ATM, 2nd Floor Sec-bad - 500 003","phone":"040-4222-4061","profile":"   Medical Billing Executive \neMedical Practice (Norm Software)","description":"Opening for Medical Billing Executive/ Freshers with good communication skills. Job Responsibilities- Opening for Denial Management, AR Callers, Charge Entry, Claim Processing, Rejections. Walk-in Date/ Time: 19th December 2020, 9.30 AM - 5.30 PM Venue Details- Norm Software, Flat No. 1-2-68T070 Parklane, Opposite Chenoy Trade Center, Beside Brand Factory, Above Canara Bank ATM, 2nd Floor Sec-bad - 500 003 Contact Person- Santhosh Bhave Office Phone: 040-4222-4061  ","location":"Hyderabad","experience":"0 - 5 Years"},{"date":"13, 14, 15, 16, 17, 18, 19 - Dec - 2020","skills":"Site Management, Architecture, Project Management, Real Estate","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"A MART Interior Designer Project Company, SARA BHAI CAMPUS ,OPP Vadodara Central Mall, NEAR GENDA CIRCLE","phone":"9016981405","profile":"   HR Manager \nA MART Interior Designer Project Company","description":"INTERIOR DISGNER PROJECT BUSINESS DEVELOPERS, INTERIOR DISGNER PROJECT CUSTOMER COORDINATION, INTERIOR DESIGNER PROJECT MERTIRAL MANAGEMENT, AND SUPPLER COMPANY COORDINATION, INTERIOR DISGNER PROJECT COST ANALYSIS, Walk-in Date/ Time: 13th - 19th December 2020, 10.00 AM - 7.00 PM Venue Details- A MART Interior Designer Project Company SARA BHAI CAMPUS ,OPP Vadodara Central Mall, NEAR GENDA CIRCLE Contact Person- Minal Makwana Phone No. 9016981405  ","location":"Vadodara","experience":"5 - 10 Years"},{"date":"14, 15, 16, 17, 18, 19 - Dec - 2020","skills":"Tele-Collections/ Credit Collections/ Debt Recovery/ NBFC industry and team handling","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Bouncerabbit Consultants India Pvt. Limited, Plot No.530,3rd floor,Udyog Vihar Phase 5 Gurgaon, Haryana","phone":"7291934751","profile":"   Assistant Manager - Tele Collection \nBouncerabbit Consultants India Pvt. Limited","description":"Hiring for Assistant Manager (AM) in collection process based out at Gurgaon Udyog vihar phase 5. Candidate should be Any Graduate with 4 to 10 years of experience in Tele-Collections/ Credit Collections/ Debt Recovery/ NBFC industry and team handling. Must be proficient in Microsoft Office with excellent verbal and written communication skills Management experience Team Management Generate reports and analysis Job Responsibility: Oversee the collection of outstanding credit and invoices to minimize profit loss while ensuring it is handled appropriately and per company policy. Create and implement strategies to increase the number of successful collections on outstanding debt. Train staff members within the collections department to ensure a sufficient number of staff members are available to handle the workload. Develop goals aching achieving the business goals of the company and coordinate staff to continually meet and exceed goals. Run reports and analyze data pertaining to the department and share it with executive staff and managers of department staff as needed. Implement credit policies and procedures that retain a smooth running of the department and avoid excessive credit limits Walk-in Date/ Time: 14th - 19th December 2020, 9.30 AM - 5.30 PM Venue Details- Bouncerabbit Consultants India Pvt. Limited Plot No.530,3rd floor,Udyog Vihar Phase 5 Gurgaon, Haryana Contact Person: Kalpana Singh WhatsApp or call us at 7291934751/ 7827407535 (If by any chance call is not connected please drop a message on whatsapp) Email - hrd.bouncerabbit@gmail.com Please note, this is an immediate requirement, preference will be for the first comers  ","location":"Gurgaon","experience":"4 - 10 Years"},{"date":"11, 12, 13, 14, 15, 16, 17, 18 - Dec - 2020","skills":"Team Management, Branch Administration, Client Relationship Management, General Administration","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Coral Communications, 1013 Sector 4, Noida","phone":"9814695703","profile":"   Office Manager - Operations \nCoral Communications","description":"Candidate should be Any Graduate with good working experience in any related field Freshers having good academic background are welcome. Must have good Knowledge of computers Should have own conveyance. Job Responsibilities- Manage a team of technical staff Attending client complaints and resolving their issues Keeping record of material received and dispatched, AMC renewal and follow up, Payments received and follow up with clients for payments. Liaising with suppliers Perks and benefits- Plus Incentives for high achievers + traveling Walk-in Date/ Time: 11th - 18th December 2020, 1.00 PM - 5.00 PM Venue Details- Coral Communications, 1013 Sector 4, Noida Contact - R K Sethi (9814695703)  ","location":"Noida","experience":"0 - 5 Years"},{"date":"8 - Dec - 2020","skills":"Customer Relationship, Client Support, Customer Support, Customer Service","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"DTDC Express Limited, No B14, Thiruvika Industrial Estate, Guindy , Chennai - 600 032","phone":"7708017258","profile":"   Customer Support Executive \nDTDC Express Limited","description":"Educational Qualification: Any Graduate Work Experience: 0 to 6 Years Freshers also welcome Roles & Responsibilities: Need to taking care of in bound and out bound calls Coordination with delivery persons Tracking shipment Salary: 15k-18k Walk-in Date/ Time- 8th December 2020, 9.30 AM - 4.30 PM Venue Details- DTDC Express Limited No B14, Thiruvika Industrial Estate, Guindy , Chennai - 600 032 Contact Person- Ravikumar (7708017258)  ","location":"Chennai","experience":"0 - 6 Years"},{"date":"8 - Dec - 2020","skills":"Student Counseling, Front Desk, Overseas Education","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Quest Immigration Services LLP, Kukatpally Hyderabad Contact Mr. John (9833956662)","phone":"9833956662","profile":"   Front Office/ Student Counsellor \nQuest Immigration Services","description":"Required proficiency in international study destinations: Australia, Canada, USA, New Zealand, Germany. Must be well versed in end to end processes from admissions to visa applications. Fresher are Welcome Perks and benefits- Incentive +accommodation + Perks + Other Benefits Job Responsibility- Counselling the students as per their eligibility & their requirement Interact with students, parents & professionals in person and assist them for overseas University admissions. Understand the student requirement & help them in overseas admissions. Walk-in Date/ Time: 8th December 2020, 9.30 AM - 7.00 PM Venue- Quest Immigration Services LLP, Kukatpally Hyderabad Contact Mr. John (9833956662)  ","location":"Hyderabad","experience":"0 - 5 Years"},{"date":"8 - Dec - 2020","skills":"General Administration, Housekeeping, Amc/ Visa Processing, Cost Reduction","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Coslight India Telecom Pvt. Limited, Plot No. 122 Sector 4 IMT Manesar Gurgaon Haryana - 122 050","phone":"Not Provided","profile":"   Senior Admin Executive- (Male) \nCoslight India Telecom Private Limited","description":"Candidate should be Any Graduate with 2 to 7 years of experience in General Administration, Housekeeping, Amc/ Visa Processing, Cost Reduction. Must have excellent communication skills Roles and Responsibilities- Transport Travels & Vehicles Management. (Planning arrangements for staff & Employees). Effective cost reduction planning. Vendor management & their AMC. Ensure of proper Housekeeping for office Facility of vendor Managements, supervising of various venders like housekeeping, plumbing, carpenter, Civil, electrician. Guest Managements (arrangements for flights, Hotels, bookings, lunch arrangements) Meetings Co-ordinations: Co-ordination for all administrates arrangements for internal & external. Events managements: providing necessary administrative arrangements. Experience in visa processing part. Walk-in Date/ Time: 8th December 2020, 11.00 AM - 4.00 PM Venue Details- Coslight India Telecom Pvt. Limited Plot No. 122 Sector 4 IMT Manesar Gurgaon Haryana - 122 050 Contact Person - Babita  ","location":"Noida","experience":"2 - 7 Years"},{"date":"8 - Dec - 2020","skills":"Customer Service, Inbound Process, Customer Support","qualification":"Diploma, B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"SHARDA CENTRE, SHARDA CENTRE, OFF KARVE ROAD, ERANDWANA, PUNE","phone":"9168637999","profile":"   Customer Service Associates \nTech Mahindra Limited","description":"As the Unlock Process has already begun Tech Mahindra Limited is looking for Customer Service Associate (Work from Office as well as Work From Home) Qualification: 10+2 (6 months Exp )/ Any Graduate/ Diploma/ Post Graduate (Fresher) Mandatory language- English, Hindi/ Marathi Age Limit: 18 to 35 Years Required Skills: Candidate must have Basic computer knowledge Should have good communication skills Job Role/ Responsibility: Advises present or prospective customers by answering incoming calls on a rotating basis; operating telephone equipment, automatic dialling systems, and other telecommunications technologies. Documents transactions by completing forms and record logs. Shift Timing: - 24*7 Salary:- 180000 Lac PA 13200 (in hand) 4k -5k Stipend in 25 Days of training Interview Process:- Telephonic/ Walkin Contact Person: Mayuresh Call/ Whatsapp resume No - +91 9168637999 E mail - mj00642401@techmahindra.com  ","location":"Pune","experience":"0 - 1 Years"},{"date":"8 - Dec - 2020","skills":"HR/ Recruitment, Screening, End to end Recruitment, Sourcing, Shortlisting","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Chromachemie Laboratory Private Limited, VTPC, Model Export Bhavan, 488B, 14th Cross, Peenya Industrial Area, Bangalore \u0096 560 058","phone":"080-677012068","profile":"   HR Recruiter - Freshers \nChromachemie Laboratory Private Limited","description":"Qualification: Any Graduation BBA/ B.com Preferable looking for Fresher Good communication in English, Kannada. Near to Peenya location can preferable Job Responsivities- End to end Recruitment, Shortlisting, resume evaluation and first level of screening of suitable candidates over phone. lining up the candidates for interview. Maintaining and developing candidate database and trackers. Documentation/ verification Walk-in Date/ Time: 8th December 2020, 9.30 AM - 3.00 PM Venue Details- Chromachemie Laboratory Private Limited VTPC, Model Export Bhavan, 488B, 14th Cross, Peenya Industrial Area, Bangalore \u0096 560 058 Contact Person- Manjula M ? +91 948-069-1559 / ? - +91 8067-701-2068  ","location":"Bangalore","experience":"0 - 1 Years"},{"date":"8, 9, 10, 11 - Dec - 2020","skills":"Technical Support, IT Helpdesk/ Service Desk, Networking","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Wings International Group, D.No. 60-20-4, 1st floor, Twinkle Residency, Back side lane of Heritage Building, Sunnapubattila Centre, Vijayawada - 520 008.","phone":"9032233456","profile":"   Technical Support Engineer \nWings International Group","description":"Qualification : B.Tech/ MCA/ BCA/ B.Sc.-IT 2018, 2019, 2020, 2021 with 60% in all academics. Work Experience: Freshers/ 0 to 1 Year Must have good communication skills Job Location : Bangalore, Chennai Rotational Shift Ready to Relocate Package : 2.20 Lakhs PA Walk-in Date/ Time: 8th - 11th December 2020, 10.00 AM - 5.30 PM Venue Details- Wings International Group, D.No. 60-20-4, 1st floor, Twinkle Residency, Back side lane of Heritage Building, Sunnapubattila Centre, Vijayawada - 520 008. Contact Person- Suman Chandra (9032233456) Mail your resumes to cmd@wingsinternational.in  ","location":"Vijayawada","experience":"0 - 1 Years"},{"date":"8, 9, 10, 11, 14, 15, 16, 17 - Dec - 2020","skills":"Technical Support, International Voice Process, Networking","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Concentrix Daksh Services India Pvt. Limited, Fortune Towers, 200 Ft. Radial Road, Kovilambakkam, Chennai - 600 117.","phone":"9384631662","profile":"   Technical Support Engineer \nConcentrix Daksh Services India Pvt. Limited","description":"Qualification: Graduates / Undergraduates or Diploma Holders (Arrears/Backlogs can be considered) 2020 passed outs are eligible . Knowledge in Networking, Hardware \u0095 Operating systems- OS \u0095 Server Technology SQL server, GPO \u0095 Hardware storage \u0095 System Securities Knowledge in Antivirus Ability to work well under pressure with high attention to detail Excellent English communication ( Both Oral & Written) and interpersonal skills Ability to work in a team or as a single contributor Adaptability / Flexibility on shifts, Ownership and initiative Being Active & Energetic Roles and Responsibilities- Handling calls & resolving enterprise level customer tickets, forensic work based on virus related issues, handling escalation calls, resolving tickets based on SLA, following internal process & keeping self-updated Work Shifts/ Hours: Rotational shift ( flexible with both Day & night shifts) Walk-in Date/ Time: 8th - 17th December , 10.30 AM - 5.30 PM Venue Details- Concentrix Daksh Services India Pvt. Limited, Fortune Towers, 200 Ft. Radial Road, Kovilambakkam, Chennai - 600 117. Contact Person- BLESSO/ KRITHIKA  ","location":"Chennai","experience":"0 - 3 Years"},{"date":"7, 8, 9, 10 - Dec - 2020","skills":"Java & SQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Rootware Technologies, 917/918 Clover Hills Plaza, NIBM Road Kondawa, Pune - 411 048.","phone":"Not Provided","profile":"   Java Trainee/ Software Engineer \nRootware Technologies","description":"Candidate should be BE/ B.Tech/ M.Tech/ BCA/ MCA or M.Sc (Computer Science) with 0 to 2 years of experience in Java, Advanced Java and SQL. Must have excellent communication skills. Job Responsibilities- To monitor business and application requirements, Resolve Technical issues, raise tickets and generate daily reports. Basic knowledge on Java & SQL. Be a great team player, strive for challenges with a do- what- ever- it- takes Walk-in Date/ Time: 7th December - 10th December , 9.30 AM - 2.00 PM Venue Details- Rootware Technologies 917/918 Clover Hills Plaza, NIBM Road Kondawa, Pune - 411 048. Contact Person- Shalini Karolia  ","location":"Pune","experience":"0 - 2 Years"},{"date":"7, 8, 9, 10, 11, 12 - Dec - 2020","skills":"IT Recruitment, Sourcing/ Hiring, Interviewing, Technical Recruitment, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Multi Recruit, 103, Above Anurga Show Room, Bull Temple Road, Bangalore - 560033","phone":"Not Provided","profile":"   HR Executive/ Recruiters \nMulti Recruit","description":"Candidate must have good knowledge and experience in IT hiring (Sharepoint, Web developers, Web designers, HADOOP, Software Trainers, Server Admins, Software Engineers, Application Developers etc). Excellent written and oral (phone) communication skills a MUST. Must have ability to build strong relationships. Self-confidence and self-starter. Good sense of humour. Roles & Responsibilities: Source, interview, and select applicants for various positions. Sound knowledge on Sourcing Candidates thru RESDEX, Monster & various Job Sites. Foster long-term relationships with candidates and clients. Sourcing from different job boards. Excellent knowledge in Boolean function & usage of various job board database. Draft job descriptions, push them through all talent acquisition channels and coordinate candidate sourcing with the same. Doing junior to middle-level hiring for all IT verticals. Review applicants to verify if position requirements are met. Format resumes meeting client expectations. Telephonic Screening of the profiles checking for Technical Fitment, Behavioural Fitment, Stability etc. Utilize your innovative and effective convincing and negotiation skills to impress and attract top talent. Follow up with candidates and client and maintain records of progress. Walk-in Date/ Time: 7th December - 12th December , 9.30 AM - 5.30 PM Venue Details- Multi Recruit 103, Above Anurga Show Room, Bull Temple Road, Bangalore-560033 Contact Person- Champa  ","location":"Bangalore","experience":"3 - 8 Years"},{"date":"5, 7, 8, 9, 10, 11, 12 - Dec - 2020","skills":"Recruitment, Job Posting, Mass Mailing, Part Time/ Work from Home","qualification":"Diploma, B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Continent Trip Services Private Limited, Block A 61 seven Wonder Tower Sector 16, Noida","phone":"9315127145","profile":"   HR Recruiter/ Support (Work from Home) \nContinent Trip Services Private Limited","description":"We need friendly male/ female candidates who have basic information of computer Work for 2 to 3 hour per day and earn up to 6k per week as a part time or home based worker. We are offering: 1. Day shift/ No Targets/ No Calling/ No Product Selling. 2. Work from home & earn huge weekly income (6000 to 7000 weekly) This position is open for people in service/ business/ college. Even retired/ housewives/fresher can join us. Walk-in Date/ Time: 3rd - 12th December 2020, 9.30 AM - 5.30 PM Venue Details- Continent Trip Services Private Limited Block A 61 seven Wonder Tower Sector 16, Noida Contact - HR SRISHTI ( 9315127145 )  ","location":"Delhi, Noida, Gurgaon","experience":"0 - 3 Years"},{"date":"5, 7, 8, 9, 10, 11, 12, 13 - Dec - 2020","skills":"Customer Relationship, Sales/ Business Loan, Cross Selling","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Axis Bank Limited, No 19 Diamond Arcade, 2nd floor, 60 feet Road, Sahakaranagar Bangalore -560092.","phone":"7892083828","profile":"   Relationship Officer \nAxis Bank Limited","description":"Graduates or Under Graduates are considered Good understanding of the customer profiles, markets, and products and good networking skills. 0-5 years of sales experience (Fresher's can also apply). Willing to travel as per business requirements. Experience in retail lending would be an added advantage & Sales Driven, Detail orientated process discipline, and good organizational discipline. Perks and Benefits- 17,000 - 17500 CTC per month + Incentives Roles & Responsibilities- Need to handle sales of loan products (LAP/Personal loan/Home loan/Business loan) Need to implement strategies towards enhancing market penetration, business volumes, and growth through multiple channels via the said Sales Managers. Driving cross-sell products and ensure internal & external customer satisfaction. Interested Prospects can walk-in to below mentioned venue for interview Axis Bank Limited, No 19 Diamond Arcade, 2nd floor, 60 feet Road, Sahakaranagar Bangalore -560092. Interview Dates: 4th Dec to 12th Dec'2020 Contact Person: Mamatha / Mahesha (7892083828)  ","location":"Bangalore","experience":"0 - 5 Years"},{"date":"12 - Dec - 2020","skills":"Lead Generation, Field Sales, Customer Acquisition, Saving Account","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Kotak Mahindra Bank Limited, A-3/12, Janakpuri, New Delhi- 110058","phone":"Not Mentioned","profile":"   Assistant Acquisition Manager \nKotak Mahindra Bank Limited","description":"We have Urgent openings for Assistant Acquisition Manager- CASA -Sales for Central & West Delhi location. Designation: Assistant Acquisition Manager- CASA (Sales) Grade: M1 - Assistant Manager (On the payroll of Kotak Mahindra Bank) CTC Offered- Upto 2.7 LPA Job Profile- To source customers for Current Account & Saving Account. Customers to be sourced from individuals, small businesses, trusts, associations, societies, corporates. Revenue Generation, Customer Acquisition, Customer Retention, Cost Efficiency Through Process Hardcore sales mentality. Primary motivation from the achievement of targets. A hunter by orientation. Job Requirement- Must be a Graduate with Fair English communication skills Must have Field Sales Exposure and willing to hunt in the open market Preferred candidate From banking, Insurance, Stockbroking & NBFC Should be well-groomed and presentable with ambassadorship qualities Maximum Age Limit - 27 Years Note - Candidate Must have basic knowledge of Banking products & Role which he applied for. Interview Date: 12th December 2020 Timing: 11:00 AM to 2:30 pm Interview Venue: Kotak Mahindra Bank Limited A-3/12, Janakpuri, New Delhi- 110058 Contact Person: Brajender Singh  ","location":"Delhi","experience":"1 - 4 Years"},{"date":"5, 7, 8, 9, 10, 11, 12 - Dec - 2020","skills":"HR Generalist Activities, Human Resource Management, HR Administration","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Accord Selection Services, 402, 4th Floor, Centre Square, Opp. Bharat Petrol Pump, S.V. Road, Near Station, Andheri (West), Mumbai - 58","phone":"020-40144716","profile":"   HR Cum Admin Executive \nAccord Selection Services","description":"Candidate must be a Graduate with good communication skills in English 5 to 7 years experience as a HR cum Admin Executive Knowledge of Computer is must Age below 33 years Handling Recruitment, Payroll, Leave Records, Legal Compliances Candidates staying between Santacruz to Goregaon & Ghatkopar will be considered Place of work : Andheri - East - MIDC Salary : Rs.25000 to 30000 per month Walk-in Date/ Time: 3rd December - 12th December , 11.00 AM - 4.00 PM Venue Details- Accord Selection Services 402, 4th Floor, Centre Square, Opp. Bharat Petrol Pump, S.V. Road, Near Station, Andheri (West), Mumbai - 58 Tel no. : 40144716 / 26283616 / 26287682 Free Service to Candidates Office  ","location":"Mumbai","experience":"5 - 7 Years"},{"date":"7, 8, 9, 10, 11, 12, 14, 15, 16 - Dec - 2020","skills":"C#, LINQ, XSLT, Web Services, XML, .Net, Web Technologies","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Avani Infosoft Private Limited, No 1, 1st Floor, 2nd Stage, Kamakshipalya Police Station, NHBCS Layout Basaveshwara Nagar Bangalore - 560079.","phone":"Not Provided","profile":"   Senior .Net Developers \nAvani Infosoft Private Limited","description":"Person must have strong experience in C#, LINQ, XSLT, Web Services, XML, .Net, Web Technologies, MVC, HTML, SQL .NET, C#, Web Services, Desktop Application, LINQ, XML / XSLT. Exposure in MVP/ MVC architecture. Min 4+ years' experience developing object oriented. Interview Date: 7th - 16th December 2020 Timings: 9.30 AM - 5.30 PM Interview Venue- Avani Infosoft Private Limited No 1, 1st Floor, 2nd Stage, Kamakshipalya Police Station, NHBCS Layout Basaveshwara Nagar Bangalore - 560079. Contact Person- Adithi  ","location":"Bangalore","experience":"1 - 6 Years"},{"date":"4 - Dec - 2020","skills":"Back office, Non voice Process, Data entry Operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Spartan Organization, Shital Puri Chowk Ukhri Road Baldeo Bagh, Next to 360 Degree Cafe, Jabalpur MP - 482002","phone":"Not Provided","profile":"   Back Office Administrator \nSpartan Organization","description":"Candidate should be Any Graduate with good Presentation and Communication skills, Should have knowledge of Excel, MS Office with good typing speed Responsibilities- DATA ENTRY, FRONT OFFICE REPRESENTATIVE, INTERVIEW CALLING, REPORT GENERATION. Work Experience: 0 to 2 Years Walk-in Date/ Tiime: 4th December 2020, 10.30 AM - 12.30 PM Venue Details- Spartan Organization Shital Puri Chowk Ukhri Road Baldeo Bagh, Next to 360 Degree Cafe, Jabalpur MP - 482002 Contact Person- SPARTAN ORG ( 7057121629 )  ","location":"Jabalpur","experience":"0 - 2 Years"},{"date":"3, 4 - Dec - 2020","skills":"C/ C++/ Java/ PHP/ React/ Android/ iOS/ HTML/ CSS","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Radiansys Technologies Private Limited, Suite 1106 & 1107, JMD Megapolis, Sohna Road, Sector 48, Gurgaon, Haryana - 122 001","phone":"7080265588","profile":"   Software Engineer/ IT Freshers \nRadiansys Technologies Private Limited","description":"Radiansys is looking for Fresher Candidates who are passionate and have the zeal to explore new technologies - React, React Native, Vue, Node, JS, etc. Desired Qualification/ Skills- Must be graduate in B.Tech/ MCA with 65% marks Analytical thinker with good communication skills Should be a team player Recommend and execute improvements Problem-solving skills Interested to learn new things Good knowledge of in any one of the programming language - C/ C++/ Java/ PHP/ React/ Android/ iOS/ HTML/ CSS. Attention to details of the requirement. Roles and Responsibilities- Good understanding of technology practices and guidelines. Awareness of development methodologies like Agile. Promptness to come up with improvement suggestions for the assigned tasks and modules. Active involvement in extra-curricular activities like Coding Contests, Open Source Contributions, etc. Benefits- Challenging and exciting work assignments Fun place to work Continuous learning for Professional and Personal Development Walk-in Date/ Time: 3rd - 4th December 2020, 10.00 AM - 5.00 PM Venue Details- Radiansys Technologies Private Limited Suite 1106 & 1107, JMD Megapolis, Sohna Road, Sector 48, Gurgaon, Haryana - 122 001 Contact Person- Suvrat Mishra (7080265588)  ","location":"Gurgaon","experience":"0 - 1 Years"},{"date":"2, 3, 4 - Dec - 2020","skills":"Java, J2EE, Spring MVC, Hibernate, Spring Boot, MySQL and Mongodb","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Yagna Technologies Private Limited, Road No. 7, KPHB 7Th Phase, Hyderabad","phone":"9398614178","profile":"   Java Developer (Trained) Freshers \nYagna Technologies Private Limited","description":"Candidate should have good knowledge/ experience on Java, J2EE, Spring MVC, Hibernate Must have knowledge on design patterns Knowledge on server deployments Work experience on Spring Boot Work experience in MySQL and Mongodb Knowledge on Microservices Knowledge on GIT Walk-in Date/ Time: 2nd - 4th December 2020, 12.30 PM - 5.30 PM Venue Details- Yagna Technologies Private Limited, Road No. 7, KPHB 7Th Phase, Hyderabad Contact Person- Ankitha (9398614178)  ","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"2 - Dec - 2020","skills":"HR/ Recruitment, Sourcing, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Visionet Systems Private Limited, AMR Tech Park, Ground Floor, # 23 & 24, Hosur Main Road, Next to Oxford College of Engineering, Bengaluru Karnataka - 560 068","phone":"Not Provided","profile":"   HR Executive/ Recruiter \nVisionet Systems Private Limited","description":"We have opening for Recruiter For Visionet Systems Private Limited at Bangalore Work Experience: 1 - 5 Years The candidate will be responsible for Sourcing and Scheduling Should have good communication skills Must be comfortable to Work from Office Looking for immediate Joiner Interested candidates can Walk in to our office directly Walk-in Date/ Time: 2nd December 2020, 10.30 AM - 3.00 PM Venue Details- Visionet Systems Private Limited AMR Tech Park, Ground Floor, # 23 & 24, Hosur Main Road, Next to Oxford College of Engineering, Bengaluru Karnataka - 560 068  ","location":"Bangalore","experience":"1 - 5 Years"},{"date":"2 - Dec - 2020","skills":"Java/ J2ee, Core Java","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"QDegrees Services Private Limited, B-9, 1st Floor, Mahalaxmi Nagar, Behind WTP South Block, Jaipur","phone":"Not Provided","profile":"   Operations Executive (Logistics) \nQDegrees Services Private Limited","description":"QDegrees Services Private Limited is hiring for Operations Profile for the Udaipur location. Candidate should be Any Graduate 2 to 7 years of experience in Voice Process, Logistics Operations, International BPO. Must have excellent communications skills. Willing to work in rotational shifts, and with an analytical mindset ONLY walk into our office to discuss the possibilities. Walk-in Date/ Time: 2nd December 2020, 10.00 AM - 7.00 PM Venue Details- QDegrees Services Private Limited B-9, 1st Floor, Mahalaxmi Nagar, Behind WTP South Block, Jaipur Contact - Human Resource Department  ","location":"Jaipur","experience":"2 - 7 Years"},{"date":"5 - Dec - 2020","skills":"Software Testing, Automation tools like Selenium, JMeter, Rest-assured","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Techwave Consulting India Private Limited, Level 4, Building No. H6, Phoenix Avance Business Hub, Hitech City, Hyderabad","phone":"Not Provided","profile":"   Automation Testing Engineer \nTechwave Consulting India Private Limited","description":"Candidate must have strong experience with Automation tools like Selenium, JMeter, Rest-assured with good coding skills. Experience in API testing using Postman, Cucumber framework. Should have knowledge of DevOps CI pipeline. Basic Java programming skills with Java 8 Should have experience in designing of frameworks, methodologies Having excellent written and verbal communication Experience with Agile Scrum Methodology Experience on Jira and Confluence Experience with Linux, Unix (optional) Roles & Responsibilities: Understanding the customer requirements Collaborate with other team members to verify and validate deliverables Quickly produce well organized, optimized, and documented test cases Should be able to work independently Should always meet the customer expectations Acquiring knowledge on customers business processes and enhancements Continuously learn and improve skills Walk-in Date: 5th December 2020 (Saturday) Timings: 10:00 AM to 3:00 PM Venue Details- Techwave Consulting India Private Limited Level 4, Building No. H6, Phoenix Avance Business Hub, Hitech City, Hyderabad  ","location":"Hyderabad","experience":"6 - 9 Years"},{"date":"1 - Dec - 2020","skills":"General Administration, Facilities Management, Travel Management, Process Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Royaloak Incorporation Pvt. Limited, Attapur Piller No 161 Beside Chroma Attapur, Hyderabad Telangana - 500048","phone":"6366386096","profile":"   Administration Executive \nRoyaloak Incorporation Private Limited","description":"Educational Qualification : Any Graduate Good leadership & Excellent communication Travelling id required. The ideal candidate would have experience in handling a Showroom in furniture / consumer durable / Home appliances / Modular kitchen / Consumer goods / Consumer electric . Job Responsibility: Plan and coordinate administrative procedures and systems devise ways to streamline processes. Manage schedules and deadlines. Monitor inventory of office supplies and the purchasing of new material with attention to budgetary constraints. Monitor costs and expense to assist in budget preparation. Organize and supervise other office activities. If your profile matches the above requirement and if you are interested in the above opening, kindly email your resume at the earliest attachment to careers@royaloakindia.com without changing the subject line. Walk-in Date/ Time: 1st December 2020, 2.00 PM - 6.00 PM Venue Details: Royaloak Incorporation Pvt. Limited Attapur Piller No 161 Beside Chroma Attapur, Hyderabad Telangana - 500048 Contact - Krishna ( 6366386096 ) For any other clarification please reach out to me at undersigned. Contact Person: Krishna Mobile No: 6366386096 Mail ID: hr.hyd@royaloakindia.com  ","location":"Hyderabad","experience":"0 - 2 Years"},{"date":"1 - Dec - 2020","skills":"PHP, CSS, Woocommerce, Javascript, HTML, MySQL Database","qualification":"B.E./B.Tech, MCA/PGDCA","address":"TechConfer Technology Private Limited, B-47, Ground floor , Sector -63, Noida. Nearest Metro Station Sector - 62","phone":"9667692478","profile":"   PHP Developers \nTechConfer Technology Private Limited","description":"Looking for Php Developers to Contribute in all phases of the development lifecycle Develop and deploy new features to facilitate related procedures and tools if necessary Follow industry best practices Job Responsibility- Write clean , well-designed code Produce detailed specifications Troubleshoot, test and maintain the core product software and databases to ensure strong optimization and functionality Walk-in Date/ Time: 27 November - 1st December , 12.00 PM - 4.00 PM Venue Details- TechConfer Technology Private Limited B-47, Ground floor , Sector -63, Noida. Nearest Metro Station Sector - 62 Contact Person- Sweety Singh (9667692478)  ","location":"Noida","experience":"0 - 1 Years"},{"date":"1 - Dec - 2020","skills":"Customer Service, Inbound Voice Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Teleperformance, 31, Chiranjeevi Layout Kempapura, Hebbal, Bangalore.","phone":"Not Provided","profile":"   Customer Support - Freshers (Voice Process) \nIntelenet Global Services Private Limited","description":"Qualification: Any Graduate/ Only Freshers need to apply Must have excellent communication skills English + any language is required Salary- 16231 CTC, 13200 take home Females Day Shift (7am to 8pm, any 9hours in this window) Males- Rotational shift 1 way cab is provided after training. 4pm to 1am Walk-in Date. Time: 24 November - 1st December , 10.00 AM - 4.00 PM Venue Details- Teleperformance- 31, Chiranjeevi Layout Kempapura, Hebbal, Bangalore. Contact Person- Balaj Email ID- Balaji.Suryanarayana@teleperformancedibs.com  ","location":"Bangalore","experience":"0 - 1 Years"},{"date":"2 - Dec - 2020","skills":"HR/ Recruitment, Talent Management, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Nimbus Adcom Private Limited, Block- E, E-89,Sector - 63, Noida.","phone":"9027423347","profile":"   HR Trainee / Executive \nNimbus Adcom Private Limited","description":"Position: HR Recruiter (Hiring for IT and Non-IT recruitment) Experience required 0.6 Months to 1 years. Salary: up to 12k(Work from office only) Location: Noida, sector-63. Interested candidates can contact on 902742347 or vidushi@nimbushire.com. Walk-in Date/ Time: 2nd December 2020, 9.30 AM - 5.30 PM Venue Details- Nimbus Adcom Private Limited Block- E, E-89,Sector - 63, Noida. Contact Person- Vidushi ( 9027423347 )  ","location":"Noida","experience":"0 - 1 Years"},{"date":"1, 2 - Dec - 2020","skills":"Java/ J2ee (Core Java, J2ee, Jsp, Servlet, Spring/ Hibernate/ Struts)","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Ojas Softech Private Limited, Block A - 139, Sector - 63, Noida - 201 301.","phone":"8447131703","profile":"   Java Developers \nOjas Softech Private Limited","description":"Candidate should have good hands on experience on Java/ J2ee (Core Java, J2ee, Jsp, Servlet, Spring/ Hibernate/ Struts). Must have good hands on Experience on Developing Java and web Application. Have knowledge about the basic database development skills like MySql, Tomcat. Walk-in Date/ Time: 1st December - 2nd December , 9.30 AM - 5.30 PM Venue Details- Ojas Softech Private Limited Block A - 139, Sector - 63, Noida - 201 301. Contact - Pooja Sinha (8447131703)  ","location":"Noida","experience":"2 - 4 Years"},{"date":"1, 2 - Dec - 2020","skills":"Automation frameworks using Selenium Webdriver with Java/ JavaScript","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Zoom ID: 956-748-03367","phone":"Not Provided","profile":"   QA/ Automation Tester \nAptify Software Development - SIPL","description":"If you are a MCM/ MCA/ MCS/ B.E and has extensively worked on creating Automation frameworks using Selenium Web driver with Java/ JavaScript. Has extensive knowledge on Junit/ TestNG, Maven, Jenkins, GIT/ TFS this is for you! If you are a passionate #QA Engineer with an eye for detailing, worked extensively in Manual and Automation testing, and has an experience ranging from 3 years to 10 years this is for you! Get into our virtual drive from the comfort of your home Virtual Walk-in: 1st - 2nd December, 2020 Time: 11am to 12 noon, 3pm to 4pm Zoom ID: 956-748-03367  ","location":"Pune","experience":"3 - 10 Years"},{"date":"1, 2 - Dec - 2020","skills":"Software Testing, Automation Testing, Manual Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Stemetric IT Solutions Private Limited, 101/A, 1st Floor, Plot #2, Above Karnataka Bank, Opposite to, Image Gardens Road, HITEC City, Hyderabad, Telangana - 500 081.","phone":"Not Provided","profile":"   Software Testing Engineer \nStemetric IT Solutions Private Limited","description":"We at Stemetric IT Solutions Private Limited are looking for Software Test Engineer Job Location: Hyderabad/ Bangalore/ Chennai Work Experience: 0 to 3 Years Prerequisite: Candidate should be Trained Or Experienced If your interested please come to Face to Face Interview Walk-in Date/ Time: 1st December - 2nd December , 10.30 AM - 1.00 PM Venue Details- Stemetric IT Solutions Private Limited 101/A, 1st Floor, Plot #2, Above Karnataka Bank, Opposite to, Image Gardens Road, HITEC City, Hyderabad, Telangana - 500 081. Contact Person - Sirisha HR Note : 2019-2020 Candidates are not Required  ","location":"Hyderabad","experience":"0 - 3 Years"},{"date":"1, 2, 3, 4, 5 - Dec - 2020","skills":"Php, Mysql, CSS, OOPS, HTML, Javascript, Jquery","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Novalnet e-Solutions Private Limited, 131 Erikarai Street, East Tambaram, Chennai - 600 059.","phone":"770822225","profile":"   PHP Developer/ Trainee \nNovalnet e-Solutions Private Limited","description":"Hiring PHP Developer/ Trainee for Creating & modifying the custom themes and plugin (payment plugin) for e-commerce shop system. Design, develop, maintain, analyse and troubleshoot the plugin & themes. A strong ability to understand the project requirements & Execute project plans. Walk-in Date/ Time: 1st - 5th December 2020, 11.00 AM - 1.00 PM Venue Details- Novalnet e-Solutions Private Limited, 131 Erikarai Street, East Tambaram, Chennai - 600 059. Contact Person- Salomi Mable ( 7708222259 )  ","location":"Chennai","experience":"0 - 1 Years"},{"date":"5 - Dec - 2020","skills":"ASP .NET, C# .Net, ASP .Net, ASP .Net MVC, ADO .Net, MS SQL, C#","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Freyr Software Services Private Limited, Level 4, Building No. H-08, Phoenix SEZ (Avance Campus) Back side of Cyber Gateway, HITEC City 2, Gachibowli, Hyderabad - 500 081.","phone":"040 4848 0999","profile":"   .Net Developers \nFreyr Software Services Private Limited","description":"Excellent Opportunity For .NET Developers With Freyr Software Services Pvt Limited in their Global Operations, Delivery and Development Center. Educational Qualification: Any Graduate/ Post Graduate Skills: ASP .NET, C# .Net, ASP .Net, ASP .Net MVC, ADO .Net, MS SQL, C# Candidate must have strong knowledge of C#, ASP .NET, MVC frameworks, JavaScript, Angular JS. Strong knowledge in developing Web Services, WCF, Web API. Understanding of object-oriented programming Skill for writing reusable libraries, design patterns/ best practices. Familiar with various design and architectural patterns, Microsoft SQL Server. Understanding of fundamental design principles for building a scalable application Experience in working with ADO. NET, Entity framework Proficient understanding of code versioning tools like TFS, SVN Experience in working with Kendo UI framework Experience on design patterns/best practices Hands on experience on automated unit testing framework like N Unit/ MS Test/ MOQ Hands on code review Knowledge on DevOps (CI-Continuous Integration and CD-Continuous Deployment) Direct Walk-ins on 5th December 2020 from 10 AM to 2 PM Venue details: Freyr Software Services Private Limited Level 4, Building No. H-08, Phoenix SEZ (Avance Campus) Back side of Cyber Gateway, HITEC City 2, Gachibowli, Hyderabad - 500 081. Landmark: Beside Dell Office Phone: +91 40 4848 0999 Note: Please carry the Copy of the above email for the interview process Candidates are requested to bring-one copy of resume, a valid photo identity card for security validation. As per COVID-19 safety protocols, all walk-in candidates are requested to wear masks, check temperature prior to walk-in, maintain social distancing and help us in maintaining a healthy environment.  ","location":"Hyderabad","experience":"1 - 5 Years"},{"date":"5 - Dec - 2020","skills":"ASP .NET, C# .Net, ASP .Net, ASP .Net MVC, ADO .Net, MS SQL, C#","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Freyr Software Services Private Limited, Level 4, Building No. H-08, Phoenix SEZ (Avance Campus) Back side of Cyber Gateway, HITEC City 2, Gachibowli, Hyderabad - 500 081.","phone":"040 4848 0999","profile":"   .Net Developers \nFreyr Software Services Private Limited","description":"Excellent Opportunity For .NET Developers With Freyr Software Services Pvt Limited in their Global Operations, Delivery and Development Center. Educational Qualification: Any Graduate/ Post Graduate Skills: ASP .NET, C# .Net, ASP .Net, ASP .Net MVC, ADO .Net, MS SQL, C# Candidate must have strong knowledge of C#, ASP .NET, MVC frameworks, JavaScript, Angular JS. Strong knowledge in developing Web Services, WCF, Web API. Understanding of object-oriented programming Skill for writing reusable libraries, design patterns/ best practices. Familiar with various design and architectural patterns, Microsoft SQL Server. Understanding of fundamental design principles for building a scalable application Experience in working with ADO. NET, Entity framework Proficient understanding of code versioning tools like TFS, SVN Experience in working with Kendo UI framework Experience on design patterns/best practices Hands on experience on automated unit testing framework like N Unit/ MS Test/ MOQ Hands on code review Knowledge on DevOps (CI-Continuous Integration and CD-Continuous Deployment) Direct Walk-ins on 5th December 2020 from 10 AM to 2 PM Venue details: Freyr Software Services Private Limited Level 4, Building No. H-08, Phoenix SEZ (Avance Campus) Back side of Cyber Gateway, HITEC City 2, Gachibowli, Hyderabad - 500 081. Landmark: Beside Dell Office Phone: +91 40 4848 0999 Note: Please carry the Copy of the above email for the interview process Candidates are requested to bring-one copy of resume, a valid photo identity card for security validation. As per COVID-19 safety protocols, all walk-in candidates are requested to wear masks, check temperature prior to walk-in, maintain social distancing and help us in maintaining a healthy environment.  ","location":"Hyderabad","experience":"1 - 5 Years"},{"date":"5 - Dec - 2020","skills":"ASP .NET, C# .Net, ASP .Net, ASP .Net MVC, ADO .Net, MS SQL, C#","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Freyr Software Services Private Limited, Level 4, Building No. H-08, Phoenix SEZ (Avance Campus) Back side of Cyber Gateway, HITEC City 2, Gachibowli, Hyderabad - 500 081.","phone":"040 4848 0999","profile":"   .Net Developers \nFreyr Software Services Private Limited","description":"Excellent Opportunity For .NET Developers With Freyr Software Services Pvt Limited in their Global Operations, Delivery and Development Center. Educational Qualification: Any Graduate/ Post Graduate Skills: ASP .NET, C# .Net, ASP .Net, ASP .Net MVC, ADO .Net, MS SQL, C# Candidate must have strong knowledge of C#, ASP .NET, MVC frameworks, JavaScript, Angular JS. Strong knowledge in developing Web Services, WCF, Web API. Understanding of object-oriented programming Skill for writing reusable libraries, design patterns/ best practices. Familiar with various design and architectural patterns, Microsoft SQL Server. Understanding of fundamental design principles for building a scalable application Experience in working with ADO. NET, Entity framework Proficient understanding of code versioning tools like TFS, SVN Experience in working with Kendo UI framework Experience on design patterns/best practices Hands on experience on automated unit testing framework like N Unit/ MS Test/ MOQ Hands on code review Knowledge on DevOps (CI-Continuous Integration and CD-Continuous Deployment) Direct Walk-ins on 5th December 2020 from 10 AM to 2 PM Venue details: Freyr Software Services Private Limited Level 4, Building No. H-08, Phoenix SEZ (Avance Campus) Back side of Cyber Gateway, HITEC City 2, Gachibowli, Hyderabad - 500 081. Landmark: Beside Dell Office Phone: +91 40 4848 0999 Note: Please carry the Copy of the above email for the interview process Candidates are requested to bring-one copy of resume, a valid photo identity card for security validation. As per COVID-19 safety protocols, all walk-in candidates are requested to wear masks, check temperature prior to walk-in, maintain social distancing and help us in maintaining a healthy environment.  ","location":"Hyderabad","experience":"1 - 5 Years"},{"date":"5 - Dec - 2020","skills":"ASP .NET, C# .Net, ASP .Net, ASP .Net MVC, ADO .Net, MS SQL, C#","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Freyr Software Services Private Limited, Level 4, Building No. H-08, Phoenix SEZ (Avance Campus) Back side of Cyber Gateway, HITEC City 2, Gachibowli, Hyderabad - 500 081.","phone":"040 4848 0999","profile":"   .Net Developers \nFreyr Software Services Private Limited","description":"Excellent Opportunity For .NET Developers With Freyr Software Services Pvt Limited in their Global Operations, Delivery and Development Center. Educational Qualification: Any Graduate/ Post Graduate Skills: ASP .NET, C# .Net, ASP .Net, ASP .Net MVC, ADO .Net, MS SQL, C# Candidate must have strong knowledge of C#, ASP .NET, MVC frameworks, JavaScript, Angular JS. Strong knowledge in developing Web Services, WCF, Web API. Understanding of object-oriented programming Skill for writing reusable libraries, design patterns/ best practices. Familiar with various design and architectural patterns, Microsoft SQL Server. Understanding of fundamental design principles for building a scalable application Experience in working with ADO. NET, Entity framework Proficient understanding of code versioning tools like TFS, SVN Experience in working with Kendo UI framework Experience on design patterns/best practices Hands on experience on automated unit testing framework like N Unit/ MS Test/ MOQ Hands on code review Knowledge on DevOps (CI-Continuous Integration and CD-Continuous Deployment) Direct Walk-ins on 5th December 2020 from 10 AM to 2 PM Venue details: Freyr Software Services Private Limited Level 4, Building No. H-08, Phoenix SEZ (Avance Campus) Back side of Cyber Gateway, HITEC City 2, Gachibowli, Hyderabad - 500 081. Landmark: Beside Dell Office Phone: +91 40 4848 0999 Note: Please carry the Copy of the above email for the interview process Candidates are requested to bring-one copy of resume, a valid photo identity card for security validation. As per COVID-19 safety protocols, all walk-in candidates are requested to wear masks, check temperature prior to walk-in, maintain social distancing and help us in maintaining a healthy environment.  ","location":"Hyderabad","experience":"1 - 5 Years"},{"date":"5 - Dec - 2020","skills":"ASP .NET, C# .Net, ASP .Net, ASP .Net MVC, ADO .Net, MS SQL, C#","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Freyr Software Services Private Limited, Level 4, Building No. H-08, Phoenix SEZ (Avance Campus) Back side of Cyber Gateway, HITEC City 2, Gachibowli, Hyderabad - 500 081.","phone":"040 4848 0999","profile":"   .Net Developers \nFreyr Software Services Private Limited","description":"Excellent Opportunity For .NET Developers With Freyr Software Services Pvt Limited in their Global Operations, Delivery and Development Center. Educational Qualification: Any Graduate/ Post Graduate Skills: ASP .NET, C# .Net, ASP .Net, ASP .Net MVC, ADO .Net, MS SQL, C# Candidate must have strong knowledge of C#, ASP .NET, MVC frameworks, JavaScript, Angular JS. Strong knowledge in developing Web Services, WCF, Web API. Understanding of object-oriented programming Skill for writing reusable libraries, design patterns/ best practices. Familiar with various design and architectural patterns, Microsoft SQL Server. Understanding of fundamental design principles for building a scalable application Experience in working with ADO. NET, Entity framework Proficient understanding of code versioning tools like TFS, SVN Experience in working with Kendo UI framework Experience on design patterns/best practices Hands on experience on automated unit testing framework like N Unit/ MS Test/ MOQ Hands on code review Knowledge on DevOps (CI-Continuous Integration and CD-Continuous Deployment) Direct Walk-ins on 5th December 2020 from 10 AM to 2 PM Venue details: Freyr Software Services Private Limited Level 4, Building No. H-08, Phoenix SEZ (Avance Campus) Back side of Cyber Gateway, HITEC City 2, Gachibowli, Hyderabad - 500 081. Landmark: Beside Dell Office Phone: +91 40 4848 0999 Note: Please carry the Copy of the above email for the interview process Candidates are requested to bring-one copy of resume, a valid photo identity card for security validation. As per COVID-19 safety protocols, all walk-in candidates are requested to wear masks, check temperature prior to walk-in, maintain social distancing and help us in maintaining a healthy environment.  ","location":"Hyderabad","experience":"1 - 5 Years"},{"date":"5 - Dec - 2020","skills":"ASP .NET, C# .Net, ASP .Net, ASP .Net MVC, ADO .Net, MS SQL, C#","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Freyr Software Services Private Limited, Level 4, Building No. H-08, Phoenix SEZ (Avance Campus) Back side of Cyber Gateway, HITEC City 2, Gachibowli, Hyderabad - 500 081.","phone":"040 4848 0999","profile":"   .Net Developers \nFreyr Software Services Private Limited","description":"Excellent Opportunity For .NET Developers With Freyr Software Services Pvt Limited in their Global Operations, Delivery and Development Center. Educational Qualification: Any Graduate/ Post Graduate Skills: ASP .NET, C# .Net, ASP .Net, ASP .Net MVC, ADO .Net, MS SQL, C# Candidate must have strong knowledge of C#, ASP .NET, MVC frameworks, JavaScript, Angular JS. Strong knowledge in developing Web Services, WCF, Web API. Understanding of object-oriented programming Skill for writing reusable libraries, design patterns/ best practices. Familiar with various design and architectural patterns, Microsoft SQL Server. Understanding of fundamental design principles for building a scalable application Experience in working with ADO. NET, Entity framework Proficient understanding of code versioning tools like TFS, SVN Experience in working with Kendo UI framework Experience on design patterns/best practices Hands on experience on automated unit testing framework like N Unit/ MS Test/ MOQ Hands on code review Knowledge on DevOps (CI-Continuous Integration and CD-Continuous Deployment) Direct Walk-ins on 5th December 2020 from 10 AM to 2 PM Venue details: Freyr Software Services Private Limited Level 4, Building No. H-08, Phoenix SEZ (Avance Campus) Back side of Cyber Gateway, HITEC City 2, Gachibowli, Hyderabad - 500 081. Landmark: Beside Dell Office Phone: +91 40 4848 0999 Note: Please carry the Copy of the above email for the interview process Candidates are requested to bring-one copy of resume, a valid photo identity card for security validation. As per COVID-19 safety protocols, all walk-in candidates are requested to wear masks, check temperature prior to walk-in, maintain social distancing and help us in maintaining a healthy environment.  ","location":"Hyderabad","experience":"1 - 5 Years"},{"date":"5 - Dec - 2020","skills":"ASP .NET, C# .Net, ASP .Net, ASP .Net MVC, ADO .Net, MS SQL, C#","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Freyr Software Services Private Limited, Level 4, Building No. H-08, Phoenix SEZ (Avance Campus) Back side of Cyber Gateway, HITEC City 2, Gachibowli, Hyderabad - 500 081.","phone":"040 4848 0999","profile":"   .Net Developers \nFreyr Software Services Private Limited","description":"Excellent Opportunity For .NET Developers With Freyr Software Services Pvt Limited in their Global Operations, Delivery and Development Center. Educational Qualification: Any Graduate/ Post Graduate Skills: ASP .NET, C# .Net, ASP .Net, ASP .Net MVC, ADO .Net, MS SQL, C# Candidate must have strong knowledge of C#, ASP .NET, MVC frameworks, JavaScript, Angular JS. Strong knowledge in developing Web Services, WCF, Web API. Understanding of object-oriented programming Skill for writing reusable libraries, design patterns/ best practices. Familiar with various design and architectural patterns, Microsoft SQL Server. Understanding of fundamental design principles for building a scalable application Experience in working with ADO. NET, Entity framework Proficient understanding of code versioning tools like TFS, SVN Experience in working with Kendo UI framework Experience on design patterns/best practices Hands on experience on automated unit testing framework like N Unit/ MS Test/ MOQ Hands on code review Knowledge on DevOps (CI-Continuous Integration and CD-Continuous Deployment) Direct Walk-ins on 5th December 2020 from 10 AM to 2 PM Venue details: Freyr Software Services Private Limited Level 4, Building No. H-08, Phoenix SEZ (Avance Campus) Back side of Cyber Gateway, HITEC City 2, Gachibowli, Hyderabad - 500 081. Landmark: Beside Dell Office Phone: +91 40 4848 0999 Note: Please carry the Copy of the above email for the interview process Candidates are requested to bring-one copy of resume, a valid photo identity card for security validation. As per COVID-19 safety protocols, all walk-in candidates are requested to wear masks, check temperature prior to walk-in, maintain social distancing and help us in maintaining a healthy environment.  ","location":"Hyderabad","experience":"1 - 5 Years"}]}