{"Walkins":[{"date":"17, 18, 19, 20, 21 - Jun - 2019","skills":"Travel Desk Hotel Booking Ticket Booking Ticketing","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"LTA School of Beauty, Ground Floor, Ramji Ashar Building, M.G Road, Ghatkopar (East), Mumbai. Behind Netram Optics/ My toys Shop, Opposite Pooja Hotel","phone":"7227002604","profile":"Travel Desk Cum Admin Executive \nFiabila India Private Limited","description":"Candidate should be Any Graduate with 1 to 2 years of relevant experience in the same field. Should have basic knowledge of Travel Desk Rail Ticket booking, Hotel Booking. Must have basic knowledge of Excel skills & Good Mail Drafting skills Should have excellent communication Skills Job Location: Ghatkopar (East) Salary: INR 1,25,000 - 3,00,000 P.A No. of Openings: 2 Walk-in Date/ Time: 17th June - 21st June , 10 AM onwards Interview Venue: LTA School of Beauty Ground Floor, Ramji Ashar Building, M.G Road, Ghatkopar (East), Mumbai Landmark: Behind Netram Optics/ My toys Shop, Opposite Pooja Hotel","location":"Mumbai","experience":"1 - 2 Years"},{"date":"17, 18, 19, 20 - Jun - 2019","skills":"Desktop Support & Linux OS, Printer Installation Support","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"OCS Group (India) Private Limited, Hiranandani Fortune City, Takka Raod, Near Kings Electronics, Panvel, Navi Mumbai","phone":"9137841023","profile":"Collection cum Admin Executive \nOCS Group (India) Private Limited","description":"Candidate should be Any Garduate with 3 to 6 years of experience in General Administration, Back Office Activities and Collections. Must have good communication skills. Job Responsbility- 1) Maintenance collection real estate 2) General Administration Walk-in Date/ Time: 14th June - 20th June , 12 AM onwards Interview Venue: OCS Group (India) Private Limited Hiranandani Fortune City, Takka Raod, Near Kings Electronics, Panvel, Navi Mumbai Contact Person: Nandini (HR) Tel: 9137841023","location":"Mumbai","experience":"3 - 6 Years"},{"date":"17, 18 - Jun - 2019","skills":"Technical Support, HTML, Java Script & CSS","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"HCL Bserv (N5), A-22, Sector 60, Noida","phone":"Not Provided","profile":"Technical Support Engineer \nHCL Technologies Limited","description":"Candidate should have 0 to 5 years of experience/ knowledge of HTML, Java Script & CSS. Should have experience in Support activities like trouble shooting. Must have excellent English Communication skills (Both Written and Spoken). This is a Support Role, knowledge on coding and testing in above technologies will be given preference Job Responsbility- L1 & L2 Support Providing support to Online advertising products (DFP, DFA) Online advertising domain knowledge is a definite plus. Level of Interest: Willingness to work in Night shift US Shifts (24/ 5) Cab facility for the employees (M/F) Charges applicable for Male employees (within the radius of 20 KMS/ 35 KMS from Work Location) Willingness to work at Client location on HCL Payroll Work Location: Gurgaon Salary best in the industry (FREE Meals and Snacks) Walk-in For Face to Face interaction at the below venue: Dates :17th and 18th June 2019 Time: 10:00 AM - 2 PM Interview Venue: HCL Bserv (N5), A-22, Sector 60, Noida Contact HCL Recruiter: Raveender Interview Details: Face to Face interview session. Technical Tests (written & verbal) - video call English Test (written & verbal) - video call Candidates who have cleared their Graduation (result declared) Fresher & Experienced both are eligible","location":"Gurgaon","experience":"0 - 5 Years"},{"date":"15 - Jun - 2019","skills":"Core Java, Java frameworks Hibernate, OSGi, Spring, MySQL, JDBC, NoSQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Aricent Technologies (ALTRAN) Tower 5, Ground Floor, IT/ ITES SEZ, M/s Candor Gurgaon One Realty Projects Pvt. Ltd., Village Tikri, Sector - 48, Sohna Road, Gurgaon - 122 018","phone":"Not Provided","profile":"Core Java Developer \nAltran Technologies India Pvt. Limited","description":"Engineering Graduate or MCA between 3 to 6 years of work experience Design and development of Web applications Ability to work independently, multi-task, and take ownership of various parts of the project Strong Knowledge of Core Java, Java frameworks Hibernate, OSGi, Spring Good working experience of Junit, Mockit, Maven, Ant Detailed expertise of design patterns, multi-threading design and network technologies One or more Web technologies like Java Script, Angular JS Good to have- Database access technologies - MySQL, JDBC, NoSQL (MongoDB, Elastic Search) Experience of working on development tools like SVN, GIT, Jenkins Troubleshooting and performance tuning experience Good to have experience in concurrency, efficient data processing and optimal memory storage Walk-in Date: 15th June' 2019 Timings: 10:00 AM - 2:00 PM Interview Location : Aricent Technologies(ALTRAN) Tower 5, Ground Floor, IT/ ITES SEZ, M/s Candor Gurgaon One Realty Projects Pvt. Ltd., Village Tikri, Sector - 48, Sohna Road, Gurgaon - 122 018","location":"Gurgaon","experience":"3 - 6 Years"},{"date":"17, 18, 19, 20, 21 - Jun - 2019","skills":"Core Java Advanced Java Spring Framework Eclipse IDE Multithreading Design Patterns","qualification":"B.E./B.Tech","address":"Agnity Communication Pvt. Limited, C-42, Sector 58, Noida. Landmark- Opposite to Hyundai Showroom.","phone":"Not Provided","profile":"Java Developers \nAgnity Communication Private Limited","description":"Candidate should have BE/ B.TECH degree in Computer Science. Should have a minimum of 2+ years of relevant working experience realized in product development in distributed environment using Java technologies. Skills Required: Self Motivated Excellent analytical and problem-solving abilities Should need minimum directions and is an excellent team player. Good Verbal and written communication skills. Should have good expertise in Linux Sockets programming and Multithreading Excellent Java programming skills. Good Exposure to Unix shell scripting is a plus Familiarity with Eclipse IDE, JProbe and related tools is a plus Exposure to application servers. Responsibilities: Proven ability to analyze problems and implement solutions that is optimized for performance, scalability, quality, and maintainability. Can work independently and lead a team of expert engineers and set new examples. Quickly able to take on new challenges and keep the team motivation high. Walk-in Date: 17th to 21st June 2019 Time: 11:00 AM - 4:00 PM Interview Venue: Agnity Communication Pvt. Limited C-42, Sector 58, Noida Landmark- Opposite to Hyundai Showroom Kindly share resume at pragati.tyagi@agnity.com","location":"Noida","experience":"2 - 5 Years"},{"date":"15 - Jun - 2019","skills":"Core Java/ J2EE, Jsp/ Servlets, Struts, Enterprise Java Beans (EJB), Web Services","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Tata Consultancy Services Limited, Deccan Park, Plot No.1, Software Units Layout, Madhapur, Hyderabad, Telangana - 500 081","phone":"Not Provided","profile":"Java Developers \nTata Consultancy Services Limited","description":"Technical/ Functional skills: Core Java/ J2EE (Jsp/ Servlets, Struts, Enterprise Java Beans (EJB), Web Services, MVC,Springs), Javascript and JQuery. Requirements Analysis, Design, Coding, Unit testing and Defect fixing Technical oversight and grooming the team members. Need to ensure overall project delivery quality is good and on time delivery is done at all times. He/she should require high technical leadership quality and should be willing to take lots of initiatives Should act as a solution developer. Offshore onshore coordination. - Work delegation and status reporting to customer on a daily or need basis. - Preparing weekly and monthly status reports and presenting to the customer. - Involvement in defect root cause analysis and process improvements. - Should be able to handle meetings with customers with ease. - Need to have excellent communication skills to interact with customer. Eligibility Criteria: 1. 2 to 5 years of working experience 2. Notice period : Immediate 3. Should have good communication skills. 4. Minimum 15 years of regular education (10th + 12th + 3 years Graduation) 5. Graduates through Open Universities / Correspondence graduates need not apply 6. Not more than 2 years of gap in Education or Employment. 7. Candidates who have attended the interview process in the last 6 months will not be eligible to apply again. 8. Willingness to work in any shifts including night shifts. Mandatory Requirements - (EPCN Registration Number) (How to generate your EPCN)? EPCN number is mandatory for eligibility of the interview. Follow the below steps to register and mention the EPCN number on your resume Step 1: Go to link www.careers.tcs.com Step 2: Select India geography & next click on Experienced Professionals link Step 3: Go to create your profile (For New Users) link & fill the details. (Please select area of interest as BPO) Step 4: You will get the EPCN number & Password to your personal e-mail ID. Walk-in Date/ Time: 15th June 2109, 11 AM onwards Interview Venue: Tata Consultancy Services Limited Deccan Park, Plot No.1, Software Units Layout, Madhapur, Hyderabad, Telangana - 500 081 (Kindly carry 2 copies of your resume and a government id proof at the time of interview) Reference: It is mandatory to write Subhashree & EPCN Number as reference on top of your resume","location":"Hyderabad","experience":"2 - 5 Years"},{"date":"17, 18 - Jun - 2019","skills":"JAVA/ PHP, HTML, CSS, Javascript, MySQL, & Google App Scripts","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Capline Services Private Limited, C-120, 2nd Floor, Sector - 2, Noida","phone":"9355650666","profile":"Software Developer (Php/ Java) \nCapline Services Private Limited","description":"We are hiring candidates for Software Developer profile. Require the candidate with the ability of Multitasking and having a dynamic personality who can serve the organization for the long run.. Proficient in HTML, CSS, Javascript, MySQL, & Google App Scripts. Knowledge of JAVA/ PHP, Software Development. Good interpersonal relationship and having a team working spirit. Must be an excellent communicator in English Roles, Responsibilities- Responsible for automating the tasks performed manually (in google Apps). Coordinating with the third party software service to scope out new implementations in currently running systems and determine feasibility for any new services required. Work on bugs and other issues that may arise in the custom software during day to day work. Working on database using MySQL to update data in google sheets for use by associates. Research and provide solutions and new applications to improve productivity. Develop web applications for in house use and/or use by clients. Salary : 2.00 LPA to 3.50 LPA Week Off : Saturday & Sunday Fixed Off Notice Period : Immediate joiners required / 15 days preferable Shift : Night Shift We are looking for Male candidates only. Walk-in Date/ Time: 17th - 18th June , 11 AM onwards Interview Venue: Capline Services Private Limited C-120, 2nd Floor, Sector - 2, Noida Interested candidates can drop an email at jobs@caplineservices.com / nishameena@caplineservices.com Please contact Nisha-0120-4133868 If you have any query or question.","location":"Noida","experience":"1 - 3 Years"},{"date":"15 - Jun - 2019","skills":"Core Java, Spring, MVC, Hibernate, Javascript, JQuery Angular JS, HTML & JSP","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Onward Group 144, 5th floor, Rayala Techno Park, 7, Old Mahabalipuram Roadd, Kottivakkam, IGP, Chennai - 600 041","phone":"044-66422822","profile":"Core Java Developer \nOnward Technologies Limited","description":"Looking for a Java Developer with very good hands on experience in the following- Core Java Spring MVC Hibernate Javascript & JQuery Angular JS HTML & JSP DB - PostgreSQL Struts 1.2.9 Walk-in Date/ Time: 15th June , 9 AM onwards Interview Venue: Onward Group 144, 5th floor, Rayala Techno Park, 7, Old Mahabalipuram Roadd, Kottivakkam, IGP, Chennai - 600 041 Phone No. 044-66422822 Interested, kindly share your updated resume to arun_selvaraj@onwardgroup.com","location":"Chennai","experience":"2 - 5 Years"},{"date":"17, 18, 19, 20, 21 - Jun - 2019","skills":"Java, Android, .NET, Testing and SQL","qualification":"B.E./B.Tech","address":"Dhanush Infotech Private Limited, 1-8-448, Laxmi Building, 6th Floor, S P Road, Begumpet, Hyderabad - 500 003","phone":"040 30145516","profile":"Java/ .Net Developer (Freshers) \nDhanush Infotech Private Limited","description":"At Dhanush Infotech, we are currently hiring - Trainee in different skills like (Java, Android, .NET, Testing and SQL - Trained) candidates. Eligibility Cretria: Must be from BE/ B.Tech (CS/ IT) background With more than 60% Percentage Passed in 2018 & 2019 only Required Skills: Good in Technical Skills Java, .Net. Sql Good in Communication skills Walk-in Date: 17th to 21st June 2019 Time: 9 AM onwards Interview Venue: Dhanush Infotech Private Limited 1-8-448, Laxmi Building, 6th Floor, S P Road, Begumpet, Hyderabad - 500 003 Phone No. 040 30145516 Mobile: +916304993561","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"15 - Jun - 2019","skills":"Core Java, Multi Threading, Spring/ Struts , Hibernate and MySQL/ Oracle","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Corent Technology Private Limited, III Floor, MCM Towers, Super-B-3, Thiru Vi Ka Industrial Estate, Guindy, Chennai - 600 032","phone":"Not Provided","profile":"JAVA Professionals \nCorent Technology Private Limited","description":"Corent Technology Private Limited, is looking for JAVA Professionals with the below skill sets- Role : Software Engineer for Java (SE) Experience : 2 to 4 years Experience of working in an agile environment. Minimum of 2+ years of experience with Core java, Multi Threading, Spring/Struts , Hibernate and MySQL/Oracle. Learn new technologies. Role : Senior Software Engineer for Java (SSE) Experience : 4 to 6 years Experience of working in an agile environment. Minimum of 3+ years of experience with Core Java, Multi Threading, Spring/ Struts , Hibernate and MySQL/ Oracle. Learn new technologies. Make informed decisions quickly and taking ownership. Experience in team handling will be an added advantage. Notice Period: Immediate to 30 days Mode of Interview: Technical Discussion HR Discussion Walk-in Date: 15th June 2019 Timings: 10:00 AM to 1:00 PM Interview Venue: Corent Technology Private Limited III Floor, MCM Towers, Super-B-3, Thiru Vi Ka Industrial Estate, Guindy, Chennai - 600 032 Landmark: Next to RR Tower III, Opposite to Guindy EB Office Contact Person: Surekha Please do carry a copy of this posting/ mail along with your resume.","location":"Chennai","experience":"2 - 6 Years"},{"date":"19 - Jun - 2019","skills":"Java, Spring, Hibernate, Web Services","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"SunTec Business Solutions Pvt. Limited, Citi Tower, 7, 3rd Cross Street Kasturibai Nagar, Adyar Chennai - 600 020","phone":"Not Provided","profile":"Java Developer \nSunTec Business Solutions Pvt. Limited","description":"Candidate should have good experience as JAVA Developer Must have good understanding of front end development Strong understanding of database management and programming Good experience in Spring, Hibernate, Web Services Walk-in Date/ Time: Date: 19th June from 9 AM onwards Interview Venue: SunTec Business Solutions Pvt. Limited Citi Tower, 7, 3rd Cross Street Kasturibai Nagar, Adyar Chennai - 600 020 Interested candidates may forward their updated CVs to jithub@suntecgroup.com","location":"Chennai","experience":"1 - 6 Years"},{"date":"17, 18, 19 - Jun - 2019","skills":"Manual Testing, Smarteam, ENOVIA, Test Cases, Quality Assurance","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Itemperance Consulting Pvt. Limited, B-36, Ground Floor, Sector-59, Noida.","phone":"0120-4221295","profile":"Java Developer \nItemperance Consulting Pvt. Limited","description":"Candidate should be having experience in Java (Core and J2EE), Should be having a working knowledge on frameworks such as Spring & Hibernate, Knowledge of any of the web server (Tomcat, Web logic, JBoss or GlassFish) Proficient in Data structure & Algorithm and OOPs. Must be able to multi-task among multiple assignments Excellent critical thinking and decision making skills Excellent written and oral communication skills Confident presenter of concepts / ideas / solutions. We would be conducting walk-in interviews on below dates: 17th to 19th June, 2019 Timing- 10 AM - 5 PM Interview Location: Itemperance Consulting Pvt. Limited B-36, Ground Floor, Sector-59, Noida. Please carry a copy of your updated resume on the day of your interview","location":"Noida","experience":"3 - 4 Years"},{"date":"15 - Jun - 2019","skills":"General Administration Housekeeping Vendor Mgmt/ Bill processing Inventory Management Procurement","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"RAMTeCH Software Solutions Pvt. Limited, A-6, Sector 67 Noida","phone":"Not Provided","profile":"Admin Executive (Only Male) \nRamtech Software Solutions Pvt. Limited","description":"Ramtech Software Solutions Pvt. Limited, is looking for Admin Executive profile (ONLY MALE) Educational Qualification: Any Graduate Work Experience: 2 to 4 Years Must have bike Responsibility- General Administration Housekeeping Vendor Mgmt/ Bill processing Inventory Management Procurement Security Management Travel Arrang Visa Management AMC Management If interested for above position, please walk in for direct interview at: RAMTeCH Software Solutions Pvt. Limited A-6, Sector 67 Noida Walk-In Date - 15 June (Saturday) Timings - 10 AM - 4 PM","location":"Noida","experience":"2 - 4 Years"},{"date":"17, 18, 19, 20, 21, 22 - Jun - 2019","skills":"CORE JAVA/ CORE PHP, Javascript, MySQL","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"REConnect Energy Private Limited, Krishik Sarvodaya Foundation, 1st Floor, #15, Golf View Road, Off Old Airport Road, Kodihalli, Bangalore - 560 008","phone":"Not Provided","profile":"Junior Java Developer \nREConnect Energy Solution Pvt. Limited","description":"Person must be strong in programming langues Java or Php Should be passionate about coding Good team player with strong analytical skills Must have excellent communication skills Be part of the Core engineering team. Write clean codes, test and deliver Work on technologies - CORE JAVA/ CORE PHP, Javascript, MySQL Walk-in Date/ Time: 17th - 22nd June 2019, 12 PM onwards Interview Venue: REConnect Energy Private Limited, Krishik Sarvodaya Foundation, 1st Floor, #15, Golf View Road, Off Old Airport Road, Kodihalli, Bangalore - 560 008","location":"Bangalore","experience":"1 - 2 Years"},{"date":"11, 12, 13, 14, 15, 17 - Jun - 2019","skills":"General Administration, Vendor Management, Handling petty cash, Facility Management, Housekeeping","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Reliable Spaces Private Limited, No. 51, Rajiv Gandhi Salai (OMR) | Rattha TEK MEADOWS, C Block, 1st floor | Sholinganallur | Chennai - 600 119.","phone":"7904356739","profile":"Administration Executive \nReliable Spaces Private Limited","description":"We have immediate job opening for Admin Executive. Requirements: Only Male Candidates. Should have BPO Experience. Roles & Responsibilities: Follow up with vendors. Handling vendors payments. Record keeping of bills processed. Booking Arrangements of vehicles, Cars and Flights etc. Booking of guest house, Hotels for clients and employees. Assigning work to office boys, housekeepers and security staffs. Send request for ID and Access cards of new joining staff. Keep records of IT Equipment. Arrangement of meetings, events and parties. All the maintenance work of office and its requirements. Handling petty cash. Handling work order and purchase order. Inventory Management. Knowledge of AMC and CMC. Job Location : Shollinganallur, Chennai. Walk-in Date/ Time: 11th June - 17th June , 10 AM onwards Interview Venue: Reliable Spaces Private Limited No. 51, Rajiv Gandhi Salai (OMR) | Rattha TEK MEADOWS, C Block, 1st floor | Sholinganallur | Chennai - 600 119. Tel: 022 3375 0037| Ext: 50037| T: 7904356739 Email: indra.kumar@reliablebss.com","location":"Chennai","experience":"1 - 3 Years"},{"date":"14, 15 - Jun - 2019","skills":"Back Office Assistance, General Administration","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Bharat Degree PG College for Women, Opp. Tourist Tiffin, Near Kachiguda Railway station, Kachiguda, Hyderabad.","phone":"Not Provided","profile":"Office Assistant \nBharat Institutions- Division of Chinta Reddy","description":"Educational Qualification: Any Degree Experience: 0 to 8 years Age: 21-35 years Candidate should have good communication skills Must be well versed with MS word and MS Excel Should be proficient in typing. Screening phone calls, emails, letters and personal visits. Ability to communicate effectively in English, both orally and in writing. Should have the knowledge & able to perform the office related activities. Salary: 8,000/- to 15,000/- Job Locations: 1. Bharat Institute of Engineering & Technology (BIET) Mangalpally (V), Ibrahimpatnam (M) Hyderabad - 501 510, Telengana 2. Bharat Institute for Degree & PG College for Women Address: 3-4-781,Opposite Tourist Hotel, Kachiguda Station Road, Barkatpura, Kachiguda, Hyderabad, Telangana - 500 027 Interested candidates can send your Resume to mbapgrec@gmail.com Please bring your updated resume with one passport size photo for Interview. Note: 1) The selected candidates should execute an Service Agreement for Min 1 year. 2) Academic Original Certificates submission is mandatory; for which an Acknowledgment receipt will be issued. Candidates who have attended Interview in last 6 months need not to Apply.","location":"Hyderabad","experience":"0 - 5 Years"},{"date":"17, 18, 19, 20, 21 - Jun - 2019","skills":"ASP .Net / .Net Core, MVC, WebAPI, Sql, Angular","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Xpanxion International Pvt. Limited, Forth Floor, Server Space, A.G Technology Park, Off ITI Road, Near Sarja Hotel, Aundh, Pune - 411007","phone":"020-67405300","profile":"Angular & .Net Developer \nXpanxion International Pvt. Limited","description":"We at Xpanxion International invite you to Walk-in for the drive from Monday to Friday, for the the below skills: ASP .Net / .Net Core, MVC, WebAPI, Sql, Angular Cloud (Azure/ AWS) will be an added advantage Educational Qulaification: BE/ B.Tech/ MCA Work Experience: 2 - 8 Years Job Location: Pune Walk-in Date: 17th - 21st June (Monday to Friday) Timings:9:30 AM to 1 PM Interview Venue: Xpanxion International Pvt. Limited Forth Floor, Server Space, A.G Technology Park, Off ITI Road, Near Sarja Hotel, Aundh, Pune - 411007 Contact Person: Deepti Wadhwa","location":"Pune","experience":"2 - 8 Years"},{"date":"15 - Jun - 2019","skills":"C# .Net (WPF/ Java Programming)","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Elico Limited, B-90, C-56, A.P.I.E, Gate No. 6, Sanathnagar, Hyderabad - 18","phone":"040-44451244","profile":".Net Developer \nElico Healthcare Services Limited","description":"Qualification: B.Tech (ECE or C.Sc)/ MCA or Equivalent Work Experience: 1 to 2 Years Job Location: Hyderabad Candidate should have at least 1.5 years experience in real implementation and documentation and Good Communication Skills. Required Skills: Good Experience in C# .Net (WPF/ Java Programming) Android Mobile Application Development is plus. Knowledge in Web application Development. Commitment, Confidence and ability to self-groom to quickly learn and work with new technologies. Roles and Responsibilities: Software Coding. Documenting the Project Implementation. Adhere to Specified s/w Development practice and project delivery schedules. Interested candidates, Please walk-in directly with your resume at below mentioned address (Excluding Sunday) or share your updated resume to prasannam@elicohcs.com Elico Limited B-90, C-56, A.P.I.E, Gate No. 6, Sanathnagar, Hyderabad - 18 Land Mark: Near Bharathanagar MMTS & Metro Rlwy Stations Contact Person: Prasanna. Contact Number: 040-44451244/ 8978447766","location":"Hyderabad","experience":"1 - 2 Years"},{"date":"15 - Jun - 2019","skills":".Net Framework, C#/ VB .Net, ASP.Net, SQL Server 2005/ 2008","qualification":"B.E./B.Tech, MCA/PGDCA","address":"GD Research Center Private Limited, 3rd Floor, MSR Block, Krishe Sapphire Building, Madhapur, Hyderabad - 500 081","phone":"040-66166706","profile":"Software Engineers (.Net ) \nGD Research Center Pvt. Limited","description":"Person should have Bachelors Degree in Engineering /Technology or MCA with Minimum 2 years of experience in .Net Framework, C#/ VB .Net, ASP.Net, SQL Server 2005/ 2008. Well-versed with JavaScript, AJAX, Web services, Threading and have strong concepts of OOPS. Hands on experience in product/ project development using MVC Exposure of Endeca Configuration, NHibernate, JQuery etc., Strong database programming skills (T-SQL) Good communication skills in English, both written and verbal and analytical Understanding of web usability issues and information architecture. Strong interpersonal and communication skills. Able to work and thrive in a fast-paced team environment Flexible to accommodate demanding Project schedules. Ability to express technical concepts clearly to people with no technical background Interview Date - 15th Jun 2019 (Saturday) Time - 10 AM to 2 PM Interview Venue: GD Research Center Private Limited 3rd Floor, MSR Block, Krishe Sapphire Building, Madhapur, Hyderabad - 500 081 Landmark- Opposite to Nandini Cafe & Beside Image Hospital Contact Person- Giridhar (HR)","location":"Hyderabad","experience":"2 - 4 Years"},{"date":"15 - Jun - 2019","skills":"C/ C++, C# .Net","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Textronics Design Systems (I) Private Limited, Plot. No. EL-109, 2nd Floor, TTC Electronic Zone, MIDC Mahape Navi Mumbai - 400 710.","phone":"9561076006","profile":"Software Developer (C++/ C# .Net) \nTextronics Design Systems India Pvt. Limited","description":"Qualification : B.E/ B.Tech (IT/ Computers) /MCA Work Experience: 0 - 3 Years Job Location: Navi Mumbai -Execute full lifecycle software development -Develop software verification plans &quality assurance procedure -Integrate software component into a fully functional software system -Develop &execute project plans and complying with industry standard Walk-in Date/ Time: 15th June 2019, 10 AM onwards Interview Venue: Textronics Design Systems (I) Private Limited Plot. No. EL-109, 2nd Floor, TTC Electronic Zone, MIDC Mahape Navi Mumbai - 400 710. Contact Person: Surbhi Gupta Email : hr@textronic.net Mobile: 9561076006","location":"Mumbai","experience":"0 - 3 Years"},{"date":"15 - Jun - 2019","skills":"ASP .Net, SQL Server, WCF, Entity Framework, C#, MVC, C# .Net","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Thyrocare Technologies Limited, D-37/3, TTC MIDC, Juinagar, Navi Mumbai - 400703.","phone":"022-45678934","profile":"Software Developer (.Net) \nThyrocare Technologies Limited","description":"Work Experience: 0 - 3 Years Job Location : Navi Mumbai Age : 21 to 29 Years Required Skills: Knowledge in C# .Net & basics of MS-SQL To develop web services as per the requirements To understand the logics & requirements given and to develop modules Good communication skills Job Responsbility: To develop functionality of existing pages & migration of the same To work on the new applications as directed and maintain applications To troubleshoot the problems and ensure applications running according to users requirements To prepare documentation of existing & new codes To attend the user queries related to IT and respond & support Acceptable Travel boundaries: Turbhe - Panvel Turbhe - Kalyan Turbhe - Sion Walk In Date : 15th June, 2019 (Saturday) Reporting Time: 11:00 AM to 1:00 PM Interview Venue : Thyrocare Technologies Limited, D-37/3, TTC MIDC, Juinagar, Navi Mumbai - 400703. Candidates who already got interview / selected for Thyrocare do not walk-in Candidates who stay outside the travel boundary please do not walk-in Interested candidate can confirm their presence for interview 12 hrs prior at hrd@thyrocare.com","location":"Mumbai","experience":"0 - 3 Years"},{"date":"15 - Jun - 2019","skills":"Automation Testing, jMeter, Performance Testing, SQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Eclinicalworks India Private Limited, Brigade Nalapad Centre, 5th Floor, Garudachar Palya, Mahadevapura, Bengaluru, Karnataka - 560 048","phone":"Not Provided","profile":"Performance Testing Engineer \nEclinicalworks India Pvt. Limited","description":"Candidate needs to have strong application knowledge, communication skills and ability to work under pressure. Have out of the box thinking approach to be able to correlate issues between multiple modules and layers of the application. Should be eager to learn and take new initiatives to solve the problem Skill sets expected- 1. Hands on Experience in Automation Testing, Manual Testing Java, SQL 2. Experience in application performance testing and database performance testing. 3. Knowledge of Tomcat, JConsole, chrome developer tools 4. Basic knowledge of networking layers and networking protocols. OSI, TCP etc. 5. Knowledge of Jmeter is plus along with above skills Shift Timings: 1pm to 10pm Benefits: Pick & Drop facility for all employees based in Bangalore 5 Days working Medical insurance for entire family Yearly performance bonus and increment Meals at subsidized rate. Best Professional Experience. Opportunity for Career & Professional Growth. Healthy Work Environment Walk-in Date: 15th June 2109 Time: 10 am - 2:30 pm Interview Venue: Eclinicalworks India Private Limited Brigade Nalapad Centre, 5th Floor, Garudachar Palya, Mahadevapura, Bengaluru, Karnataka - 560 048","location":"Bangalore","experience":"1 - 3 Years"},{"date":"15 - Jun - 2019","skills":"Software Testing, Automation Testing, Webdriver Selenium Testing","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Anblick Solutions Private Limited, MARUTI PLAZA Sy.No 78, Plot No 192/ 95A Patrika Nagar, Hitech City, Hyderabad. Landmark: Backside Maxcure Hospitals","phone":"Not Provided","profile":"Junior Testing Engineer \nAnblicks Solutions Private Limited","description":"We have Opening with Anblicks Solutions Private Limited Hyderabad for 'Junior Testing Engineer' with 1 to 3 years of relevant experience. Skill Set : Selenium Automation and Automation Testing Notice Period : Immediate to 1 Week Work Location : Hyderabad Interview Location : Hyderabad Candidate must have In-depth knowledge of testing Web-based applications. Familiarity with SDLC, quality standards and test methodologies. Should have atleast 1 years experience with Selenium Web driver. Experience working in an Agile development environment - SCRUM is a plus Experience writing front end test harnesses. Experience with Selenium frameworks preferred Interview Mode : Walkin Face to Face Date: June 15th 2019 - Saturday Timings: 9 AM onwards Venue Details:- Anblick Solutions Private Limited, MARUTI PLAZA Sy.No 78, Plot No 192/ 95A Patrika Nagar, Hitech City, Hyderabad. Landmark: Backside Maxcure Hospitals Please carry your updated resume Directions : Opposite to Cyber gateway will find Bahar cafe , between Ibis hotel(Beside Mc.Donalds) and Bahar cafe will find a lane, walk through the lane along 2nd right(Adjacent to Maxcure) & 1st left.","location":"Hyderabad","experience":"1 - 3 Years"},{"date":"14, 15 - Jun - 2019","skills":"HR Administration, Liaison/ Vendor Management Office Administration","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"ZoomCar India Private Limited, 105/106, Suratwala Mark Plazzo, Opp. Fortune Inn Hotel, Hinjewadi, Pune - 411 057","phone":"Not Provided","profile":"HR & Admin Executive \nZoomCar India Private Limited","description":"Candidate should be Any Graduate (preferably male) with 2 to 6 years of experience in HR Administration, Liaison/ Vendor Management Office Administration. Must have excellent communication skills. Job Responsibilities- 1. Recruitments 2. General Administrations 3. Legal & Liasoning 4. Vendor Management 5. Basic Idea of Car Operations. Walk-in Date/ Time: 14th - 15th June 2019, 10 AM onwards Interview Venue: ZoomCar India Private Limited 105/106, Suratwala Mark Plazzo, Opp. Fortune Inn Hotel, Hinjewadi, Pune - 411 057 Note: Male Candidates preferred as it involves outdoor/ site based activities & travelling.","location":"Pune","experience":"2 - 6 Years"},{"date":"15 - Jun - 2019","skills":"C#, ASP.NET MVC, AngularJs, WebAPI","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Calpion Software Technologies Private Limited, 2nd & 3rd Floor, #878 & 879, 7th Main Road, KSRTC Layout, 3rd Phase, JP Nagar, Bangalore - 560078 Karnataka","phone":"6383208801","profile":".Net Developer / Lead \nCalpion Software Technologies Pvt. Ltd","description":"Mandatory Skills: C#, ASP .NET MVC, AngularJs, WebAPI, Work Experience: 3 to 8 Years Job Location: Bangalore Interested candidates please walk-in directly Walk-in Date: 15th June 2019 (Saturday) Timings: 10.00 AM to 2.00 PM Interview Venue: Calpion Software Technologies Private Limited 2nd & 3rd Floor, #878 & 879, 7th Main Road, KSRTC Layout, 3rd Phase, JP Nagar, Bangalore - 560078 Karnataka HR - 6383208801 (Available in Whatsapp)","location":"Bangalore","experience":"3 - 8 Years"},{"date":"14, 15 - Jun - 2019","skills":"General Administration, Office Coordination, Reception/ Front office Activities, Guest Handling","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Super Technical (India) Private Limited, 501, Samarpan Complex, New Link Road Chakala, Andheri (East) Mumbai - 400 099","phone":"022-28323760","profile":"Receptionist & Office Coordinator \nSuper Technical (India) Pvt. Limited","description":"Candidate should be Any Garduate with 2 to 5 years of experience in General Administration, Office Coordination, Reception/ Front office Activities, Guest Handling. Must have excellent communication skills Job Responsibility: Handling Calls, Courier, & other administrative & co-ordination jobs. This is an urgent position. Female Candidates who can join immediately, should only apply. Pleasing personality, Fluency in English & Hindi Quick Learner Nearby candidates with stability in last job preferred Walk-in Date/ Time: 14th - 15th June , 10 AM onwards Interview Venue: Super Technical (India) Private Limited 501, Samarpan Complex, New Link Road Chakala, Andheri (East) Mumbai - 400 099 Cont. No- 022-28323760/ 61/ 62","location":"Mumbai","experience":"2 - 5 Years"},{"date":"15 - Jun - 2019","skills":"Application Testing, Acceptance Testing, Quality Assurance, Application Integration","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Hotel Trident, Hitech City Main Road, HITECH City, Near Cyber Towers, Madhapur, Hyderabad, Telangana - 500 081","phone":"6238096781","profile":"Manual Testers \nNavigant BPM (India) Private Limited","description":"Navigant BPM (India) Private Limited, is having opening for Manual Testers: 1) Manual Tester (SQL) 2) Manual Tester (Scrum) 3) SQL + ETL Tester 4) Python Tester Develop and establish quality assurance measures and testing standards for new applications, products, and/or enhancements to existing applications throughout their development/product lifecycles. Adhere to established QA standards for software development, application integration, and information system performance, and corresponding documentation. Create and execute test plans and scripts that will determine optimal application performance according to specifications. Work Location: Trivandrum , Kerala Interested candidates may walk-in for interview on 15th June 2019 from 9 AM onwards at the below mentioned venue- Hotel Trident, Hitech City Main Road, HITECH City, Near Cyber Towers, Madhapur, Hyderabad, Telangana - 500 081","location":"Hyderabad","experience":"2 - 7 Years"},{"date":"14 - Jun - 2019","skills":"QA/ Software Testing, Automation Testing, Performance Testing, Functional Testing","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"TSI Softech India Private Limited, 313-314, Spaze IT Park Tower B, Sector-49, Sohna Road, Gurgaon, Haryana - 122 002","phone":"Not Specified","profile":"Software Testing Engineer \nTSI Softech India Private Limited","description":"Candidate should have 1 to 2 years of experience in Manual and Automation testing Individual contributor working in Agile development environment Closely working in a scrum team to identify- test- requirements. Writing test scenarios, test cases and come up with own set of test data for different test scenarios/cases. Creating- test- environment for functional and regression- tests. Executing functional as well as regression- tests. Build and release of- tested code to the QA as well as production environment. Work on automation project with the team whenever needed. Provide support during critical business months. Strong Understanding of SDLC and role of a QA Analyst. Strong Understanding of software testing techniques and tools. Walk-in Date/ Time: 14th June 2019, 11 AM onwards Interview Venue: TSI Softech India Private Limited 313, 314-Third Floor,Tower B4, Spaze IT Park Sector 49, Sohna Road, Gurgaon - 122 002","location":"Gurgaon","experience":"1 - 2 Years"},{"date":"15 - Jun - 2019","skills":".NET Framework 4 and above, C#, ASP .NET, OOPS Concepts, SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA","address":"NetProphets Cyberworks Pvt. Limited, Technopolis Tower 6th Floor, C-56 A/12, Sector 62, C Block, Phase 2, Industrial Area, Sector 62, Noida, Uttar Pradesh - 201 301","phone":"Not Provided","profile":".Net Programmer \nNetProphets Cyberworks Pvt. Limited","description":"We are looking for passionate Dot Net Programmers to join our team. Eligibility: Degree in Computer Science, Engineering or a related subject Work Experience: 2-4 Years Job Location: Delhi Required Skills- .NET Framework 4 and above Proficiency in C# Strong knowledge of ASP .NET Thorough understanding of OOPS Concepts SQL Server 2010/ 2012 Strong skills in writing Queries for front end and mobile applications Experience in MVC would be an additional advantage Job Responsbility- Contribute in all phases of the development lifecycle Write well designed, testable, efficient code Ensure designs are in compliance with specifications Prepare and produce releases of software component Good analytical skills Walk-in Date/ Time: 15th June 2019, 10 AM onwards Interview Venue: NetProphets Cyberworks Pvt. Limited Technopolis Tower 6th Floor, C-56 A/12, Sector 62, C Block, Phase 2, Industrial Area, Sector 62, Noida, Uttar Pradesh - 201 301","location":"Noida","experience":"2 - 4 Years"},{"date":"15 - Jun - 2019","skills":"QA Testing, Automation Testing, Test Cases, Test Planning, Performance Testing","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Compass Systems Private Limited, E84 Sector 63, Noida","phone":"Not Provided","profile":"Software Testing Engineer \nCompass Systems Private Limited","description":"PERFORMANCE TESTING :- Performance Testing is upcoming and very hot Field . Cavissons Products are surrounding this Area. The person required to do performance testing using our product which are best in the world. QUALITY ASSURANCE / TESTING / Client Support ( QA): All phases of QA testing of software product which is for performance testing of Web Applications. Requirement document reviews, test plan and test cases documentation, manual and automated testing Bug tracking using Bugzilla and detailed analysis of bugs. Candidate should have good communication skills. Must be an Innovative Creative & a fresh thinker Walk-in Date/ Time: 15th June 2019 from 11 AM onwards Interview Venue: Compass Systems Private Limited E84 Sector 63, Noida","location":"Noida","experience":"0 - 1 Years"},{"date":"15 - Jun - 2019","skills":"Manual Testing, Automation Testing, Selenium, SDET, Bug Life Cycle, Functional Testing","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Ness Digital Engineering, I & II Floor, Maximus 2A, Raheja MindSpace, Hitech City, Madhapur, Hyderabad.","phone":"Not Provided","profile":"Software Testing Engineer \nNess Technologies India Pvt. Limited","description":"Candidate should have 3 to 8 years experience in Automation Testing using Selenium Java & Cucumber framework (mandatory). Extensively involved in Manual Testing and Automated Testing. Experience in Functional Testing, Back-end Testing, Regression Testing, and Installation Testing Experience in Design, development and executing Test Cases. Good Exposure to Testing Life Cycle and Bug Life Cycle. Good knowledge in Software Development Life Cycle (SDLC) and Software Testing Life Cycle (STLC) Skill in understanding Requirement Specification and identifying all possible Scenarios Experience in Designing and executing the automation scripts using Selenium Coordinating the Testing activities with Development Team Team player with Good communication and inter personal skills Immediate Requirement - 15 days Notice Period Walk-in Interview on 15th June from 10 AM onwards Interview Venue: Ness Digital Engineering I & II Floor, Maximus 2A, Raheja MindSpace, Hitech City, Madhapur, Hyderabad. Interested please share updated resume to ragapujitha.vayigandla@ness.com with the below details: Current CTC: Expected CTC: Notice Period: Available for this Saturday: Y/N","location":"Hyderabad","experience":"3 - 8 Years"},{"date":"15 - Jun - 2019","skills":".Net, ASP .Net, C# Framework and SQL Database","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Ebix Software India Private Limited, Plot No - 122 & 123 (Opp. Corporation Bank ATM), Noida Special Economic Zone (NSEZ), Near Sector 82, Phase - II, Noida","phone":"Not Provided","profile":".Net Developer \nEbix Software India Private Limited","description":"Candidate must have knowledge/ exposure in .Net, ASP .Net, C# Framework Must have good knowledge in SQL Database (SQL 2008 & above) Angular Js is must & Angular 2, 3, 4 would be a plus Experience in Ado .Net, Jquery would be a plus MVC/ Non MVC (Both preferred) WCF Walk-in Date: 15th June, 2019 Day: Saturday Time: 10 am - 3 pm Interview Venue: - Ebix Software India Private Limited Plot No - 122 & 123 (Opp. Corporation Bank ATM), Noida Special Economic Zone (NSEZ), Near Sector 82, Phase - II, Noida (Nearest metro station NSEZ (Aqua line) Contact Person- Bhavneet Prabha (HR)","location":"Noida","experience":"2 - 6 Years"},{"date":"14 - Jun - 2019","skills":"Quality Assurance, JIRA Scrum Agile Manual Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"JiBe Development Services Private Limited, Shree Nandadham Building, B Wing Office No-215, Second Floor, Sec - 11, Plot no 59, Near Belapur Station, Opposite B. P. Marine Academy. C B D Belapur.","phone":"9326337385","profile":"Software Testing Engineer \nJiBe Development Services Pvt. Limited","description":"Candidate should have BE/ B.Tech/ MCA/ MS or equivalent with minimum 2 to 4 years of relevant experience in testing/ quality assurance of software products/ applications. Any experience on Windows / Cloud / Mobile would be a huge plus Should have handled end-to-end testing/ QA for large projects/ products. Strong experience in automation tools like QTP, Selenium webdriver. Atleast 3 years of industry experience in automation testing using Java around angular Js applications, API calls,TDD. Test Automation: Experience in designing framework with programming/ scripting language preference for Javascript. Design & implement reusable automated test framework to drive test automation goal and to support continuous integration & regression testing. Walk-in Date: 14th June 2019 Time- 9:30 to 12:300 PM and 2:00 PM to 5 PM Interview Venue: JiBe Development Services Private Limited Shree Nandadham Building, B Wing Office No-215, Second Floor, Sec - 11, Plot no 59, Near Belapur Station, Opposite B. P. Marine Academy. C B D Belapur.","location":"Mumbai","experience":"2 - 4 Years"},{"date":"15 - Jun - 2019","skills":"Asp .Net , MVC, C# .Net , jQuery and JavaScript","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Ray Business Technologies Pvt. Limited, Plot No: 204, Block B, Kavuri Hills, Next to IGNOU, Madhapur, Hyderabad","phone":"Not Provided","profile":".Net Professionals \nRay Business Technologies Pvt. Limited","description":"Ray Business Technologies Pvt. Limited is currently hiring Associate Software Engineers. Looking out for someone who has basic knowledge in Asp .Net , MVC, C# .Net , jQuery and JavaScript. Candidate should be 2017, 2018 , 2019 pass out graduates who has secured 60% above through out their academics Should have good analytical skills Must be a team player, posses a good attitude & be self disciplined Must have a excellent written & verbal skills Selection Process: 1. Written test (Aptitude and Programming skills) 2. Technical round (In-person) 3. Techno Managerial round (In-person) 4. HR round Interested candidates can walk in for interview on June 15th, 2019 (Between 10:00 AM to 1:00 PM) at the below mentioned address- Ray Business Technologies Pvt. Limited Plot No: 204, Block B, Kavuri Hills, Next to IGNOU, Madhapur, Hyderabad Note: Candidates who have attended interview in last 6 months are not eligible.","location":"Hyderabad","experience":"0 - 2 Years"},{"date":"14 - Jun - 2019","skills":"General Administration, Back Office Activities, Facility Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"IIFL Finance Limited, #5-9-22/ B/501, 5th Floor, My Home Sarovar Plaza, Secretariat Road, Hyderabad - 500 004.","phone":"040-44880-430","profile":"Administration Executive \nIIFL Finance Limited","description":"Qualifications/ Skills: Any Graduate with Excellent written and verbal communication skills. Proficient computer skills, including Microsoft Office Suite (Word, PowerPoint, and Excel); scheduling appointments/ updating calendars a must. Excellent time management skills; ability to prioritize Willingness to learn and to grow with the company and motivated to take on additional projects and solve problems. Flexible to travel for new branch openings. Self-directed and able to work without supervision. Duties & Responsibilities: Monitoring and maintaining office equipment and inventory supplies; orders replacement supplies as needed Creating, updating, and maintaining records and databases Preparing reports on expenses, office budgets, and other expenditures Supporting department managers Coordinating building and maintenance issues for general repair and updating. Preparing correspondence, documentation. Walk-in Date/ Time: 14th June 2019 from 9 AM onwards Venue: IIFL Finance Limited #5-9-22/B/ 501, 6th Floor, My Home Sarovar Plaza, Secretariat Road, Hyderabad - 500 004.","location":"Hyderabad","experience":"2 - 5 Years"},{"date":"14, 17, 18, 19, 20, 21 - Jun - 2019","skills":"Front Desk/ Front Office, Receptionist Activities, General Administration, Time Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"OCS Group India Private Limited, Thane one -501- A, Near Vidyapith Bus Stop, Ghod Bunder Road Thane West","phone":"9137841023","profile":"Receptionist Cum Admin Executive \nViviana Mall (OCS Group India Pvt. Limited)","description":"Candidate should be Any Graduate with 1 to 2 years of experience in Front Desk/ Front Office, Receptionist Activities, General Administration, Time Management. Must have excellent communication skills Walk-in Date/ Time: 14th - 21st June , 10 AM onwards Interview location: OCS Group India Private Limited Thane one -501- A, Near Vidyapith Bus Stop, Ghod Bunder Road Thane West","location":"Mumbai","experience":"1 - 2 Years"},{"date":"15, 17, 18, 19, 20, 21, 22 - Jun - 2019","skills":"C# .Net, React JS, Azure Cloud, IIS, WebAPI","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Pronix IT Solutions Private Limited, # 2-48/5/6, Suite 9H, 9th Floor, Vaishnavi`s Cynosure, Opp. RTTC, Telecom Nagar Extension, Gachibowli, Hyderabad, Telangana - 500 081","phone":"7569876973","profile":".Net Developers \nPronix IT Solutions Private Limited","description":"Candidate should be BE/ B.Tech or MCA with 3 to 4 years of experience in C# .Net Must have at least 1+ year real time experience on React JS Experience with SQL Server design and development Required Skills: Design, develop, troubleshoot, and debug software applications using .Net Framework, React JS, Azure Cloud, IIS, WebAPI Walk-in Date/ Time: 15th - 29th June , 11 AM onwards Interview Venue: Pronix IT Solutions Private Limited # 2-48/5/6, Suite 9H, 9th Floor, Vaishnavi`s Cynosure, Opp. RTTC, Telecom Nagar Extension, Gachibowli, Hyderabad, Telangana - 500 081","location":"Hyderabad","experience":"3 - 6 Years"},{"date":"15 - Jun - 2019","skills":"ASP .NET 4.0/4.5 with C#, HTML, CSS, JavaScript, JQuery & AJAX","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Osmosys Software Solutions Pvt. Limited, White House Building, Block 2, 5th Floor, Begumpet, Hyderabad - 500 016. Landmark: Beside Lifestyle Building","phone":"040-23401007","profile":".Net Developer (Freshers) \nOsmosys Software Solutions Pvt. Limited","description":"Walk In for .NET (Dotnet) Developers (Freshers to 3 Years Experienced) Register Link: https://tinyurl.com/dotnet-osm (See the above Link for more details) Requirements: 1. Experience working on ASP.NET 4.0/4.5 with C# 2. Good Knowledge on HTML, CSS, JavaScript, JQuery & AJAX. 3. Candidate should have worked on any relational database. 4. Good to have knowledge on MVC and web API. 5. Self-starter with good communication & problem solving skills. 6. Freshers who are Trained and certified on .NET platform will have an added advantage Location: Hyderabad Annual CTC: 2.4 LPA to 6 LPA (The final CTC will depend upon candidate's performance during the interview and will be at the company's discretion) Walk In Date: 15th June 2019 (Saturday) Timings: 10:00 AM to 3:00 PM Interview Venue: Osmosys Software Solutions Pvt. Limited White House Building, Block 2, 5th Floor, Begumpet, Hyderabad - 500 016. Landmark: Beside Lifestyle Building Note: 1. Should carry a copy of your Resume/CV. 2. Gaps in Career must not be more than 2 Years Registration is Mandatory","location":"Hyderabad","experience":"0 - 3 Years"},{"date":"15 - Jun - 2019","skills":"Asp .Net MVC, C#, Entity framework, LINQ, SQL Server, WCF / Web API & Unit testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Saggezza India Private Limited, Solitaire, No.139/ 26, Amarjyothi Layout 2nd Floor Koramangala Intermediate Ring Road Domlur, Bangalore - 560 071","phone":"Not Provided","profile":".NET Developers \nSaggezza India Private Limited","description":"Candidate should have 2 to 4 years of hands-on experience in web application development using Asp .Net MVC, C#, Entity framework, LINQ, SQL Server, WCF / Web API & Unit testing A logical mind that enjoys using technical know-how to problem solve Natural self-motivation with a passion for delivering excellence Great communication skills with the ability to build strong professional relationships Curiosity with an ongoing desire to develop and learn What wed love you to have: Excellent understanding on Design Patterns and principles Good technical knowledge on JavaScript, CSS and HTML Good understanding of Agile methodologies Knowledge on CI / CD tools Every project will be different, but youll always be responsible for: Delivering high quality work meeting client expectations Self-starter who can deliver with little guidance Demonstrated Development experience in .Net frame work High Degree of initiative, motivation and willingness to work as a team player WALK IN ON 15TH JUNE 2019 TIME: BETWEEN 10 AM - 3 PM Chennai Venue: Saggezza India Private Limited 9th Floor, IITM Research Park, Kanagam Road, Taramani, Chennai - 113. Landmark-Hotel Ginger Bangalore Venue: Saggezza India Private Limited Solitaire, No.139/ 26, Amarjyothi Layout 2nd Floor Koramangala Intermediate Ring Road Domlur, Bangalore - 560 071","location":"Bangalore, Chennai","experience":"2 - 4 Years"},{"date":"14, 15, 17, 18, 19, 20, 21, 22 - Jun - 2019","skills":"Software Testing, Manual Testing, Test Scripts, Testing Concepts","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Talent Times Private Limited, 7-1-617/A, Third Floor, Unit # 305, Imperial Towers, Ameerpet, South India Shopping Mall Building Hyderabad, Telangana - 500 016","phone":"8367788879","profile":"Software Tester - Fresher \nTalent Times Private Limited","description":"Candidate should be Any Graduate/ B.E/ B.Tech/ MCA Fresher's / 0- 1 year of experience, Job Responsbility- Responsible for software testing, product implementation, Bug fixing, minor application issues and any adhoc requirements from client. Walk-in Date/ Time: 14th June - 31st August , 10 AM onwards Interview Venue: Talent Times Private Limited 7-1-617/A, Third Floor, Unit # 305, Imperial Towers, Ameerpet, South India Shopping Mall Building Hyderabad, Telangana - 500 016 Phone No: 8367788879","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"15 - Jun - 2019","skills":"HTML5/ CSS/ Angular 6/ Java 8/ Springboot / MySql","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Gati KWE, Plot 20, Survey 12, Kothaguda, Kondapur, Hyderabad - 500 084","phone":"Not Provided","profile":"Java/ Full Stack Developer \nGATI-KINTETSU Express Private Limited","description":"Sr./ Jr JAVA FULL STACK DEVELOPER: Independently develop UI/ Backend code with HTML5/ CSS/ Angular 6/ Java 8/ Springboot / MySql Good understanding of design principles Write clean code compliant with best practices and standards Good Analytical, Problem Solving and Communication skills Have worked with tools like JIRA and worked in Agile Understands build, deployment process and DevOps process Good to have worked in Microservices architecture JAVA UI DEVELOPER: Independently develop UI code with HTML5/ CSS/ Angular 6 Good understanding of UI design principles Write clean code compliant with best practices and standards Good Analytical, Problem Solving and Communication skills Have worked with tools like JIRA and worked in Agile Understands build, deployment process and DevOps process Should have used Bracket/Sublime as IDE Good to have worked in Microservices architecture Candidate should be willing to work on 1st (full day), 3rd(full day) and 5th Saturdays(half day) Should be willing to work from 9 am - 5:30 pm and stretch on a need basis We are not a software company. We are IT team within Supply Chain Industry Should be willing to work follow processes set by the company Walk-in Date/ Time: 15th June 2019, 10 AM onwards Interview Venue: Gati KWE, Plot 20, Survey 12, Kothaguda, Kondapur, Hyderabad - 500 084","location":"Hyderabad","experience":"2 - 7 Years"},{"date":"15 - Jun - 2019","skills":"Core Java, Advanced Java, J2EE concepts, Web Services, REST API, SWT, Maven etc","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Vyom Labs Private Limited, Sunrise Business Park Near Cummins Campus, Balewadi City, Pune, Maharashtra - 411045","phone":"Not Provided","profile":"Core Java Developer \nVyom Labs Private Limited","description":"Candidate should have 0 to 4 years of experience in Java Development with sound knowledge of Core Java, Advanced Java and J2EE concepts. Must be familiar with Java development using Web Services, REST API, SWT, Maven etc. Familiar with at least one code repository (SVN / Git / Bitbucket) Should have knowledge of Apache-Tomcat Excellent communication skills. Willingness to work in a team environment, as well as independently. Willingness to learn and work on new technologies. Ability to work with minimal supervision. Selection Process: 1. Programming Test (JAVA) 2. Technical Interview 3. HR Interview Walk in Date: 15th June 2019, Saturday Timing: 9:00 AM - 11:00 AM Venue: Vyom Labs Private Limited Sunrise Business Park Near Cummins Campus, Balewadi City, Pune, Maharashtra - 411045","location":"Pune","experience":"0 - 4 Years"},{"date":"15 - Jun - 2019","skills":"Java, Core Java, J2EE, Struts, Spring, Hibernate","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"YASH Technologies Pvt. Limited, Plot No. 23/1, IT & ITES MIDC, Rajiv Gandhi Infotech Park Phase-3, Hinjewadi, Pune - 411057","phone":"Not Provided","profile":"Java Developer \nYash Technologies Private Limited","description":"Candidate should be Graduate in Computer Science or Engineering, or equivalent with Minimum 2.4 years of Java development experience. Solid understanding of Object-Oriented Programming, Data Structures and Algorithms and Software Engineering methodologies Expertise with web architecture, providing design and development recommendations and optimizing existing infrastructure. Strong knowledge and experience with Java/ JSP. Knowledge working with Spring & Hibernate, Restful. Work Location: Pune, Magarpatta Notice: Immediate Joiners / 30 Days Preferred Interview Process: Step 1 - Technical Interview Step 2 - Coding Test (Based on core java) Step 3 - Final Discussion Walk-in Date/ Day : 15th June 2019 / Saturday Timings: 10:30 AM to 4:00 PM VENUE: YASH Technologies Pvt. Limited Plot No. 23/1, IT & ITES MIDC, Rajiv Gandhi Infotech Park Phase-3, Hinjewadi, Pune - 411057 Contact Person: Shantanu Waikar You need to Carry: 1 Hard Copy of Updated Resume (Printout). 1 Passport Size Photograph. 1 Photo Id Proof (Driving Licenses / Passport / Voter ID / PAN Card).","location":"Pune","experience":"2 - 5 Years"},{"date":"22 - Jun - 2019","skills":"PHP, Codeigniter, MySQL, CSS, HTML, Javascript, Jquery, AJAX, XML","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Value Chain Solutions (India) Private Limited, #209-212, ORNET ARCADE, Chief Justice Bungalow Lane, Bodakdev, Ahmedabad - 380 054, Gujarat","phone":"079-6777 8888","profile":"Software Engineer - PHP/ MySQL \nValue Chain Solutions (India) Private Limited","description":"PHP Development: - Must be proficient in PHP, Codeigniter, MySQL, CSS, HTML, Javascript, Jquery, AJAX, XML - Ensuring foolproof performance of the deliverable - Developing and maintaining dynamic websites and web applications - Troubleshooting, testing and maintaining the core product software and databases - Good knowledge of relational databases, version control tools and of Developing web services MySQL - Strong proficiency in MySQL database management - Decent experience with recent versions of MySQL - Understanding of MySQLs underlying storage engines, such as InnoDB and MyISAM - Proficient in writing and optimizing SQL statements - Experience with replication configuration in MySQL - Knowledge of de-facto standards and best practices in MySQL - Knowledge of MySQL features, such as its event scheduler - Ability to plan resource requirements from high level specifications - Familiarity with other SQL/ NoSQL databases such as PostgreSQL, MongoDB, etc. - Knowledge of limitations in MySQL and their workarounds in contrast to other popular relational databases Interview Date: 22nd June 2019, Timings: 9 AM onwards Venue Details: Value Chain Solutions (India) Private Limited #209-212, ORNET ARCADE, Chief Justice Bungalow Lane, Bodakdev, Ahmedabad - 380 054, Gujarat Contact No: (079) 6777 8888","location":"Ahmedabad","experience":"0 - 5 Years"},{"date":"15 - Jun - 2019","skills":"PHP, MySqL, OOPs, RDBMS, JavaScript, Jquery, HTML, Ajax/ XML/ JSON","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Matrimony.Com Limited, Arihant ePark, Lattice Bridge Road, 2nd Floor, Baktavatsalm Nagar, Adyar, Chennai - 600 020. Landmark: Opposite to Adyar Anantha Bhavan","phone":"Not Provided","profile":"PHP Developer \nMatrimony.Com Limited","description":"Candidate must have strong Knowledge in PHP and MySq, OOPs and RDBMS. Strong logical, analytical and problem solving skills. Knowledge in JavaScript, Jquery, HTML, Ajax/ XML/ JSON Knowledge in Web Services/ REST API etc. Knowledge in NoSQL like MongoDB. Knowledge in Payment Gateway Integration. Knowledge in Web Server Technology (Memcache, Redis, Jquery/ JSONP, JSON/ XML, Image magick, Facial Recognition) etc is desirable. Knowledge in NodeJS will be an added advantage. Exposure to Agile methodology but not mandatory. Result and process oriented. Job Responsibility- Planning, designing, developing, debugging, implementing and supporting web-based applications and services. Modifying existing software to correct errors, allowing it to function in new operating environments. Adhering to project coding standards and recommending improvements. Improving software quality by conducting systems analysis. Walk-in Date/ Time: 15th June 2019, 10 AM onwards Interview Venue: Matrimony.Com Limited Arihant ePark, Lattice Bridge Road, 2nd Floor, Baktavatsalm Nagar, Adyar, Chennai - 600 020. Landmark: Opposite to Adyar Anantha Bhavan","location":"Chennai","experience":"3 - 4 Years"},{"date":"14, 15, 16, 17, 18 - Jun - 2019","skills":"PHP Symfony Laravel Zend Wordpress CMS Wordpress","qualification":"B.E./B.Tech, MCA/PGDCA","address":"MPS Limited, C-35, Sector-62 Noida - 201307 (Near Kailash Health Village)","phone":"Not Provided","profile":"PHP Developer \nMPS Limited","description":"Technology Stack PHP 5.6/ 7.0 For Zend : PHP Framework (Should have hands-on experience) Zend 2(Mandatory), Laravel or Symfony Should have basic knowledge of SQL. For Wordpress : Minimum 3+ years of experience Knowledge of wordpress and database would be good to have Walk-in Date/ Time: 14th June - 18th June , 11 AM onwards Interview Venue: MPS Limited C-35, Sector-62 Noida - 201307 (Near Kailash Health Village)","location":"Noida","experience":"3 - 7 Years"},{"date":"15 - Jun - 2019","skills":"PHP MySQL Javascript Codeigniter Symfony Ajax Laravel CSS","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Corent Technology Private Limited, III Floor, MCM Towers, Super-B-3, Thiru Vi Ka Industrial Estate, Guindy, Chennai - 600 032","phone":"Not Provided","profile":"PHP Developer \nCorent Technology Private Limited","description":"We are looking for PHP Professionals with the below skill sets. Skill Set --------- 2+ years experience in php related frameworks. Strong knowledge of MVC design patterns and object oriented PHP programming. Strong knowledge of PHP web frameworks such as Laravel, Yii,CodeIgniter,Symfony,Zend etc. Strong knowledge in Wamp,Lamp,Xamp,Nginx,Mysql and Postgres database. Understanding the fully synchronous behavior of PHP. Basic understanding of front-end technologies, such as Ajax,JavaScript, HTML5, and CSS. Familiarity with limitations of PHP as a platform and its workarounds. Familiarity with SQL/NoSQL databases and their declarative query languages. Notice Period: immediate to 30 days Mode of Interview: Technical Discussion HR Discussion Walk-in Date: 15th June 2019 (Saturday) Timings: 10:00 AM to 1:00 PM Interview Venue: Corent Technology Private Limited III Floor, MCM Towers, Super-B-3, Thiru Vi Ka Industrial Estate, Guindy, Chennai - 600 032 Landmark: Next to RR Tower III, Opposite to Guindy EB Office Contact Person: Surekha Please do carry a copy of this posting/mail along with your resume.","location":"Chennai","experience":"2 - 3 Years"},{"date":"14, 15, 17, 18 - Jun - 2019","skills":"Php, MySQL, HTML5, CSS3, JavaScript, jQuery","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"W3villa Technologies Private Limited, 501/ 502, 5th floor, Tower A1, Ansal Corporate Park Sector 142, Noida - 201 305","phone":"0120-665-0465","profile":"Full Stack/ PHP Developer \nW3villa Technologies Private Limited","description":"We are looking for an experienced and passionate Full Stack Developer to join our IT team. As a Full-stack Developer at our company, you will be responsible for both back-end and front-end development, including Core PHP, WordPress, Woocommerce, Shopify, Magento. We are expecting you to have a strong understanding of the latest industry trends and content management systems. Responsibilities -> Designing and implementing new features and functionality -> Establishing and guiding the websites architecture -> Ensuring high-performance and availability, and managing all technical aspects of the CMS -> Helping formulate an effective, responsive design and turning it into a working theme and plugin. Requirements -> Good understanding of front-end technologies, including HTML5, CSS3, JavaScript, jQuery -> Experience in building user interfaces for websites and/or web applications -> Experience in designing and developing responsive design websites -> Comfortable working with debugging tools like Firebug, Chrome inspector, etc. -> Ability to understand CSS changes and their ramifications to ensure consistent style across platforms and browsers -> Ability to convert comprehensive layout and wireframes into working HTML pages -> Knowledge of how to interact with RESTful APIs and formats (JSON, XML) -> Strong understanding of PHP back-end development Interview Date: 12th - 18th June 2019 Timings: 11 AM onwards Venue Details- W3villa Technologies Private Limited 501/ 502, 5th floor, Tower A1, Ansal Corporate Park Sector 142, Noida - 201 305","location":"Noida","experience":"1 - 5 Years"},{"date":"12, 13, 14, 15 - Jun - 2019","skills":"General Administration, Facility Management, Statutory Compliance, Event Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Prism Johnson Limited, 4-97, L Godown, Saint Johns, Regional Seminary Church Compound, Ramanthapur, Hyderabad - 500 013","phone":"9920952662","profile":"Administration Coordinator \nPrism Johnson Limited","description":"Candidate should be Any Graduate with 3 to 8 years experience in General Administration, Facility Management, Statutory Compliance, Event Management. Must have excellent communication skills Job Responsbility- General Administration & Facilities Legal & Statutory Compliance Facilitate People and Business Initiatives Facilitate Employee Engagement and R&R People and Business Event Management Employee Facility Management (ID card, Medical Card, SIM Card, Tab & Laptop, Work Station / Cabin allocation) Travel and Accommodation Management IT Properties and Other Office Equipment Maintenance. Monthly Admin MIS, Attendance and Statutory reports submission to HO Walk-in Date/ Time: 12th June - 15th June , 9 AM onwards Interview Venue: Prism Johnson Limited, 4-97, L Godown, Saint Johns, Regional Seminary Church Compound, Ramanthapur, Hyderabad - 500 013 Contact Person: Mr. Vijayragahvan Iyengar Tel: 9920952662/ 9980783878","location":"Chennai","experience":"3 - 8 Years"},{"date":"13, 14, 15, 17 - Jun - 2019","skills":"outbound calling voice process inbound semi voice email support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech, B.A., B.Com, B.B.A, B.Sc","address":"Medi Assist Insurance TPA, 2nd Floor, RWD Atlantis Building, Nelson Manikam Road, Near Metha Nagar Bus stop, Chennai - 29","phone":"Not Provided","profile":"Technical Support (Semi Voice Process) \nMedi Assist Insurance TPA Private Limited","description":"Medi Assist Insurance TPA Private Limited, is having an immediate opening for Female Candidates for Semi Voice Process with our organization. Experience & Skills required: Minimum 6 Months to 1 Year experience in voice or semi voice process. Experience in handling inbound & outbound calls/drafting emails. Experience in basic word & excel. Candidates who can join immediately will be given first preference. Good in Communication, Key roles & Responsibilities: Ability to take calls and to provide & receive info. Fluent communication in English & Hindi must (Tamil will be an added advantage) Responsible for attending calls & have to co-ordinate with internal & external customers in regard. Responsible for conducting briefing about any changes / new updates or process change from time to time Should manage 50% Voice & 50% email support Handling Escalation Emails & Calls Require Good oral and written communication. Ability to effectively deal with and manage stressful situation Willing to learn and grow in changing environment Interested candidates can directly come for a face 2 face interview in the below mentioned address: Date: 13th - 17th June , 9 AM onwards Interview Venue: Medi Assist Insurance TPA, 2nd Floor, RWD Atlantis Building, Nelson Manikam Road, Near Metha Nagar Bus stop, Chennai - 29","location":"Chennai","experience":"1 - 2 Years"},{"date":"14 - Jun - 2019","skills":"technical support it helpdesk service desk","qualification":"B.Sc, BCA/BCS, B.E./B.Tech, B.A., B.Com, B.B.A, B.Sc","address":"Tata Consultancy Services Limited, No 769, Spencer plaza, Mangal Tirth Estate 3rd Phase, 9th Floor, Annasalai, Mount road, Chennai - 600 002","phone":"Not Provided","profile":"Technical Support/ Service Desk Professionals \nTata Consultancy Services Limited","description":"Eligibility: Any Graduate with (2 to 4 years) (Technical Support / IT Help desk / Service Desk / L1 support ) experience in any one of the skill can apply. Should have experience in Technical Voice. Should have good communication skill. Minimum 15 yrs of regular education (10th + 12th + 3 years Graduation) Relieving letters from all the previous companies are mandatory. Graduates through Open Universities/Correspondence graduates need not apply Not more than 2 years of gap in Graduation or Employment. Willingness to work in any Shifts. Interview Date: Friday (14th-June-2019) Time: 11:00 am to 1:00 pm Mandatory Requirements (How to generate your EPCN) EPCN number is mandatory for eligibility of the interview. Follow the below steps to register and mention the EPCN number on your resume Step 1: Go to link www.careers.tcs.com Step 2: Select India geography & next click on Experienced Professionals link Step 3: Go to Create your profile (For New Users) link & fill the details. (Please select area of interest as BPS) Step 4: You will get the EPCN number & Password to your personal e-mail ID. Interview Venue: Tata Consultancy Services Limited No 769, Spencer plaza, Mangal Tirth Estate 3rd Phase, 9th Floor, Annasalai, Mount road, Chennai - 600 002 Contact Person: Nithya Y Please carry any GOVT original ID (voters ID/ PAN CARD/ driving license) for your identity purpose & Invite mail Kindly share this information with your friends and bring them along with you Note: Candidates who have attended the selection process in the last 6 months will not be eligible to apply again.","location":"Chennai","experience":"2 - 4 Years"},{"date":"15 - Jun - 2019","skills":"General administration, office coordination, ms office, asset management","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Syncfusion Software Private Limited, Eymard Complex, AJ-217, 4th Avenue, Shanthi Colony, Anna Nagar, Chennai - 600 040.","phone":"044-26210413","profile":"Office Coordinator / Admin \nSyncfusion Software Private Limited","description":"We are conducting Walk-in for Office Coordinator / Admin on June 15, 2019. Office Coordinator / Admin (Fresher's can apply) Eligibility: Any degree (Regular) 2017 & 2018 pass-outs with minimum 60% in all academics No gaps of any kind Well versed in MS-Office Good communication skills Experience 0 - 1 year in relevant field Females only Roles: General office maintenance \\ admin tasks Maintenance of employee records Asset management Inventory record maintenance Customer support coordination Any other duties assigned Working Hours: 9:00 AM to 6:00 PM. Saturdays working (As needed) Walk-in Date: 15th June 2019 Timings: 10 AM to 2 PM Interview Venue: Syncfusion Software Private Limited Eymard Complex, AJ-217, 4th Avenue, Shanthi Colony, Anna Nagar, Chennai - 600 040. Landline: 044-26210413 Extn: 413","location":"Chennai","experience":"0 - 1 Years"},{"date":"15 - Jun - 2019","skills":"General Administration, Back Office Activities, Facility Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Queen's Hotel, 46/6, Ramakrishna Road Salem - 636 007","phone":"9384998433","profile":"Admin Executive - Female Only \nQueens Hotel","description":"Candidate should be Any Graduate with good command in English, Well groomed professional. Job Responsbility- Administrative Executive will be responsible for providing administrative support to management and employees to ensure efficient in office operation. Salary: INR 1,75,000 - 3,00,000 P.A Free Accommodation would be provided Apply with Photograph, Walk-in Date/ Time: 12th June - 11th July , 9 AM onwards Interview Venue: Queen's Hotel 46/6, Ramakrishna Road Salem - 636 007","location":"Salem","experience":"0 - 5 Years"},{"date":"13, 14 - Jun - 2019","skills":"technical supportinternational voice processinbound calls","qualification":"B.Sc, BCA/BCS, B.E./B.Tech, B.A., B.Com, B.B.A, B.Sc","address":"Mphasis Limited, EON Infrastructure, Wing 2 Cluster C, Ground Floor, Kharadi, Pune","phone":"Not Provided","profile":"Technical Support Associate \nKotak Mahindra Old Mutual Life Insurance Ltd.","description":"Mphasis Hiring for Technical Support International Voice process, looking for immediate joiners only Qualification- Any Graduate/ Undergraduate Hiring only for voice process 1+ years of experience in Service Desk/ IT Helpdesk/ Technical Support domain or International Voice Process. Job Responsibilities: Problem and Incident management under Global Service Desk environment where the Tech support Engineer has to manage clients queries and technical problems via inbound calls, emails, chat and web tickets within defined SLAs Logging incidents and service requests, categorizing and prioritizing them, and managing their life cycle as per ITIL guidelines.Update users about request status and close request when users are satisfied with solutions Level 1, Level 2 and Level 3 troubleshooting mainly related to desktop/OS, Custom and COTS applications, Exchange related, End devices, VPN, VOIP and share point as per guidelines in the knowledge base. Remote desktop troubleshooting. Escalate complex incidents / requests to upstream technical groups Should be comfortable for: 5 days working Night Shift may require to do Day shift during training and transition 2 Days Weekly Off Any 2 Days of the week 9 Hours Login ( With 1 Hour Break ) Excellent command on English (Verbal and Written) Other Benefits: Pick up and Drop Global Standards work environment Proper Desk job Performance linked incentives Walk-in Date/ Time: 13th June - 14th June from 9 AM onwards Interview Venue: Mphasis Limited, EON Infrastructure, Wing 2 Cluster C, Ground Floor, Kharadi, Pune Contact Person: HR Tausif NOTE: Please remember to mention your job code as 'Tausif ' while appearing for the walk-in interview on your resume. Please carry all your academic and employment documents (If any) along with your updated CV and photo copy of your photo ID proof and copy of this email.","location":"Pune","experience":"1 - 4 Years"},{"date":"13 - Jun - 2019","skills":"Customer Service, Customer Support, Inbound Calls, Customer Complaints","qualification":"B.Sc, BCA/BCS, B.E./B.Tech, B.A., B.Com, B.B.A, B.Sc","address":"Kotak Mahindra Life Insurance Co. Limited, No.102 & 105, 1st Floor, Cears Plaza, No.136, Residency Road, Bangalore - 560025","phone":"Not Provided","profile":"Customer Support Executive/ Fresher \nKotak Mahindra Life Insurance Company Limited","description":"Here is an opportunity for Graduate/ Freshers to get associate and enhance your career with a leading brand. Qualification: Only Full time Graduates can apply Work Experience: Fresher Job location: Bangalore (Residency Road) Job Responsibilities- 1. Recruiting Organize and run recruitment events for APs and LAs Be an expert in the recruitment processes i.e. have the ability to identify the prospective LAS and APS for the unit 2. Planning and Goal Setting Conduct review discussions/ wake-up meetings as and when required Plan goals & performance needs for APs in a periodic manner Be an expert in the sales process and conduct mechanisms to build the same with ones team through periodic on-floor coaching Own the operational aspects of coding a new AP and other day-to-day interactions with support functions whenever required 3. Developing and Coaching Handle the selection to on-boarding process of the Aps Take responsibility for the APs income Help whenever needed in prospecting/suspecting activity in the field Operate as a product Subject Matter Expert Attend joint field work activity Contact APs who are falling short of the Contract Maintenance criteria to either reactivate them or arrange for their training 4. Key points to Highlight Only Graduates can apply. Must be current year passed - out 2019. No arrears in previous semesters. Must be the locate of Bangalore. 2 months as interns then on-rolls . Walk In Date: 13th June 2019 Timings - 11:00 AM- 3:00 PM Interview Address : Kotak Mahindra Life Insurance Co. Limited, No.102 & 105, 1st Floor, Cears Plaza, No.136, Residency Road, Bangalore - 560025 Interviewer: Pramod Kundapur","location":"Bangalore","experience":"0 - 1 Years"},{"date":"13, 14, 15, 17, 18, 19, 20 - Jun - 2019","skills":"chat technical support international process technology solutions","qualification":"B.Sc, BCA/BCS, B.E./B.Tech, B.A., B.Com, B.B.A, B.Sc","address":"Stellar Information Technology Pvt. Limited, D 16, Infocity II, Sector 33, Gurugram, Haryana - 122 001","phone":"Not Provided","profile":"Technical Support Executives \nStellar Information Technology Private Limited","description":"Stellar is looking for technical support executives to handle its Voice and web process. The role involves handling inbound and outbound calls / web, chat and email queries. The profile involves dedication in assisting customers to use our software well in a professional manner and get a good WOM generated. A quality score of minimum 85% is to be maintained. Handle Inbound calls & Outbound calls Web support > Chat and Emails Response in defined TAT Maintain Quality benchmark Generate product sales Generate business through upsell Desired Qualification, Skills & Experience: Graduate, BCA or BSC (IT) Preferred Excellent command over English language (Oral & Written) Good writing skills Good time management skills Willingness to work in 24/5 Shift environment 1-3 years experience out of which minimum six months experience in International technical support process is needed Soft Skills & Communication Skills A candidate must have - Good communication skills with a clear diction Ability to construct simple and sensible sentences Ability to understand spoken American English Good problem solving skills Ability to approach problems logically Strong customer service focus Ability to work under pressure Technical Knowledge & Skills Technical troubleshooting skills Familiarity with Operating Systems (Windows 10, 8, Vista, 2000/NT, Mac etc.) Knowledge of computer hardware & networking Knowledge of Browsers & Internet based applications Knowledge of Email applications and usage Knowledge of HDD, memory cards, Card Readers and Flash Drives. Good Typing speed : 30-40 words / min Technical troubleshooting skills Familiarity with Operating Systems (Windows 10, 8, Vista, 2000/NT, Mac etc.) Knowledge of computer hardware & networking Knowledge of Browsers & Internet based applications Knowledge of Email applications and usage Knowledge of HDD, memory cards, Card Readers and Flash Drives. Good Typing speed : 30-40 words / min 5 days working / Saturday Sunday fixed off/ Blended process Candidates residing in Gurgaon or willing to relocate could apply for this opening 24*5 rotational shifts month wise (in bound calls environment) 3 shift timings : (5 AM-2 PM), (12 PM-9), PM), (8 PM-5AM) For Girls : Fixed Morning Shift 8:00 am- 05:00 PM Date of Interview : 13th to 20th June 2019 / Sunday off Time: 9:00 AM - 03:00 PM Venue Details: Stellar Information Technology Pvt. Limited, D 16, Infocity II, Sector 33, Gurugram, Haryana - 122 001 Contact Person : Dinesh (HR)","location":"Gurgaon","experience":"1 - 4 Years"},{"date":"15 - Jun - 2019","skills":"JAVA/ J2EE, Spring MVC & Spring Core","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Concerto Software & Systems Private Limited, Building No. 305, 2nd Floor, A- Wing, Sector 2, Millennium Business Park, Mahape, Navi Mumbai - 400 710","phone":"Not Provided","profile":"Software Engineer - Java/ J2EE \nConcerto Software & Systems Pvt. Limited","description":"Skills Required: 1-3 year experience on JAVA/ J2EE projects. Should have experience working on Spring MVC & Spring Core. Candidate must have expertise in Core Java Should have worked on Servlet, JSP, HTML5, CSS, JQuery, JavaScript and AJAX Should have worked on Hibernate. Should have worked in n-Tier applications Should have worked on MSSQL / Oracle and should have experience in writing queries. Roles & Responsibilities: The roles and responsibilities include: Analyse the requirement and prepare understanding document & impact document Develop & Unit test n-Tier applications Deliver applications with quality and within timelines Co-ordinate with TL for requirement understanding Follow code management processes & coding standards Learn new technologies if required and implement in the projects Walk-in Date: 15th June 2019 Timing:- 10 am to 1 pm Interview Venue: Concerto Software & Systems Private Limited Building No. 305, 2nd Floor, A- Wing, Sector 2, Millennium Business Park, Mahape, Navi Mumbai - 400 710","location":"Mumbai","experience":"1 - 3 Years"},{"date":"10, 11, 12 - Jun - 2019","skills":"Java/ JSP/ Servlet/ JQuery, Java Script, XML Programming, HTML, CSS etc","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Concentrix Daksh Services India Pvt. Limited, Plot No 5 and 43, Divyasree Trinity, Ground Floor and First Floor HitecCity; Lane Next to Lemon tree, (Opposite to HSBC; Next JPMC) Madhapur, Hyderabad Telangana - 500 081","phone":"Not Provided","profile":"Core Java Developer \nConcentrix Daksh Services India Pvt. Limited","description":"Open Walk-in for Core Java Developer from 10th - 12th June 2019, at Concentrix Daksh Services India Pvt. Limited - Hyderabad Years of Experience: 2 to 4 Years Must-have Skills: Hands on design/ coding experience on Core Java programming language. XML - Be an expert Web services - Should be handson Basic knowledge on JavaScript, JSON is required. Junit, code coverage in Java code would be required. Basic knowledge on VoiceXML would be added advantage. Working experience on source code repository such as SVN, BIT Bucket, GitHub etc. is required. Working experience on Eclipse IDE and linking source code repository. Working experience on bug tracking tools such as Jira, Bugzilla, IBM Clearcase, HPs ALM tool etc. is required. Knowledge on Agile methodology would be added advantage. Great Analytical and Trouble-Shooting skills. Excellent communication (written, spoken, and presentation) skills. Date : Monday 10th June 2019 to Wednesday 12th June 2019 Walk-in Timings :- 10 AM to 4.00 PM Venue Details:- Concentrix Daksh Services India Pvt. Limited Plot No 5 and 43, Divyasree Trinity, Ground Floor and First Floor HitecCity; Lane Next to Lemon tree, (Opposite to HSBC; Next JPMC) Madhapur, Hyderabad Telangana - 500 081 Required :- Someone who is Serving NP/ Who are available to join at the earliest","location":"Hyderabad","experience":"2 - 4 Years"},{"date":"11, 12, 13, 14 - Jun - 2019","skills":"Java/ J2EE, Core Java, Javascript, Struts, Data Structures, and Multi-threading","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"BancTec India Private Limited (Now a part of Exela Technologies), 9th Floor, ICC Tech Park Tower A, Senapati Bapat Road, Pune - 411 016","phone":"020-67437690","profile":"Java/ Angular Developer \nBancTec India Private Limited","description":"Java Developer with experience in building high-performing, scalable, enterprise-grade applications. You will be part of a talented software team that works on mission-critical applications. You will be responsible for Java application development while providing expertise in the full software development lifecycle, from concept and design to testing. Primary Skills: 3+ years of hands-on Software Development experience 3+ years of experience in Java Web Application Development Hands on experience in Core Java with good in OOPS Concepts. Hands on experience in HTML5, CSS3, Bootstrap and XML. Framework: Spring, Hibernate Angular 2/4/5/6 (Mandatory), Webservices. Core JAVA, JDBC, Hibernate Hands on experience in jQuery, Javascript & Ajax Framework Hands on experience in designing and developing applications using Java platforms Hands on experience in the Web service Development Hands on experience in Eclipse IDE, Version Control System CVS/SVN/other Experience in developing web applications using at least one popular web framework (Struts , Spring MVC) Profound insight of Java and JEE internals (Class loading, Memory Management, Multithreading, Transaction management etc.) Hands on experience in Apache Tomcat / JBoss Graduate in B.E/B.Tech/M.E./M.Tech/MCA or equivalent Excellent verbal and written communication skills Secondary Skills: Good knowledge of Relational Databases, SQL and PSQL ORM technologies like Hibernate Hands on JMS ( Java Messaging Service ) Hands on GIT, Maven, Ant and Jenkins or equivalent If you hold similar experience as per our requirement then please walk in to the below address: BancTec India Private Limited (Now a part of Exela Technologies), 9th Floor, ICC Tech Park Tower A, Senapati Bapat Road, Pune - 411 016 Walk-in Date: 11th June to 14th June Time: 11.00 am - 3.00 pm Contact Number: 020-67437690/020-67437573 *Hands on experience in Angular is a must *Immediate Joiners Only","location":"Pune","experience":"3 - 5 Years"},{"date":"12, 13, 14 - Jun - 2019","skills":".Net, PHP, Python or JavaScript technologies","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Travelyaari, No. 412, Third Floor, 100 ft Road, 4th Block, Koramangala, Bangalore - 560 034","phone":"080-43727990","profile":"Software Developer (PHP/ .Net) \nMantis Technologies Private Limited","description":"We are hiring for Freshers and near-Freshers who have good programming knowledge and strong exposure to algorithms and data structures. You should be willing to learn new technologies and programming on the go, currently, you will be working on .Net, PHP, Python or JavaScript technologies. Work Experience: Fresher till 1 year of work experience Job Location: Koramangala, Bangalore If you are interested, please walk-in to our office between 12th-June till 14th June, 2019. Please find below the office address- Travelyaari No.412, Third Floor, 100 ft Road, 4th Block, Koramangala, Bangalore - 560 034 Landmark: Opp to Sukh Sagar Hotel Interview process- Round 1 - Written aptitude and programming test Round 2 - face to face technical interview with the team Round 3 - face to face interview with the manager","location":"Bangalore","experience":"0 - 1 Years"},{"date":"12, 13 - Jun - 2019","skills":"JSE/ JEE, Spring MVC, JSP/ Java Scripts, Ajax, Jquery, Hibernate/ JPA, SQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Concentrix Daksh Services India Pvt. Limited, Prasad Technology Park Tower A, No: 97, EPIP (Whitefield Ind. Area), Survey no. 152, Hoody Hobli, Krishnarajapuram taluk, Bangalore - 560 066","phone":"8867996428","profile":"Software Engineers - Java \nConcentrix Daksh Services India Pvt. Limited","description":"Candidate should have 2 to 4 years of experience in Core and Advanced Java, Spring & Hibernate and Tools like SVN, maven. Should have experience on working HTML, CSS and JavaScript/ jQuery. Must have excellent written and verbal communication skills Experience in Database technology: Oracle Ability to absorb, understand, analyze and identify critical problems that may result in an outage Desire to work in a collaborative, small-team, fast-paced and demanding support environment. Willing to learn new technology and implement the same Write well-designed, testable code Develop software verification plans and quality assurance procedures Document and maintain software functionality Troubleshoot, debug and upgrade existing systems (Production Support) Desired Skills & Knowledge: JSE/ JEE -Mandatory Spring MVC -Mandatory JSP/ Java Scripts - Mandatory Ajax & Jquery - Mandatory Hibernate / JPA - Mandatory SQL - Mandatory Walk-in Date/ Time: 12th June - 13th June , 9 AM onwards Interview Venue: Concentrix Daksh Services India Pvt. Limited Prasad Technology Park Tower A, No: 97, EPIP (Whitefield Ind. Area), Survey no. 152, Hoody Hobli, Krishnarajapuram taluk, Bangalore - 560 066","location":"Bangalore","experience":"2 - 4 Years"},{"date":"10, 11, 12, 13, 14 - Jun - 2019","skills":"Java, Hibernate, Spring, Web Services, Software Engineering, Web Technologies","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Enterprise Touch Private Limited, Ground Floor, RR Tower IV, Thiru Vi Ka Industrial Estate, SIDCO Industrial Estate, Guindy, Chennai - 600 032","phone":"Not Provided","profile":"Sr. Software Engineer (Java) \nEnterprise Touch Private Limited","description":"Proficient in web services development for Mobile and web apps Knowledge in any mobile development framework Experience in banking domain desirable Experienced Spring Hibernate & Agile Proficiency in analyzing & solving problems related to project Walk-in Date/ Time: 10th - 14th June 2019, 2 PM onwards Interview Venue: Enterprise Touch Private Limited Ground Floor, RR Tower IV, Thiru Vi Ka Industrial Estate, SIDCO Industrial Estate, Guindy, Chennai - 600 032","location":"Hyderabad","experience":"2 - 4 Years"},{"date":"11, 12 - Jun - 2019","skills":"General Administration, Office Management, Front desk/ Receptionist Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"V Protect Powered By SIS Prosegur Pvt. Limited, Plot No. 10, GNG Tower 4th Floor, Sector -44 Gurgaon (Nearest Metro station Huda City Center)","phone":"9899206328","profile":"Admin Executive (Female) \nV Protect Powered By SIS Prosegur Pvt. Limited","description":"Person should be Any Garduate/ Computer literate with programmes such as word, excel, etc. Must have good Interpersonal and communicative skills. Organisational skills and ability to prioritise. Only Female candidates can apply. Job Responsibilities- Responsible for managing entire day today admin activities, Ticket bookings, hotel bookings for the clients and for business trips Forming and maintaining employee records Updating databases internally, such as attendance and leave records. Vendor & Invoice management. Communicating with external partner Assisting with payroll by providing the department with relevant employee information, i.e. holiday and sick days taken Helping with various arrangements internally, from travel to processing expenses Walk-in Date: 11th - 12th June 2019 Timings : 1100 am- 2:00 pm only Interview Venue: V Protect Powered By SIS Prosegur Pvt. Limited Plot No. 10, GNG Tower 4th Floor, Sector -44 Gurgaon (Nearest Metro station Huda City Center) Contact Person: Pallavi Bhatnagar Contact No. 9899206328","location":"Gurgaon","experience":"1 - 4 Years"},{"date":"13, 14 - Jun - 2019","skills":"Insurance Process Back - Office Processing, Admin operations","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Indium Software (India) Limited, #64, Ganesh Chambers, Eldams Road, Chennai - 85","phone":"Not Provided","profile":"Trainee - Java Developer \nIndium Software (India) Limited","description":"Indium Software (India) Limited is looking for Trainee Java Developer at Chennai Fresher with 0- 6 months experience from 2018/19 batch with BE/ B. Tech/ MCA/ BCA background Excellent knowledge in OOPS, Core JAVA, Database concepts Excellent communication is mandatory Walk-in Date/ Time: 13th - 14th June , 10 AM onwards Interview Venue: Indium Software (India) Limited #64, Ganesh Chambers, Eldams Road, Chennai - 85","location":"Chennai","experience":"0 - 1 Years"},{"date":"11, 12, 13 - Jun - 2019","skills":"OOPS, Java / C, C++, HTML","qualification":"B.E./B.Tech","address":"LeewayHertz Technologies Private Limited, Tower B - 1501; Unitech Cyber Park; Sector 39; Gurgaon; Haryana - 122 002","phone":"0124-4530666","profile":"Full Stack Developer/ Java Trainee \nLeewayHertz Technologies Pvt. Limited","description":"Candidate must have done B.Tech - CS/ IT Should have strong knowledge of OOPS, Java / C, C++, HTML Should be keen to learn multiple technologies. Passionate to work on mobile and web development Programmer/ Coder only Aable to learn and responsible to develop either iOS, Android or Web Applications. Able to learn and responsible to develop a cross-platform application Developing re-usable application frameworks and user interface Walk-in Date/ Time: 11th June - 13th June , 10 AM onwards Interview Venue: LeewayHertz Technologies Private Limited Tower B - 1501; Unitech Cyber Park; Sector 39; Gurgaon; Haryana - 122 002","location":"Gurgaon","experience":"0 - 1 Years"},{"date":"11, 12, 13, 14, 15 - Jun - 2019","skills":"General Administration, Project Coordination, Back - Office Processing","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Genzeon Technology Solutions Private Limited, #408, 4th Floor PSR Prime Towers, Beside DLF Building Gachibowli, Hyderabad - 500 32","phone":"Not Provided","profile":"Java Developers \nGenzeon Technology Solutions Pvt. Limited","description":"Genzeon Technology Solutions Pvt. Limited, is looking for Multiple Java Developers to join our team at Hyderabad office. Required Skills: Minimum 2 year of experience working with: Core Java, Spring, Hibernate Experience with Web Technologies like XML, XSL, JSON, Angular & Dojo Expertise with RDMS Databases (SQL, Oracle, DB2) Should have proficiency in Multi-threading, Caching, and Data Structures Strong analysis and design skills including OO design patterns Performance tuning skills. Experience building highly scalable, high performance, highly integrated web applications. Nice to Have: IBM - ILOG JRules BRMS(Business Rules Management System) IBM - Sterling OMS(Sterling Order Management System) E-commerce Domain experience Walk-in Date/ Time: 11th June - 28th June , 11 AM onwards Interview Venue: Genzeon Technology Solutions Private Limited, #408, 4th Floor PSR Prime Towers, Beside DLF Building Gachibowli, Hyderabad - 500 32","location":"Hyderabad","experience":"2 - 5 Years"},{"date":"15 - Jun - 2019","skills":"Back-Office Processing, Non Voice, Backend Operations","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"PruTech Solutions India Private Limited, Location: 4th Floor, A Block Unit 1, MJR Magnifique, Khajaguda X Road, Hyderabad - 500 008","phone":"Not Provided","profile":"Java Developer/ Freshers \nPruTech Solutions India Pvt. Limited","description":"Walk-in Drive for Java Developer/ Freshers at PruTech CMMI Level 3 Company on Saturday (15.06.2019) We are hiring Freshers for the positions of Java Developers DotNet Developers and Python Developers. Candidates should have undergone for the Training either on Core Java/ DotNet/ Python Eligibility Criteria: Qualification: MCA/ BE/ B.Tech - 2017, 2018 and 2019 Pass Outs Work Experience: 0 - 1 Years Job Location: Hyderabad Should have good Knowledge on the Programming Lanaguages like Java/ DotNet/ Python Should have excellence in the Academins Should possess Good Communication Skills Notice Period: Immediate Interview Process: Written Test, Group Discussion and Technical Interview Venue Details : PruTech Solutions India Private Limited, Location: 4th Floor, A Block Unit 1, MJR Magnifique, Khajaguda X Road, Hyderabad - 500 008 Contact Person Name : Keerthi Chekuri","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"15 - Jun - 2019","skills":"Java Script , JQuery or Anuglar JS, Spring, Hibernate & JSF/ Spring Boot","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"3i Infotech Limited, ICICI Towers, Plot No. 12, Tower III, South Wing, 5th Floor, Financial District, Nanakramguda, Gachibowli, Hyderabad - 500 032","phone":"044-71622450","profile":"Java Developers \n3i Infotech Limited","description":"Work Experience: 3 to 5 Years Language: Java Front end Technologies: Java Script, JQuery or Anuglar JS Frameworks: Spring, Hibernate & JSF/ Spring Boot Interested candidates can walk-in to the below venue- Date: 15th June, 2019 Time: 10 AM to 12.30 PM Venue: 3i Infotech Limited ICICI Towers, Plot No. 12, Tower III, South Wing, 5th Floor, Financial District, Nanakramguda, Gachibowli, Hyderabad - 500 032 Contact Person: Satya Note: Candidate must carry Govt.ID Proof and should be in full formals.","location":"Hyderabad","experience":"3 - 5 Years"},{"date":"11 - Jun - 2019","skills":"JAVA, Core-Java, HTML, C++, C","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Northcorp Software Private Limited, Tower-A, 502-503, Digital Greens, Sector 61, Gurugram - 122 102","phone":"8630370961","profile":"Java Developer/ Fresher \nNorthcorp Software Private Limited","description":"Northcorp Software Private Limited, is looking for Java Developer/ Fresher. Candidate should have skills like JAVA, Core-Java, HTML, C++, C Walk-in Date/ Time: 11th June 2019, 10 AM onwards Interview Venue: Northcorp Software Private Limited, Tower-A, 502-503, Digital Greens, Sector 61, Gurugram - 122 102 Contact Person - Deepa Tripathi Tel: 8630370961","location":"Gurgaon","experience":"0 - 1 Years"},{"date":"11, 12, 13, 14 - Jun - 2019","skills":"General Administration, Office Management, Record Keeping","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Provana India Private Limited, A-32, Ground Floor, Sector-2, Noida - 201 301. Near by 15 Metro Station","phone":"Not Provided","profile":"Administration Executive \nProvana India Private Limited","description":"Candidate should be Any Garduate with 1 to 4 years of experience in General Administration, Office Management, Record Keeping, Water Supply, Air Conditioning and Office Administration Job Responsibility- Inventory check of the in-house stock To ensure power, water supply & air conditioning in the office all the time Cab ordering for employees and record keeping. Seating plan check Managing office requirement on working Saturday Open for rotat shift Walk-in Date/ Time: 11th June - 14th June , 11 AM onwards Interview Venue: Provana India Private Limited A-32, Ground Floor, Sector-2, Noida - 201 301. Near by 15 Metro Station Please mention 'Gopal Sharma' on Resume","location":"Noida","experience":"1 - 4 Years"},{"date":"10, 11, 12 - Jun - 2019","skills":"Administration, Facilities Management, Housekeeping, Canteen/ Transportation","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Continuum Managed Solutions Pvt. Limited, Block Rhine, A Wing, 5th Floor, Embassy Tech Zone, Hinjawadi Phase II, Hinjewadi Rajiv Gandhi Infotech Park, Hinjawadi, Pune, Maharashtra - 411 057","phone":"7391055666","profile":"Administration Executive \nContinuum Managed Solutions Pvt. Limited","description":"Candidate should have atleast 2 years of experience in Admin & facilities Management Should be good in communication skills. be comfortable to work in 24*7 shifts. Required skills: Should have handled Housekeeping, Cafeteria, Security, Transport General office administration. Working knowledge on HVAC, Fire alarm systems, Plumbing & Electricals supplies Roles & Responsibility: Ensuring Zero Downtime of business process and Office facility services to be made available 24*7. Providing Safe & smooth working conditions in the office premises. Monitoring Group/ Department Policies & Procedures Vendor Management and Statutory Compliances Walk-in Date/ Time: 10th - 12th June , 11 AM onwards Interview Venue: Continuum Managed Solutions Pvt. Limited Block Rhine, A Wing, 5th Floor, Embassy Tech Zone, Hinjawadi Phase II, Hinjewadi Rajiv Gandhi Infotech Park, Hinjawadi, Pune, Maharashtra - 411 057","location":"Pune","experience":"2 - 7 Years"},{"date":"10, 11, 12, 13, 14, 15 - Jun - 2019","skills":"General Administration, Travel Management, Office Administration","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Nipun Net Solutions Private Limited, 5th Floor, Flat No: 501 & 502, Plot No: 802 & 803, Ayyappa Central, Sri Swamy Ayyappa Society, Madhapur, Hyderabad - 500 081","phone":"Not Provided","profile":"Administration Executive \nNipun Net Solutions Private Limited","description":"Candidate should be Any Graduate with 0 to 1 year experience in General Administration, Travel Management, Office Administration. Must have excellent communication skills. Job Responsbility- Needs to Look after Complete Office administration Need to maintain Inward and Outward Register of Stock Need to Maintain and file the Purchase and Sales invoices Need to book the travel tickets to the employees for tours Walk-in Date/ Time: 10th - 15th June , 10 AM onwards Interview Venue: Nipun Net Solutions Private Limited, 5th Floor, Flat No: 501 & 502, Plot No: 802 & 803, Ayyappa Central, Sri Swamy Ayyappa Society, Madhapur, Hyderabad - 500 081","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"10 - Jun - 2019","skills":"Manual Testing Software Testing Test Engineering UI Testing Writing Test Cases","qualification":"B.E./B.Tech","address":"EbizON Netinfo Private Limited, 7th Floor, Tower A Logix Cyber Park, C-28-29, Industrial Area, Sector 62, Noida","phone":"Not Provided","profile":"Quality Analyst/ Software Tester \nEbizON Netinfo Private Limited","description":"Urgent openings for Quality Analyst role with problem solving abilities and the aptitude to take corrective action and support interesting projects. Education : B.Tech with 70% throughout the academics. Experience : 0.6 - 2 Years of experience Preferred : Immediate or early joiners. Must have good Analytical skills (i.e should be able to well understand the requirements) Should have experience in Usability testing, UI testing and writing Test cases Should have good communication skills Job Responsibility: Work with the development teams to ensure each release meets high quality standards Create test plans and test cases from wire-frames Execute manual test cases, report and track issues in ticketing systems, and verify fixes Building a strong working relationship with all the teams More to offer: Competitive salary and timely increments Potential Career Growth to Lead role for high performers Team & Individual Learning and Development is part of our culture Vibrant community and regular team outs Great team members & energy filled work environment Interview Date : 10th June 2019/Monday. Time : 11AM - 2 PM Interview/ Work Location : EbizON Netinfo Private Limited 7th Floor, Tower A Logix Cyber Park, C-28-29, Industrial Area, Sector 62, Noida","location":"Noida","experience":"0 - 2 Years"},{"date":"10 - Jun - 2019","skills":"General Administration, Back Office Assistance, Branch Operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Koenig Solutions Private Limited, 2nd Floor, KLJ Complex-II, Plot No. 70, Opp. Police Station, Moti Nagar, New Delhi - 110 015","phone":"8826055199","profile":"Administration Executive \nKoenig Solutions Pvt. Limited","description":"Koenig Solutions Pvt. Limited, is looking for candidates with Administration/ Sales Coordination experience. Work Timings 8:30 to 5:00pm Monday to Saturday Job Responsbility- Center Operations, Administrative assignments, Student handling Walk-in Date/ Time: 10th June 2019, 9 AM onwards Interview Venue: Koenig Solutions Private Limited 2nd Floor, KLJ Complex-II, Plot No. 70, Opp. Police Station, Moti Nagar, New Delhi - 110 015","location":"Delhi","experience":"2 - 7 Years"},{"date":"10 - Jun - 2019","skills":"Core Java, J2EE and framework like Struts, Hibernate, Spring, MVC","qualification":"B.Sc, BCA/BCS, B.E./B.Tech, B.A., B.Com, B.B.A, B.Sc","address":"Amazon Development Centre (India) Pvt. Limited, Ground Floor, Infinity tower, Tata Ramanujan IT City SEZ, Rajiv Gandhi Salai, Near Tidal Park, Old Mahabalipuram Rd, Taramani, Chennai - 600 113","phone":"Not Provided","profile":"Quality Assurance Associate \nAmazon Development Centre (India) Pvt. Ltd","description":"Amazon is hiring Quality Assurance Associate for Chennai location, this is a Contract role for a period of 6 months. Please find the below Job Description for the same and criteria to apply for this role. You may appear for the interview if you find yourself matching the below criteria. Eligibility Criteria: Freshers / candidates with less than one year of experience. Course Completion Year: 2017/2018/2019 Passed Outs (Only candidates, who have completed & cleared their educational degree and have all Semester Mark sheets should apply) Immediate Joiners preferred Basic Qualifications: Functioning knowledge of Microsoft systems including: Word, Excel Fluent English language skills (spoken and written) Ability to meet deadlines in a fast-paced work environment driven by software systems and processes Ability to trouble-shoot and make visual quick decisions based on training Ability to work weekends Preferred Qualifications: Knowledge/experience in publishing industry would be preferred Experience in quality assurance Experience in tracking data Aptitude to quickly learn new systems and software Ability to multi-task and prioritize, with strong organizational and follow-up skills Interview Date: 10th June 2019 Walk-in Time : 10:30 AM to 2:00 PM Interview Venue: Amazon Development Centre (India) Pvt. Limited Ground Floor, Infinity tower, Tata Ramanujan IT City SEZ, Rajiv Gandhi Salai, Near Tidal Park, Old Mahabalipuram Rd, Taramani, Chennai - 600 113 Valid ID proof needed : Carry a valid photo identification proof (Aadhar Card, Pan Card or any other Government recognized photo identification) Interview Process: Written Test Managerial interviews","location":"Chennai","experience":"0 - 1 Years"},{"date":"10, 11 - Jun - 2019","skills":"Automation Testing, Selenium, QTP, White Box Testing, Functional Testing, Smoke Testing","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Infiniti-Research Marketing Solutions India Pvt. Limited, Bangalore Cessna Business Park, Embassy Signet, 1st Floor - Left Wing Kadubeesanahalli, Bangalore - 560 087.","phone":"080-61914606","profile":"Software Testing Engineer \nInfiniti Research Marketing Solutions India Pvt. Limited","description":"Key Requirements: 3-4 Years of hands on experience in Automation testing with good product experience Having good experience in Nunit testing, smoke testing, functional testing, blackbox & whitebox testing. Strong debugging and basic programming skills Automation tool experience will be preferred (Selenium, QTP etc. , ) Understanding of the principles and framework of Agile development Strong technical skills and logic are required. Primary Responsibilities: The candidate will be responsible for analyzing, testing, and evaluating software products. Ensure all products meet end-user and Company requirements and standards. Essential Responsibilities: Test for overall quality, accuracy, functionality and performance. Working closely with Development and Product Management teams, assist in the design of features for baseline and custom software development. Analyze, test, and evaluate software to ensure all products meet end-user and Company requirements and standards. . Work with Support and other technical staff to analyze and resolve product related issues. As a team member, help formulate solutions to complex problems and work to resolve open software issues. Walk-in Date/ Time: 10th - 11th June , 11 AM onwards Interview Venue: Infiniti-Research Marketing Solutions India Pvt. Limited Bangalore Cessna Business Park, Embassy Signet, 1st Floor - Left Wing Kadubeesanahalli, Bangalore - 560 087. (Opp. to Walmart Labs, Near New Horizon Engineering College) Contact Person: Shruti","location":"Bangalore","experience":"3 - 5 Years"},{"date":"10, 11, 12 - Jun - 2019","skills":"ASP .NET framework, SQL Server and Design/ Architectural Patterns","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Spigot Software Private Limited, 531/144, 3rd Floor, Outer Ring Road, Agara Village, 1st Sector, HSR Layout, Bengaluru, Karnataka - 560 102","phone":"Not Provided","profile":".Net Developer \nSpigot Software Private Limited","description":"Required Skills- 4 to 7 years knowledge of .NET Web framework. Familiarity with the ASP .NET framework, SQL Server and Design/ Architectural Patterns (e.g. Model-View-Controller (MVC)) Knowledge of at least one of the .NET languages (e.g. C#, Visual Basic .NET) and HTML5/ CSS3. Strong understanding of object-oriented programming. Experience creating database schemas that represent and support business processes. Knack for writing clean, readable, and easily maintainable code. Experience advocating for and using new technology to build applications of the future. Job Responsibilities: Assist in the design, development, and support of an enterprise web hosting plat formand related components. Translate application storyboards and use cases into functional applications. Design, build, and maintain efficient, reusable, and reliable code. Integrate data storage solutions in SQL server. Ensure the best possible performance, quality, and responsiveness of applications. Participate in all phases of the lifecycle of software application development with an emphasis on design, quality and implementation. Walk-in Date/ Time: 10th - 12th June , 10 AM onwards Interview Venue: Spigot Software Private Limited 531/144, 3rd Floor, Outer Ring Road, Agara Village, 1st Sector, HSR Layout, Bengaluru, Karnataka - 560 102 Contact Person: Subburaj P Mobile: 9036016263 Interested Candidates, please mail your updated cv to subburaj.p@spigotsoft.com","location":"Bangalore","experience":"4 - 7 Years"},{"date":"10 - Jun - 2019","skills":"SQL Queries, Regression Testing, Manual Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Wipro; Candor Info Space Building 2, Subhash Chowk, Tikri, Sec 48 Gurgaon - 122 001","phone":"Not Provided","profile":"Software Testing Engineer \nWipro HR Services Private Limited","description":"Education Qualification - B.E./B.Tech./MCA Experience - 1.6 to 3 Years Immediate joiner - can join within 1 month Designation - Analyst Knowledge of SQL Queries, Regression Testing, Manual Testing Knowledge of designing Test Plan Able to work on assigned tasks independently and also handle queries from fellow team members Good Analytical Skills & problem solving skills Have the ability to escalate issues with a view to bringing about a win-win resolution Good written & spoken communication skills Walk in on - 10th June (Monday) Walk in time - 11:00am to 1:00pm Interview Venue: Wipro; Candor Info Space Building 2, Subhash Chowk, Tikri, Sec 48 Gurgaon - 122 001 Contact Person - Kajol Singh","location":"Gurgaon","experience":"1 - 3 Years"},{"date":"10, 11, 12, 13, 14 - Jun - 2019","skills":"Automation Testing, Functional Testing, Regression Testing, Web Application Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Acknown Technologies Private Limited, 420, 4th Floor, Nirvana Courtyard, Nirvana Country, Sector- 50 Gurgaon,","phone":"9625882814","profile":"QA/ Testing Engineer \nAcknown Technologies Private Limited","description":"We are looking for a QA Tester to assess software quality through manual and automated testing. You will be responsible for finding and reporting bugs and glitches. In this role, you should have a keen eye for detail and excellent communication skills. If you are also competent in executing test cases and are passionate about quality, wed like to meet you. Ultimately, you will ensure that our products, applications and systems work correctly. Candidate must have proven experience as a QA Tester should have experience in QA methodology Ability to document and troubleshoot errors Excellent communication skills Analytical mind and problem-solving aptitude Strong organizational skills Candidate must be familiar with software testing process and its documentation (i.e test plan, test cases, test report etc.). Familiar with different type of software testing techniques. i.e. Functional Testing, regression testing, sanity, and smoke, Browser based testing, Responsive application testing. Must have exposure in web application testing and Mobile app (iOs or Android) testing. Must have understanding about different aspects of web sites security. Must have knowledge about defect/ bug reporting and its life cycle. Knowledge of web services testing (REST and SOAP) would be preferred. Knowledge of Selenium webdriver and Jmeter would be preferred. Job Responsibilities:- Ability to understand application requirement given by client/ business team and he/she should be able to prepare documents for test cases, test scenarios for provided requirements. Walk in Details: Date : 10th June - 14th June Time: 12 PM- 6 PM Interview Venue: Acknown Technologies Private Limited 420, 4th Floor, Nirvana Courtyard, Nirvana Country, Sector- 50 Gurgaon, Contact Person: Kapil Tel: #9625882814","location":"Gurgaon","experience":"3 - 6 Years"},{"date":"10, 11 - Jun - 2019","skills":".NET Projects, HTML and SQL Server","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Karvy Fintech Private Limited, (Formerly known as KCPL Advisory Services Pvt. Limited), Karvy Selenium Tower B, Plot Nos. 31 & 32, Financial District Nanakramguda, Serilingampally Mandal, Hyderabad - 500 032","phone":"040 33215106","profile":".Net Developers \nKarvy Fintech Private Limited","description":"Opportunity in one of our leading Business Unit for .Net Developers with HTML & SQL understanding too. Candidate should have minimum 1 to 3 years of hands-on development experience with the following technologies: .NET Projects, HTML and SQL Server. Must have extensive experience in developing N-tier applications. Should have good experience with reporting tools. DATE: 10th - 11th June 2019 TIME: 12 PM to 3 PM VENUE: Karvy Fintech Private Limited (Formerly known as KCPL Advisory Services Pvt. Limited) Karvy Selenium Tower B, Plot Nos. 31 & 32, Financial District Nanakramguda, Serilingampally Mandal, Hyderabad - 500 032 Tel: 040 33215106 CONTACT PERSON: SHRUTHI The following documents are mandatory and we request you to bring these for the discussion 1. Copy of your updated resume (Mention Shruthi on the top of your CV) 2. Proof of identification 3. Passport Size photograph.","location":"Hyderabad","experience":"1 - 3 Years"}]}