{"Walkins":[{"date":"16 - Nov - 2019","skills":"Java, Unit Testing. Technical Support, Javascript, Database Design","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Datazoic Machines Private Limited, 141, TVH Agnitio Park, 2nd Floor, OMR, Kandanchavadi, Chennai - 96","phone":"Not Provided","profile":"Java Developers \nDatazoic Machines Private Limited","description":"Responsible for providing a technical design of the solution to meet the requirements as explained in the BRD. Develop class diagrams, database diagrams based on existing methodologies and best practices, explain to the team members. Work with and under the directions of the manager to develop new modules and enhance existing modules of the product. Contribute to the development process by providing enhancements to the methodology and best practices. Create Unit test plans, explain to the team members, perform unit-testing using Junit. Provide technical leadership during certain scenarios, mentor the juniors in the team and assist them in understanding requirements, coding, unit-testing and other development related activities. Depending on the requirements, work on JavaScript/jQuery/Java/ SQL to build/enhance modules of the product. Be flexible enough to switch between these platforms to meet the demands in development and deployment of the products. Walk-in Date/ Time: 16th November 2019, 10 AM onwards Interview Venue: Datazoic Machines Private Limited 141, TVH Agnitio Park, 2nd Floor, OMR, Kandanchavadi, Chennai - 96 Contact Person- Mr Anthony","location":"Chennai","experience":"3 - 8 Years"},{"date":"16 - Nov - 2019","skills":"Spring boot , Core Java and Webservices","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Renault Nissan Technology (India) Pvt. Limited, Adarsh Hamilton 2/4, Langford Garden Road, Richmond Town, Bengaluru - 560 025","phone":"Not Provided","profile":"Java Developers \nRenault Nissan Technology (India) Pvt. Limited","description":"Experience in the development of Responsive Web applications Strong Experience in Spring boot , Core Java and Webservices Good knowledge in Agile methodology and devops Good Communication & Analytical skills Experience : 3+ Years Interview Date: 16th November 2019 Day : Saturday Interview Location : Renault Nissan Technology (India) Pvt. Limited Adarsh Hamilton 2/4, Langford Garden Road, Richmond Town, Bengaluru - 560 025. Contact Person Name: Rama.C Note: Please ignore this mail if you have already attended the interview. Refer some of your friends / Colleagues for the same.","location":"Bangalore","experience":"3 - 8 Years"},{"date":"12, 13, 14, 15, 16, 18, 19, 20, 21, 22, 23, 25, 26, 27, 28, 29 - Nov - 2019","skills":"Core Java/ J2EE , JavaScript , Jquery ,Struts/Spring framework, Oracle DB PL,SQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Infonovum Software and Consulting Pvt. Limited, No 7, Sriman Srinivasa Road, Alwarpet, Chennai - 600 018","phone":"044-42059589","profile":"Java Developer \nInfonovum Software and Consulting Pvt. Limited","description":"Candidate should have 1 to 4 years of experience in the full development cycle, from requirements analysis through operations and maintenance Have strong hands-on experience with: o Java, Spring/ Spring Boot o XML technologies (XPath, XQuery, XSL) o XML databases o Experience with as many of the following is a plus: o HTML5/CSS3 o JavaScript/TypeScript, AngularJS, Angular 2+ o Linux, Windows Agile development methodology Excellent written and oral communication skills Mandatory Skills - Core Java/ J2EE , JavaScript , Jquery ,Struts/ Spring framework, Oracle DB PL, SQL Development Walk-in : Only from Monday to Wednesday (every week) Date: 11th - 29th November , 10 AM - 1 PM Interview Venue: Infonovum Software and Consulting Pvt. Limited No 7, Sriman Srinivasa Road, Alwarpet, Chennai - 600 018 Contact Person- Vidhya P Phone: 044-42059589","location":"Chennai","experience":"1 - 4 Years"},{"date":"13, 14, 15 - Nov - 2019","skills":".Net, C# & SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA","address":"ParadigmIT Group, eCentric Solutions Private Limited, Purva Summit Building, SMARTWORKS, 6th Floor, White Field, Hitech City, Madhapur, Hyderabad - 500 081","phone":"Not Provided","profile":"C# .Net Developer \nParadigmIT Group (eCentric Solutions)","description":"Educational Qualification- BE/ B.Tech/ MCA Criteria: 2017 to 2019 Passouts Only Experience level: 0 to 2 Years Required Skills: Excellent Communication Skills Must have Excellent Knowledge on C# & SQL. Preferred Location:- Hyderabad only Working Hours: 1.00 PM to 10.00 PM Own Transportation Required Walk-in Date: 11th to 15th November (Monday to Friday) Time: 11 AM to 7 PM Interview Location: ParadigmIT Group, eCentric Solutions Private Limited, Purva Summit Building, SMARTWORKS, 6th Floor, White Field, Hitech City, Madhapur, Hyderabad - 500 081 Contact Person- Ramakrishna","location":"Hyderabad","experience":"0 - 2 Years"},{"date":"14, 15 - Nov - 2019","skills":"J2SE, J2EE, Spring , Struts, Webservices and Hibernate","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"DXC Technology India Private Limited, Maruthi Concorde Business Park, Sy No: 30/3 Konappana Agrahara Village, Begur Hobli, Hosur Road, Bangalore - 560 100.","phone":"Not Provided","profile":"Java Backend Developer \nDXC Technology India Private Limited","description":"Person should have 4+ years of experience in software development with Java/ J2EE technologies and Java Portal. Experience in development of enterprise business applications using J2SE, J2EE, Spring , Struts, Webservices and Hibernate. Good Experience in Design, Development and Implementation of application using Java, J2EE & Java. Should involved in SDLC- Software development life cycle. Good Experience in Developing Applications using Collections, Exception, Multithreading and JDBC. Extensive experience on web-based applications and development environments using Java, Servlet, JSP Restful, SOAP, Hibernate and Spring framework. Should worked on backend tools such as SQL server, MySQL , Oracle Walk-in Date/ Time: 14th - 15th November , 9 AM onwards Interview Venue: DXC Technology India Private Limited Maruthi Concorde Business Park, Sy No: 30/3 Konappana Agrahara Village, Begur Hobli, Hosur Road, Bangalore - 560 100. Near to Maruthi Show room (Near to Konappana Agrahara Busstop) Contact Persomn- Srinivasan","location":"Bangalore","experience":"4 - 9 Years"},{"date":"16 - Nov - 2019","skills":"Java, J2EE, AngularJS, Java Script, XSLT, HTML5/CSS, Ajax/ JSON","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"SSP India Private Limited, 4th Floor, Tower A2 DLF World Tech Park, SEZ, Silokhera, Gurugram - 122 002","phone":"Not Provided","profile":"JAVA Developer \nSSP India Private Limited","description":"Candidate should have Bachelors/ Masters degree in Engineering (preferably Electronics, Computer Science, Information Technology) with At least 3 years in design and Development of Java, J2EE applications At least 2 years in AngularJS, Java Script, XSLT, HTML5/ CSS, Ajax/ JSON Strong OOPS concepts, Core Java and various design patterns using JAVA (1.5 or later)Strong knowledge of development best practices, development methodologies & standards. Experienced in J2EE, JSP, Java Servlets, EJB Experienced with Eclipse IDE, SVN version control and continuous integration XML, SQL, DB2/Oracle, WAS and Apache/IBM HTTP server Adhere to industry standard coding practices to write secured and optimized code for all above Thorough understanding of SDLC processes to drive best practices Excellent verbal, written and interpersonal communication skills to interface with various teams Walk-in Date/ Time: 16th November 2019, 9 AM onwards Interview Venue: SSP India Private Limited 4th Floor, Tower A2 DLF World Tech Park, SEZ, Silokhera, Gurugram - 122 002 Contact Person- Gunjan","location":"Gurgaon","experience":"2 - 6 Years"},{"date":"13 - Nov - 2019","skills":"Java, Core Java, C++/ C, Devops, Software Programming","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Alpha Infoconsultants Private Limited, N5 Building 3rd Floor, South Exten, Part 1 New Delhi - 110 049","phone":"8630370961","profile":"Java Developer/ Fresher \nAlpha Infoconsultants Private Limited","description":"We are Direct hiring fresher candidate for the software developer. Candidate should have excellent knolwdge of Java, Core Java, C++/ C, Devops, Software Programming Walk-in interview Date -13/11/2019 (Wednesday) Timing - 10am Interview Venue- Alpha Infoconsultants Private Limited N5 Building 3rd Floor, South Exten, Part 1 New Delhi - 110 049 Contact Person - (HR) 8630370961","location":"Delhi","experience":"0 - 1 Years"},{"date":"12, 13, 14, 15 - Nov - 2019","skills":"Core Java, Data Structures, Multithreading","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Broadridge Financial Solutions, Inc. Divyasree NR Enclave, Whitefield, Bangalore - 560 066","phone":"Not Provided","profile":"Java Developers \nBroadridge Financial Solutions (India) Pvt. Limited","description":"Education: BE / B.Tech / MCA or equivalent is needed Shifts : Willingness to work in Rotational Shifts Job Location: Bengaluru 4 to 10 years of experience in Software Development in Java Technology. Strong in Core Java, Data Structures, Multithreading. Expertise in Springs, JQuery, Java Script, JDS, Servlets & JSP, Unix / Shell Scripting, SQL Hands on Experience on Struts, EJB, Web services, AJAX, JPA, Hibernate, HTML, Angular 2, Jenkins, ReactJS and CSS Experience in Writing test cases using JUnits, Mockito Good to have knowledge on Websphere MQ , Active MQ, distributed Caching techniques i.e. Memcached, Redis. Knowledge on Docker containerization, Elasticsearch, Kibana will be added advantage Exposure on KAFKA, Distributed Caching, Cloud based technologies. Strong Analytical thinking Walk-in Date: 11th to 15th Nov 2019 (Monday to Friday) Timings: 12:00 PM to 5:00 PM Venue Location: Broadridge Financial Solutions, Inc. Divyasree NR Enclave, Whitefield, Bangalore - 560 066 Point Of contact- NCJ, Chakravarthy & Dipannita","location":"Bangalore","experience":"4 - 10 Years"},{"date":"12, 13, 14, 15 - Nov - 2019","skills":"Android Studio and Java, Life CycleF, ront End, Mobile Applications, Web Technologies","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Thumbay Technologies Private Limited, 4th Floor, Prestige Tower, Beside Ritz Carlton Hotel, Residency Road, Bangalore.","phone":"080-68220152","profile":"Android App Developer \nThumbay Technologies Private Limited","description":"Key Skills- Android Studio and Java Roles & Responsibilities- Deliver across the entire app life cycle -concept, design, build, deploy, test, release to app stores and support. Build prototypes at tech scoping stage of projects. Working along the web developers to create and maintain a robust framework to support the apps/web. Working with the front end developers to build the interface with focus on usability features. Create compelling mobile device specific user interfaces and experiences. Optimizing performance for the apps /web. Provide assistance and Mobile Application testing/prototyping framework to testers and support personnels Writes, edits, and debugs new Mobile Application Code for assigned projects, including necessary records and desired output Integrate Mobile Applications with third party Softwares for Payment Gateway, Listing Data, CRM and other applications Document code consistently throughout the development process by listing a description of the program, special instructions, and any changes made in database tables on procedural, modular and database level. Walk-in Date/ Time: 6th November - 15th November , 10 AM onwards Interview Venue: Thumbay Technologies Private Limited 4th Floor, Prestige Tower, Beside Ritz Carlton Hotel, Residency Road, Bangalore. Contact Person- Nisha (080-68220152)","location":"Bangalore","experience":"2 - 5 Years"},{"date":"13, 14, 15, 16, 18, 19 - Nov - 2019","skills":"Front Desk, Office Administration, Receptionist/ Front Office Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Adecco India Private Limited, Montieth Place, No. 47, 2nd Floor, Montieth Road, Egmore, Chennai - 600 008","phone":"Not Provided","profile":"Front Office/ Admin Executive \nAdecco India Private Limited","description":"Qualification :12th Or Any Graduate Experience: Fresher or Experience Work Locations : ANNASALAI Walk-in Date/ Time: 12th November - 19th November , 10 AM onwards Interview Venue: Adecco India Private Limited Montieth Place, No. 47, 2nd Floor, Montieth Road, Egmore, Chennai - 600 008 Opposite To central Bank Near Rajarathinam stadium And Alsa Mall Contact Person: SenTamil","location":"Chennai","experience":"0 - 5 Years"},{"date":"12, 13 - Nov - 2019","skills":"Back Office Assistance, General Administration","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Netscribes (India) Private Limited, Millennium City 5th Floor, Tower 1 DN 62, Street No. 10, Sector V, Bidhannagar, Kolkata - 700 091","phone":"Not Provided","profile":"Back Office Executive \nNetscribes (India) Private Limited","description":"Candidate should be a graduate or awaiting final results with decent communication skill in English both written and verbal and must have an eye for detail. Basic knowledge of E-commerce industry is preferred. Age Limit - 30 years Job Salt-lake, Sector-V, Kolkata Job Responsibilities: To write features and attributes of product through extensive secondary research To adhere the feature guidelines sent from client's end Writing short product descriptions wherever necessary To adhere daily target related to production and quality To keep error benchmark at minimum as specified by the client To participate in periodical trainings as and when conducted by mentors. Walk-in Date/ Time: 12th - 13th November 2019, 11 AM onwards Interview Address: Netscribes (India) Private Limited Millennium City 5th Floor, Tower 1 DN 62, Street No. 10, Sector V, Bidhannagar, Kolkata - 700 091 Please carry your PAN and Aadhar Card at the time of interview.","location":"Kolkata","experience":"0 - 3 Years"},{"date":"16 - Nov - 2019","skills":"ASP .NET, MVC, WEB API, SQL SERVER, C#, JAVA SCRIPT","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Neudesic Technologies Private Limited, 10th Floor, Jyothi Pinnacle, Hitech City Road, Laxmi Cyber City, Whitefields, Kondapur, Hyderabad, Telangana - 500 081.","phone":"Not Provided","profile":".NET Developer \nNeudesic Technologies Pvt. Limited","description":"Neudesic Technologies Pvt. Limited hiring for strong .NET Developers with below skill set- ASP .NET, MVC, WEB API, SQL SERVER, C#, JAVA SCRIPT Walk-in Date/ Time: 16th November 2019, 9 AM onwards Interview Venue: Neudesic Technologies Private Limited 10th Floor, Jyothi Pinnacle, Hitech City Road, Laxmi Cyber City, Whitefields, Kondapur, Hyderabad, Telangana - 500 081. Contact Person- Mr. Ramu Adapa","location":"Hyderabad","experience":"3 - 8 Years"},{"date":"16 - Nov - 2019","skills":"Java, J2EE, Spring, Web Services (Rest & SOAP), JMS","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"NISUM Technologies Private Limited, Corner 29, Plot# 16 & 29, Survey# 54 Near KIMS hospital, Kondapur Main Road, Kondapur, Serilingampally, Hyderabad - 500 084","phone":"9154044185","profile":"Java Professionals \nNISUM Technologies Private Limited","description":"Java Walk-In Drive with NISUM Technologies @ 16th November 2019 (Saturday) Experience:- 4 to 6 Years Work Location:- Hyderabad Java, J2EE, Spring, Web Services (Rest & SOAP), JMS, Hands on full cycle Web development, J2EE, UI and Front end development experience, especially on Java 8 features. Very Good understanding of code quality and Java coding standards. Strong with Spring core, boot, mvc, transaction, jms etc.. across various Spring versions. Experience with Java, J2EE tech stack - capable to write Rest services and expose them securely. Good communication and writing skills required Experience of working in Agile project management teams, BDD & TTD exposure, great understanding of JIRA or any of similar tool is required. Understanding and experience on various caching mechanisms. Please register here:- https://bit.ly/2CCeTCy Walk-in Date: 16th November 2019 Interview timings:- 11: 00 AM to 04:00 PM Interview Venue: NISUM Technologies Private Limited Corner 29, Plot# 16 & 29, Survey# 54 Near KIMS hospital, Kondapur Main Road, Kondapur, Serilingampally, Hyderabad - 500 084 Land Mark : Near KIMS Hospital Contact Person- Rakesh (9154044185)","location":"Hyderabad","experience":"4 - 6 Years"},{"date":"13, 14, 15 - Nov - 2019","skills":"C#, ASP .NET MVC, Jquery/ Javascript, Ajax","qualification":"B.E./B.Tech, MCA/PGDCA","address":"MSC Technology (India) Private Limited, Kosmo One Building, 5th Floor Tower-B, Ambattur Industrial Estate, Chennai -600 058","phone":"Not Mentioned","profile":".Net Developer \nMSC Technology (India) Private Limited","description":"Requirement 1 Candidate should have Strong Experience in C#, ASP .NET MVC Candidate Should be string in Scripting Languages (Jquery/ Javascript, Ajax) Candidates should be good in both oral & written communication skills 2 - 7 years Experience Requirement 2 Candidate should have Strong Experience in C#, SQL Candidates should be good in both oral & written communication skills 3 - 8 years Experience Walk-in Date: 12th November - 15th November Interview Time Slot : 10 AM to 1 PM Venue Details- MSC Technology (India) Private Limited Kosmo One Building, 5th Floor Tower-B, Ambattur Industrial Estate, Chennai -600 058 Reach us for any Clarification : 9962491444 / 7708511188 / 9500026244 Required Documents 1. Updated CV 2. Passport Size Photograph Kindly register your name & mail your updated resume to the below mail ID. To avoid delay coming to Interview Venue or else you may have to wait to collect the Gate Pass Aneesrani.shaikmohideen@msc.com / Sundarrajan.natarajan@msc.com / sukeerthi.dinakaran@msc.com","location":"Chennai","experience":"2 - 7 Years"},{"date":"12, 13 - Nov - 2019","skills":"Front Office Activities, Facility Management, General Administration","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"SRM Institute of Science Technology, 2/21, Pillaiyar Kovil Street, Alinjivakkam","phone":"Not Provided","profile":"Front Office Executive \nSRM Institute of Science Technology","description":"Candidate should be Any Graduate with 0 to 1 year of experience in Front Office Activities, Facility Management, General Administration. Must have excellent communication skills, Walk-in Date/ Time: 12th - 13th November , 9 AM onwards Interview Venue: SRM Institute of Science Technology 2/21, Pillaiyar Kovil Street, Alinjivakkam Contact Person- Senthil Kumar","location":"Chennai","experience":"0 - 1 Years"},{"date":"13, 14, 15 - Nov - 2019","skills":"ASP .NET C# MS SQL MVC Design Patterns","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Atlas Systems Private Limited, #110, NSIC - STP Building, B24, Guindy Industrial Estate, Ekkaduthangal, Chennai - 600 032.","phone":"044-48619805","profile":".Net Developer/ Tech Lead \nAtlas Systems Private Limited","description":"Atlas Systems Private Limited is looking for candidates with 3 to 9 year's experience in the following- ASP .NET C# MS SQL MVC Design Patterns (For Lead) Experience in Product development is a plus Walk-in Date/ Time: 11th - 15th November 2019, 12 PM onwards Interview Venue: Atlas Systems Private Limited #110, NSIC - STP Building, B24, Guindy Industrial Estate, Ekkaduthangal, Chennai - 600 032. Landmark: Nearby Ekkatuthangal Bus Stop, Hyundai Showroom. Contact - Hema (044-48619805)","location":"Chennai","experience":"3 - 9 Years"},{"date":"16 - Nov - 2019","skills":"ASP .Net, Javascript, Jquery, C#, SQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Hotel Hablis, No.19, GST Road, Guindy, Chennai, Tamil Nadu - 600 032","phone":"7994250919","profile":".Net/ Full Stack Developer \nNavigant BPM (India) Private Limited","description":"Navigant BPM (India) Private Limited is hiring Full Stack Developer for our Trivandrum Office. Skills: ASP .Net, Javascript, Jquery, C#, SQL, (Good to have MVC) Work Experience : 3 to 9 Years Work location : Trivandrum Face to Face Interview on 16th November 2019 Location : Chennai Venue: Hotel Hablis No.19, GST Road, Guindy, Chennai, Tamil Nadu - 600 032 Interested candidates can apply with us or can also walk-in directly at the above given venue.","location":"Chennai","experience":"3 - 9 Years"},{"date":"16 - Nov - 2019","skills":".NET Core2.0 (Mandatory) MVC (Mandatory) SQL Azure","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Wipro Limited, T15, ECity Phase 1, Shikaripalya Main Road, Bangalore","phone":"Not Provided","profile":".Net Professionals \nWipro Limited","description":".Net Core / .Net Bootstrap/ .Net MVC JC given below : (1132494 / 1103481 / 1132484 / 1103588- Bangalore) Work Experience : 4 to 10 years Job Locations : Bangalore / Chennai Primary Skills: .NET Core2.0 (Mandatory) MVC (Mandatory) SQL Azure JD 2 Bootstrap for .Net JD 3 ASP.NET MVC 5 Azure JD 4 ASP.NET MVC Angular JD 5 ASP.NET MVC WebAPI Walk-in Date/ Time: 16th November 2019, 9 AM onwards Interview Venue: Wipro Limited T15, ECity Phase 1, Shikaripalya Main Road, Bangalore Please carry your resume & a government ID proof - Mandatory","location":"Bangalore","experience":"4 - 9 Years"},{"date":"16 - Nov - 2019","skills":"C# .Net, ASP .Net Webforms/ MVC, Entity Framework, ADO .Net, SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Selectsys India Private Limited, IT CAPITAL Building, 3rd, Floor, Plot-4, Road No. 45/A, Masthan Nagar, Jubilee Hills Hyderabad - 500 033","phone":"9849360114","profile":".Net Developer \nSelectsys India Private Limited","description":"Required Skills : C# .Net, ASP .Net Webforms/ MVC, Entity Framework, ADO .Net, WCF, Web API, MS SQL Server, JavaScript, JQuery. Work Experience: 2.5 to 5 Years Good at verbal & written communication. Should have working experience in MVC, Web API, MS SQL Server Hands-on Experience in WCF (Windows Communication Foundation)/Web Services Experienced in developing web-based applications. Database Designing, Writing Views, Stored procedures, Functions, and Triggers. Having Good Knowledge in building n -Tier Architecture. Exposure to versioning systems like Subversion and VSS. Ability to work independently and in a team environment effectively with min supervision. Should have excellent analytical & problem-solving skills. Should involve in Client Meetings. Walk-in Date/ Time: 16th November 2019, 10 AM onwards Interview Venue: Selectsys India Private Limited, IT CAPITAL Building, 3rd, Floor, Plot-4, Road No. 45/A, Masthan Nagar, Jubilee Hills Hyderabad - 500 033. Contact Person- Pawan (9849360114)","location":"Hyderabad","experience":"2 - 5 Years"},{"date":"16, 17 - Nov - 2019","skills":"Asp .Net, Web service","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Mosaic Hotels (Unit of Shipra Hotels Limited) C-1, Sector 18, Noida - 201301","phone":"9594862744","profile":"Senior .Net Developer \nMindgate Solutions Private Limited","description":"Educational Qualification: - BE/B. Tech/MCA or BCA/ Bachelor's degree with Degree/ Diploma in Computer Science/ Information Technology. Experience : - Total Minimum 5 years relevant experience in Asp .Net software development Minimum 1 year experience in Web service (SOAP, REST, JSON, XML) JQuery, Java Sup Minimum 1-year experience in WCG services with enterprise library Interview Dates : Saturday, 16th November at NOIDA & Sunday, 17th November 2019 at DELHI NOIDA Interview Date :Saturday, 16th November 2019 Time :10:00 am - 3:00 pm Interview Location: Mosaic Hotels (Unit of Shipra Hotels Limited) C-1, Sector 18, Noida - 201301 DELHI Interview Date : Sunday, 17th November 2019 Time: 10:00 am - 3:00 pm Interview Location: Hotel Emarald,112, Babar Road, Opp. World Trade Center, Connaught Place, New Delhi - 110 001 Phone: 011-40044000. Job Location: Delhi (R. K. Puram) Contact Person: Sneha/ Vishakha Contact Details: 9594862744/ 9870123237","location":"Delhi, Noida","experience":"5 - 7 Years"},{"date":"16 - Nov - 2019","skills":".NET Framework (C#, VB .NET)","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"CoWrks RMZ NXT, 1B, First Floor, EPIP Industrial Area, Whitefield Road, K.R Puram, Near SAP Labs, Bangalore, Karnataka - 560 066","phone":"080-61429059","profile":".Net Developer \nDealerSocket (India) Private Limited","description":"We are looking for a .Net Developer to build software using languages and technologies of the .NET framework. You will create applications from scratch, configure existing systems and provide user support. As .NET developer you should be at least proficient either in using VB .NET or C#, or even better, both languages. If you are a great .NET developer, you should be capable of handling many aspects of the application, including but not limited to performance, scalability, security, and testing. A fully knowledgeable .NET developer can use .NET to build a highly distributed web application, a sophisticated desktop application, or even a modern mobile application. Major Responsibilities: Producing code using .NET Framework (C#, VB .NET); Upgrading, configuring and debugging existing systems. Providing technical support for web, desktop or mobile applications. Familiarity with Net framework, SQL Server and design patterns. Understanding of Agile methodologies. Familiarity with REST and RPC APIs Walkin Interview on 16th November from 8 AM onwards Interview Venue: CoWrks RMZ NXT, 1B, First Floor, EPIP Industrial Area, Whitefield Road, K.R Puram, Near SAP Labs, Bangalore, Karnataka - 560 066. Registration Strictly in between 8 AM - 10:30 AM Only. Please carry your Laptop for the Online Test.","location":"Bangalore","experience":"4 - 9 Years"},{"date":"13 - Nov - 2019","skills":"Back End Operations, General Insurance/ Underwriting","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"EXL Services.com (I) Private Limited, Tower 1, Cybercity, Magarpatta City, Pune","phone":"Not Provided","profile":"Back Office Associate \nEXL Services.com (I) Private Limited","description":"Candidate should be Any Graduate with minimum 2 years of general insurance/ underwriting experience. Must have excellent communication Skills. Should be OK with night / rotational shifts Interested candidates can walk-in on Date: 13th November 2019 Time: 11:30 AM to 2:30 PM Venue: EXL Services.com (I) Private Limited Tower 1, Cybercity, Magarpatta City, Pune Note: Please carry your updated resume and Aadhar Card (original + 2 photocopy) along with 02 passport size photographs is mandatory to enter inside the premises.","location":"Pune","experience":"2 - 6 Years"},{"date":"13, 14, 15 - Nov - 2019","skills":".Net framework, MVC, C#, Java script, HTML/ HTML5 , CSS/ CSS3 and JSON","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Melstar Information Technologies Limited, 159, 5th Floor, Industry House Near Aakashwani Kendra, Churchgate, Mumbai - 400 020","phone":"Not Provided","profile":".Net Developer \nMelstar Information Technologies Limited","description":"Candidate should have minimum 2 years development experience for web based application using .Net framework and MVC. Should have expertise in C# programming language, Java script development, HTML/ HTML5 , CSS/ CSS3 and JSON Walk-in Date: 11th to 15th November 2019 Time: 10 am to 4 pm Venue Details: Melstar Information Technologies 159, 5th Floor, Industry House Near Aakashwani Kendra, Churchgate, Mumbai - 400 020","location":"Mumbai","experience":"2 - 8 Years"},{"date":"11 - Nov - 2019","skills":"Front Office Acvtivities, Facility Management, basic book keeping","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Rapidsoft Technologies Pvt. Limited, Plot 63, Udyog Vihar, Phase IV, Gurgaon, Haryana - 122 001.","phone":"Not Provided","profile":"Front Desk Executive (Female) \nRapidsoft Technologies Pvt. Limited","description":"Candidate should good knowledge of office management and basic bookkeeping Excellent knowledge of MS Office (especially Excel and Word) Must have strong communication and people skills Good organizational and multi-tasking abilities Maintain files and records; update when necessary Key Responsibilities- Responsible for end to end office operations Handle the walk-in as well as telephonic inquiries & maintaining record of visitors. Supervise & administer the Supervisor,keep a check on housekeeping & office staff. Must have Strong interpersonal skills Walk-in Date/ Time: 11th November 2019, 10 AM onwards Interview Venue: Rapidsoft Technologies Pvt. Limited Plot 63, Udyog Vihar, Phase IV, Gurgaon, Haryana - 122 001. Contact Person - Priya","location":"Gurgaon","experience":"1 - 2 Years"},{"date":"11, 12, 13, 14, 15 - Nov - 2019","skills":"Front Desk/ Front Office, Receptionist Activities, Guest Relations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Sodexo Food Solutions (India) Private Limited, #110/1, M Krishnappa Layout, Opposite KIA Motors, Lalbagh Road, Bengaluru, Karnataka - 560 027.","phone":"Not Provided","profile":"Front Office Executive \nSodexo Food Solutions India Pvt. Limited","description":"Female candidates are required for Receptionist/ Front Office Executive position for our reputed clients based in Bangalore at Banaswadi Road, Bommanahalli and Marathahalli. Roles & Responsibilities- Welcomes guests Have a good knowledge of all systems and standard operating procedures of front office. Good communication skills & command on English language Good working knowledge of MS Office Presentable Interested candidates may walk-in between 10 AM to 5 PM 8th - 15th November 2109 (Monday to Friday) Interview Venue: Sodexo Food Solutions (India) Private Limited #110/1, M Krishnappa Layout, Opposite KIA Motors, Lalbagh Road, Bengaluru, Karnataka - 560 027.","location":"Bangalore","experience":"1 - 6 Years"},{"date":"16 - Nov - 2019","skills":"Back Office Operations, Supply Chain Management, Non Voice Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Albans Projects Private Limited, 2nd Floor, Malhotra House, Above Tata Motors, Krishanlal Marwah Marg, Saki Vihar Road, Near Marwah Estate, Andheri, Mumbai - 400 072.","phone":"9324771589","profile":"Purchase/ Back Office Executive \nAlbans Projects Private Limited","description":"Candidate should have 0 to 1 year of experience as a Purchasing Executive. Good understanding of supply chain procedures. Advanced knowledge of MS Excel. Solid organizational skills. Candidates from Andheri and near by would be an advantage. Responsibilities- Monitor stock levels and identify purchasing needs Research potential vendors. Track orders and ensure timely delivery. Update internal databases with order details .(dates, vendors, quantities, discounts) Conduct market research to identify pricing trends. Evaluate offers from vendors and negotiate better prices. Prepare cost analyses. Walk-in Date/ Time: 16th November 2019, 10 AM onwards Interview Venue: Albans Projects Private Limited 2nd Floor, Malhotra House, Above Tata Motors, Krishanlal Marwah Marg, Saki Vihar Road, Near Marwah Estate, Andheri, Mumbai - 400 072. Landmark: After Picnic Restaurant Contact - Shweta (9324771589)","location":"Mumbai","experience":"0 - 1 Years"},{"date":"9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25 - Nov - 2019","skills":"Front Office, General Administration, Front desk/ Reception Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Jupiter Life Line Hospitals Limited, Opposite Rituparna Society, Near Prathamesh Park, Baner, Pune - 411 045","phone":"020-27992200","profile":"Front Office Executive \nJupiter Life Line Hospitals Limited","description":"Candidate should be Any Graduate with 1 to 5 years of experience in Front Office, General Administration, Front desk/ Reception Activities. Must have excellent communication skills. Job Responsbility- Greeting Patients/ Customers, Handling OPD Desk, Attending calls, OPD Bills, Handling queries on Desk. Co- Ordinating with Consultants & Doctors. Scheduling patient appointments. Preparing MIS. Collecting patient Satisfaction feedbacks. Walk-in Date/ Time: 8th - 25 November , 10 AM onwards Interview Venue: Jupiter Life Line Hospitals Limited, Opposite Rituparna Society, Near Prathamesh Park, Baner, Pune - 411 045 Contact Person- Mrs. Pranita Mhaske Tel Number: 020-27992200","location":"Pune","experience":"1 - 5 Years"},{"date":"11, 12, 13, 14 - Nov - 2019","skills":"Back Office, General Administration, Data Entry","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Mahendra Realtors & Infrastructure Pvt. Limited, 603, 6th Floor, Quantum Tower, Ram Baug Lane, Near SBI, SV Road, Malad West, Mumbai.","phone":"9082850347","profile":"Tender/ Admin Assistant \nMahendra Realtors & Infrastructure Pvt. Limited","description":"Candidate should be Any Graduate with 1 to 2 years of experience Must have very Strong communication skill oral as well as written Multi-Tasking skills with Computer literacy Job Responsbility- To Source Tenders from all available modes for Maharashtra, Goa, Gujarat, Karnataka & all MMR Region and taking approval for final participation within Given Time. Taking Approval from Management to Participate in Tenders before time. Walk-in Date/ Time: 11th - 14th November 2019, 11 AM onwards Interview Venue: Mahendra Realtors & Infrastructure Pvt. Limited 603, 6th Floor, Quantum Tower, Ram Baug Lane, Near SBI, SV Road, Malad West, Mumbai. Contact - HR (9082850347)","location":"Mumbai","experience":"1 - 2 Years"},{"date":"9 - Nov - 2019","skills":"Automation testing, Selenium, API testing or mobile application testing","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Maveric Systems Limited, Plot No. 1 & 2 NP, 2nd Floor, Lords Tower, Block 1, Jawaharlal Nehru Road, Thiru Vi Ka Industrial Estate, Ekkaduthangal, Chennai - 600 032.","phone":"Not Provided","profile":"Automation Testers \nMaveric Systems Limited","description":"Candidate must have good experience into Automation testing using Selenium and Java. Should be good into Java Coding or Programming. Should have a good exposure or experience or strong knowledge towards API testing or mobile application testing. Work experience in any frameworks (cucumber, maven, BDD, Hybrid, etc.,) Should have experience or knowledge in Framework development. Must have a strong knowledge in OOPS concepts. Interested Can walk in to the below mentioned Location along with your updated CV, passport size photograph and any ID proof. Walk-in Date: 9th November 2019 Time : 9 AM too 12 PM (Strictly no walk-in after 12:00 PM) Interview Venue: Maveric Systems Limited Plot No. 1 & 2 NP, 2nd Floor, Lords Tower, Block 1, Jawaharlal Nehru Road, Thiru Vi Ka Industrial Estate, Ekkaduthangal, Chennai, Tamil Nadu - 600 032. Contact Person : Ramya / Mark felix / Priyadharshni","location":"Chennai","experience":"3 - 8 Years"},{"date":"8, 9, 11, 12, 13, 14, 15, 16 - Nov - 2019","skills":"Software Testing, Manual/ Automation Testing, Test Cases","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Cyber Trident Technologies, 214, 3rd Floor, Surya Plaza, L B S Road Navi Peth, Dandekar Pool, Pune - 411 030.","phone":"Not Provided","profile":"Software Testing Trainee (Intern) \nCyber Trident Technologies","description":"We offer internship program on Software Testing (Manual and Automation Testing) To become a complete QA Professional To provide insight into real world scenarios of Software testing life Cycle To give hands on practical training with live project. Walk-in Date/ Time: 8th - 16th November , 10 AM onwards Interview Venue: Cyber Trident Technologies 214, 3rd Floor, Surya Plaza, L B S Road Navi Peth, Dandekar Pool, Pune - 411 030. Contact Person- Ritesh Naidu","location":"Pune","experience":"0 - 1 Years"},{"date":"9 - Nov - 2019","skills":"Automation testing using Selenium Java","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"QualityKiosk Technologies Private Limited, 4th Floor, 419A, C Wing, Rupa Solitaire, Sector-1, Millennium Business Park, Mahape, Kopar Khairane, Navi Mumbai, Maharashtra - 400 710","phone":"022-41288260","profile":"Automation Test Engineer \nQualityKiosk Technologies Private Limited","description":"Candidate must be strong in Automation testing using Selenium Java. Should have good verbal and written communication, Understand user requirements or functional specifications. Perform detailed technical analysis with impacts (Technical/ Functionally). Need to have strong analytical skills Need a Hands-on coding person for this role. Working as individual Contributor There will be 3 Levels of interviews (face to face technical, System Coding test & managerial round) Interview Date: 9th November 2019 - Saturday Time: 11:00 AM to 4:30 PM Interview Venue: QualityKiosk Technologies Private Limited 4th Floor, 419A, C Wing, Rupa Solitaire, Sector-1, Millennium Business Park, Mahape, Kopar Khairane, Navi Mumbai, Maharashtra - 400 710 (Lift Number: 24 & 25)","location":"Mumbai","experience":"1 - 5 Years"},{"date":"9 - Nov - 2019","skills":"Selenium API/ BDD Java","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Capgemini Technology Services (India) Limited, Prestige Cyber Towers, No. 117, Rajiv Gandhi Salai, Karapakkam, Chennai","phone":"Not Provided","profile":"Selenium Test Analyst \nCapgemini Technology Services (India) Limited","description":"Please carry a Government Approved Photo ID Original & 2 Passport size photograph, without these you will not be allowed to attend the interview. Candidate must have excellent with a strong technical background and strong communication skills. Experience in analyzing the middle tier technology problem solving skills and testing using REST API web services. Experience in raising bugs in JIRA and drive defect triage call Collaborate with testing developers and architects on collecting requirements payloads data for service testing and service virtualization Good working experience in BDD framework Good understanding of Agile Methodology Primary Skills Selenium API/ BDD Java Interview Date: 9th November 2019 (Saturday) Timing: 9:00 AM to 3.00 PM Interview Venue: Capgemini Technology Services (India) Limited Prestige Cyber Towers, No. 117, Rajiv Gandhi Salai, Karapakkam, Chennai Contact Person: - Santhoshi","location":"Chennai","experience":"4 - 6 Years"},{"date":"9 - Nov - 2019","skills":"Software Testing, White box, Black box testing, Database Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Sheorey Digital Systems Limited, Certified Company Software Lab & Technical Support Center, Anjaneya Techno Park, 1st Floor, 147, HAL Airport Road, Kodihalli, Bengaluru - 560 008.","phone":"Not Provided","profile":"Software Testers \nSheorey Digital Systems Limited","description":"Candidate should have 2 to 3 years of experience in Software Testing, White box, Black box testing, Database level testing (SQL). Preparation, Execution of Test plan and Test cases. Must have good knowledge of Agile Methodology and Ms - Office tools Walk-in Date/ Time: 9th November 2019, 10 AM onwards Interview Venue: Sheorey Digital Systems Limited Certified Company Software Lab & Technical Support Center Anjaneya Techno Park, 1st Floor, 147, HAL Airport Road, Kodihalli, Bengaluru - 560 008.","location":"Bangalore","experience":"2 - 3 Years"},{"date":"9 - Nov - 2019","skills":"Manual Testing, API (Rest/ SOAP), SQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Xpanxion International Private Limited, Ground Floor, Sai Radhe Building behind Sheraton Grand Hotel 7, Railway Officers Colony, Pune, Maharashtra - 411 001","phone":"020-66290500","profile":"QA/ Manual + API Tester \nXpanxion International Private Limited","description":"We at Xpanxion International are inviting you to walkin for interviews for Manual API Testing Work Experience: 2 - 4 Years Mandatory Skills : Manual Testing, API (Rest/ SOAP), SQL. (Please note all you must have experience in all the mentioned skills) Good to have: Mobile Testing (iOS) Immediate joiners Are most welcome. Walk-in Date/ Time: 9th November 2019, 10 AM onwards Interview Venue: Xpanxion International Private Limited Ground Floor, Sai Radhe Building behind Sheraton Grand Hotel 7, Railway Officers Colony, Pune, Maharashtra - 411 001 Landmark: Behind Pune Railway Station Contact Person: KASHISH CHAUHAN Please walk in directly for the interview with your resumes. Interview process: 1. Test (coding - API and DB) 2. L1 Technical Interview 3. L2 Technical Interview * Post Selection the remaining rounds will be done in the succeeding week.","location":"Pune","experience":"2 - 4 Years"},{"date":"11, 12, 13, 14, 15 - Nov - 2019","skills":"Core PHP, SQL Queries, Stored Procedure, RDBMS Databases like MYSQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"TopSource Infotech Solutions Pvt. Limited, 3rd Floor, Gamma 1, Giga Space, Viman Nagar, Pune - 411 014","phone":"Not Mentioned","profile":"PHP Developer \nTopSource Infotech Solutions Pvt. Limited","description":"We have urgent opening for PHP Developer in TopSource. Any Science/ Computer Graduate who is having 2 to 7 years of work experience in PHP can apply Must have good hands-on experience in Core PHP. Specialized in SQL Queries and Stored procedure. Specialized in RDBMS Databases like MY SQL. Knowledge of HTML, CSS. Good knowledge of jQuery/ JavaScript. Responsible for managing back-end services and the interchange of data between the server and the users. Your primary focus will be the development of all server-side logic, definition and maintenance of the central database, and ensuring high performance and responsiveness to requests from the front-end. Walk-in date/ Time: 8th - 15th November , between (2 PM to 7:30 PM) Interview Venue: TopSource Infotech Solutions Pvt. Limited 3rd Floor, Gamma 1, Giga Space, Viman Nagar, Pune - 411 014 Landmark: Opposite Maruti Showroom Contact Person- Pawan Burman","location":"Pune","experience":"2 - 7 Years"},{"date":"9 - Nov - 2019","skills":"Selenium with Java or C#, Web API Testing","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"CES IT Private Limited, 1st Floor, West wing Beta Block, SSPDL, Old No. 25, Rajiv Gandhi Salai (OMR), Navalur, Chennai - 603 103.","phone":"Not Provided","profile":"QA/ Testing Engineer \nCES IT Private Limited","description":"Walk-in-Interview for QA Automation Jr, Sr & Lead on 9th November 2019 (Saturday) Navalur, OMR, Chennai Location (3-9 Years) Skill set: Looks at Selenium with Java or C#, Web API Testing The Candidate must have Strong Communication skills Experience: 3 - 9 Years Work Timing: 1.00 PM - 10.00 PM IST (Pick-up and Drop will be provided) Walkin Date: 9th November 2019 Timing: 10 am - 3 pm Interview Venue: CES IT Private Limited, 1st Floor, West wing Beta Block, SSPDL, Old No. 25, Rajiv Gandhi Salai (OMR), Navalur, Chennai - 603 103. If possible, please share your updated profile to raghavendran.arumugam@cesltd.com","location":"Chennai","experience":"3 - 9 Years"},{"date":"11, 12, 13, 14 - Nov - 2019","skills":"Technical Support, Customer Service/ Troubleshooting","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"CSS Corp Private Limited, Ground floor, Ambit park, Ambattur, Chennai","phone":"9790065949","profile":"Technical Support Engineer \nCSS Corp Private Limited","description":"Any Graduation without Arrears , 10th + 3 years diploma also can apply. Experience within a customer service environment preferred. Excellent communication in English. Work Experience - 0-5 Years (Max). Freshers also welcome. Passionate about learning and mastering new technologies and skills. Immediate Joiners are preferred ( Max Notice Period 15 days) Walk-in Date: 11th - 14th November 2019 Time : 11 am to 7 pm Venue: CSS Corp Private Limited Ground floor, Ambit park, Ambattur, Chennai Contact Person: Sheik HR Tel: 9790065949 Note: Bring 2 resume copies, Any Government ID proof for security purpose","location":"Chennai","experience":"0 - 5 Years"},{"date":"9 - Nov - 2019","skills":"Technical/ Network Support, Voice Process","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Tech Mahindra Limited A-6, Sector-64, Noida","phone":"9871069624","profile":"Technical/ Network Support \nTech Mahindra Limited","description":"Tech Mahindra is hiring fresher's and experienced candidates for Technical/ Network Support for Tech Voice Process. Job Type: Permanent Job Location:Sector-64, Noida Experience Range: Any experience eligible. Freshers can also apply Role: Technical/ Customer Support Associate Skills Required:- Good communication skills. Excelent logical reasoning Candidate should be aware of good technical knowledge. Troubleshooting of technical related issues and ensure to resolve the issues or queries over the call. Candidate should be flexible to work in 24*7 environments, comfortable to work in night shifts. Result awaited candidates can also apply. Both side Transport facility available (Pick & Drop). 5 Days Working. Walk-in Date :9th November 2019 Timing: 11:00 AM- 4 PM Interview Venue: Tech Mahindra Limited A-6, Sector-64, Noida Contact Person- Karishma Bhatnagar ( 9871069624 )","location":"Noida","experience":"0 - 4 Years"},{"date":"11, 12, 13, 14, 15, 16 - Nov - 2019","skills":"Core Php, MySQL Database","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Extramarks Education India Pvt. Limited, D-180 , Sector 63 Noida - 201 301","phone":"Not Provided","profile":"PHP Developer \nExtramarks Education India Pvt. Limited","description":"Candidate must have strong knolwdge in Core Php, MySQL Database. Analyse, Create and Normalize database independently. Strong in Smarty, Zendwith installation process, JavaScript, Ajax, JQuery. Should have knowledge of Apache Server and Linux. Knowledge of XML, HTML, HTML5, XHTML, CSS. Should be able to handle the project independently. Can understand and workonrunning projects. Can be able to handle multiple projects simultaneously. Walkin Date/ Time: 11th - 16th November from 10 AM onwards Interview Venue: Extramarks Education India Pvt. Limited D-180 , Sector 63 Noida - 201 301","location":"Noida","experience":"1 - 3 Years"},{"date":"9 - Nov - 2019","skills":"General Administration, Team Leading, HR, Grievance Handling, Employee Engagement","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"DXC Technology India Private Limited, Maruthi Concorde Business Park, Sy No: 30/3 Konappana Agrahara Village, Begur Hobli, Hosur Road, Bangalore - 560 100.","phone":"Not Provided","profile":"Technical Support Associate \nDXC Technology India Private Limited","description":"Applicant must have Graduation with 10+2+3/4 preferably with 0- 3 years general experience, or equivalent combination of experience and college level education. Knowledge and Skills: oSuperior skills in both written and verbal communication. oExperience in customer facing role either remote or face to face. oComputer proficiency with applicable software applications (for example Microsoft Office, CAD, Adobe Suite, programming. oProblem solving skills. Walk-in Date: 9th November 2019 (Saturday). Time: 10:00 AM to 1:00 PM Venue - DXC Technology India Private Limited Maruthi Concorde Business Park, Sy No: 30/3 Konappana Agrahara Village, Begur Hobli, Hosur Road, Bangalore - 560 100. Point of Contact: Punith S M","location":"Bangalore","experience":"0 - 3 Years"},{"date":"9 - Nov - 2019","skills":"Software Testing, Selenium, Typescript, OOPS, JavaScript, Agile","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"We Work, Block L, Embassy TechVillage, Outer Ring Road, Bengaluru, Karnataka - 560 103","phone":"Not Provided","profile":"QA/ Software Tester \nDMI Innovations Private Limited","description":"Hiring Event: Interviews will be held on 9th November at Bangalore Technical Skills- Need hands on protractor and Selenium tool JavaScript/ Typescript experience is must Cucumber/ Jasmine framework hands-on experience OOPS concept and implementation in project Excellent to write with test cases for complex applications Understanding of test strategies and test plan, Hands-on would be an added advantage Defect life cycle knowledge Process Hands on in Agile STLC Process Other Skills- Excellent communication skills Knowledge on Healthcare domain will be added advantage","location":"Bangalore","experience":"4 - 9 Years"},{"date":"11, 12, 13, 14, 15 - Nov - 2019","skills":"IT Helpdesk, Technical Support, Service Desk","qualification":"B.Sc, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Pharmarack Technologies Private Limited, Office No. 201, Pride Portal, 202, 203, Senapati Bapat Road, Bahiratwadi, Bhageerath, Gokhalenagar, Pune - 411 016.","phone":"Not Provided","profile":"Technical Support Executive \nPharmarack Technologies Private Limited","description":"Education - MCA/ B.sc (Comp Science) / B.E (IT)/ M.E (IT) / B.E (Comp. Science) Experience - 6 months to 2 years in IT support services/ Technical Support Good fresher's cvs with strong technical knowledge will do. Must Have - Good Communication and good interpersonal skills Good computer operations skills (Word, Excel ) and email handling. English Proficiency/ Other languages would be an advantage Job Responsbility- Updating self-help documents so customers/employees can try to fix problems themselves Analyze, troubleshoot and resolve technical issues of the clients Improving overall quality of service and increasing customer delight levels Achieving overall productivity and service level targets Walk-in Date/ Time: 11th - 15th November , 11 AM onwards Interview Venue: Pharmarack Technologies Private Limited Office No. 201, Pride Portal, 202, 203, Senapati Bapat Road, Bahiratwadi, Bhageerath, Gokhalenagar, Pune, Maharashtra - 411 016. Contact Person- Avinash","location":"Pune","experience":"0 - 2 Years"},{"date":"12 - Nov - 2019","skills":"Technical Support, Service Desk, IT Helpdesk, Networking, Troubleshooting","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Cognizant Technology Solutions India Limited, Manyata Embassy Business Park, Mahogany (F2 Building), 2nd Floor, Hebbal Outer Ring Road, Rachenahalli, Bangalore - 560 045","phone":"Not Provided","profile":"Technical Support Associate \nCognizant Technology Solutions India Ltd","description":"Cognizant Technology Solutions India Limited is hiring Senior Process Executive (Voice) - Bangalore Location. Education : Any Graduate / Post-Graduate Work Experience : 1 to 4 years Work Location : Bangalore Skill: Voice Process Shift : Flexible to work in Night shifts Excellent written and verbal communications skills (English) Excellent Troubleshooting skills, search skills, ability to approach problems logically Basic Networking Domain experience (6+ months) Any Technical Support International Voice Experience Preferably from Help desk or Service desk Ensure on meeting daily KPIs Receiving end user calls Provide first level resolutions Ticket creation/ Categorization/ Prioritization Ticket escalation to respective Support Group Incident resolution and recovery Ticket Closure If interested, kindly walk-in to the below address on 12th November' 2019 (Tuesday) Time: 11 AM to 1 PM Interview Venue: Cognizant Technology Solutions India Limited, Manyata Embassy Business Park, Mahogany (F2 Building), 2nd Floor, Hebbal Outer Ring Road, Rachenahalli, Bangalore - 560 045 POC: Sathish You are requested to carry the following documents for the discussion A copy of your updated resume(Mandatory) 2 passport size photograph (Mandatory) Copy of your government photo id (Pan card / Passport / Driving License ). (Mandatory) Print Out of this Email. Note: Candidates who have taken up interview with cognizant in the last 2 months are not eligible to re-take the interview again","location":"Bangalore","experience":"1 - 4 Years"},{"date":"9, 10, 11, 12, 13, 14, 15, 16, 17 - Nov - 2019","skills":"PHP, Web Development","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Showflipper Entertainment & Productions Pvt. Limited, Anand Nagar, Sinhagad Road, Pune - 411 051","phone":"Not Provided","profile":"PHP Developer \nShowflipper Entertainment & Productions Pvt. Limited","description":"Candidate should be Any Graduate with 2 to 3 years of experience in Website Development, project making, Website Maintainance. Walk-in Date/ Time: 7th - 17th November , 6 PM onwards Interview Venue: Showflipper Entertainment & Productions Pvt. Limited Anand Nagar, Sinhagad Road, Pune - 411 051 Contact Person- SANDEEP JOSHI","location":"Pune","experience":"2 - 3 Years"},{"date":"11, 12, 13, 14, 15 - Nov - 2019","skills":"PHP, MySQL, CSS, HTML, Javascript, AJAX, XML","qualification":"B.E./B.Tech, MCA/PGDCA","address":"GoDigitell, 2nd floor, 34B, KaliammanKoil St, Virugambakkam, Chennai, Tamil Nadu - 92","phone":"7010828230","profile":"PHP Developer \nGoDigitell","description":"Candidate must be proficient in PHP, MySQL, CSS, HTML, Javascript, AJAX, XML. Should have experience with WordPress, Drupal. Knowledge of PHP web frameworks like CodeIgniter Walk-in Date/ Time: 7th - 15th November , 11 AM onwards Interview Venue: GoDigitell 2nd floor, 34B, KaliammanKoil St, Virugambakkam, Chennai, Tamil Nadu - 92 Contact - Asim Khan (7010828230)","location":"Chennai","experience":"0 - 1 Years"},{"date":"11, 12, 13, 14 - Nov - 2019","skills":"Core Java, Activemq, Hibernate, J2Ee, Design Patterns, Web Services, Spring IOC","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Bravura Solutions Limited (BSL), Tower - B, 10th Floor, Building No. 14, DLF Cyber City Phase - III, GURGAON, Haryana - 122 002","phone":"9899466306","profile":"Automation Testing Engineer \nBravura Solutions Limited (BSL)","description":"Candidate should be BE/ B.Tech/ MCA (only with min. 60% marks throughout & full time regular education) with 3 to 4 years of experience of software testing of multi-user software, ideally within a financial environment. Preferably experience of working on relevant Financial Services software product. Experience should cover test execution and formal recording of execution results. Minimum of 24 to 36 months experience with test automation tools (i.e. Test Complete, QTP, Rational), ideally beyond keystroke capture and replay in automating various Web & Desktop based applications. An aptitude for working to challenging deadlines and budgets on a continual basis. Technical ability to navigate around and review file contents. Knowledge of any scripting language(VB Script, QA Basic, Java Script) would be an added advantage Experience in performance Testing would be an added advantage. Other skills: Ability to work for the United Kingdom clients and respective shift timings (2:30 PM to 11 PM rotational basis) as necessary to ensure delivery timeframes are met. Walk-in Date/ Time: 11th - 14th November from 9 AM onwards Interview Venue: Bravura Solutions Limited (BSL) Tower - B, 10th Floor, Building No. 14, DLF Cyber City Phase - III, GURGAON, Haryana - 122 002. Acknowledge this mail (d2anand@bravurasolutions.com) with your updated CV or you may also share it with someone interested and relevant. You must need to send your response by filling below mentioned Google-form against the relevant position name 'Automation Testing' only : https://goo.gl/forms/3Rr4AArQz87d5TAK2","location":"Gurgaon","experience":"3 - 7 Years"},{"date":"8, 9, 11, 12, 13, 14, 15 - Nov - 2019","skills":"PHP, MySQL, HTML, CSS and jQuery","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Webkul Software Private Limited, H-28 ARV Park, Sector 63, Second Floor, Noida.","phone":"9870284067","profile":"PHP Developers \nWebkul Software Private Limited","description":"Webkul is looking for 'PHP Developers' with good knowledge of PHP, MySQL, HTML, CSS and jQuery. Having Knowledge of any framework like Yii, Symfony, Wordpress, Cake PHP, Laravel will be an added advantage. Qualification- MCA /B. Tech, BE/BCA Work Experience - 0 - 3 Years Job Nature - Permanent Skills - PHP , MYSQL, CSS, Jquery Candidate should be ready to relocate to Noida. Salary- 3.2- 5 LPA Working days - 5 Link for registration https://tinyurl.com/y3jm9qo2 Walk-in Date/ Time: 8th - 15th November 2019, 10 AM onwards Interview Venue: Webkul Software Private Limited, H-28 ARV Park, Sector 63, Second Floor, Noida Contact - HR ( 9870284067 ) Can Apply through this link https://tinyurl.com/y3jm9qo2","location":"Noida","experience":"0 - 3 Years"},{"date":"9 - Nov - 2019","skills":"PHP, WordPress Plugin, Theme & REST APIs. HTML/ JS/ CSS basics, jQuery and UI","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Ness Digital Technology Private Limited No. 33, 6th Block, 17 H Main Road, Koramangala, Bangalore - 560 095. Land Mark : Near Apollo Cradle Hospital","phone":"Not Provided","profile":"Php/ Wordpress Developer \nNess Technologies (India) Private Limited","description":"Candidate should have BE/ BTech/ ME/ MTech/ BCA/ MCA degree with good understanding of PHP and WordPress. Understanding WordPress Plugin, Theme & REST APIs. HTML/ JS/ CSS basics, jQuery and UI Development (optional) Must have good verbal and written communication skills Good logical and problem solving skills. Walkin Interview on 9th November from 10 AM onwards Interview Venue: Ness Digital Technology Private Limited No. 33, 6th Block, 17 H Main Road, Koramangala, Bangalore - 560 095. Land Mark : Near Apollo Cradle Hospital","location":"Bangalore","experience":"3 - 5 Years"},{"date":"9, 11, 12, 13, 14, 15, 16 - Nov - 2019","skills":"PHP5, MySQL, Ajax, jQuery, Javascript, HTML5, CSS3, XML, Scripting","qualification":"B.E./B.Tech, MCA/PGDCA","address":"XS Infosol Private Limited, C-34 Sector-2 Noida - 201301 Near Nirula Hotel, Near Sector-15 Metro Station","phone":"9953007925","profile":"PHP Developer \nXS Infosol Private Limited","description":"Applicant must have expertise in PHP Frameworks and good technology exposure of Core Php. Should have excellent knowledge of PHP5, MySQL, Ajax, jQuery, Javascript, HTML5, CSS3, XML, Scripting and Database Administration. Must have sound understanding of OOPs Strong Cross-Browser HTML5/ CSS3 Skills Walk-in Date/ Time: 7th - 30 November , 11 AM onwards Interview Venue: XS Infosol Private Limited C-34 Sector-2 Noida - 201301 Near Nirula Hotel, Near Sector-15 Metro Station Contact - Preeti Dhyani (9953007925)","location":"Noida","experience":"0 - 3 Years"},{"date":"8, 9 - Nov - 2019","skills":"Manual Testing, Test Cases","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Eagle Software India Private Limited, Eagle Towers, #25/27, Greams Road, Thousand Lights East, Chennai - 600 006.","phone":"Not Provided","profile":"Manual Testing Engineer \nEagle Software India Pvt. Limited","description":"Candidate Should posses minimum 3+ years of experience in Manual Testing. Required to review the software test cases. Should have good communication skills Preferred only immediate joiners. Walk-in Date/ Time: 8th - 9th November , 10 AM onwards Interview Venue: Eagle Software India Private Limited Eagle Towers, #25/27, Greams Road, Thousand Lights East, Chennai - 600 006. Landmark - Opposite to IDBI Bank Next to Sea Shell Restaurant. Contact Person - Gokulnath","location":"Chennai","experience":"3 - 5 Years"},{"date":"9 - Nov - 2019","skills":"PHP, Javascript, React.JS or Vue.JS, MySQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Netedge Computing Solutions Pvt. Limited, C-56/39 NetEdge Tower, Sector-62, Noida - 201 301","phone":"70427-94831","profile":"Software Engineers - PHP \nNetedge Computing Solutions Pvt. Limited","description":"The person must have : 1. Experience in Development using PHP, Javascript 2. Basic knowledge of React.JS or Vue.JS. 3. Experience in MySQL & other open source technologies. 4. He/She must have orientation towards quality & customer satisfaction. The Person Will be Responsible for: Coding & development of programs / modules Timely delivery of programs & projects to customers Ability to work in a team environment Must meet tight deadlines & work on several projects simultaneously Walk-in Date/ Time: 9th November 2019, 11 AM onwards Interview Venue: Netedge Computing Solutions Pvt. Limited C-56/39 NetEdge Tower, Sector-62, Noida - 201 301 Contact Person- Jagriti Hans (70427-94831)","location":"Noida","experience":"2 - 3 Years"},{"date":"7, 8, 9 - Nov - 2019","skills":"ASP .NET/ VB .NET Projects, Web Services and SQL Server","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Karvy Fintech Private Limited (Formerly known as KCPL Advisory Services Pvt. Limited), Karvy Selenium Tower B, Plot Nos. 31 & 32, Financial District Nanakramguda, Serilingampally Mandal, Hyderabad - 500 032","phone":"040-33215106","profile":".Net Developers \nKarvy Fintech Private Limited","description":"Candidate should have minimum 3 to 5 years of hands-on development experience with the following technologies: ASP .NET/ VB .NET Projects, Web Services and SQL Server. Hands on experience in design using object oriented programming principles. Extensive experience in developing N-tier applications. Good experience with reporting tools. Mandatory Skills required for a multiple project 1) Asp .Net, C#, Jquery, WCF, Webservices/ Web Api & SQL. 2) Asp & C#. 3) MVC, WebServices & Jquery Please attend F2F interview from 6th to 9th November 2019@ 11:00 am onwards Venue: Karvy Fintech Private Limited (Formerly known as KCPL Advisory Services Pvt. Limited) Karvy Selenium Tower B, Plot Nos. 31 & 32, Financial District Nanakramguda, Serilingampally Mandal, Hyderabad - 500 032 Contact : Sushma. Sushma.gajji@karvy.com","location":"Hyderabad","experience":"3 - 5 Years"},{"date":"9 - Nov - 2019","skills":".Net Framework 4.0, C#, ASP .Net MVC, SQL Server and Jquery","qualification":"B.E./B.Tech, MCA/PGDCA","address":"HCL Technologies Limited, A-10, Sector-3, Noida. Opposite - Sector 16 Metro Station","phone":"Not Provided","profile":"ASP .Net Developer \nHCL Technologies Limited","description":"HCL Technologies Limited is conducting interviews for .Net Developer on Saturday (9th November) in Noida Location. Work Experience: 2 to 7 years Must Have Skills: .Net Framework 4.0, C#, ASP .Net MVC, SQL Server and Jquery Build new systems with .Net Framework 4.0, C#, ASP .Net MVC, SQL Server and Jquery, Angular JS. Maintenance of existing applications Develop new functionality on our existing software applications. Share knowledge through knowledge-sharing presentations. Walk-in Date 9th November 2019 (Saturday) Time 9:00 AM 12:00 PM Venue: HCL Technologies Limited, A-10, Sector-3, Noida Opposite - Sector 16 Metro Station Contact Person - Hrishikesh Singh Mode of interview- Two/ Three Rounds of interview Documents to carry Updated Resume, Photograph, and Govt. ID Proof (Dont carry laptops) Kindly acknowledge this mail if you are available.","location":"Noida","experience":"2 - 7 Years"},{"date":"9 - Nov - 2019","skills":".Net, JavaScript, Ajax, JQuery and 3rd party libraries","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"HCL Technologies Limited, Surya Saphire, First Floor, ODC 8, Electronic City Phase 1, Behind Demart, Next to Bharat Petrol Bunk Bangalore - 560 100","phone":"Not Provided","profile":".Net Professionals \nHCL Technologies Limited","description":"We are hiring resources to HCL Technologies (Permanent payroll with HCL), through weekend F2F interviews on 9th Nov 2019 for below requirement. Candidate should have 4.5+ year development experience of web application using JavaScript, Ajax, JQuery and 3rd party libraries. Strong knowledge of .NET web technologies (ASP.Net, WebAPI 2.0, WCF). Proficient in C# and VB.NET with more than 6+ year's experience Strong understanding of object-oriented programming. Proven experience with various design and architectural patterns and object oriented. Hands on knowledge with Microsoft SQL Server 2016 development of stored procedures including best practices for relational DB Understanding of fundamental design principles for building a scalable application Experience design of databases and schema to solve complex business use cases Walk-in Interview on 9th November 2019 Interview Time : 9 AM to 1 PM Venue: HCL Technologies Limited Surya Saphire, First Floor, ODC 8, Electronic City Phase 1, Behind Demart, Next to Bharat Petrol Bunk Bangalore - 560 100. Please send updated resume to ahmed_s@hcl.com only with below asked details- Candidate name: Mobile Number: Email ID: Highest Qualification: Total IT Experience: Relevant hands onexperience as Java/ J2EE developers (Project Experience is must): Primary Skillsets: Current company: Notice Period: Are you serving notice period: Do you have any bond with current company: Rate yourself in communication out of 5: Current CTC in current Company: Monthly take home in current company: Expected CTC with HCL (including variable pay): Available for F2F interview on 9 Nov @ Bangalore, electronic City: Yes/ No","location":"Bangalore","experience":"4 - 9 Years"},{"date":"7, 8 - Nov - 2019","skills":"HR Generalist, Payroll, HR Operations","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"CPM India Sales Marketing Pvt. Limited, C-126, Okhla Phase - 1, New Delhi - 110 020","phone":"011-49694933","profile":"HR Generalist/ Payroll Executive \nCPM INDIA Sales Marketing Pvt. Limited","description":"Need an experienced Payroll Executive who has working experience in ESI & PF. Candidate should be able to handle PF Claims, new joinee, employee data management, salary preperation details with 1 years of experience. Must have 1 years experience in managing HR operations work. Must be excellent in Advance Excel. Walk-in Date/ Time: 7th - 8th November 2019, 11 AM onwards Interview Venue: CPM India Sales Marketing Pvt. Limited C-126, Okhla Phase - 1, New Delhi - 110 020 Nearest Metro Station : Govindpuri Contact Person- Arpita Ghai Tel: 011-49694933","location":"Delhi","experience":"1 - 5 Years"},{"date":"7, 8 - Nov - 2019","skills":"Office Administration, Front Office Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"CIEL HR Services Private Limited, #2802 (Broadway Building) 2nd & 3rd Floor, 27th Main Rd, 1st Sector, HSR Layout, Bengaluru, Karnataka - 560 102","phone":"9108476999","profile":"Front Office/ Admin Executive \nCIEL HR Services Private Limited","description":"We have opening for Office Administration role + Front Office Executive. Roles & Responsibilities: Procurement of office supplies Vendor management The person will be front facing for the company Should represent the brand in positive manner Should be responsible for maintaining and tracking visitors Handling inbound communication from all stakeholders Support in admin related activities for CielHR Facilities management. Walk-in Date/ Time: 5th - 8th November 2019 from 9 AM onwards Interview Venue: CIEL HR Services Private Limited #2802 (Broadway Building) 2nd & 3rd Floor, 27th Main Rd, 1st Sector, HSR Layout, Bengaluru, Karnataka - 560 102 POC : Karthika/ Saikat Contact Person: 9108476999","location":"Bangalore","experience":"1 - 6 Years"},{"date":"7, 8, 9, 11, 12, 13, 14, 15, 16 - Nov - 2019","skills":"Back Office Activities, Data Management, Office Coordination","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Seven Wonders Tower Plot No- A-61, Sector-16, Noida - 201 301","phone":"9326902553","profile":"Office/ Client Coordinator (Female) \nSeven Wonders Developers Private Limited","description":"Candidate should have 0 to 5 years of experience as back office operations like database, website, software, clients, etc. Strong verbal and written business English communication skills. Very strong with MS Word & Excel Make reports, manage files, coordination 6 Days working Good Salary Walk-in Date/ Time: 5th - 30 November 2019, 10 AM onwards Interview Venue: Seven Wonders Tower Plot No- A-61, Sector-16, Noida - 201 301 Landmark: Near Pioneer House Building Contact - Dipika/ Nidhi (9326902553)","location":"Noida","experience":"0 - 5 Years"},{"date":"7, 8 - Nov - 2019","skills":"Back Office Operations, General Administration, Data Entry","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Mahendra Realtors & Infrastructure Pvt. Limited, 603, 6th Floor, Quantum Tower, Ram Baug Lane, Near SBI, SV Road, Malad (West) Mumbai","phone":"9082850347","profile":"Tender/ Admin Assistant \nMahendra Realtors & Infrastructure Pvt. Limited","description":"Candidate should be Any Graduate with 1 to 2 years of experience. Very Strong communication skill oral as well as written. Multi-Tasking skills & Computer literacy Job Responsibility- To Source Tenders from all available modes for Maharashtra, Goa, Gujarat, Karnataka & all MMR Region and taking approval for final participation within Given Time. Taking Approval from Management to Participate in Tenders before time Walk-in Date/ Time: 7th - 8th November 2019, 11 AM onwards Interview Venue: Mahendra Realtors & Infrastructure Pvt. Limited 603, 6th Floor, Quantum Tower, Ram Baug Lane, Near SBI, SV Road, Malad (West) Mumbai Contact - HR (9082850347)","location":"Mumbai","experience":"1 - 2 Years"},{"date":"7, 8 - Nov - 2019","skills":"Java/ PL SQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Intellect Design Arena Limited, 249, Phase IV, Udyog Vihar, Sector 18, Gurugram, Haryana - 122 001","phone":"Not Provided","profile":"Java Developer (Fresher) \nIntellect Design Arena Limited","description":"Intellect Design Arena Limited, is Looking for fresher with excellent knowledge in Java & SQL and passion for learning quickly to develop the project individually. Eligibility Criteria: Graduation- BE/ B.Tech (CSE/ IT/ ECE)/ MCA 2017/ 2018/ 2019 Pass outs only 70% and above in 10th, 12th and Graduation mandatory Should have Good Communication Skills Certification in Java/ PL SQL would be preferred Immediate Joiner/ 15 days Notice Period (in case of experienced candidates) Work Location - Chennai Drive Location: Gurgaon Drive Date for Aptitude Test : (English/ Maths/ Reasoning MCQ) 7th & 8th November at 9 :30 AM till 2 :00 PM Drive Location: Intellect Design Arena Limited 249, Phase IV, Udyog Vihar, Sector 18, Gurugram, Haryana - 122 001 Contact Person: Rachita Dash","location":"Gurgaon","experience":"0 - 1 Years"},{"date":"8 - Nov - 2019","skills":"Java/ PL SQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"SEEC Towers, Plot No. 6, APIIC Layout, Hi-Tech City, Madhapur, Hyderabad - 500 081","phone":"040-4463 1000","profile":"Java/ SQL Developer (Freshers) \nIntellect Design Arena Limited","description":"Intellect Design Arena Limited, is looking for fresher with excellent knowledge in Java & SQL and passion for Learning quickly to develop the project individually. Qualification : B.E (CSE/ IT/ ECE) / MCA 2017/ 2018/ 2019 Pass outs 70% and above in 10th, 12th and Graduation mandatory Certification in Java/ PL SQL would be preferred Should have Good Communication Skills Immediate Joiner/ 15 days Notice Period (in case of experienced candidates) Job Location: Chennai Drive Date for Aptitude Test : (English/ Maths/ Reasoning MCQ) 8th November, Friday at 9:00 AM onwards Venue for Aptitude Test (Hyderabad) SEEC Towers, Plot No. 6, APIIC Layout, Hi-Tech City, Madhapur, Hyderabad - 500081 Phone No: 040-4463 1000 Contact Person: Chandra Devatha","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"9 - Nov - 2019","skills":"Java, J2EE, Spring or Hibernate, Angular/ Spring boot","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"HCL Technologies Limited, Surya Saphire, First Floor, ODC 8, Electronic City Phase 1, Behind Demart, Next to Bharat Petrol Bunk, Bangalore - 560 100.","phone":"Not Provided","profile":"Java Developers \nHCL Technologies Limited","description":"We are hiring resources to HCL Technologies (Permanent payroll with HCL), through weekend F2F interviews for below requirement. Candidate should have 1 to 2.5 years of experience in Java, J2EE, Spring or Hibernate Knowledge or Experience in Angular/ Spring boot will be an added advantage Willing to learn New Technologies and willing to work as a Fullstack developer Must have good communication skills Please send updated resume to supriyavishwas_b@hcl.com only with below asked details- Candidate Name: Mobile Number: Email ID: Highest Qualification: Total IT Experience: Relevant hands on experience as Java/ J2EE developers(Project Experience is must): Primary Skill sets: Current company: Notice Period: Are you serving notice period: Do you have any bond with current company: Rate yourself in communication out of 5: Current CTC in current Company: Monthly take home in current company: Expected CTC with HCL (including variable pay): Available for F2F interview on 9 Nov @ Bangalore, electronic City: Yes/ No Interview Date: 9th November 2019 Time : 9 AM to 1 PM Interview Venue: HCL Technologies Limited Surya Saphire, First Floor, ODC 8, Electronic City Phase 1, Behind Demart, Next to Bharat Petrol Bunk, Bangalore - 560 100. Interview Process : 3 Technical Rounds + HR Discussion (All the process will get completed on Same day (9th November) Note : This recruitment is for development projects and you will be trained on latest technologies","location":"Bangalore","experience":"1 - 3 Years"},{"date":"9 - Nov - 2019","skills":"Java, Struts, Hibernate, Oracle","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"ICICI Bank Limited, Shree Sawan Knowledge Park, ICICI Bank, 6th Floor, MIDC, Industrial Area, Turbhe, Navi Mumbai.","phone":"Not Provided","profile":"Java Developers \nWipro Limited","description":"Qualifications: Minimum full time Graduation Required (BE/ B.Tech/ BSC/ BCA/ B.COM) Experience Required: 2 to 5 Years (with all the valid educational & experience document) Skills:- Experience in Struts, Hibernate, Oracle. Note ;- No Gap in education and work experience Minimum 50% throughout Job Locations - Turbhe, Navi Mumbai Contact Person:- Prasad Bobade Interested Candidates mail your Resume on prasad.bobade@varaunited.in OR Walk In on below address only on Saturday, 9th November 2019 from 10.00 am to 3.00 pm Venue Details ICICI Bank Limited Shree Sawan Knowledge Park, ICICI Bank, 6th Floor, MIDC, Industrial Area, Turbhe, Navi Mumbai","location":"Mumbai","experience":"2 - 5 Years"},{"date":"9 - Nov - 2019","skills":"Java, J2EE, Spring or Hibernate, Angular / Springboot","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"HCL Technologies Limited, Surya Saphire, First Floor, ODC 8, Electronic City Phase 1, Behind Demart, Next to Bharat Petrol Bunk Bangalore - 560 100.","phone":"Not Provided","profile":"Java/ J2EE Developer \nHCL Technologies Limited","description":"We are hiring resources to HCL Technologies (Permanent payroll with HCL), through weekend F2F interviews for below requirement. Candidate must have 2.6 to 5 years of experience in Java, J2EE Good Experience in Spring or Hibernate Good communication skills Knowledge or Experience in Angular / Springboot will be an added advantage Willing to learn New Technologies and willing to work as a Fullstack developer Interview Date: 9th November 2019 Time : 9 AM to 1 PM Venue: HCL Technologies Limited Surya Saphire, First Floor, ODC 8, Electronic City Phase 1, Behind Demart, Next to Bharat Petrol Bunk Bangalore - 560 100. Contact Person: Chaithra J Interview Process : 3 Technical Rounds + HR Discussion (All the process will get completed on Same day (9th November) Please send updated resume to supriyavishwas_b@hcl.com only with below asked details Candidate Name: Mobile Number: Email ID: HighestQualification: Total IT Experience: Relevant hands onexperience as Java/J2EE developers (Project Experience is must): Primaryskillsets: Current company: Notice Period: Are you serving notice period: Do you have any bond with current company: Rate yourself in communication out of 5: Current CTC in current Company: Monthly take home in current company: Expected CTC with HCL (including variable pay): Available for F2F interview on 9 Nov @ Bangalore, electronic City: Yes/ No Note : This recruitment is for development projects and you will be trained on latest technologies","location":"Bangalore","experience":"2 - 5 Years"},{"date":"9 - Nov - 2019","skills":"Android Development, Kotlin, Java","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Capgemini Technology Services India Limited, No.14, Phase III, Rajiv Gandhi Infotech Park, Village Man, Taluka, Mulshi, Haveli, Hinjewadi, Pune, Maharashtra - 411 057.","phone":"Not Provided","profile":"Android Developer/ Team Lead \nCapgemini Technology Services India Limited","description":"Candidate should have very strong technical hands on experience in Android Development. Must have strong knowledge on Android SDK, Android Studio and Gradle. Must have Kotlin experience and Good understanding on Core Java + Android. Good to have experience on Hybrid mobile application development Cordova , Angular 2, Type Script HTML5 and CSS3 Good understanding on Android development Tools, Architecture Good understanding on networking libraries like Volley, Retrofit. Data handing using SQLite database, Preferences Strong knowledge on OOPS Concepts Strong experience working with Unit testing and BDD Should have good understanding of design patterns Familiarity with Git, GitHub and SVN Strong Agile development principles is necessary Work Experience: 2 to 9 Years Primary Skills: Android Development, Kotlin, Java Interview Date: 9th November 2019 (Saturday) Timing: 09.00 AM to 3.00 PM Interview Venue: Capgemini Technology Services India Limited No.14, Phase III, Rajiv Gandhi Infotech Park, Village Man, Taluka, Mulshi, Haveli, Hinjewadi, Pune, Maharashtra - 411 057. Contact Person- Aishwarya Dixit Documents to carry: Updated copy of resume Identity Proof 2 Passport size Photographs PS.: Please ignore, If youve already been interviewed by Capgemini in past 2 months.","location":"Pune","experience":"2 - 9 Years"},{"date":"9 - Nov - 2019","skills":".Net, C#, MVC, Web API","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Cibersites India Private Limited, 6th Floor, Ericson Building BWTC Campus Bagmane World Technology Centre, Krishnarajapuram, Hobli, Bangalore - 560037","phone":"Not Provided","profile":".Net Developers \nCibersites India Private Limited","description":"We have an excellent opportunity for Dotnet Developers for Bangalore location Person must have good hands on experience in .Net, C#, MVC Experience in Enterprise level project (added advantage) Should have good understanding of Web API Notice Period: Immediate-15 days Interview Date :-9 November (Saturday) Mode of Interview :-F2F Interview Venue: Cibersites India Private Limited 6th Floor, Ericson Building BWTC Campus Bagmane World Technology Centre, SEZ KR Puram - Marathahalli Ring Raod, Service Road Krishnarajapuram, Hobli, Bangalore - 560 037 Opposite to SoulSpace Arena / Total Mall @ Mahadevapura and Doddanekundi, If this interests you please share your updated resume at soak@ciber.com","location":"Bangalore","experience":"2 - 6 Years"},{"date":"8 - Nov - 2019","skills":"Core Java, JavaScript, JQuery, J2EE, JSF, Hibernate, Spring, Web Services, Restful","qualification":"B.E./B.Tech, MCA/PGDCA","address":"3i Infotech Limited, Prince Infocity 2, 3rd Floor, Kandanchavadi, Chennai - 96.","phone":"044-71622577","profile":"Java Developers \n3i Infotech Limited","description":"Primary Skill Set: Core Java, JavaScript, JQuery, J2EE, JSF Secondary Skills: Hibernate, Spring, Web Services, Restful (FX Added Advantage) Work Experience: 2- 9 Years Notice Period: Immediate (ASAP) Salary: Industry Standard Interested candidates can walk-in to below mentioned address: 3i Infotech Limited, Prince Infocity 2, 3rd Floor, Kandanchavadi, Chennai - 96. Interview Date: 8th November' 2019(Friday) Time: 11 AM to 4 PM Contact Person : Vivek Tel: 044-71622577","location":"Chennai","experience":"2 - 9 Years"},{"date":"9 - Nov - 2019","skills":"ASP .NET, MVC Framework, HTML, CSS, JS, Microsoft Azure","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Harita Techserv Limited, Arihant E-Park, No.117/1, 8th Floor, L. B. Road, Adyar, Chennai - 600 020","phone":"Not Provided","profile":"ASP .Net Developer \nHarita Techserv Limited","description":"Looking for candidates with minimum 2 year of experience in Software Development . Must be proficient in working with ASP.NET Good working knowledge in MVC Framework. Experience in Web technologies like HTML, CSS, JS Knowledge on cloud services Microsoft azure Walk-in Date/ Time: 9th November 2019, 10 AM onwards Interview Venue: Harita Techserv Limited, Arihant E-Park, No.117/1, 8th Floor, L. B. Road, Adyar, Chennai - 600 020 Contact Person- Helma Willer Interested candidates can attend the interview at below mentioned address or send their updated resume to w.helmawiller@harita.co.in Note : Kindly Bring any Government ID Proof ( Mandatory )","location":"Chennai","experience":"2 - 5 Years"},{"date":"7, 8, 11, 12, 13, 14, 15 - Nov - 2019","skills":"Core Java, Web Services, SOAP/ REST APIs, SQL Queries and Stored Procedure","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Prospecta Soft Private Limited, IRIS Tech Park, Unit No. 206, Second Floor, Block A, Sector 48, Gurugram, Haryana","phone":"Not Provided","profile":"Java (API) Developer \nProspecta Soft Private Limited","description":"Required Skills/ Experience: Strong hands-on experience with Core Java with good knowledge of API's Must and Strong knowledge of SQL Queries and Stored Procedure Good to have exp on Web Services SOAP/ REST APIs Should have good communication skills Job Responsbility- To produce high quality documentation for our customers related to assigned work To decompose technical tasks and provide accurate estimates To undertake project related API/ Development tasks without supervision, including programming and testing within a Test-Driven process Walk-in Date/ Time: 6th - 15th November , 9 AM onwards Interview Venue: Prospecta Soft Private Limited IRIS Tech Park, Unit No. 206, Second Floor, Block A, Sector 48, Gurugram, Haryana Contact - Isha Sharma Interested candidates can share their updated resume on shalini.singh@prospecta.com","location":"Gurgaon","experience":"2 - 4 Years"},{"date":"9, 10 - Nov - 2019","skills":".Net Core, C# .Net, Angular JS","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Nagarro Software Private Limited, Wework chromium, Milind Nagar, L&T Flyover, Manohar Nagar, Marol, Andheri East, Mumbai, Maharashtra - 400 072","phone":"Not Provided","profile":".Net Professionals \nNagarro Software Private Limited","description":"Must have Skills: Frameworks and libraries - AngularJS, Frameworks and libraries - Angular 4, Frameworks and libraries - .Net Core Proficiency with Angular2+, JavaScript and HTML5 Deep knowledge of /Angular2+practices and commonly used modules based on extensive work experience Creating self-contained, reusable, and testable modules and components Ensuring a clear dependency chain, regarding the app logic as well as the file system Responsible For: Design and development of software systems in the Presentation, Business and Service layers. Responsible for the design of applications based on architectural /design guidelines. Mainly on microservices. 9th Nov- Saturday anytime between 9:30 am- 4 pm 10th Nov- Sunday anytime between 9:30 am- 12 pm VENUE- Nagarro Software Private Limited Wework Chromium, Milind Nagar, L&T Flyover, Manohar Nagar, Marol, Andheri East, Mumbai, Maharashtra - 400 072 Contact Person- Priya Mehta","location":"Mumbai","experience":"6 - 9 Years"},{"date":"9 - Nov - 2019","skills":".Net Core, C# or .Net Net SQL/ Postgres SQL","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"INFOR (India) Private Limited, 501, C Building, 5th floor, Pune IT Park, 34 Aundh Road, Bhau Patil Marg Bopodi, Pune - 411 020","phone":"020-40125161","profile":".Net Developer \nINFOR (India) Private Limited","description":"Person should have Bachelor's Degree in Computer Engineering or Computer Science or Computer Application with minimum of 1 to 2 years' experience in software development using .Net Core, C# or .Net Net SQL/ Postgres SQL. Must have good communication skills and ability to work with multiple teams Walk-in Date: 9th November 2109 Timings: 9 AM to 3 PM Interested candidates can Walk-in with updated resume to the below venue: INFOR (India) Private Limited 501, C Building, 5th floor, Pune IT Park, 34 Aundh Road, Bhau Patil Marg Bopodi, Pune - 411 020 Contact Person : Pratiksha Supekar Tel: 020-40125161","location":"Pune","experience":"1 - 2 Years"},{"date":"8 - Nov - 2019","skills":".Net, SQL Queries/ Stored Procedure","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Automatic Software Priavte Limited, Kapil Upavan Plaza, Office No. 302, 3rd Floor, Chaitraban Bibwewadi Pune - 411 037.","phone":"9130006138","profile":"Junior .Net Developer \nAutomatic Software Priavte Limited","description":"Candidate should have good hands on experience in .Net, SQL Queries/ Stored Procedure. Experience in Power Builder 6.0, Oracle 8.0.5 will be additional advantage. MUST have good time management skills. Excellent team management skills Walk-in Date/ Time: 4th - 8th November 2019, 11 AM onwards Interview Venue: Automatic Software Priavte Limited Kapil Upavan Plaza, Office No. 302, 3rd Floor, Chaitraban Bibwewadi Pune - 411 037. Landmark : Near SBI Colony. Contact - Titiksha (9130006138) Note- Office will be Closed on Saturday and Sunday","location":"Pune","experience":"0 - 1 Years"},{"date":"9 - Nov - 2019","skills":"ASP .NET, C#, VB.NET, MVC, JavaScript, AJAX, JQuery (Angular/ Backbone),","qualification":"B.E./B.Tech, MCA/PGDCA","address":"EbixCash Financial Technologies, Suraksha Ace , 6th Floor 34 / 3, Andheri Kurla Road, Chakala, JB Nagar - Andheri (East), Mumbai - 400 059","phone":"Not Provided","profile":".NET & Angular Developer \nEbix Technologies Private Limited","description":"Ebix Technologies (Earlier Miles Software) www.ebix.com is hiring for talented .NET - (Angular + MVC) developers on immediate basis. Required Skills 1. MVC NET and Dot Net Core. 2. SQL 2014 with SQL Server, and SSIS 3. Angular 6,Js, 2, RXJS 4. Bootstrap 3, HTML Job Responsbility: Creation of working and scalable solutions using web-based languages & applications like ASP .NET, C#, VB .NET, MVC, JavaScript, AJAX, JQuery (Angular/ Backbone), Web Services, Web API, Angular Js Walk-in Date: 9th November 2019 Time- 10 AM to 2 PM. Interview Venue: EbixCash Financial Technologies Suraksha Ace, 6th Floor 34 / 3, Andheri Kurla Road, Chakala, JB Nagar Andheri (East), Mumbai - 400 059 Land Mark: Opposite SBI Bank Contact Person- Manjiri Thomre Interested candidates can share their resume along with the foll details on manjiri.thomre@milessoft.com Current CTC: Expected CTC: Notice Period : Available time for the Interview on Saturday 9th Nov:","location":"Mumbai","experience":"1 - 6 Years"},{"date":"7, 8 - Nov - 2019","skills":"ASP .Net 3.5/4.5, C#, ADO .Net, AJAX, JavaScript, JQuery, JSON, MVC, HTML","qualification":"B.E./B.Tech, MCA/PGDCA","address":"AGS House, Plot No EL 82 & 83, TTC Industrial Estate, MIDC Electronic Zone, Navi Mumbai - 400 705.","phone":"Not Provided","profile":".Net Developer \nAGS Transact Technologies Limited","description":"Candidate should have 1 to 6 years of hands on experience on ASP .Net 3.5/4.5, C#, ADO .Net, AJAX, JavaScript, JQuery, JSON, MVC, HTML, Web services, Windows Service. Experience with Transact SQL code, SQL stored procedures and views. Walk-in Date/ Time: 7th - 8th November , 9 AM onwards Interview Venue: AGS House, Plot No EL 82 & 83, TTC Industrial Estate, MIDC Electronic Zone, Navi Mumbai - 400 705. Contact person : Rasika HR team","location":"Mumbai","experience":"1 - 6 Years"},{"date":"9 - Nov - 2019","skills":".NET, MVC, JQuery, C# and OOPS","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"IKS Health (Inventurus Knowledge Solutions Pvt. Ltd) M/s. Serene Properties Private Limited (SEZ) Unit No. 203, Building No. 5, 2nd Floor Mindspace(East) iroli, Navi Mumbai - 400 708","phone":"Not Provided","profile":".Net Developers \nInventurus Knowledge Solutions Pvt. Limited","description":"Candidate should have Masters\\ Bachelors\\ Diploma in Computer Science with 1 to 3 years of experience in Software Development using .NET, MVC, JQuery, C# and OOPS. Exposure and experience in agile development preferred At least an years of hands-on application development experience using Microsoft Technologies US Healthcare knowledge and experience would be preferred. Behavioral Competencies - Customer Focus Achievement Orientation Collaboration Functional Competencies - Passion for engineering excellence Ability to work as a team member Ability to work creatively and analytically in a problem-solving environment High degree of integrity and work ethic Walk-in Date/ Time: 9th November 2019, 11 AM onwards Interview location:- IKS Health (Inventurus Knowledge Solutions Pvt. Ltd) M/s. Serene Properties Private Limited (SEZ) Unit No. 203, Building No. 5, 2nd Floor Mindspace(East) iroli, Navi Mumbai - 400 708 Contact - Rajesh Pandey Interview Process 1. Online test 2. Technical discussions 3. Hiring and HR manager discussion","location":"Mumbai","experience":"1 - 3 Years"},{"date":"7, 8, 9, 11, 12, 13, 14, 15, 16 - Nov - 2019","skills":"HR and Admin","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Pushkal IT Solutions, 204 Sai Vihar Colony Rau, Indore (MP) - 453 331","phone":"0731-2856911","profile":"HR/ Admin Executive (Part time) \nPushkal IT Solutions","description":"Require Part time HR and Admin Executive to work 4 hours per day from office. Basically for recruitment purpose. Candidate should be Graduate with good communication skills. Fresher are welcome. Walk-in Date/ Time: 2nd November - 30 November , 10 AM onwards Interview Venue: Pushkal IT Solutions 204 Sai Vihar Colony Rau, Indore (MP) - 453 331 Contact Person- Mr. Prashant Dubey For more information call 0731-2856911","location":"Indore","experience":"0 - 1 Years"},{"date":"7, 8 - Nov - 2019","skills":"HR/ Administration, Key Skills Cash Management Services","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Radiant Cash Management Services Pvt. Limited, No: 28, 3rd Floor, Voora J. K. Tower, Bazullah Road, T Nagar, Chennai - 600 017.","phone":"9500020151","profile":"HR & Admin Executive \nRadiant Cash Management Services Pvt. Limited","description":"Candidate should have good verbal & written communication skills Must have Immense knowledge in HR activities Should be conversant with MS office Hindi speaking candidates are preferable Walk-in Date/ Time: 7th - 8th November 2019, 10 AM onwards Interview Venue: Radiant Cash Management Services Pvt. Limited No: 28, 3rd Floor, Voora J. K. Tower, Bazullah Road, T Nagar, Chennai - 600 017 Contact Person- Shaila Junis Interested candidates can forward your CV to joshua@radiantcashlogistics.com Or reach us at 9500020151","location":"Chennai","experience":"0 - 3 Years"},{"date":"9 - Nov - 2019","skills":"Java, Spring 3.0, Hibernate/ JPA/ AOP, JSP, Servlet, JQuery, JavaScript, JSON","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"SHL (India) Private Limited, Tower 10B, 9th Floor, DLF Cyber City, Gurgaon, Haryana - 122 002","phone":"Not Provided","profile":"Java Developers \nSHL (India) Private Limited","description":"Person should have 4 to 7 years of experience. Thorough understanding of OO concepts & its application in development. Should have previously worked in the position as a Java/ Web Developer developing web site/ applications. Must have hands-on with Spring 3.0 + Hands-on with Hibernate/ JPA/ AOP Hands-on with JSP, Servlet, JQuery, JavaScript, JSON Hands-on with SQL Server Hands-on with REST Services Good to have Skills: Front-end engineering using Object-Oriented JavaScript, and has knowledge of at least one of the following JavaScript Frameworks (Angular, Backbone, Ember, etc.), along with HTML5 and CSS3 Knowledge of XML parsing, and/or DOM traversal. Create logical data structures, Coding, and Apply best practices/ design patterns of coding Product / application development, and knowledge of SDLC of multiple products/applications Responsible for and produces complete, quality deliverables Walk-in Date/ Time: 9th November from 10 AM onwards Interview Venue: SHL (India) Private Limited Tower 10B, 9th Floor, DLF Cyber City, Gurgaon, Haryana - 122 002","location":"Gurgaon","experience":"4 - 7 Years"},{"date":"9 - Nov - 2019","skills":"Core Java/ J2EE/ JSP, Servlets, JavaScript/ JQuery, XML, CSS, AJAX & Struts/ Spring frameworks","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Financial Software & Systems Pvt. Limited, 1st Floor, Kalpataru Prime, Plot, 3, Road No. 16, Neheru Nagar, Wagle Industrial Estate, Thane West, Mumbai, Maharashtra - 400 604","phone":"Not Specified","profile":"Java Developer/ Tech Lead \nFinancial Software & Systems Pvt. Limited","description":"Candidate must have handled projects in Core Java/ J2EE/ JSP, Servlets, JavaScript/ JQuery, XML, CSS, AJAX & Struts/ Spring frameworks. Must have good analysis or problem solving skills. Must have good communication skills. Facilitates team and client meetings effectively. Holds regular status meetings with development team. Manages client interaction and expectations regarding development efforts. Must be willing to work late hours/ weekends for critical deliveries Should have knowledge of RDBMS and use of SQL Additional Advantage: Knowledge of Web-Services/SOAP/REST o Knowledge of PL/SQL Knowledge of OWASP/ PADSS, Secure Coding standards/ tools Walk-in Date/ Time: 9th November 2019, 9 AM onwards Interview Venue: Financial Software & Systems Pvt. Limited 1st Floor, Kalpataru Prime, Plot, 3, Road No. 16, Neheru Nagar, Wagle Industrial Estate, Thane West, Mumbai, Maharashtra - 400 604 Contact Person- Akash Bhosale","location":"Mumbai","experience":"5 - 8 Years"},{"date":"9 - Nov - 2019","skills":".NET Framework (C#, VB .NET)","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"DealerSocket India Private Limited, CoWrks RMZ NXT, 1B, First Floor, EPIP Industrial Area, Whitefield Road, K.R Puram, Near SAP Labs, Bangalore, Karnataka - 560 066","phone":"08061429059","profile":".Net Developer \nDealerSocket India Private Limited","description":"We are looking for a .Net developer to build software using languages and technologies of the .NET framework. You will create applications from scratch, configure existing systems and provide user support. Major Responsibilities: Producing code using .NET Framework (C#, VB .NET); Upgrading, configuring and debugging existing systems. Providing technical support for web, desktop or mobile applications. Familiarity with Net framework, SQL Server and design patterns. Understanding of Agile methodologies. Familiarity with REST and RPC APIs In this role, you should be able to write functional code with a sharp eye for spotting defects. You should be a team player and excellent communicator. If you are also passionate about the .NET framework and software design/architecture, we'd like to meet you. Walk-In on 16th November 2019 Registration Strictly in between 8- 10:30 AM Only. Interview Venue: DealerSocket India Private Limited CoWrks RMZ NXT, 1B, First Floor, EPIP Industrial Area, Whitefield Road, K.R Puram, Near SAP Labs, Bangalore, Karnataka - 560 066 Please carry your Laptop for the Online Test.","location":"Bangalore","experience":"4 - 9 Years"},{"date":"5, 6, 7, 8, 9 - Nov - 2019","skills":"Technical Support, International Voice Process, Customer Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech, Diploma","address":"Tech Mahindra Limited, Survey No-61/A, Quthubullapur, Bahadurpally, Hyderabad - 500 043","phone":"8790585814","profile":"Technical Support Associates \nTech Mahindra BPS Limited","description":"Tech Mahindra Limited is hiring for Technical Support Associates (International Voice Process) Education: Undergraduate / Graduate / Post Graduate Experience from BPO background is only considered Should have excellent communication skills (Oral & Verbal) Must be flexible working for Rotational shifts Candidate should be aware of basic technical knowledge in LAN, WAN and handling basic Internet issues. Troubleshooting of technical related issues and ensure to resolve the issues or queries over the call. Research, diagnose, troubleshoot and identify solutions to resolve customer issues. Core Competencies: Pleasant, professional and courteous personality. Excellent Problem Solving and Customer Service Skills Ability to think creatively and should have positive attitude. Strong analytical & Interpersonal skills Shifts: Rotational (Should be flexible with gravyard shifts as well) Looking for Immediate Joiners Walk-in Dates- 5th to 9th November 2019 Time: 11:30 am - 2:30 pm Interview Location: Tech Mahindra Limited, Survey No-61/A, Quthubullapur, Bahadurpally, Hyderabad - 500 043 Contact Name: Madhavi Gullekhani-HR (8790585814) Email Id: GM00501019@techmahindra.com List of Mandatory Documents required: Resume Passport Size photographs All Educational Certificates & Experience Certificates (Xerox Copies) Original ID Proof- DL / Passport / PAN Card / Voter ID/ Aadhar card Govt Original ID proof and same Xerox copy of original ID proof Mention POC: Madhavi Gullekhani","location":"Hyderabad","experience":"1 - 5 Years"},{"date":"6 - Nov - 2019","skills":"Back Offoce/ Non Voice Process, Chat processing","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Reach Local Services Private Limited, 5th Floor, B Wing Express Zone, Western Express Highway, Goregaon (East), Mumbai - 400 097","phone":"022-67226612","profile":"Back Office Executive \nReach Local Services Private Limited","description":"Candidate should have Graduation with around 2 to 3 years of experience in any process/ Industry/ relevant work profile. Key Skills- We are looking for smart & Excellent candidate. Ability to communicate clearly & effectively (English is mandatory) Good in excel (basic analytical skills) We have an Job opening for our Back end process (Non Voice Process) - General Shift (9.30 am - 6.30 pm) Back Office role will have support responsibilities and handle functions that helps the operations team to deliver as per the business requirement. The responsibilities are managing databases, performing the research, analyzing the data and updating them in the tool/ dashboard. This is a Backend Content data moderation work This is not a calling or voice process, purely into Back office Maintaining files & record and updating the data on respective software/ tools Preparing daily reports and maintaining the dashboards Complete coordination with the respective sub- ordinates as per the requirement Shift Timings: 9.30 am - 6.30 pm (Monday to Friday) + one Saturday in a month Job Location : Goregaon East Walk in Drive on Wednesday 6th November'19 between 10:00 am - 3:00 pm Interview Venue: Reach Local Services Private Limited 5th Floor, B Wing Express Zone, Western Express Highway, Goregaon (East), Mumbai - 400 097 Contact Person- Swetha Pujari Tel: 022-67226612","location":"Mumbai","experience":"2 - 3 Years"},{"date":"5 - Nov - 2019","skills":"Technical Support, IT Helpdesk/ Service Desk, Product Support","qualification":"B.E./B.Tech","address":"HCL Technologies Limited, A 22 Sector 60, Noida. Nearest Metro Station is Noida Sector 59.","phone":"9971777986","profile":"Product Support Engineer \nHCL Technologies Limited","description":"HCL is hiring for Hardware Support Engineers with good technical knowledge and command over spoken English language. The client is a prestigious US based Healthcare Equipment Manufacturer organization. Eligibility Criteria #Only Technical graduates or post graduates can apply. #Minimum of 01-year experience in hardware troubleshooting is mandatory. #excellent spoken English skills are compulsory!! #Must be comfortable working in US shifts (Night Shifts). Salary: Upto 4.77 LPA (** Basis last CTC drawn) Working days: 5 days, 2 days off (Rotational) Shifts: US Shift Job Responsibility: #Analyse and resolve moderately complex Hardware / application problems faced by clients in Timely manner #Assist in identification, validation, review and approval of customer support procedures #Documents problem and resolution accurately #Escalates or hands-off issues to other areas appropriately #Follows established Procedures and process in resolving the issues #provides support to customers via Phone or E-mail Walk-in Date: 5th November 2019 Timings: 12:00 pm to 6 pm Interview Venue: HCL Technologies Limited A 22 Sector 60, Noida Nearest Metro Station is Noida Sector 59. Kindly carry: 1. A copy of your updated resume 2. A govt. address/ Id proof","location":"Noida","experience":"1 - 6 Years"},{"date":"7 - Nov - 2019","skills":"Technical Support, Service Desk, IT Helpdesk, Networking/ Troubleshooting","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Cognizant Technology Solutions (India) Limited, Manyata Embassy Business Park, Mahogany (F2 Building), 2nd Floor, Hebbal Outer Ring Road, Rachenahalli, Bangalore - 560 045.","phone":"Not Provided","profile":"Technical Support Executive \nCognizant Technology Solutions India Limited","description":"Candidate should be Graduate/ Post-Graduate with any Technical Support International Voice experience, Preferably from Help desk or Service desk. Must have excellent written and verbal communications skills. Excellent Troubleshooting skills, search skills, and ability to approach problems logically. Basic Networking Domain experience (6+ months) Ensure on meeting daily KPIs Receiving end user calls Provide first level resolutions Ticket creation/ Categorization/ Prioritization Ticket escalation to respective Support Group Incident resolution and recovery Ticket Closure If interested, kindly walk-in to the below address on 7th November (Thursday) between 11 A.M to 1 P.M Cognizant Technology Solutions (India) Limited Manyata Embassy Business Park, Mahogany (F2 Building), 2nd Floor, Hebbal Outer Ring Road, Rachenahalli, Bangalore - 560 045. POC: Sathish You are requested to carry the following documents for the discussion- A copy of your updated resume(Mandatory) 2 passport size photograph (Mandatory) Copy of your government photo id (Pan card / Passport / Driving License ). (Mandatory) Print Out of this Email. You who have taken up interview with cognizant in the last 2 months are not eligible to re-take the interview again","location":"Bangalore","experience":"1 - 4 Years"},{"date":"9 - Nov - 2019","skills":"Technical Support, Active Directory, Customer Service, IT Helpdesk","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Advance Computer Services Limited, 201-204, Sector-2, Building 5, Millennium Business Park, Mahape, Navi-Mumbai - 400 710.","phone":"Not Provided","profile":"Technical Support Specialist \nAdvance Computer Services Limited","description":"We are seeking an experienced Help Desk technician to provide support for Microsoft-based systems. The role includes troubleshooting our clients IT issues and supporting their variety of applications and technology needs. Our ideal candidate will bring: 3 years of outstanding customer service experience 1 year of IT help desk experience 1 year of Windows/ macOS operating systems experience Strong working knowledge of: Windows, Active Directory, Networking, Mail systems, Hardware installations Walk-in Date: 9th November, 2019 Time: 9:30 am to 2:30 pm Interview Venue: Advance Computer Services Limited 201-204, Sector-2, Building 5, Millennium Business Park, Mahape, Navi-Mumbai - 400 710.","location":"Mumbai","experience":"2 - 7 Years"},{"date":"5, 6, 7, 8 - Nov - 2019","skills":"Technical Support, Production Support, Service Desk","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Attra Infotech Private Limited, EC2 Gateway Campus, 10B Electronic City Phase II, Begur, Industrial Area, Bengaluru - 560 100","phone":"Not Provided","profile":"IT Service Desk/ Support Engineer \nAttra Infotech Private Limited","description":"Work Experience: 1 to 3 Years Role: Service Desk/ L1/2 Support Engineer Location: Electronic City Phase 2, Bangalore Handle daily technical support activities on desktop support, data network and server management. Setup desktop computers and peripherals and test network connections. Install and test desktop software applications and internet browsers. Test computers to ensure proper functioning of computer systems. Train end users on usage of computer hardware and software. Walk-in Date: 4th - 8th November 2019 Timing: 11:00 AM to 02:00 PM (No candidatures will be accepted after 2 PM) Interview Venue: Attra Infotech Private Limited EC2 Gateway Campus, 10B Electronic City Phase II, Begur, Industrial Area, Bengaluru - 560 100 Contact Person- Aravind Varma","location":"Bangalore","experience":"1 - 3 Years"},{"date":"9 - Nov - 2019","skills":"Technical Support, Customer Service/ IT Helpdesk","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Cloudstrats Technologies Private Limited, AA-57, Kailash Vaibhav Complex, Near Nagbaba Temple, Vikhroli (West), Mumbai","phone":"022-42151818","profile":"Desktop Support Engineer \nCloudstrats Technologies Private Limited","description":"Candidate should be Any Graduate with good communication skills Must be willing to work in Western Suburbs of Mumbai Able to handle the School IT requirements Installation or configuring desktops Configuring Outlook/ Ms-outlook Preparation of Daily/ Weekly/ Monthly Reports Handling team. Will get experience and exposure on End user support and IT infra skills such as Desktop, Service Desk, Cloud etc. Joining : Immediate Joiner Walk-in Date: 9th November 2019 Time: 10:00 am to 2:00 pm Interview Venue: Cloudstrats Technologies Private Limited AA-57, Kailash Vaibhav Complex, Near Nagbaba Temple, Vikhroli [West] Tel: 022-42151818 (Ext: 1804) Mobile: 8291942825 Contact Person- Nayana Rankhambe Email : hr@cloudstrats.com","location":"Mumbai","experience":"1 - 3 Years"},{"date":"5, 6, 7, 8 - Nov - 2019","skills":"HR/ Recruitment, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Franchise India Holdings Limited, 5th Floor, Charmwood Plaza, Eros Garden, Charmwood Village, Surajkund Road, Faridabad, Haryana - 121 009","phone":"9999964020","profile":"Senior Manager - Talent Acquisition \nFranchise India Holdings Limited","description":"We are currently hiring for Senior Manager - Talent Acquisition for our Faridabad based office. Preferably Male 90% Recruitment + 10% Generalist Role Excellent Communication Skills is Mandatory Job Responsbility- Independently handling entire gamut of recruitment. Also supervising hiring teams for bulk-hiring; hiring for verticals like Sales, Edit, Design & Operations. Developing a robust sourcing, screening and interview plans on a monthly basis. Preparing and presenting the TA/ HR-MIS with senior stakeholders and leaders on a daily and weekly basis. Walk-in Date/ Time: 5th - 8th November 2019, 11 AM onwards Interview Venue: Franchise India Holdings Limited 5th Floor, Charmwood Plaza, Eros Garden, Charmwood Village, Surajkund Road, Faridabad, Haryana - 121 009 Landmark: Near Tuglakabad Metro Contact Person- Purnima Haldar (9999964020)","location":"Faridabad","experience":"4 - 9 Years"},{"date":"5, 6, 7, 8, 9 - Nov - 2019","skills":"HR/ Recruitment, Sourcing, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Reliable Business Solutions & Services Pvt. Limited, No. 51, Rajiv Gandhi Salai (OMR) | Rattha TEK MEADOWS, C Block, 1st floor | Sholinganallur | Chennai - 600 119.","phone":"7904356739","profile":"HR Executive \nReliable Business Solutions & Services Pvt. Limited","description":"We have Immediate job openings for HR Executive. Direct Walk-in 1. Freshers can also apply. 2. Female Required. Job Role: 1. Should conduct the interviews of the candidates. 2. Should have good communication. 3. Source required profile from Job portals and schedule their interviews. 4. Do regular follow-ups of the candidates till the join. 5. Prepare offer letter and do joining formalities. Walk-in Date/ Time: 5th - 9th November , 10 AM onwards Interview Venue: Reliable Business Solutions & Services Pvt. Limited No. 51, Rajiv Gandhi Salai (OMR), Rattha TEK MEADOWS, C Block, 1st floor, Sholinganallur, Chennai - 600 119","location":"Chennai","experience":"0 - 1 Years"},{"date":"5, 6 - Nov - 2019","skills":".Net, MVC, Kendo, Telenik, MVC 5, MVC 4, JSON JS, Framework, J Query","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Careator Technologies Private Limited, SLJ Tower, II Floor, BDA # 297, VII Block, IV Phase, BSK III Stage, Bengaluru - 560 085","phone":"Not Provided","profile":"HR Executive/ Recruiter \nCareator Technologies Private Limited","description":"e are looking for a Talent Acquisition fresher to join our HR department and help us grow our IT teams. TA specialist responsibilities include sourcing, screening and providing a shortlist of qualified candidates for various technical roles. You will also network online and offline with potential candidates to promote our employer brand, reduce our time-to-hire and ensure we attract the best professionals. Ultimately, you will build a strong tech talent pipeline and help hire and retain skilled employees for our IT positions. Walk-in Date/ Time: 4th - 6th November , 10 AM onwards Interview Venue: Careator Technologies Private Limited SLJ Tower, II Floor, BDA # 297, VII Block, IV Phase, BSK III Stage, Bengaluru - 560 085 Contact Person- Saravanan","location":"Bangalore","experience":"0 - 1 Years"},{"date":"5, 6, 7 - Nov - 2019","skills":"HR, Talent Acquisition, IT Recruitment","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"MSC Technology (India) Private Limited, Kosmo One Building, 5th Floor Tower-B, Ambattur Industrial Estate, Chennai - 600 058","phone":"9994724746","profile":"HR Executive - Talent Acquisition \nMSC Technology (India) Private Limited","description":"Candidate must have experience in hiring for IT Recruitment. Must have handled complete recruitment cycle Should have excellent knowledge in Job portals and Social networking recruitment Understanding and analyzing the requirement for different levels & closing the requirements on time. Monitoring/ Handling the requirements on a regular basis Good in Maintaining Recruitment Reports Candidate should have go & get Attitude Should have Strong Communication & Interpersonal skill Good in Follow up Short joiners or Immediate joiners - preferable Education: MBA / MSW / MA.HRM Walk-in Date: 5th - 7th November 2019 Time Slot : 10 AM to 4 PM Interview Venue: MSC Technology (India) Private Limited Kosmo One Building, 5th Floor Tower-B, Ambattur Industrial Estate, Chennai - 600 058 Documents to Carry - Updated CV - Passport Size Photograph - Copy of Aadhaar / Pan Card Dress Code : Formals","location":"Chennai","experience":"2 - 4 Years"},{"date":"6 - Nov - 2019","skills":"Talent Acquisition, Volume Hiring, Sourcing, Vendor Management, Recruitment","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Wipro Limited, CDC 3, Right Wing, Mezzanine Floor, 105 Anna Salai, Guindy, Chennai, Tamilnadu - 600 032.","phone":"Not Provided","profile":"Talent Acquisition (Recruiter) \nWipro Limited","description":"Wipro DOP is Hiring for Talent Acquisition - Recruiter for Chennai!! We are looking for Immediate Joiners! Educational Qualification: MBA/ PG in HR Experience: 2 to 3 years' of experience Work Location : Chennai Required Skill Set:- Excellent Communication Skills Domain knowledge Volume hiring Sourcing & recruitment Portal Search. Walk-in Date/ Time: 6th November 2019, 9 AM onwards Interview Venue: Wipro Limited, CDC 3, Right Wing, Mezzanine Floor, 105 Anna Salai, Guindy, Chennai, Tamilnadu - 600 032. Contact Person: Krishna/ Boopathy Documents to be carried: 2 copy of Resume Govt. ID proof Note: Only Candidates experience in End to End volume hiring (BPO/ ITES) are eligible for this role.","location":"Chennai","experience":"2 - 3 Years"},{"date":"5, 6, 7, 8 - Nov - 2019","skills":"HR/ Recruitment, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"AtoS Syntel Private Limited, 2nd floor, Building No 4, Thane Belapur Road Airoli Mindspace, Airoli, Navi Mumbai","phone":"Not Provided","profile":"HR Executive/ Recruiter \nAtoS Syntel Private Limited","description":"We are looking for a HR Onboarding Specialist to join our Human Resources- Recruitment Team We are looking for Fresher/ experienced HR. Person would be responsible for employee onboarding. Gathering necessary paperwork & validating it for smooth joining process. Responsible for offer generation. Address new hires queries regarding their joining. Should explain Offer & salary details to all candidates. Need to co-ordinate with other team for onboarding of new employee. Assist in recruitment processes. Good in Excel & MS Office 5 Days working Requirements- Good communication skills (verbal and written) Team spirit An ability to handle sensitive and confidential information MBA degree in Human Resources Management or similar field Minimum 1 year proven work experience as an HR Onboarding Specialist or in relevant HR role would be an added advantage. Work Location: Airoli Interview Details- Date 5th to 8th November, 2019 Time- 3:00 pm to 4:00 pm. Address: AtoS Syntel Private Limited 2nd floor, Building No 4, Thane Belapur Road Airoli Mindspace, Airoli, Navi Mumbai HR Reference- Anuja sawant","location":"Mumbai","experience":"0 - 1 Years"},{"date":"4, 5, 6, 7, 8 - Nov - 2019","skills":"Talent Acquisition, HR/ Recruitment, Volume Hiring, Mass hiring","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Cafe Coffee Day Limited, Mahajan Compound, Opp. Jaswanti Landmark Walkable distance from Station, Vikhroli (West), Mumbai","phone":"8291289081","profile":"Asst. Manager - Talent Acquisition \nCafe Coffee Day Limited","description":"Work Experience: 3 to 5 years of relevant work experience Required Skills- Good understanding of the company's business objectives and organizational structure Understanding of the company's position in the marketplace Understanding of recruiting processes and procedures Strong understanding of recruiting profiles Strong interviewing skills Understanding of recruiting resource and marketing plan Good understanding of pipeline management and yield analysis Very good understanding of the external marketplace or trends Walk-in Date/ Time: 4th November - 8th November , 9 AM onwards Interview Venue: Cafe Coffee Day Limited Mahajan Compound, Opp. Jaswanti Landmark Walkable distance from Station, Vikhroli (West), Mumbai Contact Person- Frisha Koonan Tel: 8291289081 If interested please do share your resume on frisha.k@cafecoffeeday.com or call on 8291289081","location":"Mumbai","experience":"3 - 5 Years"},{"date":"9 - Nov - 2019","skills":"Technical Support, Active Directory, Windows, IT Infrastructure, Support Services","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"HCL Technologies Limited, Plot No. 3 Surya Sapphire Hosur Road Near D-Mart 1st Phase, Veer Sandra, Electronic City, Bengaluru, Karnataka - 560 100","phone":"Not Provided","profile":"Desktop Support Engineer \nHCL Technologies Limited","description":"Candidate should be Any Graduate with 3 to 8 years of experience in Technical Support, Active Directory, Windows, IT Infrastructure, Support Services. Main Responsibilities include: Accurately testing, identifying, repairing, resolving, and documenting end user technical issues regarding /desktop support, printers, PDAs, BlackBerrys, and LAN cable drops. Hands on role where expected to provide 1st line IT support services to the business community ensuring that all requirements are met within agreed service targets. To provide infrastructure administration functions Providing on-site cover as part of a shift arrangement Taking ownership of issues through to resolution on all appropriate requests. Being prepared to work out of hours when required and to provide out of hours on-call support cover as required Mode of Interview - Face to Face Date - 9th November 2019 Interview Timing -11 AM to 2 PM Interview Venue: HCL Technologies Limited, Plot No. 3 Surya Sapphire Hosur Road Near D-Mart 1st Phase, Veer Sandra, Electronic City, Bengaluru, Karnataka - 560 100 Contact Person-Shobana/ Shemona","location":"Bangalore","experience":"3 - 8 Years"},{"date":"5, 6 - Nov - 2019","skills":"Data Entry, Back Office, Backend Operations, Non Voice Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Novac Technology Solutions Pvt. Limited, Office No:275, Statesman One, R. K. Mutt Road, Mylapore, Chennai - 600 004","phone":"Not Provided","profile":"Data Entry Executive/ Fresher \nNovac Technology Solutions Pvt. Limited","description":"Novac Technology Solutions (Shriram Group Company) is currently hiring for Data Entry (Non Voice) Educational Qualification: B.SC, BCA, B.COM, BA, BBA (2018 and 2019 Batch) - WITHOUT ARREARS Work Experience : Fresher No of positions : 10 Work Location : Chennai Good typing speed Co-ordination Between departments Maintaining database Walk In Date: 5th & 6th November 2019 Time : 9.30 am to 3.00 Pm Venue: Novac Technology Solutions Pvt. Limited Office No:275, Statesman One, R. K. Mutt Road, Mylapore, Chennai - 600 004 Landmark: Near to Bata Showroom/ Mylapore Railway Station Contact Person: Ms. Kerthna *Interested candidates can walk-in directly for this position","location":"Chennai","experience":"0 - 1 Years"},{"date":"5, 6, 7, 8 - Nov - 2019","skills":"Automation/ Manual Testing, Any Scripting Like Python/ Shell/ VB Scripting","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Zuti Engineering Solutions Private Limited, Svaya Robotics 2nd Floor, NSL Icon, Road No. 12, Banjara Hills, Hyderabad - 500 034","phone":"7702700960","profile":"QA/ Testing Engineer \nZuti Engineering Solutions Private Limited","description":"Need Automation Testers and Manual Testers along with any Scripting Like Python/ Shell/ VB Scripting is mandatory Candidate should have 2 to 7 years of solid experience in QA, Software Testing. Walk-in Date/ Time: 5th - 8th November 2019, 10 AM onwards Interview Venue: Zuti Engineering Solutions Private Limited Svaya Robotics 2nd Floor, NSL Icon, Road No. 12, Banjara Hills, Hyderabad - 500 034 Landmark: Opposite to ICICI Bank Contact Person : Bhargav. Contact Number : 7702700960","location":"Hyderabad","experience":"2 - 7 Years"}]}