{"Walkins":[{"date":"14 - Feb - 2020","skills":"Vue.JS, PHP/ Laravel, HTML5, CSS2/3, and standard Java Script.","qualification":"B.E./B.Tech, MCA/PGDCA","address":"The Residency Hotel,1075, Avinashi Road, P N Palayam, Coimbathore - 641 018.","phone":"Not Provided","profile":"PHP Full Stack Developer \nMKS Vision Private Limited","description":"Job Title: PHP Full Stack Developer (Web Development) Work Experience: 5+ Years Job Location: Hyderabad Full Stack Web Developer is responsible for working with both front end and back end technologies. From the conceptual phase through project completion, the full stack developers need to be proficient with providing feedback and ideas, writing code that is clean and organized, meet coding standards set by the team, and troubleshooting bugs. Our front-end development is expected to be mobile-first, and we primarily use Vue.JS, PHP/ Laravel, HTML5, CSS2/3, and standard JavaScript. Job Responsibilities: Developing responsive/ adaptive code that is mobile-first Understanding how to support future browsers while maintaining functionality in older browsers such as IE11 Working with UX/ Creative to design user interactions/micro animations Understand performance and techniques associated with improving performance Walk-in Date/ Time: 14th February 2020, 11 AM onwards Interview Venue: The Residency Hotel,1075, Avinashi Road, P N Palayam, Coimbathore - 641 018. Contact Person- Amit","location":"Coimbatore","experience":"5 - 10 Years"},{"date":"10, 11, 12, 13, 14, 17, 18, 19, 20, 21 - Feb - 2020","skills":"Back Office Operations, Non Voice Process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Hinduja Global Solutions Limited, No. 115, Sri Chamundi Towers, C-2 Building, Hosur Main Road, Garvebhavi Palya, Bangalore - 560 068.","phone":"7829533724","profile":"Back Office Operations- Fresher \nHinduja Global Solutions Limited","description":"Any Graduate- Fresher or Experienced (NO - BE, B.TECH, Post Graduates) Desired Skills: Good communication & analytical skills Basic computer knowledge Must be willing to work in rotational shifts 2 Way cab facility provided 5 Days working, 2 Days Off Walk-in Date: 10th to 21st February 2020 (Monday to Friday) Time Slot: 10 am - 2 pm Walk-in Location: Hinduja Global Solutions Limited No. 115, Sri Chamundi Towers, C-2 Building, Hosur Main Road, Garvebhavi Palya, Bangalore - 560 068. Landmark: Sai Baba temple Contact HR Person: Pooja- 7829533724","location":"Bangalore","experience":"0 - 1 Years"},{"date":"8, 9 - Feb - 2020","skills":"jQuery, Ionic Framework, MySQL, Javascript, PHP, Cordova","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Acorn Tech, Co-win, Gracia Society, R/H No. C-01, Shakar Kalat Nagar Behind Sanket Inn Hotel, Near bhumkar chowk, Wakad, Pune - 411057.","phone":"Not Provided","profile":"PHP/ Full Stack Developer \nAcorn Tech","description":"Our client, a UK based company with offices in India, wishes to recruit an experienced PHP Developer. The right candidate will have a great attitude and will have ample opportunities to advance their career in India and abroad, if wanted! Ideal candidate should have: Two years experience in PHP Experience in jQuery, Javascript and HTML Should know responsive design Ideally should know codeigniter or other MVC framework Advantageous if they know hybrid mobile framework Walk-in Date/ Time: 8th February - 9th March , 10 AM onwards Interview Venue: Acorn Tech Co-win, Gracia Society, R/H No. C-01, Shakar Kalat Nagar Behind Sanket Inn Hotel, Near bhumkar chowk, Wakad, Pune - 411057. Contact Person- Sawan","location":"Pune","experience":"2 - 6 Years"},{"date":"10, 11, 12, 13, 14 - Feb - 2020","skills":"PHP/ MySQL, MVC based Code Igniter PHP Framework and Zend","qualification":"B.E./B.Tech, MCA/PGDCA","address":"AAPC India LLP. Logix Techno Park, 3rd Floor, Tower C, Sector 127, Noida. Opposite HCL Gate No 1. Nearest Metro Station: Okhla Bird Sanctuary","phone":"9999630511","profile":"PHP Developer \nAmerican Academy of Professional Coders","description":"AAPC India is looking for PHP Develope at Noida location (Nearest Metro Station: Okhla Bird Sanctuary and Botanical Garden). Job Timings: 1:00 PM to 10:00 PM IST Candidate should have 3 to 5 years of experience in Web Application Development using PHP/ MySQL of which at least three years in any MVC based Code Igniter PHP Framework and Zend. Must have experience in developing Rich UI based web application using HTML 2.0 web standards, AJAX, JavaScript libraries and framework such as JQuery and Prototype etc. Experience in building high-volume, highly scalable custom websites Should have strong Database Knowledge Should have worked in Agile Scrum framework Walk-in Date/ Time: 10th February - 15th February , 12 PM onwards Interview Venue: AAPC India LLP. Logix Techno Park, 3rd Floor, Tower C, Sector 127, Noida. Opposite HCL Gate No 1. Nearest Metro Station: Okhla Bird Sanctuary Contact Person- Purnima Arora (9999630511)","location":"Noida","experience":"3 - 5 Years"},{"date":"9, 10, 11, 12, 13, 14 - Feb - 2020","skills":"Back Office, Advanced excel, Office Assistance, Business services","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Tech Mahindra Business Services Limited, Spectrum Towers, Ground Floor, Mindspace, Malad (West), Mumbai - 400 064.","phone":"Not Provided","profile":"Back Office Executive \nTech Mahindra Business Services Limited","description":"Tech Mahindra Business Services Limited, is currently hiring for Back Office role for Mumbai Location. Looking for Candidates with experience working on excel and Advance Excel. Should be comfortable with 24*7 shifts Freshers can also apply. Nature of employment - Third party Contract Interested candidates walk in with your updated profile Date: 9th - 14th February , 12 PM onwards Interview Venue- Tech Mahindra Business Services Limited Spectrum Towers, Ground Floor, Mindspace, Malad (West), Mumbai - 400 064. Contact Person- Lakshmi Kumar","location":"Mumbai","experience":"0 - 4 Years"},{"date":"10, 11, 12, 13, 14 - Feb - 2020","skills":"back office, International bpo","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Powerweave Software Services Pvt. Limited, Plot No.27 Road No.11 Behind Tunga Paradise Opposite Gemini House Andheri (East), Mumbai - 400 093","phone":"022-40079322","profile":"Back Office Executive \nPowerweave Software Services Pvt. Limited","description":"Position: Back Office Executive Timings: Night Shift 7:30 PM to 5:30 AM (No Transport Facility) Job Location: Mumbai (Andheri-East) Position Type: Full Time Employment Work Experience: 1 - 6 Years Salary: Depends on Last drawn. Age Criteria: 35 Years Person must have knowledge of MS word, MS excel and MS office including internet explorer. Good Typing speeds. Might also be required to enter product details from printed catalogs into excel sheets or web forms. Freshers are Welcome!!!! Interview Time: 6th February - 14th February (Monday to Friday) Timings: 6:00 PM to 8:00 PM Interview Venue: Powerweave Software Services Pvt. Limited Plot No.27 Road No.11 Behind Tunga Paradise Opposite Gemini House Andheri (East), Mumbai 400093 Contact Person- Megha Haldankar Phone: 022-40079322","location":"Mumbai","experience":"1 - 6 Years"},{"date":"10, 11, 12, 13, 14, 17, 18, 19, 20, 21 - Feb - 2020","skills":"Back Office Operations, Data Entry, Back Office Processing, Customer Care","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Info-X Software Technology Pvt Limited, 335 Udyog Vihar Phase 2, Gurugram - 122016","phone":"9910768257","profile":"Back Office Executive \nInfo-X Software Technology Private Limited","description":"Excellent Opportunity to Work for an International US Back office process Only Graduates with streams like BA, B Com, B Sc, etc.may apply. Candidate should be good at Typing speed with Good Accuracy. (Typing speed of less than 25 wpm is not eligible) Minimum experience: 1 to 6 Years. US based Back Office process (Business to Business Campaign). Processing of Documents for US based clients. Kindly Walk-in for Interview till 28th February 2020 Timings 4:00 PM to 6:00 PM at below mention address. (No Interviews on Saturday and Sunday) Interview Venue: Info-X Software Technology Pvt Limited 335 Udyog Vihar Phase 2, Gurugram - 122016 Contact Sanjay: 9910768257 Email: pramod@infoxwebware.net","location":"Gurgaon","experience":"1 - 6 Years"},{"date":"10, 11, 12 - Feb - 2020","skills":"Non Voice Process, Back Office Operations","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Hexaware BPS- Prince Info City II 2nd Floor, No. 283/3A Old Mahabalipuram Road, Kandanchavadi, Chennai- 600 096.","phone":"9156735477","profile":"Back Office Executive \nHexaware Technologies Limited","description":"Eligibility: Any Graduate Or Experienced can apply Shifts : Rotational 24*7 Salary : Upto 15.5 k/- In Hand 1 rotational week off Limited Openings apply now Interested applicants can directly walk in for interview between 11:00 am - 8:00 pm at the below mentioned address- Hexaware BPS- Prince Info City II 2nd Floor, No. 283/3A Old Mahabalipuram Road, Kandanchavadi, Chennai- 600 096. Contact Person- Mansi Mokashi Kindly mention 'HR Mansi' on top of your resume","location":"Chennai","experience":"0 - 1 Years"},{"date":"10, 11, 12, 13 - Feb - 2020","skills":"Back Office Operations, Non Voice Process","qualification":"Diploma, B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Srhi Rathi Steel Company Limited, A 29, Sector 65, Near Mamura Chawk Noida","phone":"9873574051","profile":"Back Office Executive \nSrhi Rathi Steel Company Limited","description":"Minimum Qualification: Graduation (Any Specialization) Or Diploma holder Candidate should have good communication skills Must have Basic Computer Knowledge Walk-in Date/ Time: 10th - 13th February 2020, 12 AM onwards Interview Venue: Srhi Rathi Steel Company Limited A 29, Sector 65, Near Mamura Chawk Noida Contact Person- Ms. Ankita Srivastava Phone No. 9873574051","location":"Noida","experience":"0 - 1 Years"},{"date":"8 - Feb - 2020","skills":"OOPS and MVC frameworks in PHP, PostgreSQL, MySQL or MS SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"DBXento Systems Private Limited, Fourth Floor, Tower 9, SEZ, Magarpatta City, Pune - 411 013.","phone":"7774033591","profile":"PHP Developer \nDBXento Systems Private Limited","description":"Candidate must have Bachelors degree in Computer Science or a related field. Should have 2 - 7 years of experience with web application development Must have strong experience in OOPS and MVC frameworks in PHP. Database experience on any of the following: PostgreSQL, MySQL or MS SQL Server (Preferably PostgreSQL). Knowledge of software design patterns. Basic understanding of front end technologies (JavaScript, Ajax, etc.). Experience participating in agile and fast-paced software development methodologies. Experience of collaborating in a cross-functional agile team Good verbal and written communication skills Good to Have: Experience in front end development Knowledge of Microservices architecture. Understanding of 12 factor Apps. Understanding of Service Oriented Architectures and RESTful Web Service best practices. Well versed with cloud computing concepts. Experience of unit testing Walk-in Date: 8th February 2020 Timings: 9 AM to 2 PM Interview Venue: DBXento Systems Private Limited Fourth Floor, Tower 9, SEZ, Magarpatta City, Pune - 411 013. Contact Person- Swapnil Khade Phone No: 7774033591","location":"Pune","experience":"2 - 7 Years"},{"date":"8 - Feb - 2020","skills":"C#, SQL Server, ASP .Net, MVC","qualification":"B.E./B.Tech, MCA/PGDCA","address":"InfoVision Labs India Private Limited, Office No. 2 4th Floor, Block IT 7, Qubix Business Park, Blue Ridge, Phase 1 Hinjawadi, Pune - 411 057","phone":"8778797160","profile":"Senior .Net Developer \nInfoVision Labs India Private Limited","description":"Candidate should be able to do planning & tracking of team Agile & SCRUM required Java Script, HTML, CSS 3 required (Debajyoti to confirm on this point) Must have used SQL 2014 version Knowledge on Scripting & Writing Queries Required Resource must have below 3 skill sets: Good in Full-stack Exposure of minimum 2 WEB Applications Aptitude to clear with knowledge on ALGORITHMS, PROBLEM Statement, Multithreading Walk-in Date/ Time: 8th February 2020 from 10 AM onwards Interview Venue: InfoVision Labs India Private Limited Office No. 2 4th Floor, Block IT 7, Qubix Business Park, Blue Ridge, Phase 1 Hinjawadi, Pune - 411 057","location":"Pune","experience":"5 - 8 Years"},{"date":"7, 10, 11, 12, 13, 14 - Feb - 2020","skills":"Core Java, J2EE, Java, Spring.","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Mahindra & Mahindra Limited, Signal Hill Avenue via Reay Road, Sewree, Opp Raj Oil Mills, Next to Reliance IT Centre,","phone":"Not Provided","profile":"Junior Java Developers \nBristlecone India Limited","description":"Work Experience Required: 1 to 3 Years Required Skills: Core Java, J2EE, Java, Spring Duration: 1 Year Contarct (Extendable) Job Location: Mumbai (Sewri) Walk-in Date/ Time: (Monday to Friday) 4th - 14th February 2020, 10 AM onwards Interview Venue: Mahindra & Mahindra Limited Signal Hill Avenue via Reay Road, Sewree, Opp Raj Oil Mills, Next to Reliance IT Centre, Contact Person: Rajesh Kumar","location":"Mumbai","experience":"1 - 3 Years"},{"date":"7 - Feb - 2020","skills":"Java, Spring Boot, RESTFUL Web Services","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Wipro, Building 2, Candor Tech Space Tikri | Sector 48, Gurgaon","phone":"Not Provided","profile":"Java Developer \nWipro HR Services (India) Private Limited","description":"Education & Certification B. Tech/ BE- CSE, ECE,IT, MCA is MUST apply Mandatory Skills: Java, Springboot, RESTFUL Webservices. Work Experience: 2 to 4 Years Candidate should have good technical background in Java, Spring Boot, RESTFUL Web Services. Must have excellent knowledge of Core Java and Spring Should have working knowledge on web services Should have worked in distributed agile model and continuous integration Work Conditions- 11.30 am -9 pm Walk-in Date- 7th February 2020 Interview Timing- 9:00 AM - 1:00 PM Interview Location- Wipro, Building 2, Candor Tech Space Tikri | Sector 48, Gurgaon Interview Process:- Each round will be elimination round Interview duration -3-5 hours","location":"Gurgaon","experience":"2 - 4 Years"},{"date":"15 - Feb - 2020","skills":"Java, pring Boot/ Spring MVC, NodeJS/ Express, Angular, React, ExtJS, Vue","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Paxcom India Private Limited, Unit No. 64, Hartron Complex, Sector 18, Electronic City, Gurugram, Haryana - 122 001.","phone":"Not Provided","profile":"Java Developers \nPaxcom India Private Limited","description":"Candidate should have 2 to 8 years of experience with Java development, and/or other object-oriented programming languages. Should have atleast 1+ years' experience with one or more JS frameworks: NodeJS/ Express, Angular, React, ExtJS, Vue. Must have good experience with Spring Boot/ Spring MVC Walk-in Date/ Time: 15th February 2020, 10 AM onwards Interview Venue: Paxcom India Private Limited Unit No. 64, Hartron Complex, Sector 18, Electronic City, Gurugram, Haryana - 122 001. Contact Person- Madhuri","location":"Gurgaon","experience":"2 - 8 Years"},{"date":"8 - Feb - 2020","skills":"Java, J2EE application servers: Tomcat, WebLogic, WebSphere","qualification":"B.E./B.Tech, MCA/PGDCA","address":"ASG Worldwide Private Limited, 12th Floor, Cambridge Tower. Ramanujan IT City, OMR, Taramani Chennai, Tamil Nadu - 600 113.","phone":"9962055448","profile":"Software Engineer - Java \nASG Worldwide Private Limited","description":"Required (Primary) Skills- Demonstrable professional expertise in Java programming Proficiency with data structures, algorithms, multi-threading, object-oriented programming and design patterns. Strong diagnostic and problem-solving skills . Familiarity with software development for the Windows and/or Linux operating systems. Experience working with Web Services (REST) with an understanding of RESTful service design Practical knowledge of working with one or more of the following J2EE application servers: Tomcat, WebLogic, WebSphere. Development tools such as Eclipse IDE, IntelliJ, Maven, (Gradle, Ant), Artifactory, Jenkins, GIT Essential Duties & Responsibilities- Enhance, maintain, and support our cutting-edge Content Services Platform, primarily using Java. Participate in the full software development life-cycle: requirements analysis, design, coding, testing, debugging, problem resolution. Work in an agile environment with a cross-functional team staffed in the USA and India Provide guidance to Customer Support and field representatives in resolving problems and implementing new solutions at customers sites as necessary Walk-in Date/ Time: 8th February 2020, 9 AM onwards Interview Venue: ASG Worldwide Private Limited 12th Floor, Cambridge Tower. Ramanujan IT City, OMR, Taramani Chennai, Tamil Nadu - 600 113. POC: Gopi (9962055448)/ Bala (9003019525)","location":"Chennai","experience":"3 - 5 Years"},{"date":"9 - Feb - 2020","skills":"Java, Groovy, JavaScript, Python, PHP, .NET or similar","qualification":"B.E./B.Tech","address":"Ericsson India Global Services Pvt. Limited, 7th Floor, Tower A, Knowledge Boulevard Sector 62, Noida - 201 301.","phone":"Not Provided","profile":"Java/ Groovy Automation Developer \nEricsson India Global Services Pvt. Limited","description":"Candidate should have Bachelors degree, preferably B.E or B.Tech or higher with a major in CS or IT with At least 2 years of software development experience (Java, Groovy, JavaScript, Python, PHP, .NET or similar); knowledge web services is a plus. knowledge and skills on any RDBMS, preferably on Unix/ Linux platforms, e.g., Oracle, Sybase, PostgreSQL, etc. Alternatively, MS SQL Server knowledge and skills Experience in improving and maintaining automation, robotics, networks, and processing systems. Good working knowledge of packet networking. Development experience on this would be a definite plus Knowledge of XML/ XSL/ XSLT Good working knowledge on Unix / Linux platforms & MS Windows Server Technical knowledge of TCP/IP protocols and Telecom environment/ architecture would be an added advantage SLCM knowledge, skills and experience would be a significant advantage, especially proficiency in tools like JIRA,CVS, GIT, etc Walk-in Date/ Time: 9th February 2020, 9 AM onwards Interview Venue: Ericsson India Global Services Pvt. Limited 7th Floor, Tower A, Knowledge Boulevard Sector 62, Noida - 201 301. Contact Person- Tomin","location":"Noida","experience":"3 - 8 Years"},{"date":"8 - Feb - 2020","skills":"Core Java, JSP/ Servlet, MS SQL, SQL Queries & Stored Procedures","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Godrej Infotech Limited, Plant 19A, 2nd floor, Pirojsha Nagar, Vikhroli (West), Mumbai.","phone":"022-67964084","profile":"Core Java Developer \nGodrej Infotech Limited","description":"Educational Qualification: Full-time Graduates (Only) Work Experience: 2 to 5 Years Notice Period- Maximum 45 days Job Location: Mumbai (Vikhroli) Primary Skills- 1) Must have strong background/ knowledge in Core Java and JSP/ Servlet 2) MS SQL database design and writing SQL Queries & Stored Procedures. 3) Sound knowledge in HTML, CSS, AJAX and JavaScript. 4) Should be capable of doing Code Review and testing for team members. 5) Should have sound knowledge of Software Development Secondary Skills- 1) Have Good knowledge of React JS, Angular 2 or above. Walk-in Date: 8th February 2020 Timing: 9 AM to 12 PM Interview Venue: Godrej Infotech Limited, Plant 19A , 2nd floor, Pirojsha Nagar, Vikhroli (West), Mumbai. Entry from Gate 4 (Near Petrol Pump) Contact - Ms. Shwetha Shetty (022-67964084)","location":"Mumbai","experience":"2 - 5 Years"},{"date":"10, 11, 12, 13, 14 - Feb - 2020","skills":"MVC C# Entiry Framework MS SQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"RR Donnelley India Outsource Private Limited, 6th floor, Prestige Polygon tower, 471, Anna Salai, (Opposite Raintree hotel) Teynampet, Chennai - 18","phone":"Not Provided","profile":".Net Developers \nRR Donnelley India Outsource Pvt. Limited","description":"Candidate must be able to demonstrate a good understanding of the information technology environment/ infrastructure utilized for the job. Demonstrate good knowledge of the assigned information technology platform and ability to convey that understanding to others in work teams on projects. Good knowledge and ability to set up test scenarios. Primary Skill set: MVC C# Entiry Framework MS SQL Secondary Skills: HTML5, Javascript, JQuery Angular Microsoft Azure Functions Agile Methodology Angular JS Walk-in Date/ Time: 10th February - 14th February , 12 PM onwards Interview Venue: RR Donnelley India Outsource Private Limited, 6th floor, Prestige Polygon tower, 471, Anna Salai, (Opposite Raintree hotel) Teynampet, Chennai - 18 Contact Person- Jones Vasanth","location":"Chennai","experience":"3 - 8 Years"},{"date":"8 - Feb - 2020","skills":".Net Trained/ Fresher","qualification":"B.E./B.Tech, MCA/PGDCA","address":"RM Education Solutions Private Limited, 2nd Floor Ganga Building, Technopark Phase III, Trivandrum, Kerala","phone":"Not Provided","profile":".Net Trainee/ Software Engineer \nRM Education Solutions Private Limited","description":"Qualification: Graduate with no experience (2019 pass-outs with no backlogs) Preferred Graduated in B.Tech (IT/ CS/ EEE/ ECE), BCA, MCA, BSc/ MSc (IT/ CS) Work Experience: Fresher/ 0 to 1 Year Walk-in Date/ Time: 8th February 2020, 10 AM onwards Interview Venue: RM Education Solutions Private Limited, 2nd Floor Ganga Building, Technopark Phase III, Trivandrum, Kerala Contact Person- Sreehari","location":"Trivandrum","experience":"0 - 1 Years"},{"date":"10 - Feb - 2020","skills":".NET Framework, C#, MVC, WCF, Web Services, Web APIs, JavaScript (jQuery), Angular JS","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Cirrius Technologies Private Limited, Cirrius Centre A-19 MIDC Area Cross Road B Andheri (East) Mumbai - 400 093.","phone":"Not Provided","profile":".Net Developer/ Fresher \nCirrius Technologies Private Limited","description":"Candidate should have 0 to 1 year of experience/ knowledge into .NET Frameworks 2.0/ 3/ 5/ 4.0, C#, MVC, WCF, Web Services, Web APIs, JavaScript (jQuery), Angular JS. Must have expert knowledge on ADO .Net, Entity Framework. Someone majorly into development, programming. Walk-in Date/ Time: 10th February 2020, 10 AM onwards Interview Venue: Cirrius Technologies Private Limited Cirrius Centre A-19 MIDC Area Cross Road B Andheri (East) Mumbai - 400 093. Land Mark : JB Nagar/ Chakala (Metro Stn.), MIDC Police Station Reporting Time between 10.00 AM to 11.00 AM Contact - Sapna Rajbhar- HR Executive Interview Process- 1. Aptitude Round 2. HR Round 3. Technical Round Who have attended interview in last 6 month are not eligible to attend interview.","location":"Mumbai","experience":"0 - 1 Years"},{"date":"10, 11, 12, 13, 14 - Feb - 2020","skills":".Net, ASP .Net, VB .Net, Angular JS, Javascript, jQuery","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Infosense Global, A-103, InfoTower-3, Infocity, Gandhinagar - 382009, Gujarat.","phone":"9687644166","profile":".Net Developers \nInfosense Private Limited","description":"Candidate should have 0 to 3 years experience as .NET Developer Job Location: Gandhinagar, Gujarat. Required Skills: .Net, ASP .Net, VB .Net, Angular JS, Javascript, jQuery Walk-in Monday to Friday between 3:00 pm to 6:00 pm till 14th February, 2020 Interview Venue: Infosense Global A-103, InfoTower-3, Infocity, Gandhinagar - 382009, Gujarat. Contact Person- Bhumika Vaghela Phone: 9687644166","location":"Gandhinagar","experience":"0 - 3 Years"},{"date":"10, 11 - Feb - 2020","skills":"ASP .Net/ VB .Net, MS SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA","address":"P2B Ace Solutions Private Limited, A-38, First Floor, Road No. 11, Wagale Industrial Estate, Thane (West) - 400 604","phone":"8691047842","profile":"Software Developer - ASP .Net \nP2B Ace Solutions Private Limited","description":"Candidate should have 0 to 2 years of experience in Software Development using ASP .Net/ VB .Net with database knowledge in MS SQL Server Walk-in Date/ Time: 10th - 11th February 2020, 11 AM onwards Interview Venue: P2B Ace Solutions Private Limited A-38, First Floor, Road No. 11, Wagale Industrial Estate, Thane (West) - 400 604 Tel: 022-25827444/ 25804877","location":"Mumbai","experience":"0 - 2 Years"},{"date":"8 - Feb - 2020","skills":"ASP .NET, Web Service, ADO .Net, MVC 4/5, HTML, HTML5, XML, JavaScript","qualification":"B.E./B.Tech, MCA/PGDCA","address":"XL Health Corporation India Private Limited, Search Results Sarakki Industrial Layout, Dollar Layout, 3rd Phase, J. P. Nagar, Bengaluru, Karnataka - 560 078","phone":"Not Provided","profile":"ASP .Net Developer \nOptum Global Solutions (India) Private Limited","description":"Candidate must be proficient with Microsoft .NET development using C#. In depth knowledge and experience with web development technologies including ASP .NET, Web Service, ADO .Net, MVC 4/5, HTML, HTML5, XML, JavaScript (Vue JS), JSON, JQUERY, AJAX and CSS, database development including relational database design, MS SQL. In depth knowledge and experience with distributed application development: Web API, WCF, LINQ Knowledge or Experience with SQL Server Technologies like - SSIS, SSRS would be an added advantage Walk-in Date/ Time: 8th February 2020 from 9 AM onwards Interview Venue: XL Health Corporation India Private Limited Search Results Sarakki Industrial Layout, Dollar Layout, 3rd Phase, J. P. Nagar, Bengaluru, Karnataka - 560 078 Email : ranjith_k@uhc.com","location":"Bangalore","experience":"4 - 8 Years"},{"date":"7, 8 - Feb - 2020","skills":"Java Trained/ Fresher","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Meshark Software Technologies Private Limited, Manjeera Trinity Corporate, 13th Floor, #12A02 A2, Plot No. S2, Kukatpally, JNTU Road, Hyderabad - 500072","phone":"7331199975","profile":"Java Developer/ Fresher \nMeshark Software Technologies Pvt. Limited","description":"Meshark Software Technologies Pvt. Limited, is having an immediate requirement for Java Developer. Candidate should be excellent in coding skills in Java Must have good communication skills Walk-in Date/ Time: 4th February - 8th February , 11 AM onwards Interview Venue: Meshark Software Technologies Private Limited Manjeera Trinity Corporate, 13th Floor, #12A02 A2, Plot No. S2, Kukatpally, JNTU Road, Hyderabad - 500072 Contact Person: Chandhini Phone No. 7331199975","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"15 - Feb - 2020","skills":"Technical Support, Application Support, Production Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Seclore Technology Private Limited, Excom House, 2nd floor, Behind HP petrol pump, Near Sakinaka Metro Sakinaka, Mumbai - 72","phone":"Not Provided","profile":"Application Support Engineer \nSeclore Technology Private Limited","description":"Candidate should have 3 to 5 years' experience in a Technical Support role, preferably application support. Hands on experience across the following core technologies. Must have good communication skill and learning attitude. Operating systems - Windows Server/Windows Client Infrastructure technologies - AD, DNS, DHCP, IIS Working knowledge of Relational DB principles and methodologies - MS-SQL, Oracle Managed Customers from regions such as NA, EMEA or APAC Ready to work on 24/7 support centre. Willing to work in night shifts Walk-in Interview on 15th February 2020 Time: 10 am - 5 pm Interview venue: Seclore Technology Private Limited Excom House, 2nd floor, Behind HP petrol pump, Near Sakinaka Metro Sakinaka, Mumbai - 72","location":"Mumbai","experience":"3 - 5 Years"},{"date":"8 - Feb - 2020","skills":"Native, Java, Html5, Java Script","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Tech Era IT Consulting Private Limited, 4th Floor, Cyber view Residency, The West in Hotel Road, Madhapur, Hyderabad - 500 081","phone":"9384876833","profile":"Angular/ React Native Developer \nHexaware Technologies Limited","description":"Hexaware Technologies Limited is hiring for Angualr 2+ (or) React Native Developer, Required Skills: HTML5, Java Script Work Experience: 2 - 5 Years Location : Hyderabad Walk-in Date: 8th February 2020 Time: 9:00 am Walk in location: Tech Era IT Consulting Private Limited 4th Floor, Cyber view Residency, The West in Hotel Road, Madhapur, Hyderabad - 500 081 Contact person: Ramesh. A Phone: 9384876833/ 9865168829","location":"Hyderabad","experience":"2 - 5 Years"},{"date":"6, 7, 8 - Feb - 2020","skills":"Automation Testing with UFT/ QTP using VB Scripting","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Karani Projects Private Limited, Ground Floor, Gala No. 29, Sona Udyog Premises, Parsi Panchayat Road, Andheri (East), Mumbai - 400069","phone":"Not Provided","profile":"HR Administrator (Female) \nKarani Projects Private Limited","description":"Qualification: Any Degree or Diploma in Human Resources. Work Experience: 3 - 7 years working experience in a similar capacity. Added advantage if available immediately or within short-notice. Key Requirements: Proven work experience as an HR Administrator, HR Administrative Assistant or relevant role Experience with HR software, like HRIS or HRMS Computer literacy (MS Office applications, in particular) Thorough knowledge of labor laws Excellent organizational skills, with an ability to prioritize important projects Strong phone, email and in-person communication skills BS in Human Resources or relevant field. Walk-in Date/ Time: 6th February - 8th February , 10 AM onwards Interview Venue: Karani Projects Private Limited Ground Floor, Gala No. 29, Sona Udyog Premises, Parsi Panchayat Road, Andheri (East), Mumbai - 400069 Contact Person- Tejas Sidnal","location":"Mumbai","experience":"3 - 7 Years"},{"date":"8 - Feb - 2020","skills":"R Functions, Labour Laws, Employee Management, Business Operations, HR Operations","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"RIG Enterprise Applications, Plot 682, 4th Floor BabuKhan Rasheed Plaza Jubliee Hills Road No. 36, Hyderabad","phone":"9535121978","profile":"HR Process Associate \nRIG Enterprise Applications","description":"Candidate should have Any Bachelor Degree with Passion of HR and 0 - 2 years of experience in HR operations. Highly motivated self-starter with a competitive personality, drive to exceed goals, and strong attention to detail. Must have exceptional communication skills, both oral and written, coupled with a positive and energetic phone presence Creative, ambitious and very detail oriented Ability to work independently as well as part of a team in a fast-paced environment Must be willing to work in US/ Night Shift Job Responsibility- Manage training, transition and implementation initiatives in various HR functions. Work on any Employee Management System to streamline processes that support acquisition, management & immigration of workforce at client locations. Develop a good understanding of client companies, their industry, what they do and their work culture and environment Focus on HR process development & improvement; create awareness amongst employees, review & documentation. Regular Meetings with clients to co-ordinate business operations. Knowledge of compliance of all Labour Law/statutory registers & Immigration of US is a plus Those who are ready to work in NIGHT SHIFT (USA TIMINGS) then only attend the interview on 8th February, Saturday from 11:00 AM to 2:00 PM (maximum) Interview Venue: RIG Enterprise Applications Plot 682, 4th Floor BabuKhan Rasheed Plaza Jubliee Hills Road No. 36, Hyderabad Land Mark: Opposite to Brand factory building Next to Madhapur Metro Station Contact Person- Pavitra (9535121978)","location":"Hyderabad","experience":"0 - 2 Years"},{"date":"6, 7 - Feb - 2020","skills":"Lateral Hiring, Bfsi Recruitment, Bulk Hiring, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"IDBI Federal Life Insurance Company Limited, 22nd Floor, A Wing, Marathon Futurex, NM Joshi Marg, Lower Parel East, Mumbai, Maharashtra - 400 013.","phone":"9653466730","profile":"HR Executive/ Recruiter \nIDBI Federal Life Insurance Co. Limited","description":"Applicant should be well versed with working on sites as Naukri, Monster, Shine, LinkedIn, IIMjobs etc. Must have understanding Clients JDs & Specifications. Taking initial rounds of interviews and Scheduling for further rounds of discussion. Maintaining daily data. Handling end to end recruitment. Screening and Short listing profiles from Job portals, Networking sites and Referrals. Walk-in Date: 6th - 7th February 2020 Time- 10.30 am to 5.00 pm Interview Venue: IDBI Federal Life Insurance Company Limited 22nd Floor, A Wing, Marathon Futurex, NM Joshi Marg, Lower Parel East, Mumbai, Maharashtra - 400 013. Contact Person- Nayana Panicker ( 9653466730 )","location":"Mumbai","experience":"0 - 5 Years"},{"date":"7 - Jan - 2020","skills":"HR/ Recruitment, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"K12 Techno Services Private Limited, #41 Trinetra Building, New BEL Road Mayuri Signal, Behind Punjab National Bank, AG's Layout, Mathikere, Bengaluru, Karnataka - 560 054.","phone":"6364899690","profile":"HR Intern/ Executive (Fresher) \nK12 Techno Services Private Limited","description":"Candidate must have excellent communication skills with willingness and passion to learn new things by grabbing the opportunity. Should have good experience with Microsoft Excel & Quick learner. Experience in recruitment preferred Job Responsibility- Recruitment/ Talent Acquisition Demonstrating the use of multiple channels in sourcing by attracting candidates Posting job ads and organizing resumes and job application Assisting with leadership hiring and other miscellaneous HR processes. Walk-in Date/ Time 7th February 2020, 10 AM onwards Interview Venue: K12 Techno Services Private Limited #41 Trinetra Building, New BEL Road Mayuri Signal, Behind Punjab National Bank, AG's Layout, Mathikere, Bengaluru, Karnataka - 560 054. Contact Person- Komal (6364899690)","location":"Bangalore","experience":"0 - 1 Years"},{"date":"7 - Feb - 2020","skills":"Software Testing, Automation Testing, Manual Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"AGS Transact Technologies Limited, AGS House, Plot No. EL 82 & 83, TTC Industrial Estate, MIDC Electronic Zone, Navi Mumbai - 400 705.","phone":"Not Provided","profile":"Software Tester \nAGS Transact Technologies Limited","description":"Candidate should have experience in Manual Testing/ Automation Testing Should be working in ATM/ POS/ IMPS Switch Support Should be working in banking domain. Walk-in Date/ Time: 7th February 2020, 9 AM onwards Venue Details- AGS Transact Technologies Limited AGS House, Plot No. EL 82 & 83, TTC Industrial Estate, MIDC Electronic Zone, Navi Mumbai - 400 705. Contact Person : Rasika HR team 1st floor","location":"Mumbai","experience":"1 - 4 Years"},{"date":"8 - Feb - 2020","skills":"Production Support, Desktop Support, Application Support","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Financial Software & Systems Private Limited, 1st Floor, Kalpataru Prime, Plot, 3, Road No. 16, Nehru Nagar, Wagle Industrial Estate, Thane West, Mumbai, Maharashtra - 400 604.","phone":"8390013136","profile":"Application Support Engineer \nFinancial Software & Systems Pvt. Limited","description":"Educational Qualification: BE, B.Tech, MSC, MCA, B.SC (Computer Science) Sound Knowledge on BASE24, Banking Applications, SQL, Linux & Unix, Only Male candidates can apply. Must have excellent Customer Service Skills and Aptitude. Resolving technical issues relating to banking through Emails / telephonic support. Liaising with internal / external teams for resolving technical issues at the earliest. Liaising with vendors for issues related to UPI, Mpay, PG Providing reports to Bank as per requirement analysis. Should have good communication Skills Knowledge of Products and Processes Ability to analyze and solve Semi-technical issues. Willingness to work in night shifts and 24 / 7 environment Responsible for providing technical support for client/ Bank in timely manner. Notice period : Immediate Job Location : Mumbai If interested kindly share your resume on Gagandeepkaurr@fss.co.in and Walking for interview on 8th February 2020 at 9:00 am. Interview Venue: Financial Software & Systems Private Limited 1st Floor, Kalpataru Prime, Plot, 3, Road No. 16, Nehru Nagar, Wagle Industrial Estate, Thane West, Mumbai, Maharashtra - 400 604. Contact Person- Gagandeep Phone No. 8390013136 Kindly bring updated resume, salary slips, offer letter, passport size photo while coming for interview.","location":"Mumbai","experience":"1 - 6 Years"},{"date":"15 - Feb - 2020","skills":"Java, JSP, Servlets, J2EE, Spring, Hibernate, C/ C++, Multi-Threading, .Net, C#, SharePoint","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Seclore Technology Private Limited, Excom House, 2nd floor, Behind HP petrol pump, Saki Vihar Road Sakinaka, Mumbai - 72","phone":"Not Provided","profile":"Product Engineer - Java \nSeclore Technology Private Limited","description":"Seclore is looking to hire programmers who are passionate about working in Product Development Environment. We are open for candidates from any technology background. Criteria for evaluation will be Aptitude, Logical Reasoning and Problem Solving. Required Skills- Java, JSP, Servlets, J2EE, Spring, Hibernate C/ C++, Multi-Threading, Socket Programming, Mac Application Development, Objective C, OSX, .Net, C#, SharePoint, MVC, WCF, Candidate should have BE/ B.Tech/ MCA/ M.Tech/ PGDST qualification (2017-18 Graduates) from reputed institutes. Attitude and aptitude to meet the challenges. We are open for candidates from any technical background with knowledge of different technologies. Selected candidates will get an opportunity to work on following technologies. Training will be provided by the Company upon joining. Walkin Interview on 15th February, 2020 Time: 12 noon - 2 pm Venue Details- Seclore Technology Private Limited Excom House, 2nd floor, Behind HP petrol pump, Saki Vihar Road Sakinaka, Mumbai - 72","location":"Mumbai","experience":"1 - 2 Years"},{"date":"8 - Feb - 2020","skills":"Orcale/ PL SQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Broadridge Financial Solutions (India) Private Limited, DivyaSree NR Enclave, EPIP Industrial Area, 1 EPIP Industrial Area, Whitefield, Bengaluru Karnataka - 560 066.","phone":"Not Provided","profile":"Oracle PL/ SQL Developer \nBroadridge Financial Solutions (India) Pvt. Limited","description":"Qualification: BE/ B.Tech/ MCA/ M.Tech/ MSc or equivalent 2-4 years of experience in Oracle PL/ SQL technology with strong RDBMS concepts. Experience in Oracle 11g, Toad or Oracle PL/SQL developer will be a plus Should have excellent problem solving skills. Should able to write high performance code. Ability to model, analyze and manage large volumes of data. Highly motivated with the ability to work well independently and within a team environment Experience in dealing with clients on a verbal and written basis. Excellent communication and written skills Walk-in Date: 8th February, 2020 - Saturday Time slot: 10:00 AM to 2:00 PM Interview Venue: Broadridge Financial Solutions (India) Private Limited, DivyaSree NR Enclave, EPIP Industrial Area, 1 EPIP Industrial Area, Whitefield, Bengaluru Karnataka - 560 066.","location":"Bangalore","experience":"2 - 4 Years"},{"date":"8 - Feb - 2020","skills":"Technical Support, Customer Support, Service Desk, Voice Process","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"DXC Technology (India) Private Limited, Maruti Concorde Business Park, Service Road, Konappana Agrahara, Electronics City, Bengaluru, Karnataka - 560 010.","phone":"Not Provided","profile":"Technical Support Engineer \nDXC Technology India Private Limited","description":"Qualification: Only Graduates (BE/ B.Tech/ BSc/ BCA/ MCA etc) Work Experience: Freshers with 0-1 years Experience Good communication in English Benefits- Good infrastructure domain knowledge Two Way Cabs provided from us 5 Days Working 2 Days Off Additional shift allowance will be provided. Ready to work in global shift Walk-in Date/ Time: 8th February 2020, 11 AM onwards Interview Venue: DXC Technology (India) Private Limited DXC Technology, Maruti Concorde Business Park, Service Road, Konappana Agrahara, Electronics City, Bengaluru, Karnataka - 560 010. Landmark: Near Electronic Bus stand, Service Road Contact Person- Gopala BR List Of Mandatory Documents to carry for interview 1 Pan Card 2 Aadhar card 3 10th Marks card 4 12th Marks card 5 Degree Certificate & Last sem marks card 6 If Experience (Relieving Letter/ Full and Final Settlement /Service Certificate / Offer Letter) Interview Rounds : Group Discussion/ Written Test / Operations round","location":"Bangalore","experience":"0 - 1 Years"},{"date":"7, 8, 10, 11, 12, 13 - Feb - 2020","skills":"Desktop Support, Troubleshooting, Networking, OS Installation","qualification":"B.E./B.Tech, MCA/PGDCA, Diploma","address":"Progressive Infotech Private Limited, No:177/1, 2nd Floor , 7th B, Main Road, 3rd Block Jayanagar, Bangalore - 560 011.","phone":"9101394095","profile":"Desktop Support Engineer \nProgressive Infotech Private Limited","description":"Education: Any Graduate or 3 Yrs. Diploma holder Work Experience: 1 to 2 Years Duties & Responsibilities: Installation and Roll out services of new desktops & laptops. Hardware fault diagnosis & isolation on desktops / laptops. First level of support on desktop / laptops under warranty / AMC with third part vendor & vendor coordination for L2/L3 & Spares support Installation and OS Support - Repair / Re-Installation or fresh Installation Installation and Software Support on Office Automation software, Anti-virus software, Email Client (Outlook), IE, Chrome & other Business Critical Applications Walk-in Date/ Time: 7th February - 13th February , 10 AM onwards Interview Venue: Progressive Infotech Private Limited No:177/1, 2nd Floor , 7th B, Main Road, 3rd Block Jayanagar, Bangalore - 560 011. Landmark- (NMKRV, College) Contact - Arunoday Chakraborty (9101394095)","location":"Bangalore","experience":"1 - 2 Years"},{"date":"8 - Feb - 2020","skills":"SQL Queries, Stored procedure, functions, SQL Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Cognizant Technology Solutions India Limited, Building No. 12A, 1st floor, Raheja Mind Space, Hi-tech city, Hyderabad - 500 081","phone":"Not Provided","profile":"Technical Support Engineer (SQL) \nCognizant Technology Solutions India Limited","description":"Walk In Interview for Technical Support Engineer (SQL Support) role at Hyderabad Location. Please find the below details for your reference. Skill: SQL Support Role Designation: Level 2 ork Experience: 2 - 4 years Notice Period : immediate only Shift : Flexible for Night shifts Candidates should have Minimum 15 years of education is mandate with supporting documents. Should be interested to work on SQL support role Not a developer Should have good understanding of SQL Statements. Has working knowledge on Types of Joins Syntax structure of SQL script Strong expertise in writing complex SQL Queries, Stored procedure, functions Expert understanding of SQL Server 2005, 2008, 2012 and SQL Server administration, troubleshooting. Joins , SQL Server , Data Warehouse , SSIS , T-SQL , Java script , SSAS , MSBI Excellent in Microsoft SQL Database Walk-in Interview on 8th February 2020 Timings: 10 am to 11:30 am Interview Venue: Cognizant Technology Solutions India Limited Building No. 12A, 1st floor, Raheja Mind Space, Hi-tech city, Hyderabad - 500 081","location":"Hyderabad","experience":"2 - 4 Years"},{"date":"7 - Feb - 2020","skills":"Manual Testing, Test case Execution, Bug Reporting and Tracking","qualification":"B.E./B.Tech, MCA/PGDCA","address":"CashLink Global Systems Private Limited, No. 37, 3rd Floor, Thapar House Montieth Road, Egmore, Chennai - 600 008.","phone":"8939875135","profile":"Software Testing Engineer \nCashLink Global Systems Private Limited","description":"Candidate should have 1 to 4 years of hands on experience in Manual Testing, Test case Execution, Reporting and Tracking the bugs in bug Tracking tools. Preferred - BFSI Banking, Mobile Testing, Web Based Application, Web Logic Server, SQL, Credit and Debit Card Testing (Payment Domain). Walk-in Date/ Time: 7th February 2020, 9 AM onwards Interview Venue: CashLink Global Systems Private Limited No. 37, 3rd Floor, Thapar House Montieth Road, Egmore, Chennai - 600 008. Landmark: Opposite to Red Cross Hospital Contact Person- Jafar Hussain A (8939875135)","location":"Chennai","experience":"1 - 4 Years"},{"date":"7, 8, 10, 11, 12, 13, 14, 15 - Feb - 2020","skills":"Selenium, Webdriver, Software Testing, Application Testing, Manual Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"D2K Technologies (India) Private Limited, 605, Pujit Plaza, Plot No 67, Sector-11, CBD Belapur, Navi Mumbai.","phone":"022-27562853","profile":"Software Tester - Male Only \nD2K Technologies (India) Private Limited","description":"Candidate should have minimum 1 year of experience in Selenium, Creation & Execution of Test scenarios & Test Cases covering entire product life cycle Functional , system Integration, User Acceptance, Go Live Testing. Experiences using task & Defect Management tools viz JIRA. Web based application Testing, Database (Sql) Testing Prepare & Execute, Test Scenarios for Module, Integration System and sanity Testing Prepare Test Data for the Test Cases Defect logging & Tracking Walk-in Date: 7th - 21st February 2020 Time : 10.00 am to 3.00 pm Interview Venue: D2K Technologies (India) Private Limited 605, Pujit Plaza, Plot No 67, Sector-11, CBD Belapur, Navi Mumbai. Contact Person- Verunika S Phone: 022-27562853","location":"Mumbai","experience":"1 - 4 Years"},{"date":"8 - Feb - 2020","skills":"Java, J2ee, Core Java","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Oottru Technologies Private Limited, Pride Hulkul, #116, 802, Lal Bagh Main Road, SGN Layout, Doddamavalli, Sudhama Nagar, Bengaluru, Karnataka - 560 027.","phone":"Not Provided","profile":"QA Testing Engineer/ API Testing \nOottru Technologies Private Limited","description":"Person should be BE/ B.Tech/ MCA with 3 to 8 years of experience working with product companies or top service organizations. Hands on experience on API Testing tools like Postman, Rest Assurred, HTTP Client or Rest Sharp using Java or C# programming language. Must be strong in Programming using Java or C#. Hands on experience with testing, analyzing and troubleshooting communication between front-end and API/ Web Services Nice to have: Hands on experience on UI Automation using Selenium, Cucumber or Specflow using Java or C# Experience is designing the automation framework for API as well as UI Hands on experience on designing Xpath Walk-in Interview on 8th February 2020 (Saturday) Time: 10 AM to 2 PM Interview Venue: Oottru Technologies Private Limited Pride Hulkul, #116, 802, Lal Bagh Main Road, SGN Layout, Doddamavalli, Sudhama Nagar, Bengaluru, Karnataka - 560 027. Contact - Talent Acquisition Team ( 22223055 )","location":"Bangalore","experience":"3 - 8 Years"},{"date":"14 - Feb - 2020","skills":"JAVA/ C++, Data Structure and Algorithm, Design Concepts","qualification":"B.E./B.Tech, MCA/PGDCA","address":"DEALERSOCKET (INDIA) PRIVATE LIMITED, LEVEL 4, TOWER 2, PRESTIGE TECHNOSTAR, PHASE 1, DODDANEKUNDI INDUSTRY AREA BENGALURU 560 074","phone":"Not Provided","profile":"Software Engineer (Java) \nDealerSocket (India) Private Limited","description":"Education: Bachelor's Degree in Computer Science or equivalent Minimum Experience: 2+ years Specialized Knowledge & Skills- Experience with Web Services and Serialization (i.e. XML, JSON, SOAP, REST) Experience with OOP Architecture, Design Patterns and Implementation Experience with Agile Management Tools (i.e. Confluence, JIRA, VersionOne) Experience with SQL databases Familiar with Java Programming Familiar with at least one dynamic scripting language (PHP, Perl, Python or Ruby) Familiar with at least one high level language (C++, Java, Objective C, C# etc..) Proficiency with ECMAScript, CSS and SASS/LESS frameworks Interview Process : - Coding online test (Java) Please bring your laptop - Aptitude test - F2F Walk-in Interview on 14th February from 9 AM onwards","location":"Bangalore","experience":"2 - 7 Years"},{"date":"5, 6, 7, 10, 11, 12, 13, 14 - Feb - 2020","skills":"Selenium, Web based application Testing, Database (Sql) Testing, Test Creation & Execution, Test Cases","qualification":"B.E./B.Tech, MCA/PGDCA","address":"D2K Technologies (India) Private Limited, 605, Pujit Plaza, Plot No 67,Sector-11, CBD Belapur, Navi Mumbai.","phone":"022-27562853","profile":"Software Tester - Male Only \nD2K Technologies (India) Private Limited","description":"Candidate should have minimum 1 year of experience in Selenium, Web based application Testing, Database (Sql) Testing. Experience in creation & Execution of Test scenarios & Test Cases covering entire product life cycle Functional, System Integration, User Acceptance, Go Live Testing. Task & Defect Management tools viz JIRA. Prepare & Execute, Test Scenarios for Module, Integration System and sanity Testing as required. Prepare Test Data for the Test Cases, Defect logging & Tracking Walk-in Date: 5th - 21st February 2020 Time : 10.00 am to 3.00 pm Interview Venue: D2K Technologies (India) Private Limited 605, Pujit Plaza, Plot No 67,Sector-11, CBD Belapur, Navi Mumbai. Contact Person- Verunika S Phone No. 022-27562853","location":"Mumbai, Nagpur","experience":"1 - 4 Years"},{"date":"8 - Feb - 2020","skills":"C, C++ or Java","qualification":"B.E./B.Tech","address":"OpenText Technologies India Private Limited, Intermediate Ring Road, Challanghatta, Domlur, Bengaluru, Karnataka - 560 071","phone":"Not Provided","profile":"Software Engineer - Intern (C, C++/ Java) \nOpentext Technologies India Pvt. Limited","description":"Educational Qualification : B. Tech in CSE/ ECE/ IT stream Academic consistency with 70% or 7 CGPA in 10th, 12th and B.Tech Year of graduation : 2018, 2019 & 2020 Should have good programming knowledge on C, C++ or Java Must have good oral and written communication abilities Ability to work independently as well as in a team Internship duration: 6 months (probability to extend) If interested candidates can, walk-in directly on 8th February, 2020 from 9.30 AM till 1.00 PM at the below mentioned premises/ address- OpenText Technologies India Private Limited, Intermediate Ring Road, Challanghatta, Domlur, Bengaluru, Karnataka - 560 071 Note: Please ignore this mail if you have attended our internship drive in last 3 months duration.","location":"Bangalore","experience":"0 - 2 Years"},{"date":"3, 4, 5, 6, 7 - Feb - 2020","skills":"Front Desk / Receptionist Activities, General Administration","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"DATAMARK BPO Service Private Limited, Prince Infopark, Block-A, 2nd Main Road Ambattur Industrial Estate, Chennai - 600 058.","phone":"8056111551","profile":"Front Office/ Admin Executive \nDATAMARK BPO Service Private Limited","description":"Educational Qualification: Any Degree (Only Female) Work Experience: 1.5 - 12 Years Must have excellent communication skills Job Location: Ambattur, Chennai. Job Responsibility- Required to assist Facility Manager regarding employee transportation Should assist in managing cafeteria services, printing and stationary Should assist in managing Facilities management which includes housekeeping, security and electrical maintenance Should handle the statutory complains for vendors, bills and payment and petty cash Should assist in managing the equipment's for day to day operations AC, DG, UPS and EB power Should Coordination on client visit and event management Should assist Facilities Supervisor in other admin activities Walk-in Date/ Time: 3rd - 7th February 2020 from 10 AM onwards Interview Venue: DATAMARK BPO Service Private Limited Prince Infopark, Block-A, 2nd Main Road Ambattur Industrial Estate, Chennai - 600 058.","location":"Chennai","experience":"2 - 7 Years"},{"date":"3, 4, 5, 6, 7, 8 - Feb - 2020","skills":"International Non Voice/ Email Process, Customer Service","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Sutherland Global Services Private Limited, 9th Floor, Lanco Hills Technology Park, Near Delhi Public School, Manikonda, Hyderabad - 500 089.","phone":"Not Provided","profile":"Backend Executive (Email Process) \nSutherland Global Services Private Limited","description":"Urgent opening for Freshers and Experienced candidates min (0-5 Years), Looking for immediate Joiners. Candidate should have Bachelors Degree any stream with strong written & verbal communication skills Basic knowledge on computer, keyboarding skills, basic Microsoft Office (Outlook, Word, Excel) Should be willing to work for Night Shifts & Rotational Shifts Excellent Growth/ Incentives Two-way transport is provided for Night Shifts Job location - Hyderabad Interested candidates must directly walk-in to Sutherland Office for the interview process. Walk-in Date: 3rd - 8th February 2020 Time - 11 am to 2 pm Venue Details: Sutherland Global Services Private Limited 9th Floor, Lanco Hills Technology Park, Near Delhi Public School, Manikonda, Hyderabad - 500 089. Contact HR - Sujata Note: Please carry updated resume and Govt. photo ID proof","location":"Hyderabad","experience":"0 - 5 Years"},{"date":"3, 4, 5, 6, 7, 8 - Feb - 2020","skills":"Front desk, Front Office, Receptionist/ Front Office Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"AstraZeneca India Private Limited, C/O Sodexo Facility Management India Pvt. Limited, Ramanujan IT City, 10th & 11th Floor Neville Tower 2nd Floor Hardy Towers, Tharamani, Chennai - 600113","phone":"9962026287","profile":"Front Office Executive (Female Only) \nSodexo Food Solutions (India) Private Limited","description":"Sodexo Food Solutions (India) Private Limited, is hiring Front Office Candidates with pleasing personality and good communication for Tharamani Location in Chennai. REQUIREMENT: CANDIDATES with minimum of 6 months experience in Front Office/ Guest relations Management Good in communication skills with a pleasing personality Female Candidates only can apply for this post. Minimum UG Qualification is must SALARY: Upto 25,000 Gross per month Walk-in Date: 3rd to 20th Feburary 2020 Timings: 10 AM to 4 PM Interview Venue: AstraZeneca India Private Limited C/O Sodexo Facility Management India Pvt. Limited Ramanujan IT City, 10th & 11th Floor Neville Tower 2nd Floor Hardy Towers, Tharamani, Chennai - 600113 Interested candidates can send your updated resume to gopalakrishnan.s@sodexo.com","location":"Chennai","experience":"1 - 3 Years"},{"date":"3, 4, 5, 6, 7, 8 - Feb - 2020","skills":"Front Office, Data Entry, Ms office (Excel, Word)","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Ebenezer International School, Singena Agrahara Road, Via Huskur Road, A.P.M.C. Yard, Huskur P.O, Electronic City, Bengaluru - 560 099","phone":"9445455522","profile":"Front Office Executive \nJND Edu Management Services Pvt. Limited","description":"Ebenezer International School Bangalore, Looking for Young and energetic Team Member as a Front Office Executive with good communication skill, dynamic personality and experience. Candidate should be qualified graduate in any stream, Should have relevant experience in Front Office role Must have knowledge in Ms office (Excel, Word) Walk-in Date/ Time: 3rd to 15th February 2020, 10 AM onwards Interview Venue: Ebenezer International School Singena Agrahara Road, Via Huskur Road, A.P.M.C. Yard, Huskur P.O, Electronic City, Bengaluru - 560 099 Contact Person- Nadiya (9445455522)","location":"Bangalore","experience":"1 - 4 Years"},{"date":"3, 4, 5, 6, 7 - Feb - 2020","skills":"General Administration, Interview Coordination, Vendor Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"360 Degree Cloud Technologies Private Limited, SCO - 11, Second Floor, above Canara Bank, Sector 16, Faridabad, Haryana - 121 002.","phone":"93319710577","profile":"Administration Executive \n360 Degree Cloud Technologies Pvt. Limited","description":"Candidate should be Any Graduate with Prior experience in a similar role preferable but not mandatory. Responsibilities include handling vendor management, taking care of daily utilities, interview coordination etc. (office related work) Walk-in Date/ Time: 3rd February - 7th February , 11 AM onwards Interview Venue: 360 Degree Cloud Technologies Private Limited SCO - 11, Second Floor, above Canara Bank, Sector 16, Faridabad, Haryana - 121 002. Contact Person- Jaya (93319710577)","location":"Faridabad","experience":"1 - 2 Years"},{"date":"18 - Feb - 2020","skills":"Java, Spring boot, Microservices, MySQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Northcorp Software Private Limited, N5 building 3rd floor South Extension Part 1 New Delhi - 110 049","phone":"8447454079","profile":"Java Developers \nNorthcorp Software Private Limited","description":"Candidate should have 2 to 4 years of hands on experience in Java and related technologies Have an in-depth understanding of database technologies SQL database like MySQL Must be proficient in Java, Spring boot, Microservices, Should be able to communicate and work well within team Walk-in Date/ Time: 18th February 2020, 11 AM onwards Interview Venue- Northcorp Software Private Limited N5 building 3rd floor South Extension Part 1 New Delhi - 110 049 Contact Person- Anurag Tripathi Contact No. 8447454079","location":"Delhi","experience":"2 - 4 Years"},{"date":"3, 4, 5, 6, 7 - Feb - 2020","skills":"Object Oriented JavaScript, HTML5, CSS3, Java, Photoshop","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Techbooks International Private Limited, Aptara, A-37, Sector - 60, Noida, Uttar Pradesh - 201 301.","phone":"Not Provided","profile":"Frontend Developer \nTechbooks International Private Limited","description":"Candidate must have experience in developing front-end components using Object Oriented Java Script, HTML5, CSS3, Java, Photoshop. Experience of full software development life cycle, and good understanding of version control systems like Git. Should have experience with an agile development methodology, preferably Scrum Excellent time management, multi-tasking and communication skills. Understanding of various browser engines Walk-in Date/ Time: 3rd - 7th February 2020, 9 AM onwards Interview Venue: Techbooks International Private Limited Aptara, A-37, Sector - 60, Noida, Uttar Pradesh - 201 301. Contact Person- Tanya Awasthi","location":"Noida","experience":"1 - 6 Years"},{"date":"4, 5, 6 - Feb - 2020","skills":"Manual Testing, Website/ Applications Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Adecco India Private Limited, 1007/ 1008, 10th Floor, Windwall Building Sahar Plaza, Andheri- Kurla Road,JB Nagar Andheri (East), Mumbai - 400 059.","phone":"7977596242","profile":"Quality Analyst/ Software Tester \nAdecco India Private Limited","description":"Candidate should be Graduate with 1 year experience in Manual Testing. Experience in Website/ Applications Testing is required. Knowledge about Microsoft Excel & Manage Mailbox. Should have good communication skills in English. Walk-in Date/ Time: 4th - 6th February 2020, 9 AM onwards Interview Venue: Adecco India Private Limited 1007/ 1008, 10th Floor, Windwall Building Sahar Plaza, Andheri- Kurla Road,JB Nagar Andheri (East), Mumbai - 400 059. Contact Person- Zainab Khatoon Phone No. 7977596242","location":"Mumbai","experience":"1 - 3 Years"},{"date":"8 - Feb - 2020","skills":"Java, Fullstack, Web technologies, Bigdata, Cloud Computing, RDBMS and NoSQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Aakash Educational Services Private Limited, 2nd Floor, Tower C, Sewa Tower, Plot # 19, Sector 18, Maruti Udyog Complex, Udyog Vihar-IV, Gurgaon","phone":"7095583999","profile":"Java Fullstack Developer \nMotivity Labs Private Limited","description":"Person must have good experience on Front end web development using Angular/ React or equivalent front end Javascript framework. Back end development experience with Microservices/ SOA architecture and best practices using Java Sprint Boot (Preferred), Docker and/or Kubernetes. Experience creating and/or integrating REST APIs, services, and API authentication schemes (e.g. OAuth) Should have experience with RDBMS and NoSQL technologies Experience creating and implementing clear and concise coding standards and guidelines Experience working effectively with remote teams Experience working with Atlassian JIRA, Confluence and Bitbucket or Git equivalent Familiarity and working practice of Agile Scrum development methodology Experience with unit and integration testing systems Excellent communication skills and the ability to articulate complex technology concepts to non-technologists Roles and Responsibilities : Designs and develops new application components and services (including prototypes and concepts); Executes and delivers on product specifications, platform design, and service integrations; Participates with team members to determine technical requirements and effort/story point estimations; Assists in testing/validation efforts and delivery of quality code; Collaborates with team members on setting/implementing effective coding standards; Walk-in Date/ Time: 8th February 2020, 10 AM onwards Interview Venue: Motivity Labs Private Limited 10th floor, Water Mark Building, Kondapur, Hitech City, Hyderabad - 500 084 Landmark: Opposite building of Tech Mahindra Infocity Gate Contact Person- Satya/ Prashanth (7095583999)","location":"Hyderabad","experience":"3 - 8 Years"},{"date":"4, 5 - Feb - 2020","skills":"Core Java, Springs, Hibernate, Web Services, Multi-threading, and SQL Database","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Estel Technologies Private Limited, #126, Sector 44, Institutional Area Gurgaon, Haryana.","phone":"0124-2578204","profile":"Java Professionals \nEstel Technologies Private Limited","description":"Candidate should have 3 to 7 years of Core JAVA experience in an application development environment. Well versed in core Java, which includes Springs, Hibernate, Web Services and Multi-threading. Must have knowledge of Java related technologies such as J2EE, Spring, JDBC, GWT, Multi-threading. Proficient in: SQL/ Database Concepts/ Linux/ Unix/ Oracle Development, deployment and testing Agile Methodology Walk-in Date: 4th - 5th February 2020 Timing: 11:00 am to 4:00 pm Interview Venue: Estel Technologies Private Limited #126, Sector 44, Institutional Area Gurgaon, Haryana. Contact Person- Nitanjali/ Saif Phone No. 0124-2578204","location":"Gurgaon","experience":"3 - 7 Years"},{"date":"3, 4, 5, 6, 7, 8 - Feb - 2020","skills":"Core Java, J2EE with Servlets, Spring, Hibernate, Struts","qualification":"B.E./B.Tech, MCA/PGDCA","address":"EBIXCASH Private Limited, 7th floor, Building No. H06 A, Hi-tech City, Avance Business Hub, PHOENIX INFOCITY, Hyderabad, Telangana - 500 081.","phone":"Not Provided","profile":"Core Java Developer \nEBIXCASH Private Limited","description":"Person must have strong knowledge in Core Java, J2EE with Servlets, Spring, Hibernate, Struts. Hands on experience in understanding of application architectures and XML. Good understanding of Design and J2EE technologies, ability to solve technical problems independently. Effective client interaction skills, ability to interact with customers independently and resolve issues. Can convert business requirements into a design and technical implementation. Complete ownership of the solution design and development, ability to mentor a team of developers in programming, design and documentation, ability to do estimation for the project. Essential Skills: Persistence and patience to deal with ambiguity with positive attitude Proven ability to perform under pressure with minimal supervision Proactive, disciplined individual who can drive results Good debugging skills and ability to learn new technology quickly Walk-in Date: 3rd to 8th February 2020 Days: Monday to Saturday Time: 10:00 AM to 4:00 PM Interview Venue: EBIXCASH Private Limited 7th floor, Building No. H06 A, Hi-tech City, Avance Business Hub, PHOENIX INFOCITY, Hyderabad, Telangana - 500 081. Contact Person- Sai Sowmya Note: Please carry a copy of your updated CV & Photograph","location":"Hyderabad","experience":"2 - 7 Years"},{"date":"8 - Feb - 2020","skills":"Core Java, J2Ee, Software Engineering, Version Control","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Concerto Software and Systems Pvt. Limited, Building No. 305, 2nd Floor, A- wing, Sector 2, Millennium Business Park, Mahape, Navi Mumbai - 400 710.","phone":"Not Provided","profile":"Java Developer/ Trainee \nConcerto Software Systems (P) Limited","description":"Candidate should have analytical and programming logic skills Must have good communications and interpersonal skills Should have positive & proactive attitude Job Responsibility- Will be involved in Development, Implementation, Support Execution of the tasks related to support and development Must be clear with Basic Technology , concepts & Logic Prefer knowledge of Disaster control, version control Walk-in Date: 8th February 2020 Time: 9 AM to 11 AM. Interview Venue- Concerto Software and Systems Private Limited Building No. 305, 2nd Floor, A- wing, Sector 2, Millennium Business Park, Mahape, Navi Mumbai - 400 710. Contact Person- Pranali Ghanekar Candidate has to sign the service level agreement for specified tenure with the company (Mandatory) Please carry your Pan card or Adhar Card. Note: Candidate appeared within last six months will not be eligible to reappear.","location":"Mumbai","experience":"0 - 1 Years"},{"date":"4, 5, 6, 7 - Feb - 2020","skills":"Java, Hibernate, Core Java, Socket Programming, Spring Boot, Multi-threading","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Straviso India Private Limited, Teerth Technospace, No. B-204 & B 204 A, Second Floor, Benguluru-Pune Highway, Baner, Pune - 411 045.","phone":"7722075652","profile":"JAVA Developer \nStraviso India Private Limited","description":"Candidate should have Bachelors degree in Business, Engineering, Computer Science or other related analytical or technical disciplines, or at least Three (3) years related experience. Overall 5 + years of development experience and a minimum of 3+ years experience as a front-end developer building responsive websites and web applications. Full grasp of HTML, CSS/ CSS3, JavaScript, and AJAX-based JSON/ XML web services. Jenkins build pipeline and dashboard Development in Mongo/ Cassandra/ NOSQL DB (with admin configuration familiarity), Spring Boot Must have an understanding of semantic, responsive, cross-browser markup. Should have experience with front-end web frameworks (Bootstrap, Foundation) Experience with JavaScript application frameworks(Angular JS, jQuery) Walk-in Date/ Time: 4th - 7th February 2020, 10 AM onwards Interview Venue: Straviso India Private Limited Teerth Technospace, No. B-204 & B 204 A, Second Floor, Benguluru-Pune Highway, Baner, Pune - 411 045. Landmark: Behind Mercedes Benz Showroom Contact Person- SUHAS VILASRAO DESHMUKH Front office : 7722075652/ 7875053960 NOTE : Notice period less than 30 days can only apply","location":"Pune","experience":"2 - 7 Years"},{"date":"3, 4 - Feb - 2020","skills":"C/ C++/ OOPS Concepts","qualification":"B.E./B.Tech, MCA/PGDCA","address":"GlobalLogic Technologies Limited, PLOT NO, 590A, ROAD NUMBER 31, ADITYA ENCLAVE, VENKATAGIRI, JUBILEE HILLS, HYDERABAD","phone":"Not Provided","profile":"C++ Developer \nGlobalLogic Technologies Limited","description":"Candidate should have minimum 1 year of experience in C/ C++/ OOPS Concepts. Must have good analytical ability and client handling. Self-starting, with the ability to recognize when assistance is required without waiting for check-in or for the project to fall behind schedule and manage deadlines smartly Job Responsibilities: Gather and Analyze Requirements and document the requirements. Customer interactions to get design requirements and feedback will be required. Preparation of Unit test cases and prepare testing scenarios to assist QA functions Walk-in Date/ Time: 3rd February - 4th February 2020, 10 AM onwards Interview Venue: GlobalLogic Technologies Limited PLOT NO, 590A, ROAD NUMBER 31, ADITYA ENCLAVE, VENKATAGIRI, JUBILEE HILLS, HYDERABAD Contact Person- Vishali Bhardwaj Interested candidates please share your updated resume - Preethi.Lalaji@globallogic.com","location":"Hyderabad","experience":"1 - 3 Years"},{"date":"4, 5, 6, 7 - Feb - 2020","skills":"Java and JEE internals, Relational Databases, SQL and ORM technologies (JPA2, Hibernate)","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Agnity Communications Private Limited, C-42, Sector-58 Noida - 201 303","phone":"9899085367","profile":"Trainee Java Developer \nAgnity Communications Private Limited","description":"We are looking for a Back-End & Front End Trainee-Java Developer with experience in building high-performing, scalable, enterprise-grade applications. You will be part of a talented software team that works on mission-critical applications. Java developer roles and responsibilities include managing Java/ Java EE application development while providing expertise in the full software development lifecycle, from concept and design to testing. Java developer responsibilities include designing, developing and delivering high-volume, low-latency applications for mission-critical systems. Qualification: Bachelors or Master's Degree in Computer Science/ IT Certification Course in Core Java or related field. Experience Required : 0 to 1 Year Job Responsibilities: Contribute in all phases of the development lifecycle Write well designed, testable, efficient code Ensure designs are in compliance with specifications Prepare and produce releases of software components Support continuous improvement by investigating alternatives and technologies and presenting these for architectural review Required Skills: Proven hands-on Software Development experience Proven working experience in Java development Hands on experience in designing and developing applications using Java EE platforms Object oriented analysis and design using common design patterns. Profound insight of Java and JEE internals (Classloading, Memory Management, Transaction management etc) Excellent knowledge of Relational Databases, SQL and ORM technologies (JPA2, Hibernate) Walk-in Date/ Time: 4th February - 7th February , 10 AM onwards Interview Venue: Agnity Communications Private Limited C-42, Sector-58 Noida - 201 303 Landmark: Next to Punjab National Bank and Opposite to Hyundai Showroom Contact Person- Ms. Nivedan Singh (9899085367)","location":"Noida","experience":"0 - 1 Years"},{"date":"3, 4, 5, 6, 7, 8 - Feb - 2020","skills":"Angular 7+, Spring Boot, Spring Framework, JPA Hibernate, Oracle/ SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Thumbay Technologies Private Limited, (T Technology) 4th Floor, Prestige Tower, Beside Ritz Carlton Hotel, Residency Road, Bangalore.","phone":"080-68220152","profile":"Software Programmer (Java) \nThumbay Technologies Private Limited","description":"Primary Skills: Angular 7+ Mandatory Spring Boot Spring Framework JPA Hibernate Database: Oracle SQL Server Other Skills: Microservices REST SOAP OOP Bootstrap/ CSS Primary Responsibility: Analyze, design, coordinate and supervise the development of software systems to form a basis for the solution of information processing problems. Analyze system specifications and translate system requirements to task specifications for software programmers. Ensure analysis of current programs including performance, diagnosis and troubleshooting, in designing solutions to problematic programming. Walk-in Date/ Time: 3rd - 21st February 2020, 10 AM onwards Interview Venue: Thumbay Technologies Private Limited (T Technology) 4th Floor, Prestige Tower, Beside Ritz Carlton Hotel, Residency Road, Bangalore. Contact Person- Nisha Phone No. 080-68220152","location":"Bangalore","experience":"3 - 6 Years"},{"date":"3, 4, 5 - Feb - 2020","skills":"Technical Support, Customer Support, Customer Service, Non Voice Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Knoah Solutions Private Limited, 4th & 5th Floor, Maximus Towers 2A, Raheja Mindspace IT Park, Hitech City, Madhapur, Hyderabad, Telangana - 500 081","phone":"040-44309780","profile":"Technical Support Executive \nKnoah Solutions Private Limited","description":"Candidate should be Any Graduate with 0 to 3 years of experience in Technical Support, Customer Support, Customer Service, Non Voice Process. Should have excellent communication skills Job Responsibility- Provide customer service for electronic products such as Automated Home Appliances & High-definition Consumer goods. Provide technical assistance through web-chat and email-based communication tools. Troubleshooting & resolving customer issues. Providing timely resolution to customer queries and complaints in a professional manner and in accordance to established guidelines. Troubleshooting and resolving customer service issues and schedule field service calls when necessary. Walk-in Date/ Time: 3rd February - 5th February , 11 AM onwards Interview Venue: Knoah Solutions Private Limited 4th & 5th Floor, Maximus Towers 2A, Raheja Mindspace IT Park, Hitech City, Madhapur, Hyderabad, Telangana - 500 081 Contact Person- Brij (040-44309780)","location":"Hyderabad","experience":"0 - 3 Years"},{"date":"5, 6 - Feb - 2020","skills":"Blended Process, Technical Support, Voice Process","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Compucom-CSI Systems India Pvt. Limited, Level 4, Tower VII, Magarpatta City SEZ, Magarpatta City, Hadapsar, Pune - 411028","phone":"020 6724 7888","profile":"Technical Support Engineer \nCompucom-CSI Systems India Pvt. Limited","description":"Candidate should be Any Graduate with 1 to 3 years of experience in Blended Process, Technical Support, Voice Process. Must have excellent communication skills Roles & Responsibilities: Responds to telephone calls, email, chat, Self-Service tickets from users. Assign work orders /incidents to appropriate support teams and follow up until closure. Use the Incident Management System to document and manage problems and work requests and their respective resolutions Perform user account management activities Escalate complex problem to appropriate support specialists Identify, evaluate and prioritize customer problems and complaints Walk-in Date: 5th & 6th February 2020 Timings: 11:00 AM to 4:00 PM Interview Venue: Compucom-CSI Systems India Pvt. Limited Level 4, Tower VII, Magarpatta City SEZ, Magarpatta City, Hadapsar, Pune - 411028 Contact Person: Saurabh Phone: 020 6724 7888","location":"Pune","experience":"1 - 3 Years"},{"date":"3, 4, 5, 6, 7 - Feb - 2020","skills":"Software Testing, Selenium, Automation Testing, Web technologies, Test Cases, Manual Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Techbooks International Private Limited, Aptara, A-37, Sector - 60, Noida - 201 301","phone":"0120-41682424","profile":"Software Testing Engineer \nTechbooks International Private Limited","description":"Candidate should have 2 to 5 years of software testing experience for web based software products. Must have 1+ years of software testing experience in automated testing on Selenium Web Driver. Create test scenarios, test script, and test cases prior to feature delivery in order to support continuous delivery. Work on traceability matrix to trace requirements to estimate test case development and execution effort. Preparation of test coverage, and regression analysis reports to support high quality delivery. Should have good hands on experience in Web services Desired Skills- Strong knowledge of software QA methodologies and processes Excellent communication skills, good sense of teamwork Knowledge of MS Office (Word, Excel, PPT, Visio) Disciplined and self-motivated in delivering high-quality software. Walk-in Date/ Time: 3rd February - 7th February , 10 AM onwards Interview Venue: Techbooks International Private Limited Aptara, A-37, Sector - 60, Noida - 201 301 Contact Person- Aishwarya Phone No. 0120-41682424","location":"Noida","experience":"2 - 5 Years"},{"date":"3, 4, 5, 6, 7 - Feb - 2020","skills":"Manual Testing, Test Case Execution, Reporting and Tracking the bugs in bug Tracking tools","qualification":"B.E./B.Tech, MCA/PGDCA","address":"CashLink Global Systems Private Limited, No. 37, 3rd Floor, Thapar House Montieth Road, Egmore, Chennai - 600 008.","phone":"8939875135","profile":"Software Testing Engineer \nCashLink Global Systems Private Limited","description":"Person should have 1 to 4 years of hands on experience in Manual Testing, Test Case Execution, Reporting and Tracking the bugs in bug Tracking tools. Knowledge/ experience of BFSI Banking, Mobile Testing, Web Based Application, Web Logic Server, SQL, Credit and Debit Card Testing (Payment Domain) are preferred Walk-in Date/ Time: 3rd February - 7th February , 9 AM onwards Interview Venue: CashLink Global Systems Private Limited No. 37, 3rd Floor, Thapar House Montieth Road, Egmore, Chennai - 600 008. Landmark: Opposite to Red Cross Hospital Contact Person- Jafar Hussain A (8939875135)","location":"Chennai","experience":"1 - 4 Years"},{"date":"3, 4 - Feb - 2020","skills":"Regression Testing, Manual Testing, Quality Assurance, Quality Testing, Test Cases","qualification":"B.E./B.Tech, MCA/PGDCA","address":"ValueDrive Technologies Private Limited, 605, Vipul Square, Sushant Lok - I, Block B, Sector 43, Gurugram, Haryana - 122 009.","phone":"Not Provided","profile":"Manual Testing Engineer \nValueDrive Technologies Private Limited","description":"Candidate should be BE/ B.Tech or MCA with 1 to 4 years of experience in Regression Testing, Manual Testing, Quality Assurance, Quality Testing, Test Cases Job Responsibility- Creating detailed, comprehensive and well-structured test plans and test cases. Estimating, prioritising, planning and coordinating quality testing activities. Perform thorough regression testing when bugs are resolved and features are completed. Develop and apply testing processes for new and existing products to meet client needs. Track quality assurance metrics, like defect densities and open defect counts. Meeting the deadlines and that too within time. Walk-in Date/ Time: 3rd February - 4th February , 11 AM onwards Interview Venue: ValueDrive Technologies Private Limited 605, Vipul Square, Sushant Lok - I, Block B, Sector 43, Gurugram, Haryana - 122 009. Contact Person- Karishma Gupta","location":"Gurgaon","experience":"1 - 4 Years"},{"date":"3, 4, 5 - Feb - 2020","skills":"Desktop Support, Server Configuration, Network security, Desktop/ Server troubleshooting","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Hexaware Technologies Limited, Hexaware Bps Building No. 3, Sector 2, MBP, Mahape, Near Ghansoli Station","phone":"9372393691","profile":"Desktop Engineer (IT Support) \nHexaware Technologies Limited","description":"We have openings for Desktop Engineer (IT Support) in Hexaware BPS located in Mahape, Ghansoli Requirements & Criteria: Preferably Graduation in Computer Science or similar experience Should have minimum a year of experience Should have experience in team handling Strong knowledge in troubleshooting Diagnosing and resolving technical issues Should have experience in End User Support Single point of contact for all IT day to day tasks Willing to work extra hours Ensuring security and upgrades are applied to IT Assets and kept up to date Taking ownership of technical issues, and working with our Development group to resolve more Good team Player Interested candidates can walk-in with the updated resume and mention HR Apeksha. Walk-in Date/ Time: 3rd - 5th February 2020, 3 PM onwards Interview Venue: Hexaware Technologies Limited Hexaware Bps Building No. 3, Sector 2, MBP, Mahape, Near Ghansoli Station Contact Person- Apeksha (9372393691)","location":"Mumbai","experience":"2 - 7 Years"},{"date":"3, 4 - Feb - 2020","skills":"Product Support, MySQL/ SQL Support","qualification":"B.E./B.Tech, MCA/PGDCA","address":"HCL Technologies Limited, A-22, Sector 60, Noida (Near Noida Sector 59 Metro Station)","phone":"8586077296","profile":"Product Support Engineer \nHCL Technologies Limited","description":"HCL BSERV is hiring for PLSQL- Engineer Product Support with good technical knowledge and command over spoken English language the client is a prestigious US based Healthcare Equipment manufacturing organization. Candidate should have 1 to 4 years (Minimum 1-year experience in PL SQL development mandatory) Should be comfortable working in 24*7 rotational shifts/ Rotational Week offs Outstanding English Communication is Must. Job Location: Noida Immediate Joiners will be preferred Job Profile: It included providing B2B support on PL SQL to the client and calling as well Candidates who only have experience in MySQL/ SQL should only appear for the interview Candidates should have working knowledge experience in PLSQL language Good communication and interpersonal skills Shift: US shift (Mandatory) Interview Rounds Includes: 1. HR Assessment 2. Versant Test (To check Communication Skills) 3. Operations/ Technical Round (To check PLSQL proficiency) Please write HR Jyoti Gupta on the top of your resume Interview Date: 3rd to 4th February. 2020 Timings 11:00 am 5:00 pm Interview Venue: HCL Technologies Limited, A-22, Sector 60, Noida (Near Noida Sector 59 Metro Station) Contact Person Jyoti Gupta Kindly carry A copy of your updated resume A govt. address/ Id proof","location":"Noida","experience":"1 - 5 Years"},{"date":"5 - Feb - 2020","skills":"Php, MS-SQL/ MySQL, Object Oriented Design, and of MVC frameworks","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Media.net Software Services (India) Pvt. Limited Directiplex, Old Nagardas Road, Mogra Pada, Natwar Nagar, Andheri (East), Mumbai - 400 069.","phone":"Not Provided","profile":"PHP/ Web Developer \nMedia.net Software Services (India) Pvt. Limited","description":"Candidate should have 0 to 2 years of software development experience. A track record of working on scalable interactive web applications, preferably at a major internet property or well known startup. Mastered multiple platforms like SOAP vs REST or Ajax vs Flex or Postgres vs MySQL or Cassandra vs Voldemort - Must have expertise in Laravel and PHP Frame works. Good grasp on programming fundamentals including OOP, Design Patterns, Algorithms, Data Structures, Networking and OS Concepts. Solid experience of Object Oriented Design, and of MVC frameworks Familiarity with relational databases, experience of writing complex queries (we use MS-SQL/ MySQL). Can exhibit a passion and enthusiasm for remarkable technology (Knowledge and contribution to open source projects, Active Blog, etc.) Ability to learn emerging technical standards and apply/ coach development team in proper adoption. Walk-in Date/ Time: 5th February 2020, 10 AM onwards Interview Venue: Media.net Software Services (India) Pvt. Limited Directiplex, Old Nagardas Road, Mogra Pada, Natwar Nagar, Andheri (East), Mumbai, Maharashtra - 400 069.","location":"Mumbai","experience":"0 - 2 Years"},{"date":"2 - Feb - 2020","skills":"Java, Spring Boot, Java/ J2EE Application development","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Cognizant Technology Solutions Limited, Block#1 , Wing B, 8th Floor, Phase # 3, Building #1, Gate # 3, DLF Gachibowli, Hyderabad - 500 032","phone":"Not Provided","profile":"Java/ Spring Boot Developer \nCognizant Technology Solutions India Limited","description":"Here is an excellent career opportunity for Java Professionals to join our center in Hyderabad. Cognizant Technology Solutions India Limited is looking at candidates with the following skill sets: BE/ B. Tech/ B. Sc/ BCA/ MCA/ ME/ M. Tech/ M. Sc (Consistent above 50% must) Hands-on experience Java/ J2EE Application development/ support Projects Should have good technical problem solving skills Work Experience: 4 to 12 Years Exposure to the below skill combination is mandatory to have: Combo 1: Java, Spring Boot Job Responsibility- Estimation, planning and execution with specific focus on requirement analysis and design Delivery of assigned module/ components /phases of a project Knowledge transfer and arriving at SLAs for steady state Responsible for Status reporting Walk-in Date/ Time: 2nd February 2020, 9 AM onwards Interview Venue: Cognizant Technology Solutions Limited, Block#1 , Wing B, 8th Floor, Phase # 3, Building #1, Gate # 3, DLF Gachibowli, Hyderabad - 500 032 Contact Person- Ruchi","location":"Hyderabad","experience":"4 - 9 Years"},{"date":"3, 4, 5, 6, 7 - Jan - 2020","skills":"Software Testing, Test Plan Preparation, Web Application Testing, Quality Assurance","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Purpletalk India Private Limited, Plot No. 11, 12th Floor, Watermark Techno Park, Survey No. 9, Whitefields, Kondapur, Hyderabad, Telangana - 500 084.","phone":"Not Provided","profile":"QA/ Testing Engineer \nPurpletalk India Private Limited","description":"Applicant must have detailed knowledge of Mobile application testing, testing on mobile devices/ emulators, web application testing. Effective communication regarding requirements and reported issues with the clients. Experience in writing test plans/checklist/Test Cases - Preparing test plan documents and QA checklists - Follow up Error Reports and Retest. Minimum of 1-year experience in writing & executing test plans/scripts. Knowledge of Software Quality Assurance Methodology. Ability to communicate to Project Managers and Team Leads, Testing processes and procedures. Ability to communicate with fellow team members. Willingness to learn new techniques and methodology Should be quick in grasping in the requirements. Automation (Selenium) will be an added advantage. Walk-in Date: 3rd - 7th February 2929 Timings - 10:30 AM to 5:00 PM Interview Venue: Purpletalk India Private Limited Plot No. 11, 12th Floor, Watermark Techno Park, Survey No. 9, Whitefields, Kondapur, Hyderabad, Telangana - 500 084. Note: looking for immediate joiners only.","location":"Hyderabad","experience":"1 - 5 Years"},{"date":"3, 4, 5, 6, 7 - Feb - 2020","skills":"Software Testing, Automation & Manual Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Authbridge Research Services Private Limited, Plot No. 123, Second Floor, Udyog Vihar Phase 4, Gurgaon, Haryana - 122 015.","phone":"Not Provided","profile":"Software Testing Engineer \nAuthBridge Research Services Pvt. Limited","description":"Person must have excellent Automation & Manual Tester with core focus on functionality. Knowledge of Rest & Soap web services testing using any tool & its automation, preferably with postman or SOAP UI. Has strong exposure to web based application testing. Must have good hands on with writing web automation tests using Selenium Web driver. Hands on with scripting using any scripting language including javascript or programming language including C, C#, Java etc. Can independently develop different (Functional/ Performance/ Regression) test cases from requirements Has exposure to Defect Management and related tools including JIRA,Mantis. Exposure to variety of open source testing tools including Postman, Jmeter, Burp security testing tool Good Communication Skills,written & speaking Team contribution & grow along with others should be work motto Walk-in Date/ Time: 3rd February - 7th February , 11 AM onwards Interview Venue: Authbridge Research Services Private Limited Plot No. 123, Second Floor, Udyog Vihar Phase 4, Gurgaon, Haryana - 122 015. Contact Person- Anuradha Yadav","location":"Gurgaon","experience":"4 - 5 Years"},{"date":"2 - Feb - 2020","skills":"ASP .NET, C#, SQL, MVC, AJAX, JQuery, HTML/ CSS, Angular, Web API","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Audree Infotech Private Limited, Plot No. 5 & 6, Image Garden Road, Silicon Valley, Opposite to NCL Homes, Madhapur, Hyderabad, Telangana - 500 081.","phone":"9515128773","profile":".Net Trained - Freshers \nHetero Drugs Limited","description":"Educational Qualification: B.Tech/ M.Tech/ MCA/ BSc Year of Pass out : 2018, 2019, 2020 Work Experience: Fresher Key Skills: ASP .NET, C#, SQL, MVC, AJAX, JQuery, HTML/ CSS, Angular, Web API Interested candidates can walk on 2nd February 2020 (Sunday) @ 10 AM to 4 PM. Interview Venue: Audree Infotech Private Limited Plot No. 5 & 6, Image Garden Road, Silicon Valley, Opposite to NCL Homes, Madhapur, Hyderabad, Telangana - 500 081. Please carry an updated Resume along with your Photograph","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"2 - Feb - 2020","skills":"Automation framework, Test Cases, Test Scripts, API Automation","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Coworking - The Kode? 5 6th Floor, The Kode, Baner-Pashan Link Road Baner - Pashan Pune - 411 021.","phone":"8939042333","profile":"Automation Test Engineer \nMaveric Systems Limited","description":"Person must be strong in Automation Framework, Core Java concept & logic. Must have worked in UI (Selenium) and Web Services (API with Rest Assured) & good to have with Appium (Mobile Automation). We prefer some one from the scratch who have developed the project or Enhancement project Job Responsibility- Develop 'Automation Test Scenario & Test Scripts' based on requirement documents/ functional test cases Maintaining of project versions Perform test script execution during regression window Constant follow-up with various stakeholders during execution phases Log software product defects and track it to closure Contribute to accurately estimate work requirements Report status promptly and forthrightly Walk-in Date/ Time: 2nd February 2020, 9 AM onwards Interview Location Coworking - The Kode? 5 6th Floor, The Kode, Baner-Pashan Link Road Baner - Pashan Pune - 411 021. Contact Person: Jeevan Phone: 8939042333","location":"Pune","experience":"2 - 7 Years"},{"date":"0 - 0 - 0","skills":"SQL Support, Data Warehouse, SQL Queries, Stored Procedure, Functions","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Cognizant Technology Solutions India Limited, Building No.12A, 1st floor, Raheja Mind Space, Hitech City, Hyderabad - 500 081.","phone":"Not Provided","profile":"SQL Support Engineer \nCognizant Technology Solutions India Limited","description":"Person must have strong expertise in writing complex SQL Queries, Stored Procedure, Functions Expert understanding of SQL Server 2005, 2008, 2012 and SQL Server administration, troubleshooting. Joins , SQL Server , Data Warehouse , SSIS , T-SQL , Java script , SSAS , MSBI Excellent in Microsoft SQL Database Minimum 15 years of education is mandate with supporting documents. Work Experience: 2 - 4 years Shift : Flexible for Night shifts Notice Period : immediate / 15 days Only Irrelevant profiles will not be taken forward. Candidates should be interested to work on SQL support role Not a developer Candidate should have good understanding of SQL Statements. Has working knowledge on Types of Joins Syntax structure of SQL script Interview Date: 3rd February, 2020 Time: 10 am to 11:30 am Venue Details: Cognizant Technology Solutions India Limited Building No.12A, 1st floor, Raheja Mind Space, Hitech City, Hyderabad - 500 081. Point of Contact : Lavanya","location":"Hyderabad","experience":"2 - 4 Years"},{"date":"3, 4, 5, 6, 7 - Feb - 2020","skills":"Software Testing, Manual Testing, Technical Support","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Suvarna Technosoft Private Limited, 2nd floor, Plot No. 8, Suvarna House, Opp. Chandana Brothers, Durga Nagar, Ameerpet, Hyderabad - 500 016.","phone":"8367788890","profile":"Software Testing/ Support Engineer \nSuvarna Technosoft Private Limited","description":"Qualification: Any Graduate/ BA, B.Com, BSc, BE/ B.Tech/ MCA Work Experience: Fresher's / 0 to 1 year of experience Male Only can apply Good communication and interpersonal skills Languages Known: English Hindi and Telugu Walk-in Date/ Time: 3rd - 7th February 2020, 11 AM onwards Interview Venue: Suvarna Technosoft Private Limited, 2nd floor, Plot No. 8, Suvarna House, Opp. Chandana Brothers, Durga Nagar, Ameerpet, Hyderabad - 500 016. Contact Person- Ms. Laxmi Phone: 8367788890","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"1, 3, 4, 5, 6, 7, 8 - Feb - 2020","skills":"Software Testing, Test Cases, Application Testing, Manual Testing, Automation Tools, Test Plan Preparation, SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Cenveo Publisher Services India Limited, 5th Floor Marwah Centre, Off Saki Vihar Road, Krishnalal Marwah Marg, Andheri (East) Mumbai","phone":"022-409855216","profile":"Software Tester (Fresher) \nCenveo Publisher Services India Limited","description":"Candidate should have 0 to 2 years experience in Application Testing. Must have development and testing experience of .Net applications with Relational Database Technologies (PL SQL, SQL Server). Must have strong analytical and problem solving skills. Excellent verbal and written communication skills Must have experience in writing and analyzing users stories and/use cases/ requirements for validity and feasibility. Capable to execute all levels of testing (Unit, System, Integration, and Regression) by preparing test plans for various testing phases. Must have experience in design and development of manual test cases as well as automation scripts using automation tools. Job Responsibility: Detect and track software defects and inconsistencies and report to development team. Apply quality engineering principals throughout the Agile product lifecycle and must collaboratively work in team with sense of ownership. Provide support and documentation. Walk-in Date/ Time: 31st January - 13th February, 11 AM onwards Interview Venue: Cenveo Publisher Services India Limited, 5th Floor Marwah Centre, Off Saki Vihar Road, Krishnalal Marwah Marg, Andheri (East) Mumbai Contact Person- Priyanshi Singh Phone: 022-409855216","location":"Mumbai","experience":"0 - 2 Years"},{"date":"3, 4, 5, 6, 7 - Feb - 2020","skills":"SQL Development, .Net, PLSQL, Oracle, Content Writing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Infosense Private Limited, A-103, Info Tower-3, Infocity, CH-0, Nr. Indroda Circle, Gandhinagar - 382009","phone":"Not Provided","profile":"IT Software - Freshers/ Interns \nInfosense Private Limited","description":"Infosense Private Limited is hiring Freshers/ Interns (IT Candidates Only) for the below mentioned positions- SQL Developer Trainee .NET Trainee Technical Content writer Oracle Functional Trainee Oracle Technical Trainee Walk-in Monday to Friday between 3:00 pm to 6:00 pm till March 2020. Interview Venue: Infosense Private Limited A-103, Info Tower-3, Infocity, CH-0, Nr. Indroda Circle, Gandhinagar - 382009","location":"Gandhinagar","experience":"0 - 1 Years"},{"date":"1 - Feb - 2020","skills":"Core Java, Spring, JSP, Servlets, Hibernate","qualification":"B.E./B.Tech","address":"FTD India Private Limited, Block D Wing II, 5th Floor, Cyber Gateway Building, Hitech City, Madhapur, Hyderabad - 500 081.","phone":"040-66030303","profile":"Software Engineer (Java) \nFTD India Private Limited","description":"We are seeking passionate software application developers to work with our highly talented team of young dedicated professionals who aim to give our customers a memorable shopping experience. Education: BE/ B.Tech.with 70% throughout academics from premier institutions Work Experience Range: 1 to 3 years Job Location: Hyderabad Functional Group : Technology Knowledge, Skills and Abilities: Expert level Java skills: Can write non trivial distributed applications using Java libraries. Excellent understanding of Generics, concurrency, streams, java collections Strong understanding of Microservices and Cloud Native Application architectures. Excellent in development and deployment of MicroServices by using Spring Boot, Spring Cloud and API gateway (Netflix Zuul). Strong Core Spring and the Spring ecosystem (Spring Boot, Spring Cloud, Spring Data, Spring Security) skills. Experience with Test Driven Development (TDD ) and testing tools such as Junit and Mockito. Strong demonstrated usage of CI/CD pipelines and tools such as Jenkins, Git, SonarCube etc. Strong DB experience in Relational DB's and at least one NOSQL db, like for example MongoDB. Experience with Docker containers on Google Cloud Platform, powered by Kubernetes. Strong understanding of implementing and consuming Restful/HTTP protocols. Experience with Web frameworks like React, Redux and Webpack is a plus. Requires excellent spoken and written English skills. Duties & Responsibilities: Architect, build and deploy cloud platform microservices by using spring boot. Follow Agile Software Development methodology. Adhere to best practices in coding, documentation, test automation, and deployment. Ensure code quality with code design review participation and 100% pass rate on automated regression test suite. Interview Process: Candidates who clear Code Assessment test will be processed for further technical discussions on week days. Date of Drive: February 1, 2020 (Saturday) Time: 9:00 AM to 2:00 PM Interview Venue: FTD India Private Limited Block D Wing II, 5th Floor, Cyber Gateway Building, Hitech City, Madhapur, Hyderabad - 500 081. Note: Candidate who attended our interview process in last 6 months are not eligible for this drive.","location":"Hyderabad","experience":"1 - 3 Years"},{"date":"1 - Feb - 2020","skills":"C# 7.0 and above, MS SQL, JavaScript, HTML5, Angular 2 or above","qualification":"B.E./B.Tech, MCA/PGDCA","address":"G-Cube Webwide Software Pvt. Limited, A-154A, 2nd Floor, Sector-63, Noida","phone":"Not Provided","profile":"Software Developer (.Net) \nG-Cube Webwide Software Pvt. Limited","description":"Required Skills- C# 7.0 and above, MS SQL, JavaScript, HTML5 Angular 2 or above Object Oriented Programming Good Aptitude skills Good communication skills Job Responsibility: C# based API and business logic implementation. Contribution as a developer on different stages of Agile based development process. Development based on technical design (HLD, LLD) & functional design Ability to learn and adapt new technologies Walk-in Date: 1st February 2020 Time- 10.00 AM- 3:00 PM Interview Venue: G-Cube Webwide Software Pvt. Limited A-154A, 2nd Floor, Sector-63, Noida Contact Person- Shruti Kapoor (HR)","location":"Noida","experience":"1 - 5 Years"},{"date":"1 - Feb - 2020","skills":"Core Java (Multi-threading, Collection & Exception), Spring (MVC, IOC, and AOP)","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Capgemini Technology services India Limited, (Pantagonia Building), 155-156, EPIP Zone Whitefield Road Phase 2, Brookefield, Bengaluru, Karnataka - 560 066","phone":"Not Provided","profile":"Java Developers \nCapgemini Technology Services India Limited","description":"Candidate should have a very strong technical background in Core Java (Multi-threading, Collection & Exception), Spring (MVC, IOC, and AOP), and RESTFUL Web Services. Primary Skill: Core Java, Spring & RESTFUL Web services Experience Required: 3 - 9 Years Excellent knowledge of Core Java, and Spring Candidate should have working knowledge on web services Should have worked in distributed agile model and continuous integration Should have knowledge on designing and implementation of REST Web services Strong experience with REST API and web services Should be efficient with Java J2EE and related technologies. Interview Date: 1st February' 2020 (Saturday) Timing: 9 AM to 3.00 PM Interview Location : Capgemini Technology services India Limited (Pantagonia Building), 155-156, EPIP Zone Whitefield Road Phase 2, Brookefield, Bengaluru, Karnataka - 560 066 IGATE Junction Contact Person: - Sudarshini Documents to carry: Hardcopy of the resume Printout of this email Passport size photograph, Photo ID & Company ID card Latest salary slip (preferred) Latest Offer letter or Increment / salary revision letter from current employer Pay slips of last 3 months","location":"Bangalore","experience":"3 - 9 Years"},{"date":"1 - Feb - 2020","skills":"ASP .Net, MVC Core , AZURE ACS, SQL Server, Angular","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Mindteck (India) Limited, 664 23/24, A.M.R TECH PARK, BLOCK-1 3rd FLOOR, HOSUR MAIN ROAD BOMMANAHALLI, BANGALORE - 560 068.","phone":"Not Provided","profile":".Net Developers \nMindteck (India) Limited","description":"Candidate should have good experience in ASP .Net, MVC Core , AZURE ACS, SQL Server, Angular Expertise building solutions in the Microsoft stack, Azure and cloud native application Working knowledge of building Web MVC applications Working knowledge of building .NET Core applications Experience with building Web APIs (REST) Experience using/building applications using an Entity Framework Expertise with relational databases, especially SQL Server Building scripts using Javascript, jQuery Experience building responsive Web UI screens using modern tools like Angular JS/ React JS Working knowledge of asynchronous programming Building unit tests into core code for better CI/ CD, Strong experience addressing application performance issues Understanding of systems architecture and expertise in designing scalable Walk-in Date/ Time: 1st February 2020, 9 AM onwards Interview Venue: Mindteck (India) Limited 664 23/24, A.M.R TECH PARK, BLOCK-1 3rd FLOOR, HOSUR MAIN ROAD BOMMANAHALLI, BANGALORE - 560 068.","location":"Bangalore","experience":"5 - 10 Years"},{"date":"1 - Feb - 2020","skills":".Net Framework, C#/ VB .Net, ASP .Net, SQL Server 2005/ 2008","qualification":"B.E./B.Tech, MCA/PGDCA","address":"GlobalData Research Center Private Limited, 3rd Floor, Jyoti Pinnacle Building, Opp to Prestige IVY League Appt, Kondapur Road, Hyderabad, Telangana - 500 081.","phone":"040-67426702","profile":"Software Engineer (.Net) \nGlobalData Research Center Pvt. Limited","description":"Candidate should have Bachelors Degree in Engineering /Technology or MCA with Minimum 3 years of experience in .Net Framework, C#/ VB .Net, ASP .Net, SQL Server 2005/ 2008. Well-versed with JavaScript, AJAX, Web services, Threading Have strong concepts of OOPS. Database (T-SQL) Programming Knowledge of Endeca ITL, NHibernate Hands on experience in product/ project development using MVC Good communication skills in English, both written and verbal and analytical skills. Walk-in Date: 1st February 2020 Timings : 10:00 am till 2:00 pm Interview Venue: GlobalData Research Center Private Limited 3rd Floor, Jyoti Pinnacle Building, Opp to Prestige IVY League Appt, Kondapur Road, Hyderabad, Telangana - 500 081. Contact Person- Giridhar Phone No. 040-67426702","location":"Hyderabad","experience":"3 - 7 Years"},{"date":"1 - Feb - 2020","skills":".Net, ASP .Net, SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Ventura Securities Limited, 8th Floor, B Wing, I Think Techno Campus, Pokhran Road No. 02,Off Eastern Express Highway, Thane (West), Mumbai - 400 607.","phone":"022-66227246","profile":".Net Developer \nVentura Securities Limited","description":"Person should be BE/ B.Tech or MCA with minimum 1 year of experience is required in dot net development. Should have excellent communication skills Job Location: Thane Walk-in Date/ Time: 31st January - 1st February , 11 AM onwards Interview Venue: Ventura Securities Limited 8th Floor, B Wing, I Think Techno Campus, Pokhran Road No. 02,Off Eastern Express Highway, Thane (West), Mumbai - 400 607. Contact Person- Pooja Patil Phone No: 022-66227246 If you are unable to attend walk in then please get back to us on '02266227246' or on pooja.patil@ventura1.com","location":"Mumbai","experience":"1 - 7 Years"},{"date":"30, 31 - Jan - 2020","skills":"HR/ Recruitment, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Tech Mahindra Business Services Limited, 3 House ,Commerzone Building No. 3, Survey, No. 144, Samrat Ashoka path, Off Airport Road, Yerwada, Pune - 411 006.","phone":"Not Provided","profile":"HR Executive/ Recruiter \nTech Mahindra Business Services Limited","description":"Graduates/ Post Graduates having minimum 6 Months of recruitment experience into a BPO sector. Freshers can also apply. Job Responsibilities: Understanding the client requirements and manage end to end recruitment. Sourcing and calling candidates through Database/ Job portals/ Social media. Explaining the job role and interview processes to the candidates. Following up with the candidates for interview. Coordinating for the various rounds of interviews. Supporting in on boarding formalities. Target Based Job 6 working days in a week. Walk-in Date/ Time: 29 January - 31st January , 12 PM onwards Interview Venue: Tech Mahindra Business Services Limited, 3 House ,Commerzone Building No. 3, Survey, No. 144, Samrat Ashoka path, Off Airport Road, Yerwada, Pune - 411 006. Contact Person- Neha Baswani","location":"Pune","experience":"0 - 3 Years"},{"date":"30, 31 - Jan - 2020","skills":"General Administration, Back Office Operations, Office Coordination","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Tulip Elastics Private Limited, C-15, Hoisery Complex Phase-2, Extension NOIDA - 201 305.","phone":"Not Provided","profile":"Back Office Assistant \nTulip Elastics Private Limited","description":"Candidate should be Any Graduate with 3 to 7 years of experience in General Administration, Back Office Operations, Office Coordination. Must have excellent communication skills Walk-in Date/ Time: 30 January - 5th February , 11 AM onwards Interview Venue: Tulip Elastics Private Limited C-15, Hoisery Complex Phase-2, Extension NOIDA - 201 305. Contact Person- ASHISH MITTAL","location":"Noida","experience":"3 - 7 Years"},{"date":"30, 31 - Jan - 2020","skills":"Back office Operations, Data Entry, Back office processing","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Hinduja Global Solutions Limited, 15, Sri Chamundi Towers, C-2 Building, Hosur Main Road, Garvebhavi Palya, Opp: Sai Baba Temple, Bangalore - 560 068","phone":"Not Provided","profile":"Back Office Executive \nHinduja Global Solutions Limited","description":"Any Graduate-Fresher or Experienced (NO - BE, B.TECH, Post Graduates) Must be willing to work in rotational shifts 2 Way cab facility provided 5 Days working, 2 Days Off Desired Skills/ Abilities: Good communication skills Good Analytical Skills Basic computer knowledge Walk-in Date/ Time: 30th January - 7th February , 11 AM onwards Interview Venue: Hinduja Global Solutions Limited 15, Sri Chamundi Towers, C-2 Building, Hosur Main Road, Garvebhavi Palya, Opp: Sai Baba Temple, Bangalore - 560 068 Contact Person- Athar","location":"Bangalore","experience":"0 - 1 Years"},{"date":"30, 31 - Jan - 2020","skills":"Screening, HR Assistance, Joining Formalities, Interview Scheduling, Sourcing","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Columbia Asia Hospitals Private Limited, Sarjapur Road, Ward No - 150, Ambalipura, Sarjapura Main Road (Opposite Iblur), Bangalore - 560 102.","phone":"080-39656674","profile":"HR Assistant \nColumbia Asia Hospitals Private Limited","description":"Candidate should have 0 to 1 year experience in Screening, HR Assistance, Joining Formalities, Interview Scheduling, Sourcing and Recruitment. Key areas of responsibility: Ensure established workforce practices are followed thoroughly. Recruitment (Sourcing of profiles, screening, scheduling interviews) Pre-employment formalities/ joining Formalities Update & file all HR related documentation and letters, files Willing to perform any other duties that may be assigned from time to time Walk-in Date: 30 January - 21st February 2020 Candidates can walk in from 9 am to 4 pm No interviews on Sunday Interview Venue: Columbia Asia Hospitals Private Limited Sarjapur Road, Ward No - 150, Ambalipura, Sarjapura Main Road (Opposite Iblur), Bangalore - 560 102. Contact Person- Jissa Jacob Tel Phone: 080-39656674","location":"Bangalore","experience":"0 - 1 Years"},{"date":"30, 31 - Jan - 2020","skills":"Backend Support/ Non - Voice Process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"RMG Area A-6, Tech Mahindra Office, Sector 64, Noida","phone":"9871069624","profile":"Backend Process Executive \nTech Mahindra Limited","description":"Tech Mahindra is hiring freshers and experienced candidates for International Backend Process. Only Graduates, B.Tech/ BE are eligible. Undergraduates are not eligible. Experience Range: Freshers/ Any Experience Role: Customer Support Associate Job Type: Permanent Skills Required:- Average communication skills. Average logical reasoning Candidate should be able to queries Should be flexible to work in 24*7 environments, comfortable to work in night shifts. Basic understanding of Excel and Technical terms. Both side Transport facility available (Pick & Drop). 5 Days Working. Walk-in Details: 30th January 2020 Timing: 10.30 AM- 3 PM Venue: RMG Area A-6, Tech Mahindra Office, Sector 64, Noida 1. Hard copy of Resume 2. Aadhar Card (Mandatory)","location":"Noida","experience":"0 - 3 Years"},{"date":"1 - Feb - 2020","skills":".Net Framework, C#/ VB .Net, ASP .Net, SQL Server 2005/ 2008","qualification":"B.E./B.Tech, MCA/PGDCA","address":"GlobalData Research Center Private Limited, 3rd Floor, Jyoti Pinnacle Building, Opp to Prestige IVY League Appt, Kondapur Road, Hyderabad, Telangana - 500 081.","phone":"040-67426702","profile":"Software Engineer (.Net) \nGlobalData Research Center Pvt. Limited","description":"Candidate should have Bachelors Degree in Engineering /Technology or MCA with Minimum 3 years of experience in .Net Framework, C#/ VB .Net, ASP .Net, SQL Server 2005/ 2008. Well-versed with JavaScript, AJAX, Web services, Threading Have strong concepts of OOPS. Database (T-SQL) Programming Knowledge of Endeca ITL, NHibernate Hands on experience in product/ project development using MVC Good communication skills in English, both written and verbal and analytical skills. Walk-in Date: 1st February 2020 Timings : 10:00 am till 2:00 pm Interview Venue: GlobalData Research Center Private Limited 3rd Floor, Jyoti Pinnacle Building, Opp to Prestige IVY League Appt, Kondapur Road, Hyderabad, Telangana - 500 081. Contact Person- Giridhar Phone No. 040-67426702","location":"Hyderabad","experience":"3 - 7 Years"},{"date":"1 - Feb - 2020","skills":".Net, ASP .Net, SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Ventura Securities Limited, 8th Floor, B Wing, I Think Techno Campus, Pokhran Road No. 02,Off Eastern Express Highway, Thane (West), Mumbai - 400 607.","phone":"022-66227246","profile":".Net Developer \nVentura Securities Limited","description":"Person should be BE/ B.Tech or MCA with minimum 1 year of experience is required in dot net development. Should have excellent communication skills Job Location: Thane Walk-in Date/ Time: 31st January - 1st February , 11 AM onwards Interview Venue: Ventura Securities Limited 8th Floor, B Wing, I Think Techno Campus, Pokhran Road No. 02,Off Eastern Express Highway, Thane (West), Mumbai - 400 607. Contact Person- Pooja Patil Phone No: 022-66227246 If you are unable to attend walk in then please get back to us on '02266227246' or on pooja.patil@ventura1.com","location":"Mumbai","experience":"1 - 7 Years"},{"date":"30, 31 - Jan - 2020","skills":"HR/ Recruitment, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Tech Mahindra Business Services Limited, 3 House ,Commerzone Building No. 3, Survey, No. 144, Samrat Ashoka path, Off Airport Road, Yerwada, Pune - 411 006.","phone":"Not Provided","profile":"HR Executive/ Recruiter \nTech Mahindra Business Services Limited","description":"Graduates/ Post Graduates having minimum 6 Months of recruitment experience into a BPO sector. Freshers can also apply. Job Responsibilities: Understanding the client requirements and manage end to end recruitment. Sourcing and calling candidates through Database/ Job portals/ Social media. Explaining the job role and interview processes to the candidates. Following up with the candidates for interview. Coordinating for the various rounds of interviews. Supporting in on boarding formalities. Target Based Job 6 working days in a week. Walk-in Date/ Time: 29 January - 31st January , 12 PM onwards Interview Venue: Tech Mahindra Business Services Limited, 3 House ,Commerzone Building No. 3, Survey, No. 144, Samrat Ashoka path, Off Airport Road, Yerwada, Pune - 411 006. Contact Person- Neha Baswani","location":"Pune","experience":"0 - 3 Years"},{"date":"30, 31 - Jan - 2020","skills":"General Administration, Back Office Operations, Office Coordination","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Tulip Elastics Private Limited, C-15, Hoisery Complex Phase-2, Extension NOIDA - 201 305.","phone":"Not Provided","profile":"Back Office Assistant \nTulip Elastics Private Limited","description":"Candidate should be Any Graduate with 3 to 7 years of experience in General Administration, Back Office Operations, Office Coordination. Must have excellent communication skills Walk-in Date/ Time: 30 January - 5th February , 11 AM onwards Interview Venue: Tulip Elastics Private Limited C-15, Hoisery Complex Phase-2, Extension NOIDA - 201 305. Contact Person- ASHISH MITTAL","location":"Noida","experience":"3 - 7 Years"},{"date":"30, 31 - Jan - 2020","skills":"Back office Operations, Data Entry, Back office processing","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Hinduja Global Solutions Limited, 15, Sri Chamundi Towers, C-2 Building, Hosur Main Road, Garvebhavi Palya, Opp: Sai Baba Temple, Bangalore - 560 068","phone":"Not Provided","profile":"Back Office Executive \nHinduja Global Solutions Limited","description":"Any Graduate-Fresher or Experienced (NO - BE, B.TECH, Post Graduates) Must be willing to work in rotational shifts 2 Way cab facility provided 5 Days working, 2 Days Off Desired Skills/ Abilities: Good communication skills Good Analytical Skills Basic computer knowledge Walk-in Date/ Time: 30th January - 7th February , 11 AM onwards Interview Venue: Hinduja Global Solutions Limited 15, Sri Chamundi Towers, C-2 Building, Hosur Main Road, Garvebhavi Palya, Opp: Sai Baba Temple, Bangalore - 560 068 Contact Person- Athar","location":"Bangalore","experience":"0 - 1 Years"},{"date":"30, 31 - Jan - 2020","skills":"Screening, HR Assistance, Joining Formalities, Interview Scheduling, Sourcing","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Columbia Asia Hospitals Private Limited, Sarjapur Road, Ward No - 150, Ambalipura, Sarjapura Main Road (Opposite Iblur), Bangalore - 560 102.","phone":"080-39656674","profile":"HR Assistant \nColumbia Asia Hospitals Private Limited","description":"Candidate should have 0 to 1 year experience in Screening, HR Assistance, Joining Formalities, Interview Scheduling, Sourcing and Recruitment. Key areas of responsibility: Ensure established workforce practices are followed thoroughly. Recruitment (Sourcing of profiles, screening, scheduling interviews) Pre-employment formalities/ joining Formalities Update & file all HR related documentation and letters, files Willing to perform any other duties that may be assigned from time to time Walk-in Date: 30 January - 21st February 2020 Candidates can walk in from 9 am to 4 pm No interviews on Sunday Interview Venue: Columbia Asia Hospitals Private Limited Sarjapur Road, Ward No - 150, Ambalipura, Sarjapura Main Road (Opposite Iblur), Bangalore - 560 102. Contact Person- Jissa Jacob Tel Phone: 080-39656674","location":"Bangalore","experience":"0 - 1 Years"},{"date":"30, 31 - Jan - 2020","skills":"Backend Support/ Non - Voice Process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"RMG Area A-6, Tech Mahindra Office, Sector 64, Noida","phone":"9871069624","profile":"Backend Process Executive \nTech Mahindra Limited","description":"Tech Mahindra is hiring freshers and experienced candidates for International Backend Process. Only Graduates, B.Tech/ BE are eligible. Undergraduates are not eligible. Experience Range: Freshers/ Any Experience Role: Customer Support Associate Job Type: Permanent Skills Required:- Average communication skills. Average logical reasoning Candidate should be able to queries Should be flexible to work in 24*7 environments, comfortable to work in night shifts. Basic understanding of Excel and Technical terms. Both side Transport facility available (Pick & Drop). 5 Days Working. Walk-in Details: 30th January 2020 Timing: 10.30 AM- 3 PM Venue: RMG Area A-6, Tech Mahindra Office, Sector 64, Noida 1. Hard copy of Resume 2. Aadhar Card (Mandatory)","location":"Noida","experience":"0 - 3 Years"}]}