{"Walkins":[{"date":"3 - Aug - 2019","skills":"Test Case Preparation Integration Test Plan Preparation Mobile Testing System Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Matrimony .Com Limited, Arihant ePark, Lattice Bridge Road, 2nd Floor, Baktavatsalm Nagar, Adyar, Chennai, Tamil Nadu - 600 020.","phone":"Not Provided","profile":"Manual Testing Engineer \nMatrimony .Com Limited","description":"Candidate should have 2 to 3 years of experience in Manual Testing Experience in Mobile testing is mandatory To be part of requirement analysis Participating in preparing Test Plans Preparing Test Scenarios Preparing Test Cases for module, integration and system testing Preparing Test Data for the test cases Preparing Test Environment to execute the test cases Analysing the Test Cases prepared by other team members Executing the Test Cases Defect Tracking Knowledge in Database querying Walk In Drive on 3rd August 2019 Timings: 11:00 AM till 4:00 PM Interview Venue: Matrimony .Com Limited Arihant ePark, Lattice Bridge Road, 2nd Floor, Baktavatsalm Nagar, Adyar, Chennai, Tamil Nadu - 600 020. (Opposite to Adyar Anantha Bhavan)","location":"Chennai","experience":"2 - 3 Years"},{"date":"3 - Aug - 2019","skills":"Manual Testing, Test Engineering, Bug Tracking, Quality Assurance tools","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Benchmark IT Solutions (I) Private Limited, 2nd Floor, Shinde Complex, NDA Pashan Road, Bavdhan Khurd, Pune - 411 021.","phone":"020-22951951","profile":"Software Test Engineer \nBenchmark IT Solutions (I) Private Limited","description":"Experience developing and executing manual test suites / cases. Experience testing web-based/Mobile based enterprise application. Familiarity with QA tools and techniques, bug tracking systems, test design and execution. Good command over written and verbal English communication. (If) Work experience on any finance or any insurance projects will be preferred Candidate must be good in mathematics and financial calculation. Walk-in Date/ Time: 3rd August , 10 AM onwards Interview Venue: Benchmark IT Solutions (I) Private Limited 2nd Floor, Shinde Complex, NDA Pashan Road, Bavdhan Khurd, Pune - 411 021. Phone No: 020-22951951/ 2","location":"Pune","experience":"1 - 3 Years"},{"date":"3 - Aug - 2019","skills":"Software Testing, Regression Testing, Database Testing, System Testing, UAT, Manual Testing","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Girikon Solutions Private Limited, B-24, Sector 65, Noida - 201301","phone":"Not Provided","profile":"Manual Tester/ QA Engineer \nGirikon Solutions Private Limited","description":"Candidate must be having 3 years of experience in Manual Testing. Participating in all testing cycles, including Functional, Regression, Integration, UAT Support and basic database testing. Documentation & Execution of test cycles and test cases. Document test findings and defect discovered during the test cycle in the standard ticketing system. Candidate should be able to work as Individual Contributor & in Team as well. Should have sound knowledge of SDLC (software development methodology) Should have sound knowledge of Software Testing methodology Must have basic database skills. Should have knowledge of Agile and Scrum. Execution, reporting, defect resolution, retesting, risk/issue management. Experience in JIRA would be an added advantage. Manual integration and system test. Walk-in Date: 3rd Aug 2019 (Saturday) Time: 11 AM to 4 PM Interview Venue- Girikon Solutions Private Limited, B-24, Sector 65, Noida - 201301","location":"Noida","experience":"3 - 7 Years"},{"date":"10 - Aug - 2019","skills":"Software Testing, Test Engineering, Test Scenarios, Regression Testing, Automation Testing","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Hays Business Solutions Pvt. Limited, Candor Tech Space, IT/ITES Park, Unitech Infospace Building, 3rd Floor, Plot 2, Block B, Sector - 62, Noida","phone":"9871712629","profile":"Software Testing Engineer \nHays Business Solutions Pvt. Limited","description":"Person must have Bachelor Degree/ MCA with 1+ to 3.5 years of experience in necessarily in product testing. Excellent exposure of Testing in Support and Maintenance Environment and worked in Agile methodology. Proficiency in XML and experience in testing .Net/ Opensource tech. based application Testing of Complex products with integration exposure Proficient in planning, executing risk based testing solutions. Strong quality & risk quantification & management skills Exposure to Automation functional Testing tool would be plus especially Selenium and Jmeter. Key Activities/ Decision Areas: Creation & maintenance of test cases/test scenarios Execution of test cases on several platform and browser combinations Clearly & concisely report bugs/defects as they are discovered Provide daily status on overall test execution progress Monitor and escalate test and launch blocking issues Maintain daily record of test execution results Walk-in Date/ Time: 10th August 2019, 9 AM onwards Interview Venue: Hays Business Solutions Pvt. Limited Candor Tech Space, IT/ITES Park, Unitech Infospace Building, 3rd Floor, Plot 2, Block B, Sector - 62, Noida Land Mark: Opposite Father Agnel School HR Contact# 9871712629","location":"Noida","experience":"1 - 4 Years"},{"date":"7, 8 - Aug - 2019","skills":"Software Testing, Manual & Automation Testing","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Nucleus Software Exports Limited, A- 39, Sector - 62 Noida Nearest Metro Station: Noida Electronic City (500 Mtr)","phone":"Not Provided","profile":"Senior Testing Engineer \nNucleus Software Exports Limited","description":"Strong experience in Software Testing (Manual & Automation) Experience with building test plans and criteria for quality assurance Experience with DevOps environments. Familiar with automation test methodologies and popular automation tools (i.e. Selenium, Jmeter) Experience working with integration testing tools like Junit, etc Experience working with version control tools like SVN, JIRA Experience working on SQL Programming experience in Java, PHP, and JavaScript Strong communication and collaboration skills Overseeing, defining, and building the test processes end-to-end for our products Nice to have Skills Worked in an Agile environment Walk-in Date/ Time: 7th & 8th August, 9 AM onwards Interview Venue: Nucleus Software Exports Limited A- 39, Sector - 62 Noida Nearest Metro Station: Noida Electronic City (500 Mtr) Please carry 2 hard copies of your resumes. Please do hare your resume at prapti.madhur@nucleussoftware.com before attending the interview.","location":"Noida","experience":"4 - 5 Years"},{"date":"3 - Aug - 2019","skills":"Regression Testing, Quality Engineering, Integration Testing, Test Cases, Manual Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Smt. Indira Gandhi College of Engineering (SIGCE), Sector-8, Plot No.1, Opposite to D- Mart, Ghansoli, Navi Mumbai - 400 701","phone":"022-61304200","profile":"QA/ Testing Engineer \nSeclore Technology Private Limited","description":"Be hands-on in generating precise and concise test plan/scenarios and test cases Have experience in transforming business requirements to create test plans/cases Have participated in full life-cycle of a development project interacting with teams of developers and testers Have involved in preparing the test plans for a release Be familiar with testing of either of system software or web based products or both. Have executed test cases (both regression and new functionality) within timescales against plan Be familiar with defect tracking tools Be familiar with the documentation of testing related artifacts Walk-in Date: 3rd August 2019 Time: 10am - 4pm Interview Venue- Smt. Indira Gandhi College of Engineering (SIGCE) Sector-8, Plot No.1, Opposite to D- Mart, Ghansoli, Navi Mumbai - 400 701","location":"Mumbai","experience":"2 - 4 Years"},{"date":"3 - Aug - 2019","skills":"Software Testing, Quality Assurance, Test Engineering, Quality Control","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"eClinicalWorks India Private Limited, 409-414,4th Floor, Venus Atlantis, Fourth Floor, 100 ft Road, Prahladnagar, Ahmedabad - 380 015","phone":"Not Provided","profile":"QA Manual Tester \neClinicalWorks India Private Limited","description":"Skills Required: Bachelors or Masters Degree in Computer Science or Information Technology or a related field (such as BE, B-Tech, M-Tech, BCA, MCA, BSc IT, MSc IT) Proficient with relational databases (SQL Queries) Excellent knowledge on Manual Testing Fluency in English Communication Street smart approach Strong analytical, Logical and problem solving skills Benefits: Best Professional Experience Opportunity for Career & Professional Growth Healthy Work Environment Pick & Drop facility for all employees based in Ahmedabad & Gandhinagar Meals at subsidized rate Medical insurance for self and for family members upon successful completion of 6 months Walk-in Date/ Time: 3rd August 2019, 10 AM onwards Interview Venue: eClinicalWorks India Private Limited, 409-414,4th Floor, Venus Atlantis, Fourth Floor, 100 ft Road, Prahladnagar, Ahmedabad - 380 015","location":"Ahmedabad","experience":"0 - 5 Years"},{"date":"3 - Aug - 2019","skills":"Test Engineering, Android/ API Testing, Mobile Testing, Automation Testing","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"OnDot Systems India Office, Smartworks Global Technology Park, Block C, 1ST Floor, Outer Ring Road, Adarsh Palm Retreat, Bellandur, Bengaluru, Karnataka - 560 103","phone":"Not Provided","profile":"Automation Test Engineer \nOndot Systems India Private Limited","description":"Candidate should have overall 4 to 6 years of solid QA experience in Automation testing. Must have good hands on experience in mobile application testing on Android/ iOS platform. (Application end to end, functional, & UI). Experience in mobile automation using tools like APPIUM, SELENIUM, TESTNG, MAVEN, and JENKINS. Design, write and execute detailed Test Cases across Android & IOS application development. Good debugging, logging and troubleshooting skills. Walk-in Date/ Time: 3rd August 2019, 9 AM onwards Interview Venue: OnDot Systems India Office Smartworks Global Technology Park, Block C, 1ST Floor, Outer Ring Road, Adarsh Palm Retreat, Bellandur, Bengaluru, Karnataka - 560 103","location":"Bangalore","experience":"4 - 6 Years"},{"date":"3 - Aug - 2019","skills":"Manual Testing Database Testing (SQL), Automation (Selenium framework)","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"iBoss Tech Solutions Private Limited, D-37, Sector- 63, Noida (Landmark- Nissan Showroom)","phone":"Not Provided","profile":"Software Tester/ QA Engineer \niBoss Tech Solutions Private Limited","description":"Candidate should have 1 to 3 years experience in software quality assurance and testing of mobile and web cloud-based systems. Must have working experience of 1 to 2 years as Manual Tester. Should have good exposure in Database Testing and API Testing Able to produce reports on QA tools as well as working knowledge of MS Word, Power point and Excel. Able to mature team on QA best practices Must Have Skills : Manual Testing Database Testing (SQL) Good verbal and written communication Good to Have Skills : Automation (Selenium framework) Performance/ Load Testing (JMeter) Notice Period- Immediate/ 15 Days/ Serving Notice Working Shift : UK Shift (11 AM to 8 PM) Working Days: 5 Walk-in Date/ Time: 3rd August 2019, 10 AM onwards Interview Venue- iBoss Tech Solutions Private Limited D-37, Sector- 63, Noida (Landmark- Nissan Showroom)","location":"Noida","experience":"1 - 3 Years"},{"date":"2, 3 - Aug - 2019","skills":"Technical Support, Customer Service, Voice Process","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Tech Mahindra Limited, Software Development Block -4 Ground Floor, ODC-1 602/3, Elcot SEZ, Sholinganallur Village Chennai - 600 119","phone":"Not Provided","profile":"Technical Support Associate \nTech Mahindra Limited","description":"Tech Mahindra Limited is hiring for Technical Support Associate for an International Voice Process - Handling customers over calls - Troubleshooting / Tech Support / Customer Queries - Rotational Shift - Very good communication - Experience in any voice calling profile - Experience in International BPO will be an added advantage. - Fresher are also eligible (2018 / 2019). Candidates with backlogs can also apply. Walk-in Date: 2nd - 3rd August 2019 Timings : 10 Am to 4 Pm Interview Venue: Tech Mahindra Limited, Software Development Block -4 Ground Floor, ODC-1 602/3, Elcot SEZ, Sholinganallur Village Chennai - 600 119 - Kindly bring a copy of your updated CV. - Aadhar card","location":"Chennai","experience":"0 - 5 Years"},{"date":"5 - Aug - 2019","skills":"Technical Support, Hardware/ Networking Application Support, Network Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Athenahealth Technology, 13th Floor, Block C - Core 1, West Wing, SP Infocity, #40, MGR Road, Perungudi, Chennai - 600 096","phone":"044-40613331","profile":"Product Support Analyst \nAthenaHealth Technology Private Limited","description":"Candidate should be a Graduate in Engineering, Science, or Commerce stream with Fluency in both spoken and written English. Willingness and ability to work flexible hours to ensure substantial overlap with US-based teams (Morning/ Afternoon/ Evening) shift timings. Good communication skills and an ability to effectively engage with members of geographically disparate teams in India and other geographies across athena. Excellent customer service skills and professionalism to effectively manage communication with external parties including US lab and imaging vendors. Excellent analytical and problem-solving skills Preferred Skills: > Networking/ Technical Support/ Application Support/ Enterprise Support, experienced 2-5 years > Should have good communication skills (written/ verbal) > Willing to work in night shifts Shift Timings: Night Shifts 5 Days Working (Friday/ Saturday Or Sunday, Monday Off) Notice Period: Immediate: 30 Days Degree Mandatory Documents Mandatory Excellent Communication skills Willing to work in Night shifts (Cabs Provided) Technical Support/ Customer Support experience Walk-in Date: 5th August 2019 Timing: 10 AM - 1 PM Interview Venue: Athenahealth Technology, 13th Floor, Block C - Core 1, West Wing, SP Infocity, #40, MGR Road, Perungudi, Chennai - 600 096 Contact Person : Beula HR Interested candidates can send resumes to ibeula@athenahealth.com","location":"Chennai","experience":"2 - 6 Years"},{"date":"1, 2, 5, 6, 7, 8, 9 - Aug - 2019","skills":"Back Office Operations, Inbound/ Chat Process, Customer Service","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Nerdy Turtlez (Brand of Absas Solutions Pvt. Limited), B-30, Sector -5 Noida - 201 301","phone":"7290067299","profile":"Operations Chat/ Back Office Executive \nNerdy Turtlez (Brand of Absas Solutions Pvt. Limited)","description":"Candidate should be Any Graduate with 0 to 5 years of experience in Back Office Operations, Inbound/ Chat Process, Customer Service. Must have good communication skills Escalation Team Understanding academic projects/ assignments/ tasks requirements and ensuring if the solution is as per requirements Pricing/ Allocation Understanding academic projects/ assignments/ tasks requirements and ascertaining appropriate price of each projects/ assignments/ tasks. Identifying suitable experts for each projects, negotiating the pay with freelancers and facilitating allocation process. Chat Support Solving Customer queries through Chat / Emails Walk-in Date/ Time: 31st July - 12th August , 10 AM onwards Interview Venue: Nerdy Turtlez (Brand of Absas Solutions Pvt. Limited) B-30, Sector -5 Noida","location":"Noida","experience":"0 - 5 Years"},{"date":"2 - Aug - 2019","skills":"Desktop Support, System Support, Technical Support, Troubleshooting skills","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Dell International Services India Pvt. Limited, Vipul Tech Square, Opposite Central Park, Sector Road, Sector - 43, Gurgaon - 122 002","phone":"Not Provided","profile":"Technical Support Associate \nDell International Services India Pvt. Limited","description":"Any Graduate 0 to 1 year of relevant work experience required Should be willing to work in shifts in a 24 x7 work environment Should be residing within Transport Boundaries Excellent telephone soft skills, thorough telephone functional skills & email etiquettes Excellent spoken and written English Ability to handle stressful situations. Goal/ Career oriented and self-motivated Essential Requirements : Knowledge of job associated database, software and documentation Strong technical aptitude and troubleshooting skills Fluent communication & Time management skills Results driven with Problem-solving skills Walk-in Date: 2nd August 2019 Timings : 12:00 pm to 3:00 pm Interview Venue: Dell International Services India Pvt. Limited Vipul Tech Square, Opposite Central Park, Sector Road, Sector - 43, Gurgaon - 122002 **Note - Please carry a resume & valid Govt. ID proof","location":"Gurgaon","experience":"0 - 1 Years"},{"date":"1, 2, 5, 6, 7, 8, 9 - Aug - 2019","skills":"HR/ Coordination, MIS Reporting, Back Office Documentation","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Verifacts Services Private Limited, Plot No. 10, GR Nilayam, Lal Bahudur Colony, Trimulgherry, Secunderabad - 500 015","phone":"040 66509265","profile":"Administration Executive \nVerifacts Services Private Limited","description":"Candidate should be Any Graduate with 0 to 5 years of experience in HR/ Coordination, MIS Reporting, Back Office Documentation. Maintaining the office boys and Housekeeping. Check and maintain all the fire equipments. Must have good interpersonal skills. Prefer Male candidates only He will also be responsible for - HR related activities - Coordinating for interview, On boarding and induction process Finance related activities - Visiting bank when ever necessary and help in maintaining the vouchers/ bills. Interested candidates walk in on the below mentioned address- Date: 1st - 9th August , 10 AM onwards Verifacts Services Private Limited Plot No. 10, GR Nilayam, Lal Bahudur Colony, Trimulgherry, Secunderabad - 500 015 Contact No: 9167775350/ 040 66509265 (Kindly call between 10:00 AM to 6:00 PM)","location":"Hyderabad, Secunderabad","experience":"0 - 5 Years"},{"date":"1, 2, 5, 6, 7, 8, 9 - Aug - 2019","skills":"Office Administration, General Admin Activities and Front Office Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Grovalue Insurance Broker Private Limited, 03, Enterprise Center, Off Nehru Road, Near Domestic Airport, Vileparle (East) Mumbai - 400 099","phone":"022-62166623","profile":"Admin Executive Cum Receptionist \nGrovalue Insurance Broker Private Limited","description":"Person should be Any Graduate with 0 to 5 years of experience in Office Administration, General Admin Activities and Front Office Management. Must have excellent communication skills. Fluent with English and Hindi Knowledge of travel booking Computer skills Job Responsibilities: 1. Stationary and Pantry materials management 2. Handling Incoming and outgoing call 3. Vendor management, vendor Negotiation 4. Printing/ Issuing company Id cards, visiting cards and SIM cards 5. Coordination with Branches Walk-in Date/ Time: 1st - 9th August 2019, 10 AM onwards Interview Venue: Grovalue Insurance Broker Private Limited 03, Enterprise Center, Off Nehru Road, Near Domestic Airport, Vileparle (East) Mumbai - 400 099 Contact No: 022-62166623/ 9699555955","location":"Mumbai","experience":"0 - 5 Years"},{"date":"1, 2 - Aug - 2019","skills":"Technical Support, IT Helpdesk, Service Desk, Customer Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Dimension Data (Global NTT Limited), Manyata Embassy Business Park Silver Oak, E2 Block, 3rd floor. Outer Ring Road, Nagavara Bangalore - 560 045","phone":"Not Provided","profile":"Technical Support Analyst \nDimension Data (Global NTT Limited)","description":"Candidate should be Any Technical Graduate with 1 to 4.5 years of hands on experience in Service Desk Analyst / Technical Support Role. Should be good at monitoring the mail boxes, processing emails and taking telephone calls, ensuring all incoming queries are dealt with within the relevant SLAs. Proactively managing ticket progress for all ticket types and maintaining close liaison with Security Analysts to ensure that customers are helped as effectively as possible Working on user management tickets and tasks Maintaining accurate and sufficiently detailed documentation of work performed Good verbal and written communication skills combined with a professional telephone manner Excellent keyboard skills and good knowledge of Microsoft Excel, Word and Outlook Experience in Remedy, Service Now and/or MS CRM is highly regarded Walk-in Date/ Time: 1st August - 2nd August , 10 AM onwards Venue Details: Dimension Data (Global NTT Limited) Manyata Embassy Business Park Silver Oak, E2 Block, 3rd floor. Outer Ring Road, Nagavara Bangalore - 560 045 Landmark: On entering the TecNeelam Chaudharyh Park, be on the straight lain once you reach towards the end of the road take a U turn to ask for Silver Oak (or Alcatel Building / Next to Food Court)","location":"Bangalore","experience":"1 - 5 Years"},{"date":"2, 3, 5, 6, 7 - Aug - 2019","skills":"Application Support, Technical Support, SQL Server","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Datazoic Machines Private Limited, 141, TVH Agnitio Park, 2nd Floor, OMR, Kandanchavadi, Chennai - 96","phone":"Not Provided","profile":"Technical Support Engineer \nDatazoic Machines Private Limited","description":"Role: Tech Support Engineer (International Semi Voice Process) Shift: 4.00 pm - 1.00 am Candidate must have excellent verbal & written communication skills, analytical & troubleshooting skills. Responsible to drive all technical and functional issues towards closure L1/L2 support - diagnosis, investigation, resolution, coordination with business, application owners, infrastructure support Creation of ticket and tracking through lifecycle Basic understanding of SQL. Some knowledge on scripting language (very basic Java script or windows shell or vbscript). Incident ticket handling and service request queue management (preferable JIRA). Academic and conceptual knowledge of any programming language (Java) would be plus. Fair analytical skills. Good in excel and preparing reports for management. Walk-in Date/ Time: 2nd - 7th August , 11 AM onwards Interview Venue: Datazoic Machines Private Limited 141, TVH Agnitio Park, 2nd Floor, OMR, Kandanchavadi, Chennai - 96","location":"Chennai","experience":"0 - 1 Years"},{"date":"1, 2, 3, 5, 6, 7, 8, 9 - Aug - 2019","skills":"Core JAVA, Java Swing, JAVA J2EE, OOPS Concept, JSP, Servlets, JDBC","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Verifacts Services Private Limited, #4007, 1st and 2nd Floor, Hallmark Square, 100ft Road, Indiranagar Bangalore - 560 038","phone":"080-6782 2222","profile":"Core Java Developer \nVerifacts Services Private Limited","description":"Education Qualification: Any Graduate Experience: 1 - 3 Years Java Skills: Core JAVA, Java Swing, JAVA J2EE, OOPS Concept, JSP, Servlets, JDBC, Hibernate, Spring, Struts, Web Services API (SOAP/ Rest), JSON, HTML, CSS, Jquery, JavaScript , XML, AJAX, MVC, Android Application Development. Database: SQL/Postgres SQL/Psql Web Server: TOMCAT IDE: Eclipse OS/ Platform: Windows & Red Hat Job Responsibilities: Designs, develops, and implements web-based Java applications to support requirements. Follows approved life cycle methodologies, creates design documents, and performs program coding & testing. Resolves technical issues through debugging, research, and investigation. Requires a bachelor's degree in area of specialty(Computer Science & ENG.). Experience in development and debugging standalone/ web applications built using java. Interested candidates walk in on the below mentioned address- Date: 1st - 9th August , 10 AM onwards Interview Venue: Verifacts Services Private Limited #4007, 1st and 2nd Floor, Hallmark Square, 100ft Road, Indiranagar Bangalore - 560 038 Contact No: 91677 75350/ 080-6782 2222 (Kindly call between 10:00 AM to 06:00 PM)","location":"Bangalore","experience":"1 - 3 Years"},{"date":"3 - Aug - 2019","skills":"Java/ J2EE, HTML, Java Script, DB, Spring , Hibernate","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Softcell Technologies Limited, 4th Floor, 401, Mayfair Tower-I, 28, Mumbai-Pune Road Wakdewadi, Pune - 411 005","phone":"9225681948","profile":"Software Developer (Java/ J2EE) \nSoftcell Technologies Limited","description":"As part of a fast growing business we are looking for a highly motivated and experienced Java Developers, who will be responsible for the development of the products and services planned at our new start-up. Required Skills: - Strong Java/ J2EE, HTML, Java Script, DB, Spring , Hibernate - Web Services (Developing web services using SOAP, Spring - Should have knowledge about Web Service security. - Should have worked on SOA Enterprise Architecture projects - Spring / Hibernate framework Developer will be responsible for taking business and functional requirements and translating them into technical and functional designs. Producing and maintaining application code. Unit and integration testing of code, and providing support to testing cycles ensuring that defects are resolved. Walk-in Date: 3rd August 2019 Timing- 10 AM - 1 PM Interview Venue: Softcell Technologies Limited 4th Floor, 401, Mayfair Tower-I, 28, Mumbai-Pune Road Wakdewadi, Pune - 411 005","location":"Pune","experience":"2 - 7 Years"},{"date":"5, 6, 7, 8, 9 - Aug - 2019","skills":"Generalist Activities, Recruitment, HR Administration","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Radiant Group of Companies, No: 28, 3rd Floor, Voora J.K. Tower, Bazullah Road T Nagar, Chennai - 600 017","phone":"9500092092","profile":"HR & Admin Generalist \nRadiant Cash Management Services Pvt. Ltd","description":"Candidate should be Any Graduate with good verbal & written communication skills Should be conversant with MS office with Immense knowledge in HR activities Hindi speaking candidates are preferable Walk-in Date/ Time: 5th August - 9th August , 10 AM onwards Interview Venue: Radiant Group of Companies No: 28, 3rd Floor, Voora J.K. Tower, Bazullah Road T Nagar, Chennai - 600 017 Interested candidates can forward your CV to joshua@radiantcashlogistics.com and reach us at 9500020151 Please carry below mandatory documents: Updated Resume copy Copy of your Pan Card & Aadhar card 2 Passport size photos Educational documents: xerox copy of consolidated mark sheet/ provisional certificate Copy of experience / relieving certificate Last three months pay slip","location":"Chennai","experience":"0 - 2 Years"},{"date":"3 - Aug - 2019","skills":"Java/ J2EE, Spring/ Hibernate, Web Technologies and MySQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"BuzzyBrains Software (India) Pvt. Limited, C-501, Wisteria Fortune, Near New Poona Bakery, Bhumkar Chowk-Marunji Road, Wakad, Pune. Landmark: Opposite Silver Spoon Restaurant","phone":"7249519431","profile":"Java/ J2EE Developer \nBuzzyBrains Software (India) Pvt. Limited","description":"Person must have sound knowledge in Java/ J2EE technologies Working knowledge in Spring/ Hibernate necessary (Java, JSP, Spring, Hibernate/ Junit) Working knowledge in web technologies and MySQL Working knowledge in tomcat and Apache Web Server is needed Must have very good analytical skills Walk-in Date/ Time: 3rd August 2019, 10 AM onwards Interview Venue- BuzzyBrains Software (India) Pvt. Limited C-501, Wisteria Fortune, Near New Poona Bakery, Bhumkar Chowk-Marunji Road, Wakad, Pune Landmark: Opposite Silver Spoon Restaurant","location":"Pune","experience":"3 - 5 Years"},{"date":"1, 2, 3 - Aug - 2019","skills":"Java, Hibernate, springs, MS SQL, Postgress, Oracle","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"AGS Transact Technologies Limited, AGS House, Plot No. EL- 82-83, TTC Industrial Area, Near Nelco, MIDC, Mahape, Navi Mumbai- 400 710.","phone":"Not Provided","profile":"Java Developer (Freshers) \nAGS Transact Technologies Limited","description":"Candidate should be BE/ B.Tech/ M.Tech or MCA with excellent knolwdge of Java, Hibernate, springs, MS SQL, Postgress, Oracle. Walk-in Date/ Time: 1st - 3rd August , 10 AM onwards Interview Venue: AGS Transact Technologies Limited AGS House, Plot No. EL- 82-83, TTC Industrial Area, Near Nelco, MIDC, Mahape, Navi Mumbai- 400 710.","location":"Mumbai","experience":"0 - 1 Years"},{"date":"1, 2 - Aug - 2019","skills":"Core Java, JSP/ Servlet, J2EE, Spring, Hibernate, Angular, OOP","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Xpanxion International Private Limited, 4th Floor, Server Space, A. G Technology Park, Off ITI Road, Near Sarja Hotel, Aundh, Pune - 411 007.","phone":"020-40190500","profile":"Java Professionals \nXpanxion International Pvt. Limited","description":"Candidate must have 3 to 5 years of experience in Core Java, JSP/ Servlet, J2EE and good understanding of Object Oriented Programming. Must have experience in Spring, Hibernate, Angular 2/4/5 , Micro Services. Strong in Jenkins, Maven/ any build tools, Oracle/ MS SQL Server and Database designing skills Walk-in Date: 1st & 2nd August 2019 Timings: 8.30 am to 9.30 am Interview Location: Xpanxion International Private Limited 4th Floor, Server Space, A. G Technology Park, Off ITI Road, Near Sarja Hotel, Aundh, Pune - 411 007. Contact Person: Shweta Patil Interview Process: 1. Written Test: Candidate can give their test (1 hr.) and leave for the day, we can have L1 Technical telephonic discussion later. 2. If Selected in above rounds we will brief about further Client rounds.","location":"Pune","experience":"3 - 5 Years"},{"date":"3 - Aug - 2019","skills":"Java, PHP, Javascript, DB Concepts (RDBMS or no SQL Databases)","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Daffodil Software Private Limited, 9th Floor, Building B-1, DLF Silokhera SEZ, Sector 30, Gurgaon - 122 001.","phone":"Not Provided","profile":"Software Developer (PHP, JAVA) \nDaffodil Software Private Limited","description":"Daffodil Software Private Limited, is looking for Software Developer (Javascript, PHP, JAVA) to expand and strengthen its exceptional team at one of the most prime office spaces at DLF SEZ, Gurgaon. Designation: Associate/ Sr. Associate-IT Work Experience: 1-5 Years Job Location: Gurgaon Required Skills: Understanding of best practices for Architectural and Design Patterns Should have excellent communication skills (both written and verbal) Constructive Attitude is required Should have work experience in any of the technologies based on Java, PHP, Javascript Understanding of DB Concepts (RDBMS or No SQL Databases) REST Conventions HTML/ CSS Walk-in Date: Saturday, 3rd August 2019 Time: 9:00 AM to 12:00 PM Interview Venue: Daffodil Software Private Limited 9th Floor, Building B-1, DLF Silokhera SEZ, Sector 30, Gurgaon - 122 001. Landmark: Star Mall, NH 8, Gurgaon Nearest Metro Station: Huda City Center Please use the below mentioned link for Registration: http://bit.ly/3rdAugdrive","location":"Gurgaon","experience":"1 - 5 Years"},{"date":"5, 6, 7, 8, 9 - Aug - 2019","skills":"Technical Support, Desktop Support, Trouble Shooting","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Digital Minds Software Solutions Pvt. Limited, 2nd Floor, A-Wing, Softsol Building,, #4 Infocity, Beside Mindspace, Hi-tech City, Madhapur, Hyderabad,","phone":"040 66885669","profile":"Technical Support Executive \nDigital Minds Software Solution Pvt. Limited","description":"Educational Qualification: Any Degree Work Experience: 3 - 6 Years Required Skills: Excellent Comm Skills / Technical Skills / Trouble shooting skills / Customer Handling Skills Good in Active Directory, Basic Exchange Server or Office 365 administration, DHCP & DNS Excellent Knowledge of desktop OS Windows 8.1 / 10 and Trouble Shooting. Support hardware issues related to PC desktops, laptops, networking and Cisco phones. Able to work effectively with vendors and suppliers by logging tickets and service requests. Hands on experience with Ticketing tools is essentials(Jira / Alloy Navigator etc ) Knowledge of VMware(VSphere 5.5) and Citrix Xen Server. Knowledge of Cisco CUCM / Unity/ PLM - Not mandatory Knowledge on Backup (Veritas Backup, Veeam Backup, etc...) Process: Australian Voice Support Shift Timings (IST): 2:30 Am to 11:30 Am or 4:00 Am to 1:00 Pm or 6:00 Am to 03:00 Pm. (Shifts can change depending on Roster or Day light saving (Rotational) Rounds of Interview : First Round: Screening Second & Third Rounds: Technical Final Round: Human Resources. Walk-in Date: 5th - 9th August 2019 Timings: Between 10:00 AM -01:00 PM & 2:00 PM - 4:00 PM. Interview Venue: Digital Minds Software Solutions Pvt. Limited 2nd Floor, A-Wing, Softsol Building, #4 Infocity, Beside Mindspace, Hi-tech City, Madhapur, Hyderabad, Telangana - 500 081 Contact No. 9063610208/ 040 66885669 Email: hr@dmss.co.in Note: Those attended the interview with in Six Months, Kindly Ignore.","location":"Hyderabad","experience":"3 - 6 Years"},{"date":"1, 2, 3, 5, 6, 7, 8, 9, 10 - Aug - 2019","skills":"Non Voice Process, Debt Collection, Chat Process, Back end Operations","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Provana India Private Limited, A-32, Sector-2 Noida, Nearest Metro Noida Sector-15","phone":"Not Provided","profile":"Back-end Process Associate \nProvana India Private Limited","description":"Skill Sets Required in the candidate (Job Requirement) Good Analytical ability and Time Management skills; Should possess good English communication skills Good typing skills with a typing speed of 35 WPM with 97% accuracy Ability to follow instructions and clearly defined objectives; Ability to proactively identify process improvements; Fast learner (on both process and systems); Shift timings 10:00 AM - 07:30 PM (timings can change as per business requirement) Tests to be Conducted Typing Test - 35 words for a minute Analytical/Reasoning English Grammar Test Paragraph Writing Walk-in Date: 1st - 20th August 2019 Time: 11 am to 4 pm Interview Venue: Provana India Private Limited A-32, Sector-2 Noida, Nearest Metro Noida Sector-15 Contact Person- Karan HR","location":"Noida","experience":"0 - 1 Years"},{"date":"2 - Aug - 2019","skills":"Back Office Activities, Banking Operations, Data Entry Operations, Back-end Operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Kotak Mahindra Bank Limited, Kotak Infiniti, 2nd Floor, Building No. 21, Infinity Park, Off Western Express Highway, General AK Vaidya Marg, Malad (East), Mumbai - 400 097","phone":"Not Provided","profile":"Operation Executive/ Fresher \nKotak Mahindra Bank Limited","description":"Candidate should be Any Graduate with with excellent communication skills. Would be responsible for Back Office Activities, Banking Operations, Data Entry Operations, Back-end Operations. Job Profile for Operation Team (Off role):- 1) Data entry operator 2) MIS Knowledge 3) Excel management 4) Operation Executive 5) Freshers Required Interview Date : 2nd August 2019 Timing : 11 to 2 pm Interview Venue: Kotak Mahindra Bank Limited, Kotak Infiniti, 2nd Floor, Building No. 21, Infinity Park, Off Western Express Highway, General AK Vaidya Marg, Malad (East), Mumbai - 400 097 Contact Person : Khushbu Rathod","location":"Mumbai","experience":"0 - 1 Years"},{"date":"3 - Aug - 2019","skills":"Front desk, Guest Relations, Hotel Management, Customer Service, Front Office Management","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"JLL, Level 16, Tower C Epitome Building No. 5, DLF Cyber City Phase III, Gurugram - 122 002","phone":"Not Provided","profile":"Front Desk Executive \nJones Lang LaSalle Property Consultants (India) Pvt. Limited","description":"Candidate should be Any Graduate, Hotel Management Degree holder are preferred Should have 2 to 10 years of experience in Front Office or Guest Relations Must have excellent communication skills Candidates from Hotel & Aviation Industry with relevant work experience are welcome Willing to work 6 days a week Walk-in Date: 3rd August 2019, Saturday Time: 10 am - 3 pm Interview Venue: JLL, Level 16, Tower C Epitome Building No. 5, DLF Cyber City Phase III, Gurugram - 122 002 Contact Person: Manisha","location":"Gurgaon","experience":"2 - 10 Years"},{"date":"1, 2 - Aug - 2019","skills":"Core Java, Spring, Struts, J2ee, Hibernate","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Colan Infotech Private Limited, Murugesa Nayakar Complex, B Block, 4th Floor, Greams Road, Thousand Lights, Chennai - 600 006","phone":"9042055706","profile":"Java Developer/ Fresher \nColan Infotech Private Limited","description":"Candidate must have completed the course or Internship in Java Should have good analytical and logical skills Must have basic coding and problem-solving skills Should have good communication skills Only 2018/ 2019 passed out are eligible Walk-In Date: 1st to 2nd Aug 2019, Thursday & Friday Time: 12:00 PM to 03:00 PM Venue: Colan Infotech Private Limited, Murugesa Nayakar Complex, B Block, 4th Floor, Greams Road, Thousand Lights, Chennai - 600 006 Landmark: Opposite Road to Seashell Hotel","location":"Chennai","experience":"0 - 1 Years"},{"date":"3 - Aug - 2019","skills":".Net, (WCF, WPF, WF)","qualification":"B.E./B.Tech","address":"Capgemini India Private Limited, Campus 6B, Pritech Park, RMZ Ecospace, Bellandur, BANGALORE - 37","phone":"9886594559","profile":".Net Developer \nCapgemini Technology Services India Limited","description":"Candidate should be a Graduate in Computers or Engineering from a reputed university with with 4 to 6 years of experience in .Net, (WCF, WPF, WF). Must have good writing coding & communication skills. Looking for Immediate to 30 days candidates only Job Location: Bangalore (Ecospace Bellandur) Required Skills- 1. Framework Stack: .Net Framework 4.5 and above, .Net Core 2.2, .Net Standard 2.0. dot net ecosystem (.Net framework, .Net Core/ ASP .Net Core) Strong hands on experience in development of software tools and applications in C# and in.net (Must) 2. Programming Languages: C# and interoperability. Experience in C++,(added advantage). 3. UI Stack: WPF (using PRISM, MEF/Unity) , Windows Forms, UWP (Good to have), ASP.Net Core Razor (Good to have), Angular (Good to Have) Experience in UI framework development and UI development for Web based UI, Desktop and HTML5 (Must) 4. Service Stack: WCF, ASP.Net Core 2.2 (WebAPI, SignalR, HTTP Clients), Any Messaging Framework. Strong knowledge and skills in WPF, Web services, WCF etc.- (Must) Walk-in Date: 3rd August 2019 Timing: 10 AM to 2 PM Interview Venue: Capgemini India Private Limited Campus 6B, Pritech Park, RMZ Ecospace, Bellandur, BANGALORE - 37 Contact Person - Girish/ Sonam/ Manjunath Request to call -9632078131 1 hour before coming & drop resume on Sonam.singh@capgemini.com with subject line 'Dot Net Developer'","location":"Bangalore","experience":"4 - 6 Years"},{"date":"31 - Jul - 2019","skills":"ASP .Net, C#, MVC","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Cognizant Softvision, SSTP, #316-318, Infosys Road, Hebbal Industrial Area, Mysuru, Karnataka - 570 016","phone":"9036093129","profile":"Senior .Net Developer \nCognizant Softvision","description":"We currently have a Full-time opportunity for a .Net Developer Looking for immediate joiners (or) candidates who can join us early Work Experience: 4 to 9 Years Required Skills: ASP .Net, C#, MVC Should be flexible to learn multiple technologies Should have very Good Communications skills. Place of Work: Mysore/ Bangalore Walk-in Date/ Time: 31st July 2019, 9 AM onwards Interview Venue: Cognizant Softvision, SSTP, #316-318, Infosys Road, Hebbal Industrial Area, Mysuru, Karnataka - 570 016 Please share your resumes to Keerthideep.dsouza@softvision.com (or) Kindly reach out to me @ 9036093129 Name: (Complete Name as per ID Proof (any)) Ph: Email ID: Current Location: Total Exp: Relevant Exp: Reason for change: Notice Period: Fulltime/ Contract: (Please mention the employment status) Current CTC: Expected CTC: Employer Details: Available on 31st July 2019:","location":"Bangalore, Mysore","experience":"4 - 9 Years"},{"date":"30, 31 - Jul - 2019","skills":"Front Office/ Administrative Assistance, Font Desk/ Receptionist Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Accord Selection Services, 402, 4th Floor, Centre Square, Opposite Bharat Petrol Pump, S.V. Road, Near Station, Andheri (West), Mumbai - 58","phone":"022-26283616","profile":"Receptionist cum Admin Assistant \nAccord Selection Services","description":"Candidate should be Any Graduate with 2 to 3 years experience as a Receptionist cum Admin Assistant. Must have good knolwdge of Computers and excellent communication in English Only Female candidates can apply Smart & Presentable Typing Letters & Sending Emails Telephone Attending General Office Administration Age below 30 years Walk-in Date/ Time: 30th July - 31st August , 10 AM onwards Interview Venue: Accord Selection Services 402, 4th Floor, Centre Square, Opposite Bharat Petrol Pump, S.V. Road, Near Station, Andheri (West), Mumbai - 58 Tel No. : 022-26283616/ 26287682","location":"Mumbai","experience":"2 - 3 Years"},{"date":"30, 31 - Jul - 2019","skills":"Administration, Pantry, Housekeeping, Purchase coordination, Stock Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Digi Style, D-244, Second Floor, Sector-10, Noida. Landmark: Near Swani Furniture","phone":"Not Mentioned","profile":"Administration Executive \nDigi Style - Fitrick","description":"Educational Qualification: Any Graduate Work Experience: 1 - 3 Years Job Location: Noida Job Responsibilities- 1. Office Stationary Management. 2. Company assets management & stock management. 3. Employees Punching & ID card processing process. 4. All bills & vendor payment cross verification. 5. Vendor coordination. 6. House-keeping staff management & pantry stock management. 7. Only male candidate can apply. 8. Candidate should be Dedicated towards work, Punctual, Quick Learner and Hard-Worker We are looking for a person who can ride a bike and can mange things independently (Mandatory) Walk-in Date/ Time: 29th July - 10th August , 1 PM onwards Interview Venue: Digi Style, D-244, Second Floor, Sector-10, Noida. Landmark: Near Swani Furniture","location":"Noida","experience":"1 - 3 Years"},{"date":"30, 31 - Jul - 2019","skills":"General Administration, Office Management, Record Keeping","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Provana India Private Limited, A-32, Sector-2 Noida. Landmark: Close to 15 Metro Station Noida","phone":"Not Provided","profile":"Administration Executive \nProvana India Private Limited","description":"Candidate should be Any Graduate with 0 to 2 years of experience in General Administration, Office Management, Record Keeping. Must be good in spoken English & open for rotational shift Job Responsibilities- Airline ticket booking (Must) Hotels booking, Reservation and needs to prepare Itinerary Cab ordering for employees and record keeping. Seating plan check Managing office requirement on working Saturday Walk-in Date/ Time: 29th July - 2nd August, 11 AM onwards Interview Venue: Provana India Private Limited A-32, Sector-2 Noida Landmark: Close to 15 Metro Station Noida Contact Person- Gopal Sharma","location":"Noida","experience":"0 - 2 Years"},{"date":"30, 31 - Jul - 2019","skills":"Backend Process, Admin Support, B2B interaction","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"WNS Global Services Private Limited, 11th FL Block A2 & A3 Building, DLF IT SEZ, Sector 30 NH8, Gurgaon (Near Star Mall)","phone":"Not Specified","profile":"Backend - Admin Support \nWNS Global Services Private Limited","description":"WNS Looking for Backend - Admin Support - Gurgaon Educational Qualification: Any Graduate Years of experience - 1+ Year Freshers can also apply Skill Required: Ability to multi-task and to work within a framework of standard processes Good communication skills (both written and verbal) Ability to grasp requirement and deliver as per understanding Proactive team oriented, flexible approach. Job Responsbility: The role involves B2B interaction, providing Administrative support (arranging, travel, filing expenses, data entry) using the client tools remotely. Join on Immediate basis. Candidate should be flexible with the shift Timings. Walk In Details: Date - 30th July to 2nd August 2019 Timings: 1:00 PM to 4:00 PM Venue Details: WNS Global Services Private Limited 11th FL Block A2 & A3 Building, DLF IT SEZ, Sector 30 NH8, Gurgaon (Near Star Mall) Contact Person: Shalini","location":"Gurgaon","experience":"1 - 3 Years"},{"date":"1 - Aug - 2019","skills":"Back Office, Customer Satisfaction, Service Level Process Training, Customer Complaints","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"RBS Business Services Pvt. Limited, Olympia Technology Park, 8th Floor, Fortius Block, Guindy, Chennai - 600032","phone":"Not Provided","profile":"Back Office Executive \nRBS Business Services Pvt. Limited","description":"Fresher (B.A, B.Com, BBA, B.Sc Non-IT) (2017, 2018 & 2019 Results Declared Graduates only) , Students from an IT or Engineering or HR background are not eligible for this role. Post Graduates are NOT eligible for this role Be aware of changes in trends/ policies/ regulations as applicable to your business Understanding of the industry and customers Thorough understanding of product and processes, banking systems Good knowledge of Banking, Customer Service, MS Office, Back Office, Live person is essential. CANDIDATE NEED TO BE COMFORTABLE WITH THE WORKING HOURS (24*7 Rotational Shifts). Walk-in Date/ Time: 1st August , 10 AM onwards Interview Venue: RBS Business Services Pvt. Limited, Olympia Technology Park, 8th Floor, Fortius Block, Guindy, Chennai - 600032 Please carry a photo copy of the following mandatory documents. You will not be allowed to participate in the drive without these documents (i) Updated Resume (ii) 2 passport-size photographs How to Apply for this role: 1. Go to india.jobs.rbs.com 2. Search for job reference number: 91280 (Web chat process) 3. Apply for this job online","location":"Chennai","experience":"0 - 1 Years"},{"date":"30, 31 - Jul - 2019","skills":"Back Office Assistance, Document Verification, KYC","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Cholamandalam Investment and Finance Co. Limited, ASV Adarsh Complex, 719, Pathari Road, off Mount Road, Near Thousands Light Metro Station, Behind Raj Video Vision, Anna Salai, Chennai - 600 002.","phone":"Not Provided","profile":"Back Office Operations/ Fresher \nCholamandalam Investment & Finance Co. Limited","description":"Cholamandalam Investment & Finance Co. Limited, is looking for Operations/ Back Office - Officer in Chennai - Annasalai. Freshers/ 1 year experience in KYC documents updates Hindi is must MIS MS Excel Walk-in Date/ Time: 30th July - 2nd August from 10 AM onwards Interview Venue: Cholamandalam Investment and Finance Co. Limited ASV Adarsh Complex, 719, Pathari Road, off Mount road, Near Thousands Light Metro Station, Behind Raj Video Vision, Anna Salai, Chennai - 600 002.","location":"Chennai","experience":"0 - 1 Years"},{"date":"30, 31 - Jul - 2019","skills":"Receptionist/ Front Desk, Guest Handling/ reception Guest Relations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Seashell Logistics Private Limited, 'Monarch Plaza' 211/212 Plot No. 56 Sector 11, CBD Belapur, Navi Mumbai, Maharashtra - 400614","phone":"9137152938","profile":"Front Office Executive \nSeashell Logistics Private Limited","description":"Candidate should be Any Graduate with 0 to 3 years of experience as Receptionist/ Front Desk Executive, Responsible for Guest Handling/ reception Guest Relations. Must have excellent communication skills Job Responsbility- Handling Incoming and outgoing call at EPBX system. Handling inward and outward couriers. Taking care of Reception and Housekeeping activities. Admin Activities. Attendance and Branch co-ordination Walk-in Date/ Time: 30th July - 3rd August , 11 AM onwards Interview Venue: Seashell Logistics Private Limited 'Monarch Plaza' 211/212 Plot No. 56 Sector 11, CBD Belapur, Navi Mumbai, Maharashtra - 400614","location":"Mumbai","experience":"0 - 3 Years"},{"date":"1, 2 - Aug - 2019","skills":".NET Core, Angular 7, Microsoft Azure Cloud, Container, Dockers, Kubernetes","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"TRU Realty, 409, City Point, Near Symbiosis Boys Hostel, Hinjewadi Phase 1, Pune","phone":"Not Provided","profile":"Software Developer (.Net) \nTrurealty Private Limited","description":"Opportunity to work for fastest growing PropTech Real Estate Company. Urgent openings with immediate joining for .Net, Angular Programmer, MS SQL DB Programmer .NET Core, Angular 7, Microsoft Azure Cloud, Container, Dockers, Kubernetes, Microservices Walk-in Date/ Time: 1st to 2nd August , 11 AM onwards Interview Venue: TRU Realty, 409, City Point, Near Symbiosis Boys Hostel, Hinjewadi Phase 1, Pune","location":"Pune","experience":"1 - 6 Years"},{"date":"1, 2, 3, 5, 6, 7 - Aug - 2019","skills":".NET, MS SQL, HTML, ASP .NET","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Online24x7 Inc, Vipul Business Park, 601-605 Sector 48, Gurgaon","phone":"Not Provided","profile":".Net/ SQL Developer \nOnline24x7 Inc","description":"We are looking for freshers who want to work as a software engineer, in a fast-growing IT services company. Must have basic understanding of programming logic, data structures, and web programming. .NET, MS SQL, HTML, ASP .NET Must have good communication skills, ability to work in a team environment. Must have good attitude and willingness to learn. Walk-in Date/ Time: 31st July - 31st August , 10 AM onwards Interview Venue: Online24x7 Inc Vipul Business Park, 601-605 Sector 48, Gurgaon","location":"Gurgaon","experience":"0 - 2 Years"},{"date":"1, 2 - Aug - 2019","skills":".Net Framework, C#/ VB .Net, ASP .Net, SQL Server 2005/ 2008","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Progressive Digital Media (Sister company of GlobalData) 2nd Floor, NSL Centrum, Plot No-S1, Phase 1 & 2 KPHB Colony, Opposite: BSNL Office, Hyderabad","phone":"Not Provided","profile":"Senior Software Engineer (.Net) \nGD Research Center Pvt. Limited (GDRC)","description":"Candidate should have minimum 3 years of experience in .Net Framework, C#/ VB .Net, ASP .Net, SQL Server 2005/ 2008 Well-versed with JavaScript, AJAX, Web services, Threading Have strong concepts of OOPS. Hands on experience in product/ project development using MVC Exposure of Endeca Configuration, NHibernate, JQuery etc., Strong database programming skills(T-SQL) Good communication skills in English, both written and verbal and analytical skills. Bachelors Degree in Engineering /Technology / MCA. Understanding of web usability issues and information architecture. Strong interpersonal and communication skills. Able to work and thrive in a fast-paced team environment and flexible to accommodate demanding Project schedules. Ability to express technical concepts clearly to people with no technical background Interview Date - 1st & 2nd August ' 2019 Time - 10 AM to 6 PM Interview Venue: Progressive Digital Media (Sister company of GlobalData) 2nd Floor, NSL Centrum, Plot No-S1, Phase 1 & 2 KPHB Colony, Opposite: BSNL Office, Hyderabad Land Mark - Above Brand Factory & Reliance Trends, Near to Malaysian township Circle. Contact Person - Giridhar (HR)","location":"Hyderabad","experience":"3 - 6 Years"},{"date":"1, 2, 3, 5 - Aug - 2019","skills":"ASP .Net MVC, RESTful Services, .Net Framework, Microsoft SQL Server","qualification":"B.E./B.Tech","address":"Bar Code India Limited, 5C4, Gundecha Onclave, Khairani Road, Saki Naka, Andheri (E), Mumbai - 400 072","phone":"Not Provided","profile":".Net Programmer \nBar Code India Limited","description":"Primary Skills (Must have): C# and Vb with good understanding of OOPS, design patterns and multi-threading ASP .Net MVC, RESTful services, .Net Framework knowledge of Microsoft SQL Server Job Responsibility: Develop world class software Design and Develop front-end, middle-tier and back-end applications Work on Agile development lifecycle Maintain and support multiple projects and deadlines Design, develop and deliver functionalities for dynamic web and/or desktop applications on the Microsoft .NET platform. Walk in Date/ Time: 30th July - 5th August , 12 AM onwards Interview Venue: Bar Code India Limited 5C4, Gundecha Onclave, Khairani Road, Saki Naka, Andheri (E), Mumbai - 400 072","location":"Mumbai","experience":"0 - 5 Years"},{"date":"3 - Aug - 2019","skills":"C#, Design Patterns, ADO .Net, OOPS, Web Technologies, .Net Entity Framework, MVC","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Agile Cockpit Software Development Pvt. Limited, 15th Floor Ocus Quantum, Sector 51, Gurgaon - 122 003","phone":"Not Provided","profile":".Net Developer \nAgile Cockpit Software Development Pvt. Limited","description":"Very strong in OOPS Concepts Very strong in web applications (MVC, Web API, C#, Entity Framework, Ado.net) Hands on experience on Design Patterns, SOLID Principles Should be able to understand and develop Web Architecture Walk-in Date/ Time: 3rd August 2019, 9 AM onwards Interview Venue: Agile Cockpit Software Development Pvt. Limited 15th Floor Ocus Quantum, Sector 51, Gurgaon - 122 003","location":"Gurgaon","experience":"3 - 7 Years"},{"date":"31 - Jul - 2019","skills":"ASP .NET using C#, CSS, Java Script and Ajax","qualification":"B.E./B.Tech","address":"FTD India Private Limited, Block D - Wing II, 5th Floor, Cyber Gateway Building, Hitech City, Madhapur Village Hyderabad - 500 081","phone":"Not Provided","profile":".Net Developer \nFTD India Private Limited","description":"Education : Only B.Tech./BE/ with 60% throughout academics. Work Experience : 2 to 4 years A technical resource who is a strong team player recognized for his knowledge, technical leadership and experience in Windows technologies and has a strong ability to meet delivery criteria on schedule and with high quality. Duties and Responsibilities: 1) Participate in the analysis, design, implementation and support of the FTD Mercury POS system 2) Mentor and provide technical leadership to less experienced developers and 3) Support and improve the efficiency of the development process. Other responsibilities may be assigned based upon business need. Knowledge, Skills and Abilities 2+ years of software development experience, including all aspects of the Software Development Life Cycle Expert in Microsoft .Net environment using C# / Web Services Experience in Microsoft VC++ using MFC/ ATL Very strong MS SQL Server (2005) development including Stored Procedures, Views, and optimization Expert in web development preferably ASP .NET using C#, CSS, JavaScript and Ajax Experience in Agile or Iterative development Strong written and verbal communication skills Technically competent with various software programs, such as MS-Office, MS-Visio, MS-Project and TFS / Visual Studio 2005/2010 Experience using Microsoft Entity Framework for data access Experience with WCF and .net 4.5 for Win Forms Development Walk-in Date/ Time: 31st July 2019 from 9 AM onwards Interview Venue: FTD India Private Limited Block D - Wing II, 5th Floor, Cyber Gateway Building, Hitech City, Madhapur Village Hyderabad - 500 081","location":"Hyderabad","experience":"2 - 4 Years"},{"date":"31 - Jul - 2019","skills":".Net, Javascript, HTML, SQL","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Cosmosoft Technologies Limited, 3rd Floor, No.141, Old No.75, Arcot Road, Kodambakkam, Chennai - 600 024","phone":"Not Provided","profile":"Software Developer (.Net) \nCosmosoft Technologies Limited","description":"At Cosmosoft candidates are given extensive training both in frontend (JavaScript) and backend (.NET) development, producing full stack web developers every year. Our employees gain hands on experience in building high-quality, innovative and fully performing web solutions in compliance with coding standards and technical design. The selected candidate will be trained for a period of 4 months. Candidates will later be assigned full time projects depending on their skill level. Walk-in Date/ Time: 31st July - 30th August , 10 AM onwards Interview Venue: Cosmosoft Technologies Limited 3rd Floor, No.141, Old No.75, Arcot Road, Kodambakkam, Chennai - 600 024 Opposite to Koncept Hospital Near to Powerhouse Bus Stop","location":"Chennai","experience":"0 - 1 Years"},{"date":"3 - Aug - 2019","skills":"C#, ASP .Net, and MS SQL 2008/ 2012","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Xceedance Consulting India Pvt. Limited, 5th floor, Candor Gurgaon, One Projects Private Limited, SEZ Building No. 6, Village Tikri, Sector 48, Gurgaon, Haryana - 122 018","phone":"Not Provided","profile":".Net/ Full Stack Developer \nXceedance Consulting India Pvt. Limited","description":"Person should have Bachelor or Master Degree in a Computer technology related discipline with 2 to 6 years of experience as a software engineer. Must have good understanding of SDLC and waterfall/ agile project methodologies. Good knowledge of OOPS and core .Net concepts. Good knowledge of MVC/ MVP frameworks. Must have good programming and troubleshooting skills using C#, ASP .Net and MS SQL 2008/ 2012 Good hands on JavaScript and jQuery. Should have worked on Angular 2 or 2+ version in frontend. Additional Skills Candidates having knowledge of AngularJS scripting framework will be given preference. Good communication skills. Problem solving skills and capacity to work independently as well as in team. Good interpersonal and team working skills. Walk-in Date/ Time: 3rd August 2019, 11 AM onwards Interview Venue: Xceedance Consulting India Pvt. Limited 5th floor, Candor Gurgaon, One Projects Private Limited, SEZ Building No. 6, Village Tikri, Sector 48, Gurgaon, Haryana - 122 018","location":"Gurgaon","experience":"2 - 6 Years"},{"date":"1, 2 - Aug - 2019","skills":"C#, ASP .Net, Design Patterns, CSLA .Net SQL Server","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Progressive Digital Media (Sister company of GlobalData) 2nd Floor, NSL Centrum, Plot No-S1, Phase 1 &2 KPHB Colony, Opposite BSNL Office, Hyderabad","phone":"040-67426702","profile":"Software Engineer - .Net \nProgressive Digital Media (GlobalData)","description":"BE, MCA or BCA Degree in one of the following subject areas: Computer Science, Information Technology or related field 2+ years experience in the design and development of complex software systems Should have prior experience in working in SDLC model 1-2 years experience in developing web applications Experience working in an nTier environment Understanding of design patterns Excellent interpersonal, written, and oral communication skills Ability to present ideas in user-friendly language Able to prioritize and execute tasks in a high-pressure environment Experience working in a team-oriented, collaborative environment Self motivated and directed, with keen attention to detail Role & Responsibilities: Should be involved in developing web applications in nTier Enivironment Should be involved hand-on in writing optimized code and stored procedures Should be involved in object oriented designing and development Should do Technical documentation Interview Date - 1st and 2nd August 2019 Time - 10 AM to 6 PM (anytime in between) Interview Venue: Progressive Digital Media (Sister company of GlobalData) 2nd Floor, NSL Centrum, Plot No-S1, Phase 1 &2 KPHB Colony, Opposite BSNL Office, Hyderabad Land Mark - Above Brand Factory & Reliance Trends, Near to Malaysian township Circle Contact Person- Giridhar (HR)","location":"Hyderabad","experience":"2 - 4 Years"},{"date":"1 - Aug - 2019","skills":"Web technologies like HTML, CSS, JavaScript","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Cognizant Technology Solutions India Limited, Manyata Embassy Business Park, Mahogany (F2 Building), 2nd Floor, Hebbal Outer Ring Road, Rachenahalli, Bangalore - 560 045","phone":"Not Provided","profile":"Web/ Php Developer \nCognizant Technology Solutions India Limited","description":"Education Requirement: Bachelor's Degree in Technology / Engineering / Mathematics + 4 Months Training in JS / Basic Web technologies Work Experience : 1.5 to 4 Years Required Skills: Non-Voice Process Shift : Flexible to work in any shifts Work Location : Bangalore Key Responsibilities: Analyze mobile websites of customers to understand the architecture and identify fitment of AMP Implementation Develop Sites using web related technologies including JS, HTML, CSS,PHP Prepare all the required artifacts and develop knowledge repository Understand the various CMS & available plugins to develop the site accordingly Conduct research on various components to use them suitable providing both effectiveness in speed and loading time. Walk-in Date: 1st August 2019 (Thursday) Time : 10 AM to 1 PM Interview Venue: Cognizant Technology Solutions India Limited Manyata Embassy Business Park, Mahogany (F2 Building), 2nd Floor, Hebbal Outer Ring Road, Rachenahalli, Bangalore - 560 045 POC : Nischitha Kindly keep the brush up on the web technologies like HTML, CSS, Java Script when you come for an Interview.","location":"Bangalore","experience":"1 - 4 Years"},{"date":"30 - Jul - 2019","skills":"PHP, Word Press themes, Responsive Design, Bootstrap & Html5","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Info Edge (India) Limited (99acres.com), A-88, Sector - 2, Noida","phone":"Not Provided","profile":"PHP Developer \nInfo Edge India Limited (99acres.com)","description":"Candidate should have minimum 2 years experience in PHP, Word Press, HTML and JQuery. Must have good knowledge of PHP, Word Press themes, Responsive Design, Bootstrap & Html5. Write clean, testable and scalable code for websites, landing pages, emailers and other web elements/applications Develop and test code across multiple browsers, platforms, and devices, ( including Smart Phones and tablets) Optimize page tags, headings, navigation, page performance and links, keeping security intact Take responsibility of maintaining and scaling the website Open to constructive criticism and willing to learn new technologies. Should have good experience in JavaScript and JS frameworks Capable of finishing projects on time and flexible to work according to the urgency. Walk-in Date - 30th July (Tuesday) Time - 10 am - 3pm Interview Venue: Info Edge (India) Limited (99acres.com) A-88, Sector - 2, Noida Contact Person: Shweta","location":"Noida","experience":"2 - 6 Years"},{"date":"29, 30, 31 - Jul - 2019","skills":"Software Testing, Automation Testing, Manual Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"AGS House, Plot No. EL 82 & 83, TTC Industrial Estate, MIDC Electronic Zone, Navi Mumbai - 400 705.","phone":"Not Provided","profile":"Junior Software Tester \nAGS Transact Technologies Limited","description":"Candidate should be BE/ B.Tech or MCA with 2 to 5 years of experience in Software Testing, Automation Testing, Manual Testing Job Responsbility- Testing, Analyze the BRD, mPOS and wPOS application testing, Performing DR (disaster recovery) drill activity, Testing Mobile,Web and Desktop applications, Using Magstripe, EMV and RFID Credit / Debit cards for testing application on terminals like BluePad. Walk-in Drive/ Time: 29th July - 2nd August , 9 AM onwards Interview Venue: AGS Transact Technologies Limited AGS House, Plot No EL 82 & 83, TTC Industrial Estate, MIDC Electronic Zone, Navi Mumbai - 400 705. Contact Person: Rasika HR team","location":"Mumbai","experience":"2 - 5 Years"},{"date":"29, 30, 31 - Jul - 2019","skills":"Java, Selenium, Automation Testing, OOPs","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"ApMoSys Technologies Private Limited, A-105, Greenscape Technocity Shil Phata Mahape Road Next to Country Inn & Suites Mahape, Navi Mumbai - 400 701","phone":"022-41222250","profile":"Automation Tester/ Fresher \nApMoSys Technologies Pvt. Limited","description":"Should have knowledge in Selenium, Web Driver, Basic Java, OOPs Automation course is mandatory Open to travel in Mumbai & Navi Mumbai location Walk-in Date: 29th July - 9th August Timings: 11 AM to 4 PM Interview Venue: ApMoSys Technologies Private Limited A-105, Greenscape Technocity Shil Phata Mahape Road Next to Country Inn & Suites Mahape, Navi Mumbai - 400 701","location":"Mumbai","experience":"0 - 2 Years"},{"date":"30, 31 - Jul - 2019","skills":"Php, Web Development, Codeigniter, Software Engineering","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Wizmatrix Consulting Private Limited, #687, 'Vajra', 2nd Floor, Unit-1 15th Cross, 100ft Ring Road, J P Nagar 2nd Phase, Bangalore - 560 078","phone":"080-40050935","profile":"PHP/ Web Developer \nWizmatrix Consulting Private Limited","description":"Candidate should be Any BE/ MCA Freshers with good knowledge about responsive web designs. Expected to possess strong problem-solving skills, programming, testing and troubleshooting skills. Must have good analytical and problem solving skills Capability to adapt fast to new technologies Academic project experience in Codeigniter Walk-in Date/ Time: 30th July - 2nd August , 10 AM onwards Interview Venue: Wizmatrix Consulting Private Limited #687, 'Vajra', 2nd Floor, Unit-1 15th Cross, 100ft Ring Road, J P Nagar 2nd Phase, Bangalore - 560 078 Phone No: 080-40050935 (Direct)","location":"Bangalore","experience":"0 - 1 Years"},{"date":"30, 31 - Jul - 2019","skills":"Core PHP, Java Script, JQuery, MVC, Ajax, HTML, Frameworks and Oops","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Indorizon India Private Limited, Almas Plaza, 10-3-304/7/202, Flat No. 202, 3rd Floor, Humayun Nagar, Masab Tank, Hyderabad, Telangana - 500 028","phone":"Not Provided","profile":"Senior PHP Developer \nIndorizon India Private Limited","description":"We are looking for a highly motivated Senior PHP Developer, working experience with PHP technology and Web-based business applications. Work Experience: 2-8 Years Job Type: Permanent Job location: Hyderabad Skills and Qualifications: 3-7 years of Strong programming experience in Core PHP, Java Script, JQuery, MVC, Ajax, HTML, Frameworks and Oops. How basic web request responses works (like HTTP requests/ Response headers). Integration of user-facing elements developed by front-end developers Build efficient, testable, and reusable PHP modules Expert of Javascript,Ajax, XML,JSON, Web-Services, APIs and Design Patterns Must have the good knowledge in presentation layer (HTML,CSS and JSP) Proficient understanding of code versioning tools, such as Git Responsibilities & Duties: Identify user and system requirements for new websites and applications Prioritize software development projects, set timelines and assign tasks to team members Write or review code for various applications Run functionality testings and debug code Oversee junior web developers and evaluate their performance Ensure our software documentation is up-to-date Collaborate with mobile developers to build mobile-responsive websites Walk-in Date/ Time: 27th July - 10th August, 9 AM onwards Interview Venue: Indorizon India Private Limited Almas Plaza, 10-3-304/7/202, Flat No. 202, 3rd Floor, Humayun Nagar, Masab Tank, Hyderabad, Telangana - 500 028","location":"Hyderabad","experience":"3 - 7 Years"},{"date":"1, 2, 3 - Aug - 2019","skills":"Front Office, Complaint Management, Customer Relationship, Customer Service Front, Front desk Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"TV Sundaram Iyengar & Sons Private Limited, No. 368-370, Mettupalayam Road Coimbatore - 641043. Landmark: Opp to Avinashilingam College","phone":"9840526992","profile":"Front Office Executive (Female) \nTV Sundaram Iyengar & Sons Private Limited","description":"Candidate should be Any Graduate with 1 to 3 years of experience in Front Office, Complaint Management, Customer Relationship, Customer Service Front, Front desk Activities. Must have excellent communication skills. Job Responsibilities- Greet and welcome guests as soon as they arrive at the office Direct visitors to the appropriate person and in office Answer, screen and forward incoming phone calls Incoming and outgoing log book maintenance Walk-in Date/ Time: 1st August - 3rd August , 10 AM onwards Interview Venue: TV Sundaram Iyengar & Sons Private Limited No. 368-370, Mettupalayam Road Coimbatore - 641043 Landmark: Opp to Avinashilingam College","location":"Coimbatore","experience":"1 - 3 Years"},{"date":"30, 31 - Jul - 2019","skills":"PHP, MVC, Design Patterns, Java Script, HTML5, and CSS3","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Techindia Infoway Private Limited, B-15, 2nd Street, Ambattur Industrial Estate, (Opp: Ambattur BMW Service center), Chennai - 600 058.","phone":"9003142494","profile":"PHP Developer \nTechindia Infoway Private Limited","description":"Candidate must have strong knowledge of Common PHP or web server exploits and their solutions PHP web frameworks (Laravel, Yii, etc depending on candidates technology stack) Work Experience: 2 to 5 Years Understanding on fully synchronous behavior of PHP, MVC Design Patterns, JavaScript, HTML5, and CSS3 accessibility and security compliance (Project specific) Fundamental design principles behind a scalable application Code versioning tools, such as Git Knowledge and familiarity with Object-oriented PHP programming User authentication and authorization between multiple systems, servers Integration of multiple data sources and databases into one system Limitations of PHP as a platform and its workarounds Creating a database schema that represents and support business processes SQL/ NoSQL databases and their declarative query languages. Job Responsibilities : Integration of user-facing elements developed by front-end developers Build efficient, testable, and reusable PHP modules Solve complex performance problems and architectural challenges Integration of data storage solutions Walk-in Date/ Time: 29th July - 2nd August , 10 AM onwards Interview Venue: Techindia Infoway Private Limited B-15, 2nd Street, Ambattur Industrial Estate, (Opposite Ambattur BMW Service Center), Chennai - 600 058. Contact Person: Meena Contact No: 9003142494 Documents required: Updated resume","location":"Chennai","experience":"2 - 5 Years"},{"date":"29, 30 - Jul - 2019","skills":"QA, Software Testing/ Fresher","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Binary Semantics Limited, Plot no.- 15, Electronic city Sector- 18, Gurgaon -122015","phone":"6398972916","profile":"QA/ Testing Engineers \nBinary Semantics Limited","description":"Walk-in for QA/ Testing Engineer Freshers with Binary Semantics Position- Quality Analyst Only Full time MCA or B.Tech can apply No distance education please. Job Location - Gurgaon Required Skills : Good technical Knowledge Ready to work as QA (Quality Analyst) Good communications skills ' Positive attitude Interested candidates can come for interview on 29th July - 30th July , 10 AM onwards Address - Binary Semantics Limited Plot no.- 15, Electronic city Sector- 18, Gurgaon -122015 Nearest Metro - Sikendarpur Contact Person - Ricky Rajput Contact No.- 6398972916","location":"Gurgaon","experience":"0 - 1 Years"},{"date":"29 - Jul - 2019","skills":"Java + Selenium, Manual Testing, SQL / DB Testing, Katalon Studio","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Meredith India, 5th Floor, Building 8A, RMZ Eco World, Bellandur, Bengaluru.","phone":"Not Provided","profile":"QA/ Testing Engineers \nMeredith India","description":"We invite QA Engineers with Manual & Automation Testing skills Experience : 2-4 Years Position Summary: Opportunity to work on Cross Browser and Cross Platforms like Windows, Mac, Android devises testing for multiple Meredith titles. Rest API Testing, Performance / Load Testing Continuous Integration and Continuous Delivery Primary Responsibilities: 1. Understanding the User stories(Requirement understanding ) 2. Writing Test Plans 3. Writing Test cases in Quality Center or excel 4. Performing Regression / Functional test using QC/ SQL 5. Raising defects, triage and getting them resolved in a timely manner using Jira/QC and tracking them 6. Improving Technical Skills -Java + Selenium -Manual Testing -SQL / DB Testing -Katalon Studio Shift Timing - 1PM to 10PM Cab & Food will be provided Walk-in Schedule: Monday (29 July, 2019). Timings: 12:00 pm-2:00 pm Venue: Meredith India, 5th Floor, Building 8A, RMZ Eco World, Bellandur, Bengaluru. Contact Person: Sheetal Yadav (HR)","location":"Bangalore","experience":"2 - 4 Years"},{"date":"29, 30, 31 - Jul - 2019","skills":"ASP .Net MVC 4/5, C#, Web Services","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Webhelp India Private Limited, Plot no 243, SP Infocity, Udhyog Vihar Phase 1, Gurgaon - 122 016","phone":"8448393565","profile":"ASP .Net Developer \nWebhelp India Private Limited","description":"Candidate should be a B.E/ B.Tech/ MCA/ DOEACC (A/B/C Level) with 3 to 5 years of experience in an Software Application Development in Microsoft Technologies (ASP .Net MVC 4/5, C#, Web Services). Understanding of OOPS, Multi- tier and Client server architecture. Should have hands on experience with code versioning like TFS (Team Foundation Server) etc. Experience with Agile development and proven ability to work independently and part of a Software Development Team. Desired Skills- Asp .Net MVC 4/5 REST API JQuery Angular JS 2.0 SQL 2014/16 Additional Skills Asp .Net Core JQuery Mobile Xamarin Walk-in Date/ Time: 29th July - 31st July , 12 PM onwards Interview Venue: Webhelp India Private Limited Plot no 243, SP Infocity, Udhyog Vihar Phase 1, Gurgaon - 122 016","location":"Gurgaon","experience":"3 - 5 Years"},{"date":"29, 30 - Jul - 2019","skills":"Core JAVA, JavaScript, Spring Framework, HTML, MySQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Spoors Technology Solutions India Pvt. Limited, 4th Floor, Sai Prithvi - Cyber Arcades, Above Bata Showroom, Indian Oil Petrol Bunk, Madhapur, Hyderabad.","phone":"Not Provided","profile":"Java/ J2EE Developer \nSpoors Technology Solutions India Pvt. Limited","description":"Looking for recent pass-outs 2018,2019 for freshers, Exp candidate should have 2 to 4 years experience as a Java/ J2EE Developer Experience with Struts, Spring, Hibernate and Tomcat CSS, HTML, JavaScript, XML, JSON, AJAX and JSP Knowledge of Javascript and HTML is desirable. Must have database design and modelling skills (preferably in MySQL) Looking for Immediate joins only Walk-in Date/ Time: 29th - 30th July , 10 AM onwards Interview Venue: Spoors Technology Solutions India Pvt. Limited, 4th Floor, Sai Prithvi - Cyber Arcades, Above Bata Showroom, Indian Oil Petrol Bunk, Madhapur, Hyderabad.","location":"Hyderabad","experience":"0 - 4 Years"},{"date":"3 - Aug - 2019","skills":"Core Java Concepts, OOPS, J2EE, Multi threading & OOPS","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Please share your updated resume to register yourself for the recruitment Drive","phone":"Not Provided","profile":"Java Developers \neInfochips Limited","description":"Must have skills: Experience in Java 6 or above Good exposure in OOPS & J2EE Good Core Java Concepts, Multi threading, & OOPS Good understanding in design patterns Rich experience with web frameworks Spring3/4 or Springboot Good to have skills: Experience working with Microservices, AWS, Spring. Experience with NoSQL's Amazon DynamoDB Walk-in Drive on 3rd August , 10 AM onwards Please share your updated resume to avishek.mukherjee@einfochips.com to register yourself for the recruitment Drive on 3rd August 2019.","location":"Ahmedabad","experience":"2 - 5 Years"},{"date":"31 - Jul - 2019","skills":"BigData, Hadoop, Java","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Banquet Hall, 23 Chefs Hotel, Manjeera Majestic Commercial, JNTU Road, KPHB Colony, Hyderabad","phone":"Not Provided","profile":"Software Testing Trainee \nQualiTlabs","description":"Required Qualification: B.Tech/ BE (CSE/ IT/ ECE) or MCA only Minimum 65% in academics (2018 & 2019 passed outs only) No pending backlogs Candidate should have very good programming skills (in Java, C# .NET or C) Knowledge in Selenium or Testing is not a requirement (just an added advantage) Must be interested to work on Software testing/ Test Automation Should have good communication skills Must be able to join immediately. JOB LOCATION: QualiTlabs, PSR Prime Tower, Gachibowli, Hyderabad. (Next to DLF IT Park Gate#1) Hiring Process: Written-test (Aptitude & Reasoning), Programming Test (must be able to write any program with your own logic), Face to Face interview Walk-in Date: Wednesday, July 31, 2019 Timing: From 9 am to 3 pm WALK-IN Location : Banquet Hall, 23 Chefs Hotel, Manjeera Majestic Commercial, JNTU Road, KPHB Colony, Hyderabad (Phone: 9701936364 this number works only on July 31, 2019) Note: Candidates who have undergone the hiring process with QualiTlabs in last 6 months are NOT eligible","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"26, 29, 30, 31 - Jul - 2019","skills":"ASP .NET, ASP .NET Web API, ASP .NET Web Forms, Angular, MS SQL","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Agdova Technologies Private Limited, E -59 & 60, Sector- 3, Office No- G 01, Ground Floor, Noida - 201 301","phone":"Not Provided","profile":".Net/ Full Stack Developer \nAgdova Technologies Private Limited","description":"We are looking for Angular/ .Net Full Stack Developer who can contribute to a fast-paced, high-energy team, supporting the systems and applications in development. As a software developer, your primary responsibilities will include execution of application development and technical support by following the software development lifecycle processes. This will include interacting with business liaisons, business users and different technology groups on an ongoing basis, developing technical design documents, coding, and unit testing. Skills Required: Experience Range should be 1 to 4 Years Must have sound knowledge in Angular 4/5/6 Dot NET framework versions: .NET 4.0 and above. Languages: C#, JavaScript, TSQL, HTML Web frameworks: ASP .NET, ASP .NET Web API, ASP.NET Web Forms, Angular. Database: MS SQL Interview Date: 26th to 31st July 2019 (Sat/ Sun Off) Time: 12:00 PM to 5:00 PM Interview Venue: Agdova Technologies Private Limited E -59 & 60, Sector- 3, Office No- G 01, Ground Floor, Noida - 201 301 Land mark: Behind Punjab National Bank Housing Finance Sector -3 Nearest Metro Station: Noida (Sector-16)","location":"Noida","experience":"1 - 4 Years"},{"date":"28 - Jul - 2019","skills":"C# .NET, ASP .NET, MVC, WinForms, .Net Core, Entity Framework, SQL","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Decision Machines Private Limited, 508, Speciality Business Center, Balewadi, Pune","phone":"Not Provided","profile":"Software Engineer (.Net) \nDecision Machines Private Limited","description":"Qualification: BE/ B.Tech/ BCA/ MCA Work Experience: 1 to 2 Years Mandatory Skills: C# .NET, ASP .NET, MVC, WinForms Optional : .Net Core, Entity Framework, SQL Walk-in Date/ Time: 28th July 2019, 10 AM onwards Interview Venue: Decision Machines Private Limited 508, Speciality Business Center, Balewadi, Pune","location":"Pune","experience":"1 - 2 Years"},{"date":"29, 30, 31 - Jul - 2019","skills":".Net, HTML, CSS, Bootstrap, Jquery, etc.","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"DEV Information Technology Private Limited, 14, Aaryans Corporate Park, Nr. Shilaj Railway Crossing, Thaltej - Shilaj Road, Thaltej, Ahmedabad - 380 059","phone":"Not Provided","profile":".Net Developer \nDEV Information Technology Pvt. Limited","description":"Person must be having good knowledge of basics of programming Should have basic HTML, CSS, Bootstrap, Jquery, etc. Basic knowledge of database and Query Writing Should have good analytical & logical skills Having good grasping power Positive Attitude. Work commitment. Walk-in Date/ Time: 29th July - 31st August , 9 AM onwards Interview Venue: DEV Information Technology Private Limited 14, Aaryans Corporate Park, Nr. Shilaj Railway Crossing, Thaltej - Shilaj Road, Thaltej, Ahmedabad - 380 059","location":"Ahmedabad","experience":"0 - 1 Years"},{"date":"29, 30, 31 - Jul - 2019","skills":"C# .Net and Java/ Android Programming","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Elico Limited, B-90, C-56, A.P.I.E, Gate No. 6, Sanathnagar, Hyderabad - 18","phone":"040-44451244","profile":".Net Developers \nElico Healthcare Services Limited","description":"Qualification: B.Tech (ECE or C.Sc)/ MCA or Equivalent. Experience: 2.5 to 5 Years. Candidate should have at least 4 years of work experience in real time projects. At least 6 months of experience in the real time project with an external client. Should have knowledge about Project Management and Version control Software. Must have good communication skills. Required Skills: C# .Net and Java/ Android Programming. Must have a strong experience in at least one set of the above mentioned fields. Experience in Communication programming (Serial, Network Programming) Development of image processing Algorithms. Knowledge in Web Application Development. Knowledge in Cloud Computing is an advantage. Knowledge in AI and ML is an advantage. Interested candidates, please walk-in directly with your resume from 29th July - 3rd August at below mentioned address (Excluding Sunday) or send your updated resume to prasannam@elicohcs.com Elico Limited B-90, C-56, A.P.I.E, Gate No. 6, Sanathnagar, Hyderabad - 18 Land Mark: Near Bharathanagar MMTS & Metro Rlwy Stations Contact Person: Prasanna. Contact No: 040-44451244/ 8978447766","location":"Hyderabad","experience":"2 - 5 Years"},{"date":"29, 30, 31 - Jul - 2019","skills":"C#/ VB .NET, Client-side Web Technologies, CSS, SQL Server","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Nittany Creative Solutions LLP, No 141, Prakash Towers, Second Floor, Rajiv Gandhi / OMR IT highway, Near IGP Bus Stop / Next to IGP Building, Chennai - 600 041","phone":"8552019000","profile":".Net Developer \nTcraft Technologies","description":"We are looking for ambitious .Net Developer to join our team. As a .NET Developer you will be involved in design, development, coding, customization, configuration, testing, and deployment in support of enterprise packaged solutions. Roles And Responsibilities: . Finding information about latest technologies that aid in the development of core web applications and enhance their features in the long run. . They have to also ensure the compatibility of their websites with newer software or operating system version. . Understanding the life cycle of software and determining any changes that may be needed as per the observations and feedback of software testing professionals. . Manage defect tracking system and resolve all issues and prepare update for systems. . Enhance existing systems by analyzing business objectives, preparing an action . Investigate and develop skills in new technologies Skills: SQL Server, CSS, C#/ VB .NET, Client-side Web Development Technologies, MVP, Unit Testing, MCSD Walkin Details Walk-ins: 26 July to 3 Aug 2019 (Timing- 10 am to 1pm) Venue Details- Tcraft Technologies 301, 3rd Floor, Pinnacle Pride S. No. 1544/45 A, Sadashiv Peth, Opposite Hotel Durvankur, Tilak Road, Pune - 411 030 Contact No.: 8552019000","location":"Pune","experience":"0 - 3 Years"},{"date":"3 - Aug - 2019","skills":"Technical Support, IT Service Desk, Customer Cupport","qualification":"B.Sc, BCA/BCS, B.E./B.Tech, Diploma","address":"Hexaware Technologies Private Limited, EB1, 1st Floor, Plot No. H5 SIPCOT IT Park, Navallur Post, Siruseri, Chennai -603 103","phone":"Not Provided","profile":"Technical Support Engineer \nHexaware Technologies Pvt. Limited","description":"ANY DIPLOMA GRADUATES WITH GOOD COMMUNICATION CAN ATTEND THE INTERVIEW. GRADUATION IS NOT MANDATORY. CANDIDATES WITH BACKLOGS / ARREARS CAN ALSO ATTEND THE INTERVIEW. VERY SIMPLE ONE ROUND FACE TO FACE INTERVIEW PROCESS. Excellent verbal and written communication is must. Should have very good phone etiquette. Good customer handling skills and good attitude is must. Previous work experience in BPO , Voice Process, Non-Voice Process, Customer Support, Technical Support will be an added advantage. INTERESTED CANDIDATES CAN WALK-IN FOR THE INTERVIEW ON 3RD AUGUST 2019 @ 10:00 AM TO THE BELOW MENTIONED VENUE WITH YOUR UPDATED RESUME AND MEET YOUR CONTACT PERSON HR-DINESH. Hexaware Technologies Private Limited EB1, 1st Floor, Plot No. H5 SIPCOT IT Park, Navallur Post, Siruseri, Chennai -603 103","location":"Chennai","experience":"0 - 2 Years"},{"date":"29, 30 - Jul - 2019","skills":"System Administration, Technical Support, Network Support, Asset Management, Desktop Support","qualification":"B.E./B.Tech","address":"Inspirisys Solutions Limited, (Formerly Accel Frontline Limited) Dowlath Towers, Second floor, Taylors Road, Chetpet, Chennai, Tamil Nadu - 600 010","phone":"044-42255443","profile":"Trainee Support/ System Enigneer \nInspirisys Solutions Limited","description":"Walk-in Interview for the position of Technical Support Engineers (Male) Qualification: BE/ B.Tech (2017, 18 & 19 batch) Experience: Fresher/ 0 to 1 Years Job Location: Chennai Roles & Responsibilities: E-mail Configuration Installation & Troubleshooting: Antivirus, MS office, Mailing clients and other software Hardware, Desktop & Laptops Network Printer & Scanner Operating System - Windows Patch management for desktops, laptops Troubleshooting all network and application issues Immediate joiners preferred Candidates should be Interested to sign 3 year bond (Mandatory) Walk-in Date: 29th to 30th July 2019 Time: 10.00 AM to 4.00 PM Interview Venue: Inspirisys Solutions Limited (Formerly Accel Frontline Limited) Dowlath Towers, 2nd floor, Taylors Road, Chetpet, Chennai, Tamil Nadu - 600 010","location":"Chennai","experience":"0 - 1 Years"},{"date":"29, 30 - Jul - 2019","skills":"International Voice Process, Customer Service","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Sitel India Private Limited, Boomerang, No 501, Wing A & B1, Chandivali, Andheri East, MUMBAI - 400 072","phone":"7303443025","profile":"Customer Support Executive \nSitel India Private Limited","description":"Sitel India Private Limited, is hiring for UK Inbound Customer Service Process. Job Requisites: Qualification HSC+ 6 months of experience Maximum Qualification Graduates Age: 19+ years to 39 years (Undergrads can be considered but should not be regular college students) Experience 0 to 2 year of experience in BPO/ Customer Service industry (Fresher will be preferred) Excellent communication skill with good hold on grammar Basic knowledge of computers Job Responsbility: Handling inbound calls Providing Customer support to UK Customers Other Benefits: Pick up & drop Facility will be provided.- 5-Days working (2 Rotational and Split offs) Willingness to work in Rotational Shifts Attractive incentives Walk-in Date/ Time: 29th - 30th July from 11 AM onwards Interview Venue: Sitel India Private Limited Boomerang, No 501, Wing A & B1, Chandivali, Andheri East, MUMBAI - 400 072 Contact Person:- HR RAMESH PAL: 7303443025","location":"Mumbai","experience":"0 - 2 Years"},{"date":"29, 30, 31 - Jul - 2019","skills":"Technical Support, International Voice Process, Customer Service","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Tech Mahindra Limited, Survey No. 62/1 A, Takshashila Building, Gate No: 1, Qutubullapur Mandal, Bahadurpally, Hyderabad - 500 043.","phone":"7386174351","profile":"Technical Support - Voice Process \nTech Mahindra Limited","description":"Tech Mahindra Limited, is hiring for Technical Support Associates (International Voice Process) Required Qualification/ Experience: Undergraduate / Graduate / Post Graduate Minimum 6 months in technical support OR 1 year in customer support - Voice Experience from International BPO background is only considered Should have excellent communication skills (Oral & Verbal) Must be flexible working for Rotational shifts Candidate should be aware of basic technical knowledge in LAN, WAN and handling basic Internet issues. Troubleshooting of technical related issues and ensure to resolve the issues or queries over the call. Research, diagnose, troubleshoot and identify solutions to resolve customer issues. Transport facility available (Pick & Drop). Looking only for Immediate Joiners 5 days working. Core Competencies- Pleasant, professional and courteous personality. Excellent Problem Solving and Customer Service Skills Ability to think creatively and should have positive attitude. Strong analytical & Interpersonal skills Walk-in Date/ Time: 29th July - 3rd August , 12 AM onwards Interview Venue: Tech Mahindra Limited, Survey No. 62/1 A, Takshashila Building, Gate No: 1, Qutubullapur Mandal, Bahadurpally, Hyderabad - 500 043. Contact Person: M. SWATHI Tel- 7386174351","location":"Hyderabad","experience":"0 - 5 Years"},{"date":"29, 30, 31 - Jul - 2019","skills":"Technical Support, Technical Sales, Blended Process","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Stellar Information Technology Pvt. Limited, D 16, Infocity II, Sector 33, Gurugram, Haryana - 122 001","phone":"Not Provided","profile":"Technical Support Associate \nStellar Information Technology Pvt. Limited","description":"Desired Qualification, Skills & Experience: Graduate, BCA or BSC (IT) Preferred Excellent command over English language (Oral & Written) Good writing skills. Good time management skills. Willingness to work in 24/5 Shift environment 1-3 years experience out of which minimum six months experience in International technical support process is needed Soft Skills & Communication Skills A candidate must have - Good communication skills with a clear diction Ability to construct simple and sensible sentences Ability to understand spoken American English Good problem solving skills Ability to approach problems logically Strong customer service focus Ability to work under pressure Job Responsibilities- Handle Inbound calls & Outbound calls Web Support > Chat and Emails Response in defined TAT Maintain Quality benchmark Generate product sales Generate business through upsell 5 days working / Saturday Sunday fixed off/ Blended process Candidates residing in Gurgaon or willing to relocate could apply for this opening 24*5 rotational shifts month wise (in bound calls environment) 3 shift timings : (5 AM-2 PM), (12 PM-9), PM), (8 PM-5AM) For Girls : Fixed Morning Shift 8:00 am- 05:00 PM Walk-in Date: 29th July - 1st August 2019 Time: 9:00 AM - 3:00 PM Venue Details: Stellar Information Technology Pvt. Ltd. D 16, Infocity II, Sector 33, Gurugram, Haryana - 122001 Contact Person : Dinesh (HR)","location":"Gurgaon","experience":"1 - 3 Years"},{"date":"3 - Aug - 2019","skills":"Team Management Monthly Reports MS Outlook MIS Operations End User Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Cloudstrats Technologies Pvt. Limited, AA-57, Kailash Vaibhav Complex, Near Nagbaba Temple, Vikhroli (West) Mumbai","phone":"022-42151818","profile":"Desktop Support Engineer (L1/ L2) \nCloudstrats Technologies Pvt. Limited","description":"Candidate should have 1 to 3 years of experience and exposure on End user support and IT infra skills such as Desktop, Service Desk, Cloud etc. Installation or configuring desktops. Configuring Outlook/ Ms-outlook Preparation of Daily/ Weekly/ Monthly reports Handling team. Good communication skills required. Joining : Immediate Joiner Walk-in Date/ Time: 3rd August 2019, 12 PM onwards Interview Venue: Cloudstrats Technologies Pvt. Limited AA-57, Kailash Vaibhav Complex, Near Nagbaba Temple, Vikhroli (West) Mumbai Tel: 022-42151818, Ext : 3304 Mobile: 8291942825 Email : hr@cloudstrats.com","location":"Mumbai","experience":"1 - 3 Years"},{"date":"2 - Aug - 2019","skills":"Automation framework, QA Testing, Selenium, Webdriver","qualification":"B.E./B.Tech","address":"SHL (India) Private Limited, 9th Floor, Building No. 10B, DLF Cyber City, Gurgaon - 122002","phone":"Not Provided","profile":"Automation Test Engineer \nSHL (India) Private Limited","description":"Education/ Experience- BE/ B. Tech in Computer Science, Information Technology or relevant professional experience 3-5 years of experience in an IT or Business environment testing highly scalable applications Excellent communications skills interacting with technical and business audiences Any testing certification is a plus. Technical Skills- Strong Java skills Strong experience with automation using Selenium Strong understanding of basic concepts to testing principles, all types of Black/Grey Box testing Knowledge of Test management tools JIRA, QC etc. Should be hands on with sql-database Experience in Performance testing and tools like JMETER is a plus. Experience in Agile development environment is a plus. Web Services Testing/ Backend Testing: SOAP UI, POSTMAN is a plus Walk-in Date/ Time: 2nd August from 10 AM onwards Interview Venue: SHL (India) Private Limited 9th Floor, Building No. 10B, DLF Cyber City, Gurgaon - 122002","location":"Gurgaon","experience":"3 - 5 Years"},{"date":"29 - Jul - 2019","skills":"Technical Support, Customer Support, Networking","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Quick Heal Technologies Limited, 2nd Floor Shree Ganesh Classic Plot No. 6, Sr.No 35/1+2 Near Navshya Ganpati Temple Anandwalli, Gangapur Road, Nashik - 13","phone":"9325789601","profile":"Technical Support Engineer \nQuick Heal Technologies Limited","description":"Candidates with experience in Customer support / Technical Support/ Any IT related Support or good technical knowledge can apply. Must be able to communicate fluently in mentioned languages. Positive attitude, Learning Skills, Sincere Channels: Voice, Chat & Email Process Shifts: Should be able to work under rotational shift 15/7 Languages: English/ Hindi Job Location: Nashik Walk-in Date/ Time: 29th July 2019, 10 AM onwards Interview Venue: Quick Heal Technologies Limited 2nd Floor Shree Ganesh Classic Plot No. 6, Sr.No 35/1+2 Near Navshya Ganpati Temple Anandwalli, Gangapur Road, Nashik - 13","location":"Nasik","experience":"0 - 1 Years"},{"date":"29, 30, 31 - Jul - 2019","skills":".Net, ASP .Net, C# .Net","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"ApMoSys Technologies Pvt. Limited, A-105, Greenscape Technocity Shil Phata Mahape Road Next to Country Inn & Suites Mahape, Navi Mumbai - 400 701","phone":"022-41222250","profile":"Java Developer - Fresher \nApMoSys Technologies Pvt. Limited","description":"Person must have good command over programming languages like C, C++, Core Java etc. Should have excellent skills in Java - Collections, Object Oriented Programming, JQuery. Certificate in Java is mandatory CDAC certified candidates will get an added advantage. Walk-in Date: 29th July - 16th August Timings: 11 AM To 4 PM Interview Venue: ApMoSys Technologies Pvt. Limited A-105, Greenscape Technocity Shil Phata Mahape Road Next to Country Inn & Suites Mahape, Navi Mumbai - 400 701","location":"Mumbai","experience":"0 - 2 Years"},{"date":"27 - Jul - 2019","skills":"Core Java, Spring, Javascript, Spring Boot, Hibernate, Mongo/ Cassandra / NOSQL DB","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"STRAVISO India Private Limited, 6TH FLOOR, Windsor Commerce Building, Near Vadeshwar Hotel, 48 Baner Road, Pune - 411 045","phone":"020-48614595","profile":"Senior Java Developer \nStraviso India Private Limited","description":"Candidate should have overall 5 + years of development experience and a minimum of 3+ years experience as a JAVA developer building responsive websites and web applications. Jenkins build pipeline and dashboard (Setup and Config), Junit/ Mockito, Sonar Cube, Docker, PACT (Consumer contract builder) Development in Mongo/ Cassandra / NOSQL DB (with admin configuration familiarity), Spring Boot Must have an understanding of semantic, responsive, cross-browser markup. Experience with front-end web frameworks (Bootstrap, Foundation). Walk-in Date: 27th July 2019 Time: 11 am- 5 pm IST Venue: STRAVISO India Private Limited 6TH FLOOR, Windsor Commerce Building, Near Vadeshwar Hotel, 48 Baner Road, Pune - 411 045 Landmark : Above Giridhar Hotel, Opp Dominos Lane PH :7722075652/ 020-48614595 NOTE : Notice period less than 30 days can only apply","location":"Pune","experience":"4 - 9 Years"},{"date":"29, 30, 31 - Jul - 2019","skills":"Back Office Processing, Data Entry","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Vara United Private Limited, 1st Floor, Raghuleela Arcade, Vishwaroop Software Park (Above Audi Showroom), Sector 30A, Vashi, Navi Mumbai - 400 703","phone":"9075917122","profile":"Data Entry/ Process Executive \nVara United Private Limited","description":"We are having daily walk in interviews at our Vashi Office for Banking Back Office Process Executive. Candidate will be working here for Banking process under data trasaction department. Should have good typing speed and flexible to work in rotational shift. Preferably looking for Male candidates and who can work in night shift. Candidate should have completed 12th. Walk-in Date. Time: 29th July - 2nd August , 9 AM onwards Interview Venue: Vara United Private Limited 1st Floor, Raghuleela Arcade, Vishwaroop Software Park (Above Audi Showroom), Sector 30A, Vashi, Navi Mumbai - 400 703 Contact Person: Priyanka","location":"Mumbai","experience":"2 - 5 Years"},{"date":"29, 30, 31 - Jul - 2019","skills":"MS Office, Non Voice Process, Backend Operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Bamboo Movie International Private Limited, BMI, 2nd Floor, Prestige Point, No. 47 Haddows Road, Nungambakkam, Chennai - 600 006.","phone":"044-45554093","profile":"Office Assistant/ Secretary \nBamboo Movie International Private Limited","description":"Ideal candidate should have experience between 0 to 2 years. We are expecting candidate with Good Looking & Good Communication. General knowledge of computers Maintain the general filing system, file all correspondence and database maintenance. Looking for FEMALE CANDIDATES ONLY Walk-in Date/ Time: 29th July - 12th August , 11 AM onwards Interview Venue: Bamboo Movie International Private Limited BMI, 2nd Floor, Prestige Point, No. 47 Haddows Road, Nungambakkam, Chennai - 600 006. For further more details Contact: Priya(HR)@ 044-45554093","location":"Chennai","experience":"0 - 2 Years"},{"date":"27 - Jul - 2019","skills":"Java, JDBC, Spring, Servlet and JSP, Tomcat, JBoss, J2EE, JSP/JSF","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Amiti Software Technologies Pvt. Limited, 68 4th Cross Panduranganagar, Opp Adigas/ HSBC, Bannerghatta Road, Bengaluru - 560 076","phone":"Not Provided","profile":"Java Developer (Fresher) \nAmiti Software Technologies Pvt. Limited","description":"Candidate must have strong Java programming skills Excellent knowledge building scalable web applications Good knowledge of Relational DB design and Object Oriented design. Proficient with JDBC, Spring, Servlet and JSP Excellent experience with Oracle RDBMS and SQL Queries Good experience with Tomcat, JBoss, J2EE, JSP/JSF Experience with Spring Framework, JMS, iBATIS, Hibernate Excellent Communication & interpersonal Skills; Team Player. Excellent benefits such as fully paid technical courses and certifications such as Java Certification. Walk-in Date: 27th July 2019 Time: 10 AM to 3 PM Interview Venue: Amiti Software Technologies Pvt. Limited 68 4th Cross Panduranganagar, Opp Adigas/ HSBC, Bannerghatta Road, Bengaluru, Karnataka - 560 076","location":"Bangalore","experience":"0 - 1 Years"},{"date":"29, 30, 31 - Jul - 2019","skills":"Patient Care, Patient Support, Front Office","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Max Healthcare Institute Limited, Gurgaon","phone":"8800674672","profile":"Patient Care Coordinator - Front Office \nMax Healthcare Institute Limited","description":"Urgently requirement of Patient Care Coordinator for Front Office Minimum Qualification - Graduation Walk-in Date/ Time: 29th July - 2nd August , 10 AM onwards Interview Venue: Max Healthcare Institute Limited Gurgaon Contact Person - Varun Kumar Tel:- 8800674672","location":"Gurgaon","experience":"0 - 4 Years"}]}