{"Walkins":[{"date":"3, 4, 5 - Sept - 2019","skills":"Customer Service, General Administration, Customer Care","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"WNS Global Services Private Limited, 11th FL Block A2 & A3 building, DLF IT SEZ, Sector 30 NH8 Gurgaon. (Near Star Mall)","phone":"Not Provided","profile":"Backend - Admin Support \nWNS Global Services Private Limited","description":"WNS Looking for Backend - Admin Support - Freshers can also apply Educational Qualification: Any Graduate Years of experience - 1+ Year Freshers can also apply Candidate should be flexible with the shift Timings. Join on Immediate basis. Skill Required- Ability to multi-task and to work within a framework of standard processes Good communication skills (both written and verbal) Ability to grasp requirement and deliver as per understanding Proactive team oriented, flexible approach. Job Responsibility: The role involves B2B interaction, providing Administrative support (arranging, travel, filing expenses, data entry) using the client tools remotely. Walk In Details: Date - 3rd - 5th September 2019 Timings: 1:00 PM to 4:00 PM Venue Details: WNS Global Services Private Limited 11th FL Block A2 & A3 building, DLF IT SEZ, Sector 30 NH8 Gurgaon. (Near Star Mall) Contact Person: Shalini","location":"Gurgaon","experience":"0 - 3 Years"},{"date":"3, 4 - Aug - 2019","skills":"Office Management, General Administration, Front Office Operations, & Handling Complaints","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"4th Quarter Technologies Pvt. Limited, MIGSUN Mahaluxmi Metro Tower C-1, C-2, Lower Ground Floor, behind Vaishali Metro Station, Vaishali Sector 4 Ghaziabad - 201 010","phone":"8448989035","profile":"Front Office & Admin Executive \n4th Quarter Technologies Pvt. Limited","description":"Candidate should be Any Graduate with 2 to 5 years of experience in Office Management, General Administration, Front Office Operations, & Handling customer complaints. Must have excellent communication skills. Job Responsibility- 1 . EPABX / IVR Handling (Call Handling) 2. Managing all front office works ,Walk in Handling (Customers, Broker, Banker, Vendor) 3 .Handling general Administration work 4 Entry of customers details in Excel and Maintaining daily report 5 .Event Management like Holi, Diwali, New Year Etc. 6. Preparing n Verifying of Conveyance of field boys Walk-in Date/ Time: 3rd - 4th September 2019, 10 AM onwards Interview Venue: 4th Quarter Technologies Pvt. Limited MIGSUN Mahaluxmi Metro Tower C-1, C-2, Lower Ground Floor, behind Vaishali Metro Station, Vaishali Sector 4 Ghaziabad - 201 010 Contact Person: Monika (8448989035)","location":"Hyderabad","experience":"2 - 5 Years"},{"date":"5, 6, 7 - Sept - 2019","skills":"Counselling, Sales Administration, Front office operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"RK Solar Systems, Office No. B 202, 1st Floor, New Excelsior Complex, Opposite Crown Hotel, Khadki Bazar, Khadki, Pune - 411 003","phone":"Not Provided","profile":"Front Office/ Admin Executive \nRK Solar Systems","description":"Require Female Front Office Executive to handle all front office operations, Co-ordinaton with team members regarding work allotted and completion report, Handle Walk & Telephonic Customers, Work on Account ( Maintain Account Cash & Bank Expanses), Documentation work, Calling for Sales. Walk-in Date/ Time: 5th - 7th September , 10 AM onwards Interview Venue: RK Solar Systems Office No. B 202, 1st Floor, New Excelsior Complex, Opposite Crown Hotel, Khadki Bazar, Khadki, Pune - 411 003","location":"Pune","experience":"1 - 4 Years"},{"date":"3, 4, 5, 6, 7 - Sept - 2019","skills":"Job Posting placement Recruitment selection HR","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Swagatham Resource Management India Pvt. Limited, Plot No: 15, 2 A Kakkan Nagar Main Road, Ganesh Nagar, NGO Colony, Adambakkam, Chennai - 600 088.","phone":"7550081511","profile":"HR Executive/ Recruiter \nSwagatham Resource Management India Pvt. Limited","description":"We are looking for an HR Recruiter to manage our full cycle recruitment, from identifying potential hires to interviewing and evaluating candidates. HR Recruiter responsibilities include sourcing candidates online, updating job ads and conducting background checks. If you have experience with various job interview formats, including phone screenings and group interviews, and can help us recruit faster and more effectively, wed like to meet you. Language Hindi must. Walk-in Date/ Time: 3rd - 7th September , 9 AM onwards Interview Venue: Swagatham Resource Management India Pvt. Limited Plot No: 15, 2 A Kakkan Nagar Main Road, Ganesh Nagar, NGO Colony, Adambakkam, Chennai - 600 088. Feel free to call us for any clarification 7550081511/ 7397769049","location":"Chennai","experience":"0 - 1 Years"},{"date":"3, 4 - Sept - 2019","skills":"Customer Service Desktop Support Networking Remote Support Technical Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Inspirisys Solutions Limited (Formerly Accel Frontline Limited) Dowlath Towers,Second floor, Taylors Rd, Chetpet, Chennai, Tamil Nadu 600010","phone":"Not Provided","profile":"Desktop Support Engineer/ L1 \nInspirisys Solutions Limited","description":"Inspirisys hiring Desktop Support L1 position at Chennai Qualification: - BE/ B.Tech/ BSc/ BCA Experience from 1 to 2.5 Years Must have good communication & exceptional customer service skills and demeanor, along with the innovative ability to communicate with both technical and non-technical customers & clients. Hands-on experience on End-user computing like Desktops, Laptops, network, Wi-Fi devices, etc. on both Hardware & Software. Remote support and application knowledge. Softwares - OS-level troubleshooting in Win 7 & Win 10, MS Office 2016, etc., Outlook / Mail config. Windows applications troubleshooting, Windows updates failure troubleshooting. Antivirus troubleshooting. Wi-Fi Config. Video Conferencing troubleshooting Handle daily technical support activities on desktop support Basic knowledge of server Interaction, Adhering to SLAs. Identify Improvements & quick resolution on day to day IT Operations Interested candidate kindly shares updated resume to naveenkumar.t@inspirisys.com with the below details- Total Expr: Rel Expr: C.CTC: Official NP:","location":"Chennai","experience":"1 - 2 Years"},{"date":"2, 3, 4, 5, 6, 7 - Sept - 2019","skills":"technical support consultative sales outbound sales outbound calling sales process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Aegis Customer Support Services Pvt. Limited, 41, Old Lakshmi Theatre Building, Essar House, St Johns Road, Bangalore - 560042","phone":"6361275363","profile":"Technical Support Associate \nAegis Customer Support Services Pvt. Limited","description":"Eligibility Criteria:- Mix of UG 50% & Graduate (Any Stream) 50% UG with One Year of Experience Graduate with 3 Month to 1 Year and Fresher. Must possess Very Good English communication skills, and strong Hindi skill (No RTI and MTI). Clarity in speech with neutral accent. Should have problem solving attitude. Positive attitude and commitment to grow with the organization. Basic Knowledge of Computers. Core Outbound Sales Skills. Flair Sales and target driven. Voice Skills. Versant 5 assessment Good Consultative Sales Skills. Voice Portfolio 6 days a week Operations, rotational off. Salary Range Up to 19K to 26K CTC. Interested candidates are requested to come for a direct walk-in interview along with your updated resume between 10 AM to 5 PM at our office address mentioned below; Aegis Customer Support Services Pvt. Limited 41, Old Lakshmi Theatre Building, Essar House, St Johns Road, Bangalore - 560042 Contact Person: Bala-6361275363","location":"Bangalore","experience":"0 - 5 Years"},{"date":"3, 4, 5 - Sept - 2019","skills":"IT Helpdesk, Networking, Technical Support, Customer Handling","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Concentrix Business Services (India) Pvt. Limited, Level 2, D4, Manyata Embassy Business Park, Nagawara Outer Ring Road, Bangalore - 560 045","phone":"7899326333","profile":"Technical Support Engineer \nConcentrix Daksh Services India Pvt. Limited","description":"Candidate should be a Graduate / Engineer from a technical background Garduate with 4+ years of experience in technical support Should have excellent customer handling skills. CCNA or VMware is added advantage. Role & Responsibilities: Advice/educates customers within procedural guidelines to ensure a complete solution to their technology. Identifies and provides input on unique or recurring customer problems. Focuses on delivering positive customer experience. Reviews and distribute pertinent cross-functional Escalates more complex customer technical issues to senior-level support. Walk-in Date/ Time: 3rd - 5th September , 12 PM onwards Interview Venue: Concentrix Business Services (India) Pvt. Limited, Level 2, D4, Manyata Embassy Business Park, Nagawara Outer Ring Road, Bangalore - 560 045","location":"Bangalore","experience":"4 - 6 Years"},{"date":"2, 3 - Sept - 2019","skills":"Technical Support, Customer Service/ Troubleshooting","qualification":"B.E./B.Tech, Diploma","address":"Sony India Pvt Limited, A-18, Near Sarita Vihar Metro Station, Mohan Co-operative Estate, Mathura Road, New Delhi","phone":"Not Provided","profile":"Technical Support Engineer \nSony India Private Limited","description":"We are urgently looking for B.Tech/ B.E/ Diploma holder for Technical Support executive Position in our organisation (Third Party Payroll) at New Delhi Office. Will be responsible for attending calls of the customer for Technical Support To manage escalated customers Trouble shooting over phone Punching the calls in software Walk in is planned on 2nd & 3rd Sept' 2019 at 09.30 am to 12.00 pm Interview Venue: Sony India Pvt Limited, A-18, Near Sarita Vihar Metro Station, Mohan Co-operative Estate, Mathura Road, New Delhi","location":"Delhi","experience":"0 - 1 Years"},{"date":"2, 3 - Sept - 2019","skills":"Technical Helpdesk, Technical Support, Product Support","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"HCL Technologies, A-22, Sector 60, Noida","phone":"9971777986","profile":"Product Support Engineer \nHCL Technologies Limited","description":"Designation: Engineer Product Support Education: Any Technical Graduate Job Location: Noida Experience: 1-year experience in hardware troubleshooting, calling experience is preferable. Eligibility Criteria: Only Technical graduates or post graduates can apply. Minimum of 1 year experience in hardware troubleshooting is mandatory. Must have excellent spoken English skills are compulsory!! #Must be comfortable working in US shifts (Night Shifts). Please come down for a face to face Interview on 2nd - 3rd September Timings: 11:00 am to 6 pm Interview Venue: HCL Technologies, A-22, Sector 60, Noida Contact Person: Chander Mohan Contact Details: 9971777986, chander.mohan@hcl.com Kindly carry: 1.A copy of your updated resume 2.A govt. address/ Id proof Please write HR Chander Mohan on top of your resume for gate entry","location":"Noida","experience":"1 - 6 Years"},{"date":"6 - Sept - 2019","skills":"HTML, CSS or any other Front-end (CSS) frameworks, Python, Ruby, PHP, C# and .Net framework","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Ramboll India Private Limited, The Epitome, 17th Floor, Tower B, Building No. 5, DLF Cyber City, Phase III, Next to Rapid Metro Phase 2 Metro Station, Gurgaon - 122 002","phone":"Not Provided","profile":"Full Stack Developer (Php/ .Net) \nRamboll India Private Limited","description":"This role requires you to be able to solve problems in a creative way. Many of the problems that you will deal with do not necessarily have an existing solution implemented. To do so, you need to be an open-minded person with good communication skills to work collaboratively as well as independently as needed Proficiency with fundamental front-end languages such as HTML, CSS or any other Front-end (CSS) frameworks like Foundation or Bootstrap, AJAX. Familiarity with JavaScript frameworks such as React and Amber, Three js or JS-based build tools Libraries like jQuery or Backbone.js Proficiency with server-side languages such as Python, Ruby, PHP, C# and .Net framework Familiarity with database technology such as MySQL, Oracle and MongoDB, RESTful Services Familiarity with Autodesk Revit/ Tekla Navisworks API Development (not mandatory but an added advantage) Prior working experience with scripting tools like Dynamo, grasshopper etc. Walk-in Date: 6th September 2019 Time: 9:30 am to 3 pm Interview Venue: Ramboll India Private Limited, The Epitome, 17th Floor, Tower B, Building No. 5, DLF Cyber City, Phase III, Next to Rapid Metro Phase 2 Metro Station, Gurgaon, Haryana - 122 002 Contact Person: Neha Sharma","location":"Gurgaon","experience":"3 - 7 Years"},{"date":"2, 3, 4, 5 - Sept - 2019","skills":"Php/ MySQL, Lamp, Laravel","qualification":"B.E./B.Tech, MCA/PGDCA","address":"TheOS Systems Private Limited, Nirmal Chaya Apartments, 2B, 2nd Floor, Argora Housing Colony, Ranchi. Landmark: Near Sub-Post Office","phone":"Not Provided","profile":"PHP Developer \nTheOS Systems Private Limited","description":"Writing clean, fast PHP to a high standard, in a timely and scalable way. Producing detailed specifications. Troubleshooting, testing and maintaining the core product software and databases. Walk-in Date/ Time: 28th August - 5th September , 12 PM onwards Interview Venue: TheOS Systems Private Limited Nirmal Chaya Apartments, 2B, 2nd Floor, Argora Housing Colony, Ranchi, Landmark: Near Sub-Post Office","location":"Ranchi","experience":"1 - 3 Years"},{"date":"7 - Sept - 2019","skills":"Core Java/ J2EE, JDBC, SQL, Stored Procedures, Database Fundamentals and SQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"TurningPoint Software Solutions Pvt. Limited, No. 31, Ground Floor, TBR Tower, 1st Cross, New Mission Road J.C. Road, Bangalore - 560 027","phone":"9739336661","profile":"Java Developer \nTurningPoint Software Solutions Pvt. Limited","description":"Candidate should have Bachelors degree or its equivalent in computer science, information technology, engineering, or related technical field with 2 to 4 years of overall programming work experience, or any equivalent combination of education and experience. Two years of Core Java/ J2EE experience at the minimum. Good understanding of JDBC, SQL, Stored Procedures and related tools. Must have strong understanding of database design and structures. Ability to understand and construct complex database designs is required. Preferred Skills: Strong in Database Fundamentals and SQL. Good in table design and query performance tuning. Experience in web service. Exposure to Telecom domain. NoSQL Databases MongoDB will be an added advantage. Exposure to Pentaho - Kettle or any related BI tools, elastic search is an added advantage Walk-in Date/ Time: 7th September 2019, 10 AM onwards Interview Venue: TurningPoint Software Solutions Pvt. Limited No. 31, Ground Floor, TBR Tower, 1st Cross, New Mission Road J.C. Road, Bangalore - 560 027","location":"Bangalore","experience":"2 - 4 Years"},{"date":"31 - Aug - 2019","skills":"core java j2ee spring hibernate jprofiler visualvm jstack Docker","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"iBoss Tech Solutions Private Limited, D-37, Sector-63, Noida (Near Nissan Showroom)","phone":"Not Provided","profile":"Software Engineer - Java \niBoss Tech Solutions Private Limited","description":"Candidate should have 2 to 6 years hands on development experience using Core Java, J2ee, and spring, HB, Micro-Services and Oracle / MS SQL Server. Must be able to technically guide a team of minimum 2 members with excellent communication and client handling skills are required. Server-side component design, detailed technical design, development, implementation and maintenance In depth knowledge of core java. Solid on coding fundamentals e.g. Object-Oriented design, data structures and dependency injection. Micro services Architecture with container-based deployment is must. Hands-on experience in widely used third party frameworks (e.g. Spring, Hibernate, Web Services) Experience with Java Script framework like Angular, Jquery etc. Strong background Object Oriented analysis and design Hands on experience with Databases technologies preferably MS SQL Server. Walk-in Date: 31st August 2109 Reporting time- 10 AM to 2 PM Interview Venue: iBoss Tech Solutions Private Limited D-37, Sector-63, Noida (Near Nissan Showroom) **Candidates coming after 2 PM won't be considered","location":"Noida","experience":"2 - 6 Years"},{"date":"6, 7 - Sept - 2019","skills":"Java Script & Core Java, SQL/ NoSQL","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Full Creative Private Limited, Ascendas Tech Park, Pinnacle Building - Phase I, 4th Floor, CSIR Road, Taramani, Chennai","phone":"044-42666652","profile":"Software Engineer/ Java \nFull Creative Private Limited","description":"Excellent programming skills in Java Script & Core Java Write well designed & efficient codes. Ensure the designs are in compliance with specifications Should build an interface with the customers, management & the team. Proficiency in Java & JavaScript. Experience in Amazon-AWS /Google Cloud. Design & implementation experience in SQL/ NoSQL (MySQL, PostgreSQL, Google's Cloud Datastore, MongoDB) Knowledge of version control systems like GIT & TDD. Should have Good Communication skills. Walk-in Date/ Time: 6th - 7th September , 10 AM onwards Interview Venue: Full Creative Private Limited Ascendas Tech Park, Pinnacle Building - Phase I, 4th Floor, CSIR Road, Taramani, Chennai","location":"Chennai","experience":"0 - 3 Years"},{"date":"31 - Aug - 2019","skills":"Angularjs, Java, Rest, GIT, Web Technologies, Javascript, Web Application","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"WNS Global Services Private Limited, Plot No. 8A, RMZ Centennial, Kundalahalli Main Road, Whitefield, Bangalore","phone":"Not Provided","profile":"Fullstack Developer \nWNS Global Services Private Limited","description":"Person should have experience working with graphic designers and converting designs to visual elements. Understanding and implementation of security and data protection. Experience working with restful webservices. Proficient experience using advanced JavaScript libraries and frameworks such as AngularJS, VueJS, BackboneJS, ReactJS etc. Knowledge of Java/ Python. Development experience for both mobile and desktop. Should have knowledge of code versioning tools as Git, Mercurial or SVN Roles & Responsibilities: Knowledge of overall architecture of web application. Maintain quality and ensure responsiveness of applications. Collaborate with the rest of the engineering team to design and launch new features. Maintain code integrity and organization. Walk-in Date/ Time: 31st August from 11 AM onwards Interview Venue: WNS Global Services Private Limited Plot No. 8A, RMZ Centennial, Kundalahalli Main Road, Whitefield, Bangalore","location":"Bangalore","experience":"2 - 4 Years"},{"date":"31 - Aug - 2019","skills":"Java Rest Open Source Linux Software Architecture Customer Centric SOAP Android","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Atria Convergence Technologies Pvt. Limited, ACT Golden Heights, 1st Floor, 59th C Cross, 4th M Block, Near Sujatha,Rajaji Nagar, Bengaluru - 560 010","phone":"9513206011","profile":"Android Developer \nAtria Convergence Technologies Pvt. Limited","description":"Candidate should have a good experience in Android software architecture. Considerable programming experience in Android and JAVA is required. Should have an experience in developing Android TV custom launchers. They should have Good Understanding on the Live TV and Android Player concepts on Video, Audio, synching and EPG understanding. Should have a deeper understanding on AOSP (Android open source project). Should know about the Google Certification of GTS/ CTS. Develop the Setup and Settings for Android TV app and improve the quality and performance. Must have Experience with 3rd party API Integrations like DRM, EPG integrations, Live TV channels etc. Should have knowledge on Linux, REST and SOAP Framework. Behavioral Competencies- Value orientation Team working abilities Customer centricity Passion for excellence Innovation Walk-in Date/ Time: 31st August 2019, 10 AM onwards Interview Venue: Atria Convergence Technologies Pvt. Limited ACT Golden Heights, 1st Floor, 59th C Cross, 4th M Block, Near Sujatha,Rajaji Nagar, Bengaluru - 560 010","location":"Bangalore","experience":"1 - 3 Years"},{"date":"31 - Aug - 2019","skills":"Java, J2EE, SQL, HTML, CSS, JavaScript and AngularJS","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Atria Convergence Technologies Pvt. Limited ACT Fibernet Head office 8-2-618/B, Mithila Nagar, Road No. 11, Banjara Hills, Hyderabad - 500 034. Landmarks : Care Hospital-Outpatient Center & Karvy Data","phone":"Not Provided","profile":"Java Developers \nAtria Convergence Technologies Pvt. Limited","description":"We are looking for an Server Side Java developer responsible for the development and maintenance of applications. Your primary focus will be development of applications and their integration with other services along with constant eye of improvements through customer/user feedback. Required Skills- 1+ years of development experience Proficient with Linux, Java, J2EE, SQL Familiarity with HTML, CSS, JavaScript and AngularJS Experience with frameworks such as spring, SpringBoot and hibernate Experience with Eclipse IDE Familiarity with RESTful and SOAP APIs Knowledge of other web technologies and UI/UX standards Knack for benchmarking and optimization Proficient understanding of code versioning tools {{such as Git, Mercurial or SVN}} Experience with Agile and Waterfall SDLC models Walk-in Date/ Time: 31st August 2019, 10 AM onwards Interview Venue: Atria Convergence Technologies Pvt. Limited ACT Fibernet Head office 8-2-618/B, Mithila Nagar, Road No. 11, Banjara Hills, Hyderabad - 500 034 Landmarks : Care Hospital-Outpatient Center & Karvy Data","location":"Hyderabad","experience":"1 - 3 Years"},{"date":"31 - Aug - 2019","skills":"Event planning, Office Administration, Maintenance activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Indospirit Group, B-230, Okhla Industrial Area, Okhla Phase 1, New Delhi - 110020","phone":"Not Provided","profile":"Admin Executive (Female) \nIndospirit Distribution Limited","description":"Minimum Qualification: Graduation in any domain Minimum 1 year of work experience in a large organization Demonstrated ability to work in a dynamic and intense environment as a team member Hands on experience in MS Office/ Excel Job Responsibility- Facility management, including housekeeping, cafeteria, and other maintenance activities. Plan and prepare monthly reports for maintaining office infrastructure and facilities. Manage & Monitor inventory of office supplies and purchase of new materials within the allocated budget. Organize and supervise other office activities including event planning, travel desk, renovations and recycling. Walk-in Date/ Time: 31st August 2019, 11 AM onwards Interview Venue: Indospirit Group B-230, Okhla Industrial Area, Okhla Phase 1, New Delhi - 110020","location":"Delhi","experience":"1 - 3 Years"},{"date":"31 - Aug - 2019","skills":"Front Desk/ Front Office, Administrative Assistance","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Quantum BSO & Tech Private Limited, 3rd Floor, Ahad Pinnacle 5th Main, 2nd Cross, 5th Block, Koramangala Industrial Area Bangalore - 560 095","phone":"080-44066700","profile":"Administration Executive \nQuantum BSO & Tech Private Limited","description":"Qualification: Any Graduate OR Post Graduate Work Experience: 2 to 8 Years Age must be maximum of 32 yrs (Only Female Required) Must have experience as Admin Executive Must have working exp in Bangalore Preferably who speak Kannada Walk-in Date: 31st August, Saturday Time: 9:30 am to 1 pm Interview Venue: Quantum BSO & Tech Private Limited 3rd Floor, Ahad Pinnacle 5th Main, 2nd Cross, 5th Block, Koramangala Industrial Area Bangalore - 560 095 Landmark: Near Jyothi Nivas College Tel; 080-44066700","location":"Bangalore","experience":"2 - 8 Years"},{"date":"3, 4, 5 - Sept - 2019","skills":"General Administration, Back Office Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Spoors Technology Solutions India Pvt. Limited, 4th Floor, Sai Prithvi - Cyber Arcades, Above Bata Showroom, Indian Oil Petrol Bunk, Madhapur, Hyderabad.","phone":"040-40036677","profile":"Admin Executive (Male Only) \nSpoors Technology Solutions Pvt. Limited","description":"Looking for a candidate who can join immediately, Candidate should have Bike (Mandatory). and should have 4 wheeler license with all the Admin Experience. Should be able to communicate in both Hindi and English. Walk-in Date/ Time: 3rd - 5th September , 10 AM onwards Interview Venue: Spoors Technology Solutions India Pvt. Limited, 4th Floor, Sai Prithvi - Cyber Arcades, Above Bata Showroom, Indian Oil Petrol Bunk, Madhapur, Hyderabad.","location":"Hyderabad","experience":"2 - 3 Years"},{"date":"31 - Aug - 2019","skills":"Java, J2EE, SQ, HTML, CSS, JavaScript and AngularJS","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Atria Convergence Technologies Pvt. Limited, Golden Heights, 59th C Cross, 4th M Block, Rajajinagar, Bangalore - 560 010","phone":"9513206011","profile":"Java Developer \nAtria Convergence Technologies Pvt. Limited","description":"We are looking for an Server Side Java developer responsible for the development and maintenance of applications. Your primary focus will be development of applications and their integration with other services along with constant eye of improvements through customer/user feedback. You will be working alongside other engineers and developers working on different layers of the infrastructure. Required Skills- 1+ years of development experience Proficient with Linux, Java, J2EE, SQL Familiarity with HTML, CSS, JavaScript and AngularJS Experience with frameworks such as spring, SpringBoot and hibernate Experience with Eclipse IDE Familiarity with RESTful and SOAP APIs Knowledge of other web technologies and UI/UX standards Interview Venue: Atria Convergence Technologies Pvt. Limited Golden Heights, 59th C Cross, 4th M Block, Rajajinagar, Bangalore - 560 010","location":"Bangalore","experience":"1 - 3 Years"},{"date":"31 - Aug - 2019","skills":"C C++ Java JDBC Python, CSS, Javascript","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Beovolytics Computing Pvt. Limited, Grand Plaza, 58 Geetha Hall Road, Opp : Railway Station, Behind Cheran Towers, Coimbatore -18","phone":"9176064081","profile":"C/ C++/ Java Developer \nBeovolytics Computing Pvt Limited","description":"Candidate should have good analytical and problem solving skills. Design, build, maintain efficient, reusable, and reliable source code. Independently analyze, solve issues in real time, providing problem resolution end-to-end. Willing to work on MERN (JavaScript) Stack Walk-in Date/ Time: 31st August , 10 AM onwards Interview Venue: Beovolytics Computing Pvt Limited Grand Plaza, 58 Geetha Hall Road, Opp : Railway Station, Behind Cheran Towers, Coimbatore -18","location":"Chennai, Coimbatore","experience":"0 - 1 Years"},{"date":"30, 31 - Aug - 2019","skills":"Core Java, User Experience, Design, Opencart, Software Testing, PHP, HTML","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Poorvika Mobiles Private Limited, AGR Platina, No. 32, Developed Plot NP (Near Jaya TV) , SIDCO Industrial Estate Ekkaduthangal, Chennai - 600 032","phone":"7708055855","profile":"Software Developer/ Tester \nPoorvika Mobiles Private Limited","description":"Candidate should be BE/ B.Tech/ M.Tech or MCA with 1 to 5 years of experience in Core Java, User Experience, Design, Opencart, Software Testing, PHP, HTML, User Interface Designing, SQL Server, Core PHP Job Responsibilities- Designing, implementing and managing software programs. Testing and evaluating new programs. Identifying areas for modification in existing programs and subsequently developing these modifications. Writing and implementing efficient code. Developing quality assurance procedures. Deploying software tools, processes and metrics. Maintaining and upgrading existing systems. Walk-in Date/ Time: 30th August - 14th September , 11 AM onwards Interview Venue: AGR Platina, No. 32, Developed Plot NP (Near Jaya TV) , SIDCO Industrial Estate Ekkaduthangal, Chennai - 600 032 Phone No: 7708055855","location":"Chennai","experience":"1 - 5 Years"},{"date":"2, 3, 4, 5, 6 - Sept - 2019","skills":"Php, MySQL Javascript, Python, CSS, Html5","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Galore Networks Private Limited, L-1, RAM, Guindy Industrial Estate, Guindy, Chennai - 32","phone":"9176609603","profile":"PHP Developer \nGalore Networks Private Limited","description":"Galore Networks Private Limited, is looking for PHP Application Developer with 2+ years of experience. Programming Skills: PHP, Perl, Python, and Ruby Markup & Style Sheet language: HTML5, Javascript & CSS UI Frameworks: Bootstrap, JQuery Database skills: MySQL, MongoDB Operating system: Linux , Windows Immediate Joiners are preferred. Interested candidates can directly walk-in to below mentioned address: Date: 31st August - 6th September , 11 AM onwards Galore Networks Private Limited, L-1, RAM, Guindy Industrial Estate, Guindy, Chennai - 32 0r share across your CV to recruitment@ga-lore.com Contact Person: Udaya - 9176609603","location":"Chennai","experience":"2 - 5 Years"},{"date":"31 - Aug - 2019","skills":"Regression Testing, Rest, Unit Testing, Automation Testing, Selenium, Acceptance Testing","qualification":"B.E./B.Tech","address":"Altran, Tower 5, Ground Floor, Unitech Infospace SEZ, Tikri, Sohna Road, Sector 48, Gurugram - 122 001","phone":"Not Provided","profile":"Automation Test Engineer \nAltran Technologies India Pvt. Limited","description":"We have an excellent opening for Test Automation Engineer in one of our new project. If you would like to take up this opportunity and want to be part of Altran family (formerly Aricent Technologies) please come and attend the evaluation process at our Gurgaon office. Work Experience: 1-2 Years Job Location: Gurgaon Candidate must have strong knowledge on SDLC and STLC Concepts. Strong knowledge on Automation Testing (Selenium & JAVA). Hands on experience on different kinds of testing like Functional testing, Unit testing, Regression Testing, System Acceptance Testing Date & Time : Saturday, 31st Aug 2019 Timings: 10.00 AM to 2.00 PM Venue Details : Altran, Tower 5, Ground Floor, Unitech Infospace SEZ, Tikri, Sohna Road, Sector 48, Gurugram - 122 001 Contact Person : Meenakshi Kindly carry copy of valid ID proof (PAN/ Aadhaar/ Passport/ DL) and updated resume.","location":"Gurgaon","experience":"1 - 2 Years"},{"date":"31 - Aug - 2019","skills":"open source Javascript php software engineering mysql sql server","qualification":"B.E./B.Tech, MCA/PGDCA","address":"NetEdge Computing Solutions Pvt. Limited, C-56/39 NetEdge Tower Sector-62, Noida - 201 301","phone":"70427-94831","profile":"Software Engineer (PHP/ Open Source) \nNetEdge Computing Solutions Pvt. Limited","description":"The person must have : 1. Experience in Development using PHP & Javascript 2. Experience in MySQL & other open source technologies. 3. He/She must have orientation towards quality & customer satisfaction. The Person Will be Responsible for: -Coding & development of programs / modules -Timely delivery of programs & projects to customers -Ability to work in a team environment -Must meet tight deadlines & work on several projects simultaneously Walk-in Date/ Time: 31st August 2019, 11 AM onwards Interview Venue: NetEdge Computing Solutions Pvt. Limited C-56/39 NetEdge Tower Sector-62, Noida - 201 301","location":"Noida","experience":"2 - 3 Years"},{"date":"31 - Aug - 2019","skills":"Software Testing, Selenium, Manual Testing, API Testing, Database Testing SQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"IBoss Tech Solutions Private Limited, D-37, Sector- 63, Noida (Landmark- Nissan Showroom)","phone":"022-71016246","profile":"QA/ Testing Engineer \nIBoss Tech Solutions Private Limited","description":"Candidate should have 1 to 3 years experience in software quality assurance and testing of mobile and web cloud-based systems. Must have working experience of 1 to 2 years as Manual Tester. Must have exposure in Database Testing and API Testing. Able to produce reports on QA tools as well as working knowledge of MS Word, Power point and Excel Able to mature team on QA best practices Work closely with development and business team to understand requirement to ensure end-to- end quality assurance of software product builds Must Have Skills : -Manual Testing -Database Testing (SQL) -Good verbal and written communication Good to Have Skills : -Automation (Selenium framework) -Performance/ Load Testing (JMeter) Walk-in Date/ Time: 31st August 2019, 10 AM onwards Interview Venue: IBoss Tech Solutions Private Limited D-37, Sector- 63, Noida (Landmark- Nissan Showroom)","location":"Noida","experience":"1 - 3 Years"},{"date":"2 - Sept - 2019","skills":"PHP, Codeigniter, Oops, Ajax","qualification":"B.Sc, BCA/BCS, B.E./B.Tech, Diploma","address":"XS Infosol Private Limited, C-34, Ist Floor Near Nirulas Hotel Sector -02, Noida - 201 301. Nearest Metro Station -Noida Sector -15","phone":"9953007902","profile":"PHP Developer \nXS Infosol Private Limited","description":"Expertise in PHP Frameworks and good technology exposure of Codeigniter/ Core Php. Excellent knowledge of PHP5, MySQL, Ajax, jQuery, Javascript, HTML5, CSS3, XML, Scripting and Database Administration. Must have sound understanding of OOPs. Strong Cross-Browser HTML5/ CSS3 skills are required Walk-in Date/ Time: 26th August - 2nd September , 11 AM onwards Interview Venue: XS Infosol Private Limited C-34, Ist Floor Near Nirulas Hotel Sector -02, Noida - 201 301 Nearest Metro Station -Noida Sector -15","location":"Noida","experience":"0 - 5 Years"},{"date":"31 - Aug - 2019","skills":"Test Engineering, Test Data, Usability Testing, Web Services Testing, Software Testing, Test Scenarios","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Acidaes Solutions Private Limited, B2, Plot 2 Tower 1, Nr Indus Valley School, Block B, Industrial Area, Sector 62, Noida - 201 309","phone":"Not Provided","profile":"Software Testing Engineer \nAcidaes Solutions Private Limited","description":"Educational Qualification: BE/ B.Tech/ MCA/ ME/ M.Tech First division (60%) in all the academic years. Candidate should have 1 to 3 year of experience in automation software testing environment is a must using Telrik Automation (preferred), QTP. Knowledge on CRM product will be added advantage , but is not mandatory. Technical and Other Skills- Knowledge of testing tools Good communication skills Responsibilities & Duties: A Software Tester or Quality Analyst must have a deep understanding of testing the application/software and possess a strong interest in technology and its advancement . Walk-in Date/ Time: 31st August from 9 AM onwards Interview Venue: Acidaes Solutions Private Limited B2, Plot 2 Tower 1, Nr Indus Valley School, Block B, Industrial Area, Sector 62, Noida","location":"Noida","experience":"1 - 3 Years"},{"date":"31 - Aug - 2019","skills":"General Administration, Front Desk, Security, Administrative Support","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Xavient Information Systems, Plot No. 54 Noida SEZ Phase 2, Noida","phone":"Not Provided","profile":"Software Testing Engineer \nXavient Software Solutions India Pvt. Limited","description":"Person must have expertise in Telecom testing on Wireless applications and devices for any Telecom service provider. Working experience on different telecom billing/ charging systems like SAP Convergent Charging (SAPCC), Service Oriented Architecture (SOA) system. Proficient around OSS/ BSS OR mediation Zone, Rating System , Wireless application provisioning, E2E functional flow Good to have experience in Web Services Testing using SOAP protocol Must have experience in Restful API with XML and JSON Demonstrate hands on experience on QC or JIRA Should have complete awareness of Onshore-Offshore delivery Model Working knowledge in UNIX and SQL Well versed with Agile methodology Clear and complete written communication (documenting issues) Nice to have ISTQB certification Walk-in Date/ Time: 31st August 2019, 10 AM onwards Interview Venue: Xavient Information Systems Plot No. 54 Noida SEZ Phase 2, Noida","location":"Noida","experience":"4 - 9 Years"},{"date":"30, 31 - Aug - 2019","skills":"Technical Support, Software Testing, Manual Testing","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Talent Times Private Limited, 7-1-617/A, Third Floor, unit # 305, Imperial Towers, Ameerpet, South India Shopping Mall Building Hyderabad, Telangana - 500 016","phone":"8367788879","profile":"Software Tester/ Support - Fresher \nTalent Times Private Limited","description":"Looking for Fresher's / 0- 1 year of experience, Any Graduate/ B.E/ B.Tech/ MCA. Responsible for software testing, product implementation, Bug fixing,minor application issues and any adhoc requirements from client. Salary: INR 1,00,000 - 1,25,000 PA Including PF, ESI, Insurance, Professional Tax Walk-in Date/ Time: 22nd August - 30th September , 10 AM onwards Interview Venue: Talent Times Private Limited 7-1-617/A, Third Floor, unit # 305, Imperial Towers, Ameerpet, South India Shopping Mall Building Hyderabad, Telangana - 500 016 Phone No. 8367788879","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"30, 31 - Aug - 2019","skills":"QA Testing, Software Testing, Automation Testing, Test Case Execution","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Smartconnect Technologies Pvt. Limited, 715 & 716, 7th Floor, B Wing, Lodha Supremus II, Tower South, Road # 22, Wagle Estate, Mumbai, Thane, Maharashtra - 400 604","phone":"9082515883","profile":"Software Tester/ Quality Analyst \nSmartconnect Technologies Pvt. Limited","description":"We are looking for an experienced Quality Analyst. The candidate will be expected to create and manage manual and automation testing for Mobile and Web Applications. Candidate should have proven experience of more than 3 years as a QA tester or similar role. Must have good experience in QA methodology and Testing Automation. Review and analyze system specifications Collaborate with Product Managers and QA to develop effective strategies and test plans Execute test cases (manual or automated) and analyses results Evaluate product code according to specifications Create logs to document testing phases and defects Report bugs and errors to development teams Walk-in Date/ Time: 30th - 31st August 2019, 10 AM onwards Interview Venue: Smartconnect Technologies Pvt. Limited 715 & 716, 7th Floor, B Wing, Lodha Supremus II, Tower South, Road # 22, Wagle Estate, Mumbai, Thane, Maharashtra - 400 604","location":"Mumbai","experience":"3 - 8 Years"},{"date":"2 - Sept - 2019","skills":"java c++ php python software engineering web crawling","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Vaco Binary Semantics, Plot No.15, Sector18, Electronic City, Gurgaon, Haryana - 122 015","phone":"Not Provided","profile":"Software Engineer - PHP/ C++ \nVaco Binary Semantics LLP","description":"Vaco Binary Semantics is hiring Software Engineer for one of its client for Gurgaon location!! Preferable B.Tech / MCA or other Graduate in Computer Science with good academics with strong hands on experience on development (preferably Python or JS or Php or C++), other can also be considered. Must have strong analytical, logical reasoning and problem-solving skills. Should have good communication skills Immediate joiner will be preferred. Interested candidates may directly come for F2F interview on 2nd September, 19 (Monday) at below mention address from 10:00 AM to 5 PM Vaco Binary Semantics Plot No.15, Sector18, Electronic City, Gurgaon, Haryana - 122 015 Landmark - at Aricent Lane","location":"Gurgaon","experience":"3 - 6 Years"},{"date":"30, 31 - Aug - 2019","skills":"functional testing load testing performance testing Software Testing manual testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Aptron Solution Private Limited, B-10, Near by Sector 15 Metro Station Noida","phone":"7065390111","profile":"Software Tester/ QA - Manual \nAptron Solutions Private Limited","description":"Candidate should have 0 to 1 years of experience in Manual Testing Should have experience in creating Test Plans, Test scripts, Test cases Should have experience in web and mobile apps testing. Proper knowledge of different test methodology Walk-in Date/ Time: 28th August - 3rd September , 11 AM onwards Interview Venue: Aptron Solution Private Limited B-10, Near by Sector 15 Metro Station Noida","location":"Noida","experience":"2 - 5 Years"},{"date":"29, 30, 31 - Aug - 2019","skills":"Front desk, Facility administration, facility management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Lynks Logistics Limited, 2nd Floor, 108A, Venkatachalam Street, Dr. Radhakrishnan Salai, Mylapore, Chennai - 600 004.","phone":"044-66723400","profile":"Admin/ Front Office Executive \nLynks Logistics Limited","description":"Educational Qualification: Any Graduate Work Experience: 2+ years Gender: Female Only Location: Chennai Job Responsibilities- Responsible for managing front desk operations Responsible for day to day Admin activities Supervision of other Admin and House Keeping staff Travel reservations for Office staff Walk-in Date/ Time: 29th - 31st August , 10 AM onwards Interview Venue: Lynks Logistics Limited 2nd Floor, 108A, Venkatachalam Street, Dr. Radhakrishnan Salai, Mylapore, Chennai - 600 004. Telephone : 044-66723400","location":"Chennai","experience":"2 - 6 Years"},{"date":"28, 29, 30, 31 - Aug - 2019","skills":"TESTING/ JAVA/ PHP Programming, OOPS Concept","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Secret Technologies India (VMS Group), Office No.302, Amit Samruddhi, Opposite Balgandharva Rang Mandir, Behind Arrow Showroom, J. M. Road, Pune - 411 004","phone":"020 25530099","profile":"Software Developer (Testing/ Java/ Php) \nSecret Technologies India (VMS Group)","description":"Qualification: Any Graduate/ B.E/ B.Tech/ MCA/BCA/ BSc/ MSc (Comp) Work Experience: 0 to 3 Years Job Location: Pune Responsibilities & Duties: Strong knowledge of TESTING/ JAVA/ PHP programming required. Should have knowledge of basic Programming languages like C, Java and any database Strong knowledge of OOPS Concept. Should have a fair knowledge of entire SDLC. Required Experience, Skills: Should have knowledge of basic Programming languages like C, Java and any database Strong knowledge of OOPS Concept . Should have a fair knowledge of entire SDLC, STLC. Good analytical and problem solving ability. Detail orientated with excellent written and verbal communication skills. Direct Walk-in for the Interview on weekdays Date-26th August to 15 September Timing 10.00 AM to 4 .30 PM Venue: Secret Technologies India (VMS Group), Office No.302, Amit Samruddhi, Opposite Balgandharva Rang Mandir, Behind Arrow Showroom, J. M. Road, Pune - 411 004 Meet - Mr. Rahul MOB : 7066147637 TEL 020 25530099 Email: info@secrettechnologiesindia.com rahulvms143@gmail.com","location":"Pune","experience":"0 - 3 Years"},{"date":"30 - Aug - 2019","skills":"Administration Life Insurance Sales Operations Front Office Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Kotak Mahindra Life Insurance Company Limited, Unit No. 302, 3rd floor, SAI HERITAGE, Tilak Road, Ghatkopar (East), Mumbai , Maharashtra - 400 077","phone":"022-660-57177","profile":"Administration Executive \nKotak Mahindra Life Insurance Company Limited","description":"Graduate with minimum 6 months of experience in Administration Department Pleasant personality with good spoken and written English language Good PC operating knowledge and good excel knowledge To be ready to work from the front office Job Responsibilities : Managing Front Office / reception To take care of Housekeeping operations Manage security operations at branch Fulfill and maintain stationery stock Ensure smooth Tea / Coffee vending machine operations Ensure smooth Drinking water dispenser operations Take care of Courier services Job Location : Ghatkopar Interview Date : 30th August 2019 Time : 11:00 AM - 3:00 PM Interview Venue : Kotak Mahindra Life Insurance Company Limited Unit No. 302, 3rd floor, SAI HERITAGE, Tilak Road, Ghatkopar (East), Mumbai , Maharashtra - 400 077 Contact Person : Parash Nagar Interested candidates can send their resume on kli.linette-dsouza@kotak.com or call us on 022-660-57177.","location":"Mumbai","experience":"1 - 7 Years"},{"date":"29, 30 - Aug - 2019","skills":"Front Office Acvtivities, Facility Management, General Administration","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"ANAROCK Property Consultants Pvt. Limited (Formerly Jones Lang LaSalle Residential Pvt. Limited) 1002, 10th Floor, B Wing, ONE BKC, G Block Bandra Kurla Complex, Bandra East, Mumbai 400 051","phone":"022-42934293","profile":"Front Office/ Finance Coordinator \nAnarock Property Consultant Pvt. Limited","description":"Urgent opening for the post of Front office cum Admin Executive for Real Estate Company. Candidate must have excellent communication and good Personality. Should be able to handle both the role as Front office and Admin. Must be willing to work for 6 days a week. Female candidates preferred Walk-in Date/ Time: 29th August - 30th August , 10 AM onwards Interview Venue: ANAROCK Property Consultants Pvt. Limited (Formerly Jones Lang LaSalle Residential Pvt. Limited) 1002, 10th Floor, B Wing, ONE BKC, G Block Bandra Kurla Complex, Bandra East, Mumbai 400 051","location":"Mumbai","experience":"2 - 3 Years"},{"date":"28, 29 - Aug - 2019","skills":"ASP .Net, MVC, SQL","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Nexsus Business Solutions Pvt. Limited, Everest Nivara Infotech Park - I, 803, Plot No. D-3, MIDC, Navi Mumbai - 400705","phone":"022 67410357","profile":"Trainee Developer (ASP .Net) \nNexsus Business Solutions Pvt. Limited","description":"Work Location - South Mumbai B.E/ B.Tech/ MCA/ B.Sc (IT) Good knowledge of ASP .Net Exposure to MVC, SQL Should have done certification course in ASP .Net Walk-In Date: 28th/ 29th AUG, 2019 Time: Between 10 am to 5 pm Interview Venue: Nexsus Business Solutions Pvt. Limited Everest Nivara Infotech Park - I, 803, Plot No. D-3, MIDC, Navi Mumbai - 400705 Contact No. - 022 67410357 E-Mail ID - sonal.tandon@nexsussolutions.com","location":"Mumbai","experience":"0 - 1 Years"},{"date":"31 - Aug - 2019","skills":".Net, MVC, Web API, C#, Entity Framework, Ado .Net","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Agile Cockpit Software Pvt. Limited, 5th Floor Ocus Quantum, Sector 51 Gurgaon, Haryana - 122 003","phone":"Not Provided","profile":".Net Developer \nAgile Cockpit Software Pvt. Limited","description":"Person must be very strong in OOPS concepts and Web applications (MVC, Web API, C#, Entity Framework, Ado.net). Must have good hands on experience on Design Patterns and SOLID Principles. Should be able to understand and develop Web Architecture Walk-in Date/ Time: 31st August 2019, 9 AM onwards Interview Venue: Agile Cockpit Software Pvt. Limited 5th Floor Ocus Quantum, Sector 51 Gurgaon, Haryana - 122 003","location":"Gurgaon","experience":"3 - 7 Years"},{"date":"30, 31 - Aug - 2019","skills":".NET, SQL, Web Services, WCF and Windows Services, Web API, MVC, jQuery, HTML5","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"PayMate India Private Limited, 111 - A Wing Sundervilla, S V Road, Next to Vijay Sales Santacruz West, Mumbai - 400 054","phone":"Not Provided","profile":"Software Engineer - .Net \nPayMate India Private Limited","description":"Required Skills: ï\u0081\u0090 .NET 4.0 and above, SQL 2012 and above ï\u0081\u0090 Web Services, WCF and Windows Services ï\u0081\u0090 Web API, MVC, jQuery, HTML5 ï\u0081\u0090 Must follow SOLID principle and design pattern ï\u0081\u0090 Good knowledge on Finance domain and Payment Gateway will be add on Responsible for development & coding of various software applications as directed by the project lead Apply his/her knowledge of software development processes and contribute in developing functional specs, design specifications Unit and Integration Walk-in Date/ Time: 30th - 31st August , 11 AM onwards Interview Venue: PayMate India Private Limited 111 - A Wing Sundervilla, S V Road, Next to Vijay Sales Santacruz West, Mumbai - 400 054 Landmark: Above ICICI Bank","location":"Mumbai","experience":"2 - 5 Years"},{"date":"28, 29, 30, 31 - Aug - 2019","skills":"Asp .Net, C# , Jquery, WCF, Webservices / Web Api & SQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Karvy Fintech Private Limited, (Formerly known as KCPL Advisory Services Private Limited) Karvy Selenium Tower B, Plot Nos. 31 & 32 Financial District Nanakramguda, Serilingampally Mandal Hyderabad - 500 032","phone":"Not Provided","profile":".Net Developers \nKarvy Fintech Private Limited","description":"Minimum 3 to 5 years of hands-on development experience with the following technologies: ASP Dot NET / VB Dot NET projects, Web services and SQL server. Hands on experience in design using object oriented programming principles. Extensive experience in developing N-tier applications. Good experience with reporting tools. Mandatory Skills required for a different positions- 1. Asp .Net, C# , Jquery, WCF, Webservices / Web Api & SQL 2. Asp & C# 3. MVC, Web Services & Jquery Walk-in Date/ Time: 28th August - 3rd September , 11 AM onwards Interview Venue: Karvy Fintech Private Limited (Formerly known as KCPL Advisory Services Private Limited) Karvy Selenium Tower B, Plot Nos. 31 & 32 Financial District Nanakramguda, Serilingampally Mandal Hyderabad - 500 032 Contact Person : Rupya.V","location":"Hyderabad","experience":"3 - 5 Years"},{"date":"30 - Aug - 2019","skills":"C#, Winforms, ADO.Net- Entity Framework, LINQ, WCF","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"ANTWORKS, 2nd Floor, Core 2, Module No. 2L, Pacifica Tech Park, No.23 Rajiv Gandhi Salai, OMR Navalur, Chennai-600130","phone":"7550193152","profile":".Net Developer \nMaples Imaging Solution Private Limited","description":"Skills Required: Proficient in C#, Winforms, ADO.Net- Entity Framework, LINQ, WCF Strong understanding of OOPS & Data structures Hands-on experience in writing reusable C# libraries and DLL Familiarity with Relational Databases and SQL Microsoft SQL Server 2008 or 2012- Stored Procedures, Functions, Triggers Creating database schemas that represent and support business processes Proficient understanding of code Versioning tools -Git, SVN Walk-in Date : 30th August (Friday) 2019 Time : 10.00 AM - 4.00 PM ANTWORKS 2nd Floor, Core 2, Module No. 2L, Pacifica Tech Park, No.23 Rajiv Gandhi Salai, OMR Navalur, Chennai-600130 Landmark Navalur Bus Stop (or) Near to Hotel Saravana Bhavan (Navalur) Contact Person Karthik Samy (Mobile - 7550193152) Things to Carry : Updated Profile Photocopy of Any ID Proof (Pancard (or) Driving License (or) Aadhar Card (or) Passport)","location":"Chennai","experience":"3 - 8 Years"},{"date":"31 - Aug - 2019","skills":"Advanced Java, Struts, Hibernate JQuery, Manual/ Automation Testing","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Netcomm Labs Private Limited, 219, 2nd Floor, NOIDA ONE- Tower B, B-8, Industrial Area, Sector 62, Noida (UP) - 201309","phone":"9775057646","profile":"Senior .Net Developer \nNetcomm Labs Private Limited","description":"We are looking at enhancing our .NET Development Team and look forward to meet candidates who have worked on ASP.NET, MVC and Angular technologies You should have specialized within .NET with or without MVC Development. Must know- Writing store procedures in database Experience of 3-4 projects for ERP / HR , Financial, Banking Industries in Domestic India Market will be an added advantage. Min 3+ Years of exp. as .Net Developer . Should have worked on Web Application projects of enterprise level involving HTML, CSS, Stored Procedure, Angular JS JavaScript & JQuery. Require MVC knowledge with C#, Asp.Net, & MS SQL Worked on design, coding, & unit testing Debugging of enhancements & bug fixing WALK IN directly at our office on 31st Aug,Saturday between 10 am-5 pm","location":"Noida","experience":"5 - 5 Years"},{"date":"28, 29, 30 - Aug - 2019","skills":"ASP.Net C#, HTML 5, CSS, Java Script, AngularJS, jQuery and Bootstrap","qualification":"B.E./B.Tech, MCA/PGDCA","address":"StraViso India Private Limited, Teerth Technospace, No. B-204 & B 204 A Second Floor, Survey No. 103 Hissa No. 2 to 14, Village Baner, Taluka Haveli, Dist Pune - 411 045","phone":"7722075652","profile":".Net Developers \nStraViso India Private Limited","description":"Seeking full stack .net developer with over all 5 years application development experience with 1 -3 years in following technologies- Responsive Web design, ASP.Net C#, HTML 5, CSS, Java Script, AngularJS, jQuery and Bootstrap RESTful API Web services and microservices using C# and object-Oriented programming. Chatbot development with Microsoft Bot Frame work and Microsoft Cognitive services. MySQL, Mongo DB, Cosmos DB, MSSQL and Oracle Database. Must have excellent Communication and Soft Skills. Bachelors degree in Business, Engineering, Computer Science or other related analytical or technical disciplines, or at least four (3) years related experience. Walk-in Date: 27th - 30th August 2019 Time: 11 am to 4pm Interview Venue: StraViso India Private Limited Teerth Technospace, No. B-204 & B 204 A Second Floor, Survey No. 103 Hissa No. 2 to 14, Village Baner, Taluka Haveli, Dist Pune - 411 045 Landmark: Behind Mercedes benz showroom FRONT OFFICE: 7722075652/ 7875053960 NOTE : Notice period less than 30 days can only apply","location":"Pune","experience":"4 - 9 Years"},{"date":"28, 29 - Aug - 2019","skills":"Bootstrap/ Angular/ PHP/ Java, HTML5.0 and CSS3","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Tech Mahindra Limited, SEZ, Tower 1, Opp. to Ananth Technologies, Beside Oracle, Hi-Tech City, Madhapur, Hyderabad.","phone":"Not Provided","profile":"UI Developer - .Net , Java \nTech Mahindra Limited","description":"Tech Mahindra is hiring for Internship of 3 months for UI Designer/ Developer , .Net , Java positions from 26th to 29th August' 2019. Note: Strictly candidates will not allowed after 11:00 am. Eligibility: Should be trained in the below mentioned skills. Skills Required: Good knowledge on web scripting. Such as HTML5.0 and CSS3 Good knowledge on .Net framework, Win Applications, ASP .NET Web applications Basic idea on Java Script. Added advantage:Idea on Bootstrap/ Angular/ PHP/ Java Should be ready to work in any shift. Interested candidates can directly walk-in to the below mentioned address. Tech Mahindra Limited, SEZ, Tower 1, Opp. to Ananth Technologies, Beside Oracle, Hi-Tech City, Madhapur, Hyderabad. Contact Person: Monika","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"29, 30 - Aug - 2019","skills":"Software Testing, White box, Black Box testing","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"TechBlocks - C/O ZapDesk, Raj Classic, 7/113, 1st Main, Dr Rajkumar Road, Near Axis Bank, Rajaji Nagar, Bengaluru.","phone":"Not Provided","profile":".Net Developer \nTechblocks Consulting Private Limited","description":"We have a walk-in drive for the role of .Net Developer for Bangalore location. Looking for candidates who can join on or before 20th September, 2019. Minimum of 15 years of formal education - Graduate / Post Graduate in Computer Science / Information Technology. Professional work experience of 3 to 5 years. Technical Skills: Should have prior experience in design, develop and maintaining .Net based web applications within all phases of the Software Development Life Cycle (SDLC) Should have worked on complex, multi-tiered architectural applications Should have Experience of Object-Oriented programming practices (SOLID principles, Design pattern) Should have experience with the process of choosing from the design patterns and platforms and should be able to convey the merits and demerits of these to the team Thursday, 29th August - Between 10 AM to 6 PM Friday, 30th August - Between 10 AM to 3 PM Address: TechBlocks - C/O ZapDesk, Raj Classic, 7/113, 1st Main, Dr Rajkumar Road, Near Axis Bank, Rajaji Nagar, Bengaluru. Note: Interested candidate please send us your resumes and availability as this is specific invite only drive. Candidates without an invite won't be eligible for the interview process.","location":"Bangalore","experience":"3 - 5 Years"},{"date":"7 - Sept - 2019","skills":"Asp .Net, MVC, Jquery, SQL, Angularjs (Angular preferred)","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Netsmartz Infotech (India) Pvt. Limited, Plot No. 10, Netsmartz Infotech, Netsmartz House, Chandigarh, IT Park.","phone":"8360446754","profile":".Net Professionals \nNetsmartz Infotech (India) Pvt. Limited","description":"Netsmartz is Conducting a Walk-In-Interview for .Net Professionals in IT Park, Chandigarh. Work Experience :- 2 to 8 years Key Responsibilities- 1. Self-sufficient to understand requirements of the project. 2. Analyze the requirements and give estimates for development. 3. Do proper Unit testing of the work being delivered. 4. Make sure due dates are met. Key Skills/ Abilities- 1. Asp .Net, MVC (Mandatory), Jquery, SQL, Angularjs (Angular preferred). 2. Concept of OOPs should be crystal clear. 3. Good programming skills in C#. 4. Good knowledge of REST / SOAP web services. 5. Knowledge of any frontend development technologies like Angular. 6. Excellent communication skills.","location":"Chandigarh","experience":"2 - 8 Years"},{"date":"31 - Aug - 2019","skills":"Java/ J2EE, and Spring, HTML/ XHTML, CSS, AJAX, JavaScript Frameworks","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Atos Global IT, RMZ Centennial, ITPL Main Road, B Block, EPIP Zone, Whitefield, Bengaluru, Karnataka - 560 048","phone":"Not Provided","profile":"Java Full Stack Developer \nAtos Syntel Private Limited","description":"Candidate should have 3 to 10 years of work experience in Java, Web development. Demonstrated experience in Agile development, application design, software development, and testing. Must have expertise with Java/ J2EE, and Spring Expertise with HTML/ XHTML, CSS, AJAX, JavaScript Frameworks such as REACT/ Redux Expertise in objected oriented analysis and design across a variety of platforms Expertise with building RESTful APIs Thorough understanding of XML, JSON, Web Service technologies, and data structure fundamentals Experience with adaptive and responsive development techniques Ability to effectively communicate with internal and external business partners Experience with a broad range of software languages and payments technologies is a plus. Interview Date: 31st August 2019 Timings: 10.00 am to 2.00 pm Interview Venue: Atos Global IT RMZ Centennial, ITPL Main Road, B Block, EPIP Zone, Whitefield, Bengaluru, Karnataka - 560 048 Contact person: Narashiman","location":"Bangalore","experience":"3 - 10 Years"},{"date":"26, 27, 28, 29, 30 - Aug - 2019","skills":"Technical support, Customer Support, Chat Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Amazon Development Centre (India) Pvt. Limited, 6th Floor in Tower 1 of Laxmi Infobahn Private Limited, SEZ Survey No. 107(P), Kokapet Village, Gandipet Mandal, Ranga Reddy District","phone":"9818176604","profile":"Technical Support Associate (VTS) \nAmazon Development Centre (India) Pvt. Limited","description":"Virtual Technical Support (VTS) - It is a Work from Home model for India D2 VTS which deals with Devices & Digital content. VTS associates are expected to work from a home location approved by Amazon for all scheduled hours. It is the responsibility of the associates to ensure uninterrupted internet connectivity and work-like environment at home location so that associates can deliver their best in terms of productivity and quality. Qualifications required Minimum qualification is 10 + 2. Any graduate/ PG is eligible to apply Desired skills: Action oriented, self-disciplined and organized Effective time management skills and ability to prioritize work time to ensure productivity and department standards Ability to communicate clearly with both internal and external customers Good comprehension skills - ability to clearly understand and address customer issues appropriately Interview Date: 26th to 30th August 2019 (Monday- Friday) time: 10.30 am to 2 pm Venue Details: Amazon Development Centre (India) Pvt. Limited 6th Floor in Tower 1 of Laxmi Infobahn Private Limited SEZ Survey No. 107(P), Kokapet Village, Gandipet Mandal, Ranga Reddy District Contact the HRs Sruthi and Abhay to schedule your interview- Sruthi (8328065891), Abhay (9818176604 / 7011328383) & IVR Support (9817730730)","location":"Hyderabad","experience":"0 - 5 Years"},{"date":"27, 28, 29, 30, 31 - Aug - 2019","skills":"technical support Customer Support Customer Service","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Tech Mahindra Limited, SEZ Building, Tower 1 Opp. to Ananth Technologies, Hi-tech City, Madhapur, Hyderabad - 500 081.","phone":"9949277812","profile":"Technical Support - Voice Process \nTech Mahindra Limited","description":"Key Qualifications & Skills- Any Graduate, Diploma or Intermediate with excellent verbal communication skills in English. Excellent judgment skills to be able to properly evaluate situations and immediately provide effective solutions. Min 6 months of Voice Tech Support experience or 12 months BPO or any Voice Calling Experience. Freshers are not eligible. Should be quick learner and self-motivated. Core Competencies- Pleasant, professional and courteous personality. Excellent Problem Solving and Customer Service Skills Ability to think creatively and should have positive attitude. Strong analytical & Interpersonal skills Note- Freshers are not eligible. Experience apart from BPO will not be considered. Candidate should carry an original & a Photocopy of the Aadhar card. Interested Candidates can directly walk-in to the below mentioned venue address with the necessary documents- Interview Venue Details Tech Mahindra, SEZ Building, Tower 1 Opp. to Ananth Technologies, Hi-tech City, Madhapur, Hyderabad - 500 081. Interview Walk-in Time 12:00 PM to 3:00 PM Contact Person- Dimple Documents Required (Mandatory) Kindly carry an Aadhar Card (Original & Copy). Resume & passport size photo Photocopy of Educational & Experienced related documents","location":"Hyderabad","experience":"1 - 6 Years"},{"date":"26, 27, 28, 29, 30 - Aug - 2019","skills":"Front desk/ Receptionist Activities, Backend Operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Atharv Agricure Private Limited, 403, 3rd floor Prime Plaza, Munshipulia, Indra Nagar, Lucknow.","phone":"9118008304","profile":"Back Office Executive \nAtharv Agricure Private Limited","description":"Educational Qualification: Any Graduate Work Experience: 1 to 3 Years Only female required Job Responsbility- Daily maintenance of office files & registers Creating ID cards for employees Preparing official letters Courier dispatch, POD receiving & tracking Preparing Invoice & bills of stock All other official work as & when required Walk-in Date/ Time: 26th August - 30th September , 9 AM onwards Interview Venue: Atharv Agricure Private Limited 403, 3rd floor Prime Plaza, Munshipulia, Indra Nagar, Lucknow. Contact No. 9118008304 Interested candidates can send their CV on geetanjali.atharv@gmail.com","location":"Lucknow","experience":"1 - 3 Years"},{"date":"27, 28, 29, 30 - Aug - 2019","skills":"HR Administration, Training, Purchase, Vendor Management","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Weshare Group, RMZ Eco Space, 6B, Co-Works Building first floor, Near Eco World Belandur, Bangalore.","phone":"Not Provided","profile":"HR Administrator \nWeshare Group","description":"Candidate should be Any Graduate/ MBA with 3 to 5 years of experience in HR Administration, Training, Purchase, Vendor Management. Must have excellent knolwdge of Excel Powerpoint Key Responsibility- Handling company full administration, vendor management, MOM, invoicing, contracts, co-ordination with d client, various reports on excel and PowerPoint , events management, training, raising POR, organising events for the smooth running of the firm , price negotiations for the benefit of firm with the vendor for renewal of contracts , maintaining calender for clients , issuing work authorisation for urgent requirement etc. Walk-in Date/ Time: 26th - 30th August , 12 PM onwards Interview Venue: Weshare Group RMZ Eco Space, 6B, Co-Works Building first floor, Near Eco World Belandur, Bangalore.","location":"Bangalore","experience":"3 - 5 Years"},{"date":"27, 28, 29, 30 - Aug - 2019","skills":"HR Administration, Vendor Management, Process Handling, Recruitment","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Quintessence Business Solutions & Services, Module 21 & 23, Second Floor, Elnet Software City, TS-140, Block 2&9 , Rajiv Gandhi Salai, Taramani , Chennai - 600 113.","phone":"8870428777","profile":"HR/ Admin Executive \nQuintessence Business Solutions Services Pvt. Limited","description":"We are looking for MBA/ BBA (HR) with 6 months to 1 year experience Must have good communication skills Flexible to work in night shift Preferably Female candidates Job Responsibility- End to end of recruitment process Handling the vendor management Responsible of the on boarding the new joinees and hand over to the operations Interested candidates can walk In directly from Monday to Friday at 11.00 AM to 3.00 PM Or forward your CV to mail sangeetha.p@qbssmail.com Venue: Quintessence Business Solutions & Services Module 21 & 23, Second Floor, Elnet Software City, TS-140, Block 2&9 , Rajiv Gandhi Salai, Taramani , Chennai - 600 113. Contact person : Sangeetha HR Contact No: 8870428777 / 7338853331","location":"Chennai","experience":"0 - 1 Years"},{"date":"27, 28, 29, 30, 31 - Aug - 2019","skills":"Technical Support, International Voice Process, Service Desk","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"HCL Technologies Limited, A-11, Sector-3 , Below Noida Sector 16 Metro Station","phone":"Not Provided","profile":"Technical Support Engineer \nHCL Technologies Limited","description":"Candidate should have 6 months - 3 years of Service desk, voice customer service, and support experience with problem solving involving hardware, involving hardware, software, and networks. Soft Skills- Excellent communication and conversation skills (Verbal and Written) Good documentation skills Good working knowledge of MS OFFICE (Including MS Project and Visio) Should have a great customer handling skills Other Skills / Experience Ability to successfully provide hardware/software/network problem analysis and resolution support over the phone Personal dedication to providing high quality, superior service at all times. Ability to finish what is started is a must. Ability to integrate as a cross-functional, team player in a fast-paced environment where all information is shared. Ability to learn new information quickly and the willingness to do so at all times. Walk-in Date: 27th to 31st-Aug-2019 Time: 11:00 AM to 2:00 PM Interview Venue: HCL Technologies Limited A-11, Sector-3 , Below Noida Sector 16 Metro Station Spoc: Himanshi/ Meenakshi Documents to Carry (Mandatory)* Hard Copy of your updated Resume. Printout / Screenshot of this walkin post One Government ID proof Xerox copy (Preferable Passport ) One Passport size photograph.Record form and at the top of your resume.","location":"Noida","experience":"0 - 3 Years"},{"date":"27, 28, 29, 30, 31 - Aug - 2019","skills":"Technical Support, IT Service Desk, Customer Cupport","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"HCL Technologies Limited, Surya Sapphire, Plot No 3, 1st Phase, Hosur Road, Electronics City Bangalore - 560 100","phone":"Not Provided","profile":"Technical Support/ Service Desk (L1) \nHCL Technologies Limited","description":"Candidate should have 6 months - 3 years of Service desk, voice customer service, and support experience with problem solving involving hardware, involving hardware, software, and networks. Soft Skills Excellent communication and conversation skills (Verbal and Written) Good documentation skills Good working knowledge of MS OFFICE (Including MS Project and Visio) Should have a great customer handling skills Able to handle unforeseen situations Other Skills / Experience Ability to successfully provide hardware/software/network problem analysis and resolution support over the phone Personal dedication to providing high quality, superior service at all times. Ability to finish what is started is a must. Ability to integrate as a cross-functional, team player in a fast-paced environment where all information is shared. Ability to learn new information quickly and the willingness to do so at all times. Walk-in Date- 27th to 31st Aug-2019 Time - 10:00 AM to 2:00 PM Interview Venue: HCL Technologies Limited, Surya Sapphire, Plot No 3, 1st Phase, Hosur Road, Electronics City Bangalore - 560 100 Spoc: Shobhana/ Shemona Documents to Carry (Mandatory)* Hard Copy of your updated Resume. Printout / Screenshot of this walkin post One Government ID proof Xerox copy (Preferable Passport ) One Passport size photograph.","location":"Bangalore","experience":"0 - 3 Years"},{"date":"27, 28, 29, 30 - Aug - 2019","skills":"Data Entry, Data Entry Operation","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Atos Syntel, 2nd floor, Building No 4, Thane belapur Road, Airoli","phone":"Not Provided","profile":"Admin/ Data Entry Executive \nAtos Syntel Private Limited","description":"Mega Walk-in Drive Admin/ Data Entry Executive - QC at Airoli, Navi Mumbai Eligibility : HSC Pass or Diploma or Graduate with 35-49% marks. Graduate with KT can also apply. Willingness to work in Night Shifts is must. Term of Employment: Contractual Job You can directly walk in on below address- Atos Syntel, 2nd floor, Building No 4, Thane belapur Road, Airoli Walk-in Drive: 27th to 30th August 2019 Timing: 11.00 AM -1:00 PM Note: Candidates who have applied and interviewed in the last 3 months need not apply. Please carry your updated resume and govt. photo id proof.","location":"Mumbai","experience":"0 - 1 Years"},{"date":"28, 29 - Aug - 2019","skills":"talent acquisition exit process corporate hr recruitment Induction background verification","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Spice Jet Limited, Building no. 319, Udyog Vihar, Phase 4, Gurgaon - 120 016","phone":"0214-3913939","profile":"Executive/ Senior Executive - HR \nSpice Jet Limited","description":"Educational Qualification: MBA in Human Resources Work Experience: 1 - 4 Years Location: Gurugram Job Responsibilities: * Talent Acquisition * Joining and On-Boarding formalities * Background Verification * Drafting of letter viz. Appointment Letters, NOCs, Transfers, deputations, absenteeism, disciplinary, Visa * Fixed Term Contract Renewals * Employee query resolution * Probation/Confirmations * Exit Process * MIS preparation Required Skill Sets: * Excellent verbal and written communication skills * Knowledge of MS-Excel is must * Prior experience of business partnering and HR Operations * Open for travelling * Eye for detail Walk-in Date/ Time: 28th - 29th August , 10 AM onwards Interview Venue: Spice Jet Limited Building no. 319, Udyog Vihar, Phase 4, Gurgaon - 120 016","location":"Gurgaon","experience":"1 - 4 Years"},{"date":"31 - Aug - 2019","skills":"Java Hibernate JSP Javascript JDBC HTML Spring JQuery","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Enlume Technologies Private Limited, Plot No. 19 and 20, Srinivasa Nagar Colony, Hyderbad - 500 068. Landmark PBR Convention, Nagole Circle","phone":"70328-10742","profile":"Java Developer \nEnlume Technologies Private Limited","description":"Person must have strong skills in Java programming, Angular, Spring framework, Spring boot and web services knowledge. Ability to multi-task in a highly dynamic environment. Proficient in written and spoken English. Walk-in Date/ Time: 31st August 2019, 10 AM onwards Interview Venue: Enlume Technologies Private Limited Plot No. 19 and 20, Srinivasa Nagar Colony, Hyderbad - 500 068 Landmark PBR Convention, Nagole Circle","location":"Hyderabad","experience":"2 - 5 Years"},{"date":"31 - Aug - 2019","skills":"JAX - WS Java Hibernate datastr Aop Spring Mvc OOPS OOAD JSON","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"VirStra-i Technology Services Limited, Marisoft-I (Business Unit of Nucleus Software) 6th Floor, Marigold Premises, Kalyani Nagar, Vadgaon Sheri, Pune - 411 014","phone":"Not Specified","profile":"Java Developers \nNucleus Software Exports Limited","description":"Work Experience 2 to 10 Years Work Location - Noida, Sector-62 Pure Hands-on technology and development professional. Primarily Java, J2EE, Spring, Hibernate and tools including open source tools and platforms, web services and open interfaces to build software that is state-of-the-art. Experience with SOA concepts and Integrations (EAI/ Hub-Spoke). Should have thorough experience in integration with middleware like ESB; Good knowledge of Web Services and related frameworks in Java like JAX-WS; Extensive experience of the object-oriented analysis and design patterns/techniques with emphasis on Java/J2EE technology; Good Experience in JSP, AJAX using Spring MVC, JSON, JQuery. Should be aware of Spring MVC, controllers, interceptors, filters and other framework features Data Structures, Algorithms (sorting, searching) Date 31st August 2019 (Saturday) Timings 9 am to 1 pm Interview Venue: VirStra-i Technology Services Limited, Marisoft-I (Business Unit of Nucleus Software) 6th Floor, Marigold Premises, Kalyani Nagar, Vadgaon Sheri, Pune - 411 014 Interested candidates may send their profiles along with their confirmation to sachin.sharma @nucleussoftware.com","location":"Pune","experience":"2 - 10 Years"},{"date":"27, 28, 29, 30 - Aug - 2019","skills":"Solaris, ITIL, Certified Service Desk, Service Level, Customer Service, Client Satisfaction","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"MARS Telecom Systems Private Limited, aVance Business Hub, Phoenix Infocity SEZ Hitec City 2, Hyderabad - 500 081","phone":"040 67685555","profile":"Java Developer \nMARS Telecom Systems Private Limited","description":"Person should have 3+ years of development experience as a Java Developer with 2+ years of solid and sound JAVA experience in cloud based, multi-tiered, enterprise application systems. Ability to work with client, dev teams and Testing teams. Experience of the some of the following is highly desirable: J2EE, Servlet, EJB, Spring Framework, Hibernate. Experience in Spring, Hibernate is preferred Walk-in Date/ Time: 27th - 30th August , 11 AM onwards Interview Venue: MARS Telecom Systems Private Limited aVance Business Hub, Phoenix Infocity SEZ Hitec City 2, Hyderabad - 500 081 APPLY - DIVYA.TAMAVADA@MARS-INDIA.COM","location":"Hyderabad","experience":"3 - 6 Years"},{"date":"31 - Aug - 2019","skills":"Core Java, JSP/ Servlet, J2EE, Spring, Hibernate, Angular 2/4/5, Oracle/ MS SQL Server","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Xpanxion International Private Limited, Sai Radhe Ground Floor, Behind Sheraton Hotel Near Pune Railway Station, Pune","phone":"Not Provided","profile":"Java Fullstack Developer \nXpanxion International Pvt. Limited","description":"Xpanxion International Pvt. Limited, is hiring for Java Fullstack Developers. Experience required: 3 - 8 Years Technical Skills - Mandatory Strong understanding of Object Oriented Programming Strong skills in Core Java, JSP/ Servlet, J2EE Must have experience in Spring, Hibernate, Angular2/4/5 , Micro services Strong in Jenkins, Maven/ any build tools. Strong Oracle/ MS SQL Server and database designing skills A natural communicator who can explain esoteric technical concepts in clear, plain English (both written and verbal). Should be able to explain at least one of his/her development assignments with reasoning; as to how it was designed, what controls were used and why Interview Date: 31st August' 2019 Timings: 9 am - 1 pm Interview Location: Xpanxion International Private Limited Sai Radhe Ground Floor, Behind Sheraton Hotel Near Pune Railway Station, Pune Contact Person: Shweta Patil","location":"Pune","experience":"3 - 8 Years"},{"date":"7 - Aug - 2019","skills":"Core Java, Advance Java, EJB, JSP/ Servlets, CSS, JavaScript","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Atom Technologies Limited, FT Tower, CTS No. 256 & 257, 1st Floor, Suren Road, Chakala, Andheri (East), Mumbai - 400 093.","phone":"Not Provided","profile":"Java Developer \nAtom Technologies Limited","description":"Educational Qualification: B.E, B.Tech, B.Sc, MCA Experience: 2 to 4 years (Minimum 2 years in Spring) Job Location: Mumbai (Andheri) Skills required: Experienced in Linux Commands and Spring for minimum 2 years. Should be well versed with Core Java, Advance Java, EJB, JSP/ Servlets Web technologies like CSS, JavaScript. Web services/ Web services Integration. MySQL Database Queries & Stored Procedures. Walk-In Date: 7th Sep 2019 Time: 10am to 4pm. Interview Venue: Atom Technologies Limited, FT Tower, CTS No. 256 & 257, 1st Floor, Suren Road, Chakala, Andheri (East), Mumbai - 400 093.","location":"Mumbai","experience":"2 - 4 Years"},{"date":"28 - Aug - 2019","skills":"Java, J2EE, AngularJS, Java Script, XSLT, HTML5/ CSS, Ajax/ JSON","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"SSP India Private Limited, 12 FLOOR, TOWER-C, BUIDING NO.10, DLF CYBER CITY, GURGAON - 122 002","phone":"Not Provided","profile":"Java Developer \nSSP India Private Limited","description":"Bachelors/ Masters degree in Engineering (preferably Electronics, Computer Science, Information Technology) Should have expertise in- At least 3 years in design and Development of Java, J2EE applications At least 2 years in AngularJS, Java Script, XSLT, HTML5/CSS, Ajax/JSON Strong OOPS concepts, Core Java and various design patterns using JAVA (1.5 or later)Strong knowledge of development best practices, development methodologies & standards. Walk-in Time: 9AM to 1PM Date: 28th August 2019 Address - SSP India Private Limited 12 FLOOR, TOWER-C, BUIDING NO.10, DLF CYBER CITY,, GURGAON - 122 002 Contact Person : Ruchika/ Gagan","location":"Gurgaon","experience":"2 - 6 Years"},{"date":"31 - Aug - 2019","skills":"Core Java, OOPs concepts, J2EE, HTML, CSS, SQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Soft Suave Technologies Private Limited, #100, 3 Lakeview Estate Building, M S Nagar, Kundrathur Main Road, Porur, Chennai.","phone":"044-42874244","profile":"Software Engineer - Java Fresher \nSoft Suave Technologies Pvt. Limited","description":"Eligibility Cretria: B.E. / B.Tech / M.E. / M.Tech / MCA 2016, 2017, 2018 & 2019 passed outs. Immediate Joiners. Job Skills: Core Java, Strong knowledge in OOPs concepts, J2EE, HTML, CSS, SQL Logical and analytical thinking towards the Java programming Should have designed at least one project module using object oriented analysis and design techniques Sound knowledge of modern software architecture and development techniques Should be a self initiator and interested in learning new technologies. OPTIONAL: IOS Objective C, Spring, Hibernate Interview Time: 10:00 am to 12:00 pm (Post this time slot, candidates will not be considered) Interview Date: 31st August and 1st September, 2019 (Saturday & Sunday) Interview Venue: Soft Suave Technologies Private Limited #100, 3 Lakeview Estate Building, M S Nagar, Kundrathur Main Road, Porur, Chennai.","location":"Chennai","experience":"0 - 1 Years"},{"date":"28 - Aug - 2019","skills":"Java fullstack/ React js/ Spring boot Mmicroservices/ Angular Spring Boot","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Capgemini India Private Limited, Campus 6B, Pritech Park, RMZ Ecospace, Bellandur, BANGALORE - 37","phone":"9632078131","profile":"Java/ Full Stack Developer \nCapgemini Technology Services India Limited","description":"Capgemini Technology Services India Limited, is looking for Java/ Full Stack Developer at Bangalore location Required Skills: Java fullstack/ React js/ Spring boot Mmicroservices/ Angular Spring Boot Years of Experience: 4 to 9 years Location: Bangalore Walk-in Date : 28th August 2019 Time 10:00 AM 3:00 PM Interview Venue: Capgemini India Private Limited Campus 6B, Pritech Park, RMZ Ecospace, Bellandur, BANGALORE - 37 Spoc- Sonam Singh/ Priyanka Saha Call at-least before 1 hr reaching the premises- 9632078131 Mail- sonam.singh@capgemini.com","location":"Bangalore","experience":"4 - 9 Years"},{"date":"26, 27, 28, 29, 30 - Aug - 2019","skills":"Core Java, Hibernate, jQuery, J2Ee, Spring","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"eClerx Services Limited, Airoli Mindspace, Building No. 11, 6th floor, Opposite Airoli Station, Airoli - 400 708","phone":"Not Provided","profile":"Java Developers \neClerx Services Limited","description":"Skills / Experience Required Must haves Languages : Java / J2EE Databases : Oracle, SQL Server Scripting techniques : Java Script, JQuery, AJAX, JSON Web Server : Apache Tomcat 8.0 and above Good to haves- Tools : Ant script, log4j, WinSCP 4.3.9, PuTTY 0.62, WinMerge 2.12.4, Total Commander 8.01, IBM Rational ClearQuest, TestTrack Application Servers : JBoss 5.0, Oracle WebLogic 11g Maven Key Competencies- Technology 1 Java / J2EE Oracle, SQL Server Technology 2 Java Script, JQuery, AJAX, JSON In depth understanding of Object Oriented Programming (OOPs), web technologies and Java/J2EE Technologies and ability to write and optimize application code Deep knowledge of Java / J2EE technologies with hands-on experience on Spring, Struts, Hibernate and application server environments and ability to configure and deploy web applications Ability to design solutions using oops concepts and design patterns, hands-on experience on modelling tools Work Location - Airoli (navi mumbai) Shift - Day shift / Rotational shifts Work Day - Monday to Friday (Sat & Sun fix off) Work Experience - 3 years to 7 years Contact person - Kiran Vengdingal. Notice Period - Immediate Joiner (15/30 days) Walk-in Date/ Time: 26th - 30th August , 11 AM onwards Interview Venue: eClerx Services Limited Airoli Mindspace, Building No. 11, 6th floor, Opposite Airoli Station. Airoli - 400 708","location":"Mumbai","experience":"3 - 7 Years"},{"date":"30 - Aug - 2019","skills":"Java/ J2EE (Core Java, Struts, Hibernate & Spring Framework)","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"TOMIA (Formerly Starhome Mach), #49, Ground Floor, Shilpa Vidya, 1st Main Road, Sarakki Industrial Layout, 3rd Phase, JP Nagar, Bengaluru, Karnataka - 560 078","phone":"080-66909490","profile":"Java/ J2EE Developer \nTOMIA (Formerly Starhome Mach)","description":"Candidate should have Any Engineering degree (BE/ B.Tech/ ME/ M.Tech), preferably in Computer Science Or Computer Application degree (MCA) with 5+ years of experience in Java/ J2EE development, Creating application in Telecom OSS/ BSS domains. Technical Skills: Java/ J2EE (Core Java, Struts, Hibernate & Spring Framework) Advanced level Angular Intermediary level Oracle, others RDBMS Concepts Intermediary level UNIX Intermediary level Performance Tuning Intermediary level Agile Methodologies Intermediary level Worked on Telecommunication OSS/BSS platforms and prior experience in Roaming domain would be preferred Subversion, CVS Intermediary level Walk-in Date/ Time: 30th August 2019, 10 AM onwards Interview Venue: TOMIA (Formerly Starhome Mach) #49, Ground Floor, Shilpa Vidya, 1st Main Road, Sarakki Industrial Layout, 3rd Phase, JP Nagar, Bengaluru, Karnataka - 560 078","location":"Bangalore","experience":"4 - 9 Years"},{"date":"27, 28, 29, 30 - Aug - 2019","skills":"Core Java Spring Mvc JSTL JUnit JSP Struts JDBC, Hibernate","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"VSH Solutions Private Limited, 1087, First Floor, Nrusinha Sadan Apartments, Thorle Bajirav Peshwe Road, Near Shanipar Temple, Sadashiv Peth, Pune, Maharashtra - 411 030.","phone":"Not Provided","profile":"Java Developer \nVSH Solutions Private Limited","description":"WALK-IN only if you have a minimum of 3+ years of Java development experience. A Bachelors degree in Computer Science (CS), Software Engineering (SE) or related technical field is required for the position. Must be able to work independently with little guidance from others and in a team environment. Strong verbal and written communication and interpersonal skills, with attention to detail. A strong understanding of object-oriented design and programming. Demonstrated experience and knowledge of core Java and J2EE including Thymeleaf, JSP, JSTL, JDBC, Struts, Spring MVC, Hibernate, Web Services. Experience with Apache, Tomcat, and SQL (preferably MySQL) including complex SQL queries. Solid understanding of web services and web development technologies. Some experience in front-end technologies such as HTML, CSS, JavaScript, jQuery, and Bootstrap. Working experience in Eclipse IDE in Windows environment. Experience with JSON, REST and SOAP is mandatory. Familiar with Junit for automated test, Ant for the structured build. Work in the Agile and Dynamic environment. Walk-in Date/ Time: 27th - 30th August , 11 AM onwards Interview Venue: VSH Solutions Private Limited 1087, First Floor, Nrusinha Sadan Apartments, Thorle Bajirav Peshwe Road, Near Shanipar Temple, Sadashiv Peth, Pune, Maharashtra - 411 030. IMMEDIATE JOINER PREFERRED.","location":"Pune","experience":"2 - 4 Years"},{"date":"28, 29 - Aug - 2019","skills":"Java, HTML5.0, CSS3, .Net framework, Win Applications, ASP .NET","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Tech Mahindra Limited, SEZ, Tower 1, Opp. to Ananth Technologies, Beside Oracle, Hi-Tech City, Madhapur, Hyderabad.","phone":"Not Provided","profile":"UI Designer/ Developer (Java/ .Net) \nTech Mahindra Limited","description":"Tech Mahindra is hiring for Internship of 3 months for UI Designer/ Developer , .Net , Java positions at Hyderabad location Skills Required: Good knowledge on web scripting. Such as HTML5.0 and CSS3. Good knowledge on .Net framework, Win Applications, ASP .NET web applications. Basic idea on Java Script. Added advantage:Idea on Bootstrap/ Angular/ PHP/ Java. Must be ready to work in any shift. Interested candidates can directly walk-in to the below mentioned address. Tech Mahindra Limited, SEZ, Tower 1, Opp. to Ananth Technologies, Beside Oracle, Hi-Tech City, Madhapur, Hyderabad. Walk-in Date: 26th to 29th August' 2019. Note: Strictly candidates will not allowed after 11:00 am Contact Person: Monika","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"31 - Aug - 2019","skills":"Automation Testing, Selenium/ Ruby, SoapUI Pro","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"ASG World Wide Private Limited, 2-D, iLabs Centre, Plot # 18, Software Unit Layout, Madhapur, Hyderabad - 500 081","phone":"Not Provided","profile":"QA/ Testing Engineer \nASG World Wide Private Limited","description":"Required (Primary) Skills: Automated testing experience with Selenium/ Ruby, SoapUI Pro or batch scripting languages. Experience working in a in a fast-paced development environment. Knowledge of testing methodologies and experience testing in agile product release cycles. Experience involving browser-based and or server-based software products. Working experience in Windows OS, Unix, Linux, and database management tools (SQL, Oracle, and DB2). Experience with virtualization environments. Duties and Responsibilities: Independently create automated test scripts in Selenium, Ruby, SoapUI Pro, or appropriate batch scripting language from provided test cases design descriptions. Perform different types of automated testing including functional, usability and load testing. Analyze results and provide defect reporting with a defect tracking tool. Debug and resolve issues in automated scripts by reading logs and other output. Work on an agile team of automation engineers. Interact with development as necessary. Manage time across testing multiple projects simultaneously. Walk-in Date/ Time: 31st August from 9 AM onwards Interview Venue: ASG World Wide Private Limited, 2-D, iLabs Centre, Plot # 18, Software Unit Layout, Madhapur, Hyderabad - 500 081","location":"Hyderabad","experience":"2 - 4 Years"},{"date":"31 - Aug - 2019","skills":"Test Engineering, Test Data, Usability Testing, Web Services Testing, Test Scenarios, Manual Testing","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Acidaes Solutions Private Limited, B2, Plot 2 Tower 1, Near Indus Valley School, Block B, Industrial Area, Sector 62, Noida, Uttar Pradesh - 201 309","phone":"Not Provided","profile":"Software Testing Engineer \nAcidaes Solutions Private Limited","description":"Educational Qualification: BE/ B.Tech./ MCA/ ME/ M.Tech First division (60%) in all the academic years Job Location: Noida Candidate should have 1 to 3 year experience in automation software testing environment using Telrik Automation (preferred), QTP. Required Skills: Must have good knowledge of testing tools Should have good communication skills Walk-in Date/ Time: 31st August from 9 AM onwards Interview Venue: Acidaes Solutions Private Limited B2, Plot 2 Tower 1, Near Indus Valley School, Block B, Industrial Area, Sector 62, Noida, Uttar Pradesh - 201 309","location":"Noida","experience":"1 - 3 Years"},{"date":"26, 27, 28, 29, 30, 31 - Aug - 2019","skills":"PHP5, MySQL, Ajax, jQuery, Javascript, HTML5, CSS3, XML, Scripting and Database Administration","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"XS Infosol Private Limited, C-34 ,Ist Floor Sector -02, Near Nirulas Hotel Noida - 201 301. Landmark: Nearest Metro Station - Noida Sector -15","phone":"9953007902","profile":"PHP Developer \nXS Infosol Private Limited","description":"Candidate must have expertise in PHP Frameworks and good technology exposure of Codeigniter / Core Php. Should have excellent knowledge of PHP5, MySQL, Ajax, jQuery, Javascript, HTML5, CSS3, XML , scripting and database administration. Must have sound understanding of OOPs Strong Cross-Browser HTML5/ CSS3 Skills Walk-in Date/ Time: 26th August - 2nd September , 11 AM onwards Interview Venue: XS Infosol Private Limited C-34 ,Ist Floor Sector -02, Near Nirulas Hotel Noida - 201 301 Landmark: Nearest Metro Station - Noida Sector -15","location":"Noida","experience":"0 - 5 Years"},{"date":"26, 27, 28, 29, 30, 31 - Aug - 2019","skills":"Website Development, PHP Development, Back end development and Development of API","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Kriworld Itech Private Limited, 367, 2nd Floor, Bajrang Chowk, Sarai Main Market, Near Sarai Metro Station, Faridabad, Haryana -121 003","phone":"8383891889","profile":"Senior Website Developer \nKriworld Itech Private Limited","description":"Candidate should be Any Graduate with 1 to 6 years of experience in Website Development, PHP Development, Back end development and Development of API, Convert static to dynamic Walk-in/ Time: 26th - 31st August , 11 AM onwards Interview Venuue: Kriworld Itech Private Limited 367, 2nd Floor, Bajrang Chowk, Sarai Main Market, Near Sarai Metro Station, Faridabad, Haryana -121 003","location":"Gurgaon","experience":"1 - 6 Years"},{"date":"26, 27, 28, 29, 30 - Aug - 2019","skills":"CSS Woocommerce Wordpress Magento Javascript PHP HTML JQuery Joomla Ajax","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Tychon Solutions Private Limited, B28 & B29, 6th Cross Road, Sipcot IT Park, Siruseri, Chennai - 603 103.","phone":"9566260999","profile":"Php/ Magento Developer \nTychon Solutions Private Limited","description":"Candidate should have 2 to 7 years of experience in Magento, Magento2, Magento Community 2x and Enterprise 2x,Enterprise 2 is a plus PHP programming, Understanding of MVC design patterns. Wordpress / Drupal / Joomla / CodeIgniter ,HTML, CSS, JQuery, Javascript, and Ajax, WooCommerce is a plus. Immediate /15 days Notice Preferred Walk-in Date/ Time: 26th - 30th August , 11 AM onwards Interview Venue: Tychon Solutions Private Limited, B28 & B29, 6th Cross Road, Sipcot IT Park, Siruseri, Chennai - 603 103.","location":"Chennai","experience":"2 - 7 Years"},{"date":"27, 28, 29, 30 - Aug - 2019","skills":"Php, Web frameworks, SQL Server","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"StraViso India Private Limited, Teerth Technospace, No. B-204 & B 204 A Second Floor, Survey No. 103 Hissa No. 2 to 14, Village Baner, Taluka Haveli, Dist, Pune - 411045","phone":"7722075652","profile":"PHP Developer \nStraViso India Private Limited","description":"Applicants must be well experienced as PHP Developer responsible for managing back-end services and the interchange of data between the server and the users. Candidate should have Bachelors degree in Business, Engineering, Computer Science or other related analytical or technical disciplines, or at least Three (3) years related experience. Strong knowledge of PHP web frameworks {such as Laravel, Yii, etc depending on your technology stack}. Understanding the fully synchronous behavior of PHP Understanding of MVC design patterns Basic understanding of front-end technologies, such as JavaScript, HTML5, and CSS3. Knowledge of object oriented PHP programming Understanding accessibility and security compliance {Depending on the specific project}. Strong knowledge of the common PHP or web server exploits and their solutions Walk-in Date: 27th - 30th August 2019 Timings: 11 am- 5 pm IST Interview Venue: StraViso India Private Limited Teerth Technospace, No. B-204 & B 204 A Second Floor, Survey No. 103 Hissa No. 2 to 14, Village Baner, Taluka Haveli, Dist, Pune - 411045 Landmark: Behind Mercedes Benz Showroom Front office : 7722075652/ 7875053960 NOTE : Notice period less than 30 days can only apply","location":"Pune","experience":"4 - 9 Years"},{"date":"29 - Aug - 2019","skills":"PHP/ MySQL, Joomla, Durpal, CSS, Wordpress, PHP Design & Development","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA, B.E./B.Tech, MCA/PGDCA","address":"Changepond Technologies Pvt. Limited, H 2, SIPCOT IT Park, OMR SIRUSERI - 603 103","phone":"Not Mentioned","profile":"PHP Developer \nChangepond Technologies Private Limited","description":"Candidate should have 2+ years of hands on experience in PHP Development. Good to have knowledge in Joomla, Durpal, CSS, Wordpress, PHP Design & Development. Must have sound knowledge in PHP-MySQL. Good communication skill and must have knowledge in interacting with clients. Must have an ability to learn new Technologies Self-Starter and motivated to excel Walk-in Date & Time: 29th August 2019 (Thursday) from 9.00 AM to 12.00 PM Interview Venue: Changepond Technologies Pvt. Limited H 2, SIPCOT IT Park, OMR SIRUSERI - 603 103 Contact Person: A G Rubas","location":"Chennai","experience":"2 - 4 Years"},{"date":"28, 29, 30, 31 - Aug - 2019","skills":"Drupal CSS Wordpress MySQL Javascript PHP HTML Vtiger Joomla Ajax","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Target Integration, 143, First Floor, Tower B3, Spaze Itech Park, Near Shoppers Stop, Sector-49, Gurgaon - 122 018","phone":"8368304179","profile":"PHP Developer \nTarget Integration","description":"The ideal candidate should have 3 to 5 years experience within a web application development environment. Should have good experience with PHP, HTML, CSS, MySQL, SOAP/REST, JavaScript, AJAX, etc. is must. Following are the key area we are expecting you to have strong command on: Analytical Skills Algorithms Job Responsibilities: Development of software extensions to vTiger CRM/Drupal/WordPress and any other PHP based application Development of integration between CRM and ERP systems provided by Target Integration and any other system using their APIs Development and maintenance of code in Gitlab (In-house git server) Managing tickets and updating them regularly in Redmine (Project and Ticket Management Platform) Providing solutions to the pre-sales team on new projects Supporting the existing development team Walk-in Date/ Time: 28th - 31st August , 11 AM onwards Interview Venue: Target Integration 143, First Floor, Tower B3, Spaze Itech Park, Near Shoppers Stop, Sector-49, Gurgaon","location":"Gurgaon","experience":"3 - 5 Years"},{"date":"26, 27, 28, 29, 30, 31 - Aug - 2019","skills":"Core PHP, MySQL, Bootstrap, MVC Architecture","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Digi Style, G-1, Second Floor, Sector-11, Noida. Landmark: Near Swani Furniture Red Light","phone":"Not Provided","profile":"Php Developer \nDigi Style","description":"Work Experience- 2 to 4 Years Strong understanding and hold on working with Core PHP. Excellent knowledge about Core PHP, MySQL, Bootstrap Excellent command on PHP and MySQL using MVC Architecture. Expertise on PHP based framework like: codeigniter, laravel, etc... Required Skills: Ability to adjust schedules to meet deadlines will be crucial. Must be self-motivated and take responsibilities for his/her own deliverables. Excellent written and verbal communication skills Ability to manage multiple projects & lead the development effort while meeting deadlines and maintaining high-quality results Good analytical, reasoning, logical and troubleshooting skills Walk-in Date/ Time: 26th to 31st August , 10 AM onwards Interview Venue: Digi Style, G-1, Second Floor, Sector-11, Noida. Landmark: Near Swani Furniture Red Light","location":"Noida","experience":"2 - 4 Years"},{"date":"26, 27, 28 - Aug - 2019","skills":"HTML5, CSS3, Photoshop, JQuery, Javascript, Bootstrap and any Digital MCM platforms","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Auraine Botanicals Private Limited, 3rd Floor, Plot No. 15, Sector 44, Gurgaon","phone":"0124-4015666","profile":"PHP Developer \nAuraine Botanicals Private Limited","description":"Person should have 2 to 4 Years of experience in software development with strong knowledge of RDBMS. Must have at least 1 to 3 years of experience in the design of software development. Strong coding skills and Computer Science fundamentals. Should have strong problem-solving skills Must have strong on OOPS Concepts Strong command on MVC Design Pattern and PHP (CodeIgnitor, Larave etc.) Good knowledge of relational databases, version control tools and of developing web services. Experience in common third-party APIs (Google, Facebook, eBay etc) Experience writing clear and concise technical specifications and design documents. Walk-in Date/ Time: 26th to 28th August 2019, 11 AM onwards Interview Venue: Auraine Botanicals Private Limited 3rd Floor, Plot No. 15, Sector 44, Gurgaon (Nearest Metro Station : Huda City Center) Landmark: Marvel Tea Building or Taj Vivanta Hotel","location":"Gurgaon","experience":"2 - 4 Years"},{"date":"26, 27, 28 - Aug - 2019","skills":"Android Life Cycle Management, Android Apis, OOPS Concepts and Java","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Auraine Botanicals Private Limited, 3rd Floor, Plot No. 15, Sector 44, Gurgaon (Nearest Metro Station : Huda City Center)","phone":"0124-4015666","profile":"Android Developer \nAuraine Botanicals Private Limited","description":"Person should have 2 to 4 Years of experience in software development. Should have experience working on offline Apps. Should have strong knowledge of RDBMS. At least 1-3 years of experience in the design of software applications. At least 2+ years of experience in Android app development for Android Mobiles Strong coding skills and Computer Science fundamentals Should have strong problem-solving skills Should have good analytical skills and communication skills Strong debugging skills on Android/ Java; Strong understanding of memory management, android life cycle management, android apis. Strong on OOPS concepts and Java Walk-in Date/ Time: 26th to 28th August 2019, 11 AM onwards Interview Venue: Auraine Botanicals Private Limited 3rd Floor, Plot No. 15, Sector 44, Gurgaon (Nearest Metro Station : Huda City Center) Landmark: Marvel Tea Building or Taj Vivanta Hotel","location":"Gurgaon","experience":"2 - 4 Years"},{"date":"26, 27, 28 - Aug - 2019","skills":"QA - Manual Testing, HTML5, CSS3; JS, jQuery, Adobe Photoshop, SQL, PL/SQL, .Net, MVC","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Q3 Infotech Private Limited, 6th Floor JMD Megapolis, Sohna Road, Sector 48, Gurugram, Haryana - 122 001","phone":"Not Provided","profile":"QA/ Testing Engineer \nQ3 Infotech Private Limited","description":"We are conducting walk-in interviews for QA Engineer, Senior Design Developer and SQL Developer position. Interested candidates may directly come down for the interview. Please find the details below: QA Engineer: QA - Manual (1 year) Senior Design Developer: HTML5, CSS3; JS, jQuery, Adobe Photoshop, Adobe Illustrator, Adobe Indesign, Corel Draw & Page Maker, Balsamic (5+ years) SQL Developer: SQL, PL/SQL, .Net, MVC, PostgreSQL, HTML5, CSS, JavaScript, WCF, JQuery. ( 2-5 years) Requirements: - 60% and above throughout academics Excellent Oral and written Skills Immediately available (preferable) or <2 months notice period Job Location- Gurugram Interview Date & Time - 26th-28th August, 11.00 AM to 4.00 PM Interview Venue : Q3 Infotech Private Limited 6th Floor JMD Megapolis, Sohna Road, Sector 48, Gurugram, Haryana - 122 001 Contact Person: Shalini","location":"Gurgaon","experience":"1 - 6 Years"},{"date":"31 - Aug - 2019","skills":"PHP, OOPS, Laravel, Codignator, MVC frameworks, HTML, CSS, MySQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Enlume Technologies Private Limited, Plot No. 19 & 20, Srinivasa Nagar Colony, Nagole Circle, Hyderabad - 500 068. Landmark PBR Convention","phone":"70328-10742","profile":"PHP Developer \nEnlume Technologies Private Limited","description":"Candidate should have 2 to 3 years of experience in PHP, OOPS, Laravel, Codignator, MVC frameworks, HTML, CSS and Java Script, Typescript, JQuery, MySQL, SQL Queries, Redis Knowledge on PHP frameworks like Laravel, Codignator & MVC frameworks Knowledge on HTML, CSS and Java script, JQuery Good Knowledge on MySQL and SQL queries Knowledge on Caching mechanism like Redis Walk-in Date/ Time: 31st August 2019, 10 AM onwards Interview Venue: Enlume Technologies Private Limited Plot No. 19 & 20, Srinivasa Nagar Colony, Nagole Circle, Hyderabad - 500 068 Landmark- PBR Convention","location":"Hyderabad","experience":"2 - 3 Years"},{"date":"26, 27, 28, 29, 30 - Aug - 2019","skills":"Software Testing, Automation Testing, Manual Testing","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Hard N Soft Technology Private Limited, 5th Floor, Kochar Technology Park, SP 31A, 2nd Main Road, 1st Cross Rd, Ambattur, Chennai, Tamil Nadu - 600 058","phone":"8939695969","profile":"Software Testing Engineer \nHard n Soft Technologies Pvt. Limited","description":"Candidate should have 3 to 6 years of experience in Automation and Manual Testing. Must be able to coordinate with team to solve and do the app test Walk-in Date/ Time: 26th - 30th August , 9 AM onwards Interview Venue: Hard N Soft Technology Private Limited, 5th Floor, Kochar Technology Park, SP 31A, 2nd Main Road, 1st Cross Rd, Ambattur, Chennai, Tamil Nadu - 600 058 Landmark: Opposite to Ambit","location":"Chennai","experience":"3 - 6 Years"},{"date":"26, 28 - Aug - 2019","skills":"Manual Testing, Test Engineering, Test Case Design and Test Execution","qualification":"B.E./B.Tech, MCA/PGDCA","address":"QualityKiosk Technologies Private Limited, 4th Floor,419A, C Wing, Rupa Solitaire, Sector-1, Millennium Business Park, Mahape, Kopar Khairane, Navi Mumbai, Maharashtra - 400 710","phone":"022-41288260","profile":"Manual Testing Engineer \nQualityKiosk Technologies Private Limited","description":"Urgent opening for Manual Testing (flexible to travel anywhere in Mumbai location mandatory) MANUAL TESTING experience: 1-4 Years Manual test Case Design and Test Execution Experience of Insurance domain will add advantage Job Location: Navi Mumbai Base location (Client location can be Central, Harbor, Western Line, within India or Onsite) Interview Date: 26th & 28th August 2019 Monday & Wednesday Interview Time: 11 AM to 3 PM Interview location: QualityKiosk Technologies Private Limited 4th Floor,419A, C Wing, Rupa Solitaire, Sector-1, Millennium Business Park, Mahape, Kopar Khairane, Navi Mumbai, Maharashtra - 400 710 (Lift Number 24 & 25) Mandatory: immediate to 30 days joiner only Job Description:","location":"Mumbai","experience":"1 - 4 Years"},{"date":"26, 27 - Aug - 2019","skills":"Software Testing, Automation Testing, Selenium","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Estel Technologies Private Limited, #126, Sector 44, Institutional Area Gurgaon, Haryana","phone":"0124-2578208","profile":"Software Testing Engineer \nEstel Technologies Private Limited","description":"Candidate should have good understanding of mobile and web application testing concepts. Strong knowledge of Automation Framework Development and test scripts creation using Selenium with Java. Good knowledge of API/ Web Services testing. Good knowledge of Selenium automation with Database Good knowledge of Eclipse, JUnit, TestNG, Xcode Must be good in writing SQL Queries Interview Date: 26th - 27th August 2019 Timing 11:00 am to 4:00 pm Interview Venue: Estel Technologies Private Limited #126, Sector 44, Institutional Area Gurgaon, Haryana","location":"Gurgaon","experience":"3 - 6 Years"},{"date":"31 - Aug - 2019","skills":"Selenium, QA, Automation Testing, SOAP","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"ASG World Wide Private Limited, 2-D, iLabs Centre, Plot # 18, Software Unit Layout, Madhapur, Hyderabad - 500 081","phone":"Not Provided","profile":"Senior QA/ Testing Engineer \nASG Technologies Private Limited","description":"Required (Primary) Skills: Automated testing experience with Selenium/ Ruby, SoapUI Pro or batch scripting languages. Experience working in a in a fast-paced development environment. Knowledge of testing methodologies and experience testing in agile product release cycles. Experience involving browser-based and or server-based software products. Working experience in Windows OS, Unix, Linux, and database management tools (SQL, Oracle, and DB2). Experience with virtualization environments. Duties & Responsibilities: Independently create automated test scripts in Selenium, Ruby, SoapUI Pro, or appropriate batch scripting language from provided test cases design descriptions. Perform different types of automated testing including functional, usability and load testing. Analyze results and provide defect reporting with a defect tracking tool. Walk-in Date/ Time: 31st August from 9 AM onwards Interview Venue: ASG World Wide Private Limited, 2-D, iLabs Centre, Plot # 18, Software Unit Layout, Madhapur, Hyderabad - 500 081","location":"Hyderabad","experience":"6 - 8 Years"},{"date":"26, 27, 28, 29, 30 - Aug - 2019","skills":"Software Testing, SQL Quality Telecom","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Plintron, Block 6, GKS Tech Park , 3rd Floor DLF-Tech Park, 1/124 Shivaji Gardens, Ramapuram, Chennai - 600 089","phone":"Not Provided","profile":"Testing Engineer - Freshers \nPlintron","description":"Plintron hiring Software Engineer/ Testing Freshers (0-1 year) from 26th (Mon) to 30th August (Fri) at 10.00 am Eligibility Criteria: B.E (CSE/ IT/ ECE/ EEE)/ B.Tech/ MCA/ MSc (IT/ CS) 2018/ 2019 passed outs , No Current Arrears Consistent 60% marks throughout (10th, 12th, UG / PG) Must have good communication skills Required Skills: Testing (Only Male Candidates) SQL Quality Telecom CANDIDATES MUST BE WILLING TO SIGN A 3-YEARS OF AGREEMENT WITH US, WHICH IS NON-BREAKABLE. Interview process: Level 1: Initial HR Screening Level 2: Technical F2F discussion(Depends) Level 3: HR Discussion If interested please walk-in to the below mentioned venue from 26th (Mon) to 30th August (Fri) at 10.00 am, Plintron Block 6, GKS Tech Park , 3rd Floor DLF-Tech Park, 1/124 Shivaji Gardens, Ramapuram, Chennai - 600 089 Timing:10:00 am to 11.30 am only","location":"Chennai","experience":"0 - 1 Years"},{"date":"26, 27, 28 - Aug - 2019","skills":"Software Testing, SQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Ionidea Interactive Private Limited, # 38-40,EPIP, Besides SAP LABS Whitefield, Bangalore - 560 066.","phone":"080-66581500","profile":"Testing Engineer/ Fresher \nIonidea Interactive Private Limited","description":"Educational Qualification: BE/ B.Tech/ MCA/ M.Tech Freshers Must have above 60% in UG, PG, 12th and 10th Year of Pass out: 2017/ 2018/ 2019 Required Skills: Software Testing, SQL Date of Interview: 26th to 28th August 2019 Time: 9.00 AM to 12.00 PM Venue: Ionidea Interactive Private Limited # 38-40,EPIP, Besides SAP LABS Whitefield, Bangalore - 560 066. Landmark: KTPO Stop, Near Ginger Hotel Interested candidates can walk-in directly with a hard copy of your resume For further clarification, please contact +91 (80) 66581500","location":"Bangalore","experience":"0 - 1 Years"},{"date":"24, 26, 27, 28, 29, 30, 31 - Aug - 2019","skills":"HR Administration, Vendor Management, Process Handling, Recruitment","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Quintessence Business Solutions & Services, Module 21 & 23, Second Floor, Elnet Software City, Block 2&9, Rajiv Gandhi Salai, Taramani, Chennai - 600113","phone":"8870428777","profile":"HR / Admin Executive \nQuintessence Business Solutions Services","description":"We are looking for MBA/ BBA (HR) with 0.6 months to 1 year experience Preferably Female candidates Fresher can also apply Must have good communication skills End to end of recruitment process Handling the vendor management Responsible of the on boarding the new joinees and hand over to the operations Flexible to work in night shift Interested candidates can walk In directly from Monday to Friday at 11.00 AM to 3.00 PM Or forward your CV to mail sangeetha.p@qbssmail.com Venue: Quintessence Business Solutions & Services, Module 21 & 23, Second Floor. Elnet Software City, Block 2&9, Rajiv Gandhi Salai, Taramani, Chennai Contact Person : Sangeetha HR Contact No: 8870428777 / 7338853331","location":"Chennai","experience":"0 - 2 Years"},{"date":"26, 27, 28, 29, 30, 31 - Aug - 2019","skills":"HR / Recruitment, General Administration, Vendor Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Bianca 915, Hubtown Solaris, N.S Phadke Road, Opp. Telli Galli, Near Andheri Flyover, Andheri (East) MUMBAI, Maharashtra - 400 069,","phone":"Not Provided","profile":"Administration Executive \nBianca Home LLP","description":"Candidates must have prior experience in Administration. Female candidate from Western line (preferably Gujarati staying at Vile Parle) preferred Should have knowledge of Computer (must) Good Typing Speed (Above 30 w.p.m) Good knowledge of Microsoft Excel. Can handle correspondence & can talk to customers. Must have strong Multi tasking ability. Walk-in Date: 26th - 31st August 2019 Interview Time - 11 am to 06 pm Venue: Bianca 915, Hubtown Solaris, N.S Phadke Road, Opp. Telli Galli, Near Andheri Flyover, Andheri (East) MUMBAI, Maharashtra - 400 069","location":"Mumbai","experience":"3 - 8 Years"},{"date":"26, 27, 28, 29, 30, 31 - Aug - 2019","skills":"General Administration, Facility Maintenance/ Office Maintenance/ Repairing","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Trivium Education Services Pvt. Limited, F-4, Second floor, Okhla Industrial Area, Phase-I, New Delhi - 110 20","phone":"Not Provided","profile":"Admin Executive For Night Shift \nTrivium Education Services (P) Limited","description":"Supervision of Facility Maintenance/ Office Maintenance/ Repairing & Maintenance/ Security of premise(s) & personnel. Supervision of office equipment, housekeeping, front office, meeting rooms, Interior decorations, pantry management, office stationary, carpentry and pest control, etc. In charge of printing of visiting cards, Letter heads & Company brochures, ID cards. General Administration, Courier Management, Handling Petty Cash for office use. Maintaining expense reports and claim reimbursements. Interested candidates can directly come for an Interview at below mentioned address. Kindly carry your CV for appearing in interview. Trivium Education Services Pvt. Limited F-4, Second floor, Okhla Industrial Area, Phase-I, New Delhi - 110 20 Walk-in Date: 26th - 30th August , 12 AM onwards Contact Person: Raghav Rana Email: raghav.rana@triviumedu.com","location":"Delhi","experience":"1 - 2 Years"},{"date":"26 - Aug - 2019","skills":"General Administration, Warehouse, Stock Management, Cash Handling, Back Office Operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Ample Technologies Private Limited, NCC Windsor Urban, 4th Floor, Jakkur, Bangalore - 560065 Landmark: Next to Renault Showroom","phone":"080 33500500","profile":"Logistics & Admin Executive \nAmple Technologies Private Limited","description":"Candidate should be Any graduate with 1 to 2 years of experience in General Administration, Warehouse, Stock Management, Cash Handling, Back Office Operations. Must have excellent communication skills. Job Responsibility- Sending and receiving stocks and ensure both quality and quantity Ensure accuracy of all inventory in the store. Enable the sales team with stock updates. Create and maintain contact with vendors, warehouse and customers to ensure timely delivery of goods. Price change update to the store team on daily basis. Ensure all stocks are numbered and tagged. Physical stock checks. Walk-in Date/ Time: 26th August 2019, 10 AM onwards Interview Venue: Ample Technologies Private Limited NCC Windsor Urban, 4th Floor, Jakkur, Bangalore - 560065 Landmark: Next to Renault Showroom","location":"Bangalore","experience":"1 - 2 Years"},{"date":"22, 23 - Aug - 2019","skills":".NET, C#, SQL, MVC, Angular","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Greytrix India Private Limited, 301, 3rd floor, B Wing, Everest Nivara Infotech Park, 1, MIDC Main Rd, Indira Nagar, MIDC Industrial Area, Turbhe, Navi Mumbai, Maharashtra - 400 705","phone":"022-67687826","profile":"Software Developer (.Net) \nGreytrix India Private Limited","description":"Greytrix India Private Limited, is looking for experienced for .Net developer at Turbhe, Navi Mumbai. Skills required: .NET, C#, SQL Preferred - MVC, Angular - Not mandatory Walk in Date - 21st to 23rd Aug between Walk-in Date: 21st - 23rd August 2019 Timings: 9:30 am to 3 pm Interview Venue: Greytrix India Private Limited 301, 3rd floor, B Wing, Everest Nivara Infotech Park, 1, MIDC Main Rd, Indira Nagar, MIDC Industrial Area, Turbhe, Navi Mumbai, Maharashtra - 400 705","location":"Mumbai","experience":"1 - 5 Years"},{"date":"22, 23 - Aug - 2019","skills":"C#, Web API, ASP .Net, .Net, MVC, WCF","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Galax E.Solutions India Private Limited, 1st Floor, Voyager Building ITPL, Whitefield Road, Pattandur Agrahara, Whitefield, Bangalore - 560 066. Land Mark: Near Hotel Taj Vivanta & Park Square Mall","phone":"080-41429658","profile":".Net Developers \nGalax E.Solutions India Private Limited","description":"Candidate should have 2 to 3 years experience with .Net Full lifecycle application development. Design, code and debug complex software applications. Perform software analysis, risk analysis, reliability analysis. Participate in software modeling and simulation. Integrate new software solutions with existing systems. Mode of Interview: .NET online technical test 1st Level - Technical Interview 2nd Level - Technical Interview Final Level - Managerial Interview Walk-in Date/ Time: 22nd - 23rd August , 9 AM onwards Interview Venue: Galax E.Solutions India Private Limited 1st Floor, Voyager Building ITPL, Whitefield Road, Pattandur Agrahara, Whitefield, Bangalore - 560 066 Land Mark: Near Hotel Taj Vivanta & Park Square Mall","location":"Bangalore","experience":"2 - 3 Years"},{"date":"24 - Aug - 2019","skills":"ASP .NET, C#, MS SQL Server, JavaScript, jQuery, AJAX and React JS","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Mirabel Technologies India Pvt. Limited, Kapil Towers IT Block, 11th Floor (Unit No.2), IT Park, Nanakramguda, Hyderabad - 500 032","phone":"040 48491157","profile":".Net Full Stack Developers \nMirabel Technologies India Pvt. Limited","description":"Walk-In Drive for .Net Full Stack Developers & Full stack Web Developer on 24th Aug,2019 i.e. Saturday from 9:30am to 5:00pm. Interested and eligible candidates can directly Walk-in at the interview location below. Required Skill set .Net Full Stack Developers : ASP .NET, C#, MS SQL Server, JavaScript, jQuery, AJAX and React JS Full Stack Web Developers: Node.js, Express JS, HTML, CSS, ReactJS, MongoDB. .Net Full Stack Developers (Exp: 2-4 Years) Strong working Knowledge of ASP .NET, C#, MS Sql Server 2008 and above versions, XML, JavaScript, jQuery, React JS and AJAX. Development experience with data integration technologies including Web API, REST, SOAP, JSON and XML. Strong HTML and JavaScript (AJAX, DOM). Strong understanding of cross-browser compatibility, with support for IE, Firefox, Chrome, Safari on Windows and Safari, Firefox, Chrome on MAC. Full Stack Web Developers (Node Js & React JS) : (Exp 1-3 Years) . Experience in Node.js and frameworks available for it, such as Express or StrongLoop. Preferably Express. . Experience in building Rich UI components with React.js. . Strong understanding of JavaScript, its quirks and workarounds, experience on MongoDB. Selection Process: Three levels of face to face technical discussion Walk-in Details- Date: 24th August 2019 Time: 9:30am to 5pm Venue Details: Mirabel Technologies India Pvt. Limited Kapil Towers IT Block, 11th Floor (Unit No.2), IT Park, Nanakramguda, Hyderabad - 500 032 Contact Person: Sowmya","location":"Hyderabad","experience":"2 - 4 Years"}]}