{"Walkins":[{"date":"18 - Feb - 2021","skills":"HR Operations, Attendance, Payroll Management, Employee Records, Statutory Compliances","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"ISHIR, D-44, Sector 59, Noida - 201 301","phone":"Not Provided","profile":" HR Operations Trainee/ Executive \nBorderlessmind Technologies Pvt. Limited","description":"The person will be responsible for the smooth functioning of the day to day HR Operations such as managing leave and attendance, payroll, employee records, statutory compliances. Technical Skills- Extensive usage of MS Excel (Aggregate function, Index, Vlookup, Hlookup, Pivot table, Pie Chart) Competencies- Logical thinking Proactive & Organized Ability to plan and organize daily work Attention to detail is a must Excellent written and verbal communication Key Responsibilities- Responsible for complete the Joining Formalities, preparing of Appointment Letter, NDA, generating employee code, ID card, biometric etc. Provide necessary inputs to finance team for payroll processing Managing attendance and leave records Responsible for managing statutory compliances such as PF & ESIC Conduct employment/ background verification checks Maintenance of employee records and updating our Intranet Handling Exit and Full and Final Settlement formalities Managing the Monthly, Weekly & Daily Report Creating in MS-Excel Generating & maintaining day to day MIS Data and updating the HR Data Resolve employee queries related to leaves, attendance, salary calculation Responsible for recruitment coordination Supporting the HR team on conducting employee engagement activities Walk-in Date/ Time: 18th February 2021, 10.30 AM - 1.30 PM Venue Details- ISHIR, D-44, Sector 59, Noida - 201301 Contact Person- Himanshu/ Astha  ","location":"Noida","experience":"0-2Years"},{"date":"17 - Feb - 2021","skills":"Revenue Cycle Management","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Inventurus Knowledge Solutions Pvt. Limited, Building No. 5 & 6, 2nd floor, Airoli Mindspace, Opposite Airoli Railway station, Airoli (East) Mumbai - 400 708","phone":"8686273622","profile":" Process Associate - Fresh Graduates \nInventurus Knowledge Solutions Pvt. Limited","description":"Qualification: Any graduate (Graduation Certificate is mandatory) Excellent command of the English Language. Process Name: Revenue Cycle Management Shifts: Night shifts only (pick and drop provided) Salary: 2.50 Lakhs per annum Job Responsibility: Reviews and analyze outstanding insurance claims, to get physician efforts paid. Identify trends and communicate findings/ errors to appropriate stakeholders in an effort to educate and eliminate future errors. Work with the insurance company on behalf of our clients, represent them and resolve the claims within the timelines and defined Service Level Agreements (SLAs) Interact with insurance org to get the required status update and have the claims resolved The Walk-in Date/ Time: 17th February 2021, 10.00 AM - 3.00 PM Venue Details- Inventurus Knowledge Solutions Pvt. Limited Building No. 5 & 6, 2nd floor, Airoli Mindspace, Opposite Airoli Railway station, Airoli (East) Mumbai - 400 708 Contact - Syed (8686273622) Basic requirements for the walk-in interview: Please carry your own earphones which have a microphone in it. Please download the 'VERSANT' app on your respective phones. This app is readily available on the Google Playstore. Updated CV is mandatory. Please carry a copy of your Passing Certificate / Degree Certificate / All semester mark sheet hardcopies  ","location":"Mumbai","experience":"0-1Years"},{"date":"17 - Feb - 2021","skills":"HR/ Recruitment, Head Hunting, Screening, Talent Acquisition, Interview Scheduling","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Axis Consultants, C 127 2nd Floor, Naraina Industrial Area Phase 1, New Delhi - 110 028.","phone":"8826891633","profile":" HR Recruiter/ Executive \nAxis Consultants","description":"Hiring Graduates/ Under Graduate/ MBA - HR having a zeal to work. Both Freshers/ Experienced can apply Bulk hiring experience of International BPO/ IT hirings Students seeking Internship in HR/ Research can also apply Job Responsibility- Sourcing Candidates from Job Portals, Screening, Scheduling Interviews. Need good communication/ Interacting skills Connecting with candidates/ Clients Hiring for Major International BPOs for front level and also for support and IT Hiring. Walk-in Date/ Time: 17th February 2021, 11.30 AM - 4.30 PM Venue Details- Axis Consultants C 127 2nd Floor, Naraina Industrial Area Phase 1, New Delhi - 110 028. Contact - Ms Sanna (8826891633)  ","location":"Delhi","experience":"0-4Years"},{"date":"17 - Feb - 2021","skills":"Technical Support, Non-Voice Process, Customer Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Prodapt Solutions Private Limited, Module 1, Tower 1 (1st & 6th Floors), IT Special Economic Zone Pallavaram-Thuraipakkam, 200 Feet Radial Road, Oggiyamduraipakkam, Tamil Nadu - 600 097.","phone":"Not Provided","profile":" Process Associates (Technical/ Non-Voice) \nProdapt Solutions Private Limited","description":"We are recruiting Freshers (BE/ B.Tech/ BCA/ BSc Graduates - 2018, 2019 & 2020 Passed outs) for Process Associates (Technical/ Non-Voice) and this position will be based at Chennai (Kandanchavadi/ Thoraipakkam). We provide Telecom-specific technical support for our clients in the US. You will be provided with the basic process training for your role. To become a part of Prodapt - TOPS (Telecom Operations Process & Services), you should be a GRADUATE and should have Good communication skills Good typing skills Should be willing to work in night shifts Should be an immediate joiner Walk-in Date/ Time: 17th February 2021 from 3.00 PM onwards Venue Details- Prodapt Solutions Private Limited Module 1, Tower 1 (1st & 6th Floors), IT Special Economic Zone Pallavaram-Thuraipakkam, 200 Feet Radial Road, Oggiyamduraipakkam, Tamil Nadu - 600 097. If you are interested, please share your resume to Prabhakaran.p@prodapt.com along with the below-mentioned details- Full Name: Contact Number : Whatsapp Number: E-Mail ID: Current Location : Education Qualification: Graduation Passed out Year:  ","location":"Chennai","experience":"0-1Years"},{"date":"17, 18 - Feb - 2021","skills":"Customer Care, Travel Process, Customer Support","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"iEnergizer (A unit of Granada Services Pvt. Limited) A-37, Sector 60 Noida","phone":"7678370584","profile":" Customer Service Associate - Travel Process \niEnergizer (Granada Services Private Limited)","description":"Candidate should be Any Graduate/ Undergraduate with minimum 6 months of experience in Travel Industry on Ticketing process. Should have Experience of managing Non-voice process/ Email queries/ Calling (Inbound and Outbound) Minimum qualifying criteria is 6 months experience to handle relevant queue i.e Email or Chat, calling and sales preferably with Travel domain). Must have good spoken & written English. Customer Service experience in Travel Domain. Candidates with excellent communication skills can also apply. Desired Skills: Should have specific experience into Travel process/ domain. Should possess good communication skills. Must be patient and willing to help others in solving problems while maintaining a positive attitude at all times. Must have a keen eye for detail and follow instructions. Agent should be flexible to work in 24/7 Environment and 6 working days. Interested candidates can walk in directly for the interview along with an updated resume and need to mention 'HR Pooja' on top of the resume Interview Date : 17th to 18th February 2021 Timing : 11 am - 4 pm Address details : iEnergizer (A Unit of Granada Services Pvt. Limited) A-37, Sector 60 Noida Contact Person: POOJA BHARDWAJ Call Or Whatsapp - 7678370584  ","location":"Noida","experience":"1-6Years"},{"date":"20 - Feb - 2021","skills":"Java/ J2EE, MVC, Ajax, JSON, Web Services, JavaScript, Oracle SQL, HTML 5 & CSS","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Contact - Rashmi Raghav (7338613505)","phone":"7338613505","profile":" Java Developer (Freshers) \nNevvit Technologies Private Limited","description":"Candidate must have good knowledge on application frameworks, such as Java Spring MVC, Spring boot & Hibernate. Should have excellent knowledge of Java/ J2EE, MVC, Ajax, JSON, Web Services, JavaScript, Oracle SQL, HTML 5 & CSS. Work Location: Harohalli, Kanakapura Road, Bangalore Mode: Permanent Position Salary: 12,000 K Scheduled Interview Date: 20th February 2021 (Saturday) - F2F Discussion Interview Timings: 11.00 AM Contact - Rashmi Raghav (7338613505)  ","location":"Bangalore","experience":"0-1Years"},{"date":"17, 18, 19, 22, 23, 24, 25, 26 - Feb - 2021","skills":"Java/ Android/ IOS/ Python/ Block chain","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Ionixx Technologies Private Limited, No. L 25 (Second Floor), Dr. Vikram Sarabhai Instronics Estate, SRP Tools, Thiruvanmiyur, Chennai - 600 041.","phone":"Not Provided","profile":" Software Trainee Programmer \nIonixx Technologies Private Limited","description":"Hiring for 2019 & 2020 Pass out Students Only (Any working employees move into software Development opportunities with Ionixx Technologies) for Trainee Programmers. Educational Qualification: BE/ B.Tech (CS, IT, ECE) & ME/ M.Tech (CS, IT, ECE) & MCA (Percentage: Bachelor/Master Degree: 60% and 10th& +2: 60 % and above) Certification in Java/ Android/ IOS/ Python/ Block chain is an Added advantage No standing arrears Selection Process - Interview Levels: 1. Online Test (1.30 hour) with 100 questions each on Analytical and Technical 2. Programming Test - Candidates have to develop a program & demonstrate the same to the panel 3. Basic Technical discussion 4. One to one HR discussion and issue of the offer letter, if selected. Terms & Conditions for above the Students: The relationship bond period is 3 years along with 2 Lakhs cheque will be submitted on the date of joining in the internship. Stipend for students Rs.10 K per month(Internship Period) Six Month internship period Six months evaluation process, if a selected candidate fails to meet our expectation he/she will be terminated during the evaluation period Will offer 3 Lakhs CTC after Successful completion of the internship. If you are interested, please share your updated profile to senthilmurugan.raju@ionixxtech.com Or reach me 7397385400. Interview Day/ Time: 17th - 26th February (Monday To Friday) between 10.30 AM To 4.00 PM Venue Details- Ionixx Technologies Private Limited, No. L 25 (Second Floor), Dr. Vikram Sarabhai Instronics Estate, SRP Tools, Thiruvanmiyur, Chennai, Tamil Nadu - 600 041. Landmark: Velachery Road - SRP Tools Bus stop. Scheduled candidates only allowed for the interview on the scheduled interview Date & Time. Candidate must bring any original photo id proof like Aadhaar or PAN Card Note - We are not collect any fees from any candidate.  ","location":"Chennai","experience":"0-1Years"},{"date":"17, 18 - Feb - 2021","skills":"ASP .Net, Web Services, SQL Server, HTML, CSS, JavaScript, and C#/ VB .Net","qualification":"B.E./B.Tech, MCA/PGDCA","address":"C-56, A/12, 3rd Floor, OPUSING LLC Technopolish Building, Opposite Stellar IT Park, Sector 62, Noida - 201 301","phone":"9310277794","profile":" ASP .Net Developer (Web Forms) \nFlentisPRO","description":"Hunting for few good resources 'ASP .Net Developer (Web Forms)' for our own organisation 'FLENTIS CORPORATION' - US Canada Based IT Setup, (a sister concern of OPUSING LLC INFORMATION SERVICES PVT. LIMITED) Technical Requirements: Fluent in ASP .Net, Database design and development (Microsoft SQL Server) Experience with not limited to ASP .Net, Web Services, SQL Server, HTML, CSS, JavaScript, and C#/ VB .Net Should have experience on multiple projects especially US Canada based projects that will be plus point. Must have excellent communication skills Skill Required: Hands on with ASP .NET 4.7, ASP .NET, WEB SERVICES, SQL Server HTML, CSS, Bootstrap C#, XML, JQUERY, WEB API, Understanding of GIT Shift timing: Summer: 6:30 pm to 3:30 am & Winter: 7:30 pm to 4:30 am IST Job Responsibilities: Analyze system requirements and prioritize tasks Upgrading/ Working on existing .NET websites and applications. Write clean, testable code using .NET programming languages Test and debug various .NET applications Review and refactor code Deploy fully functional applications Document development and operational procedures Rounds of Interview- Face to face interviews- including Technical test (on the spot offers) Walk-in Date/ Time: 16th February - 18th February 2021, 12.30 PM - 6.30 PM Venue Details- Flentis Corporation (Sister concern of Opusing Information Services Pvt Limited) C-56, A/12, 3rd Floor, OPUSING LLC Technopolish Building, Opposite Stellar IT Park, Sector 62, Noida - 201 301  ","location":"Noida","experience":"5-10Years"},{"date":"15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28 - Feb - 2021","skills":"HTML/ CSS Concepts & Data Structure Concepts, C, C++, OOPS Concepts","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Beryl Systems Private Limited, SCF 8, Second Floor Sector 11 D, Faridabad, Haryana - 121 006","phone":"8882920531","profile":" Graduate Engineer Trainee \nBeryl Systems Private Limited","description":"Great opportunity for Freshers/ Young Engineers at Beryl Systems Private Limited - Software IT company Candidates from B.Tech/ B.E/ MCA/ M.Tech (in only CSE or IT) with 60% throughout academics and No Backlogs. Students in their last semester can also apply. Should have good understanding of Database Concepts, OS, HTML/ CSS Concepts & Data Structure Concepts, C, C++, OOPS Concepts. Excellent Problem-Solving skills and solution-oriented attitude. Keen to learn new technologies and implement those to solve business problems and improve application efficiency. Must have capacity to work independently and also as a part of team Go-getter attitude and a strong work ethic Excellent written and verbal communication skills Walk In Interview: 15th - 28th February 2021 Time : 11am - 6pm Venue Details- Beryl Systems Private Limited SCF 8, Second Floor Sector 11 D, Faridabad -121006, Haryana Contact - BHAWNA SHARMA (8882920531)  ","location":"Faridabad","experience":"0-1Years"},{"date":"15, 16, 17, 18, 19, 20, 21 - Feb - 2021","skills":"HR/ Recruitment, Time Office Administration","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Appidi Technologies Private Limited, 123, Jeedimetla Village, Quthbullapur Road Hyderabad - 500 055.","phone":"9701211899","profile":" Assistant Manager - HR \nAppidi Technologies Private Limited","description":"Candidate should be Any Graduate with good communication skills having thourough experience as independent charge in handling medium size company with100 employees, excellent in recruiting skilled and semi skilled. Key Responsibilities- Job calls for good aquentance in Engineering manfuacturing units and must have handled routine manpower recruitment, time office, staturoty matters, training etc., Candidate should work with independent charge and must have very good experience. Walk-in Date/ Time: 15th February - 21st February , 10.30 AM - 6.00 PM Venue Details- Appidi Technologies Private Limited 123, Jeedimetla Village, Quthbullapur Road Hyderabad - 500 055. Contact - Ashwini (9701211899) Email- HR@APPIDITECH.COM  ","location":"Hyderabad","experience":"5-10Years"},{"date":"16 - Feb - 2021","skills":"Recruitment, Staffing & comprehensive HR services","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"ACZ Global Private Limited, #19, PM Enclave, GKVK Post, Near Mother Dairy, Yelahanka New Town, Bengaluru, Karnataka - 560065","phone":"9886111658","profile":" HR Recruiter/ Executive \nACZ Global Private Limited","description":"Looking for NON IT Recruiter/ Executive with B.com/ M.Com Degree Qualification (If BBM/ MBA \u0096 they need be with finance background) Passionate about Recruitments with good communication skills End to End recruitment cycle of ACZ Must be Flexible in working Job Responsibilities: Will be responsible for front-end recruitment activities. Should be able coordinate with Team Lead to understand requirements and Work on job specifications as per the assigned requirements. Should be smart enough to handle requirements simultaneously. Focus on sourcing quality resumes through head hunting, Job Portals and Social Networking Sites. Efficiently manage Recruitment process and actively involved in each phase of it. To communicate effectively and work with team members and managers at all levels. Understanding of the latest technology knowledge. If interested walk-in directly to our office on 16th (Tuesday) 2021: ACZ Global Private Limited #19, PM Enclave, GKVK Post, Near Mother Dairy, Yelahanka New Town, Bengaluru, Karnataka - 560065 For details Call- 9886111658  ","location":"Bangalore","experience":"2-6Years"},{"date":"8, 9, 10, 11, 12, 13, 14, 15 - Feb - 2021","skills":"General Administration, Back Office, Documentation, etc","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Pelican (India) Private Limited, Bhosale Terrace, Opposite to Surya Hotel, Deccan, Pune","phone":"8180886080","profile":" Back Office Executive \nPelican (India) Private Limited","description":"Candidate should be Any Graduate with good interpersonal skills, including the ability to deal with people from a wide range of backgrounds, ages and temperament excellent skills on MS Word and Excel. Can be fresher or experienced and ready to take new challenges. Required Skills: Scanning Operator/ Data Entry Operator Shift Timing: Genaral Shift Hiring in both process in domestic BPO Walk-in Date/ Time: 6th - 15th February 2021, 9.30 AM - 5.30 PM Venue Derails- Pelican (India) Private Limited Bhosale terrace, Opp. to Surya Hotel, Deccan, Pune Contact - Mr. Bharate (8180886080)  ","location":"Pune","experience":"0-1Years"},{"date":"14 - Feb - 2021","skills":"Talent Acquisition/ Recruitment, Lateral Hiring, Volume Hiring, Bulk Hiring","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Visionary RCM Infotech (India) Private Limited, 4th Floor, Tidel Park, Elcot SEZ, Aerodrome Po., Coimbatore - 14","phone":"8939207603","profile":" Talent Acquisition Executive \nVisionary RCM Infotech (India) Private Limited","description":"Candidate must be a MBA Graduate with 3 to 5yrs of experience in bulk or volume hiring Candidate must have handled end to end recruitment process Candidate should have experience in Campus & Fresher Hiring Candidate should be strong in screening process Candidate with prior experience in Healthcare is preferable. Should know to implement recruitment strategies. Job Responsibilities- Assessing the hiring needs of the organization and developing job descriptions and specifications accordingly. Designing and implementing recruitment strategies such as events and social media campaigns. Sourcing talented candidates through a variety of means including events, advertising, and databases. Maintaining relationships with universities, student organizations, and recruitment networks. Screening resumes and scheduling interviews. Managing and conducting interviews with shortlisted candidates. Managing all administrative tasks such as updating recruitment databases, hiring profiles, and applicant documentation. Hosting and attending college career days and conferences. Walk-in Date/ Time: 14th February 2021 from 9.30 AM onwards Venue Details- Visionary RCM Infotech (India) Private Limited 4th Floor, Tidel Park, Elcot SEZ, Aerodrome Po., Coimbatore - 14 Contact Person- Lokesh HR -8939207603  ","location":"Coimbatore","experience":"3-5Years"},{"date":"14 - Feb - 2021","skills":"Email Process, Chat Process, Customer Support","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Tech Mahindra Limited, Delta 1, 2nd Floor, Giga Space, Vimanagar, Pune","phone":"9579167599","profile":" Backoffice Executive (Email Process) \nTech Mahindra Limited","description":"Qualification Required : Any Graduate / Age Criteria - 18 to 35 Max Experience Required : 1 Year BPO Experience (Email & Chat Process) Minimum 1 Year - Email / Chat Process Experience is Mandatory Shift: 8 Am to 8 Pm Rotational Shift ( One Week off-rotational) Salary: 180000-220000 LPA The primary responsibilities of a Customer Service specialist would be: Handling escalations and complex queries. Manage large amounts of emails & chats Answer calls professionally to provide information about products and services, take/ or obtain details of complaints. Identify and assess customers needs to achieve satisfaction Build sustainable relationships and trust with customer accounts through open and interactive communication Key skills required: Proven customer support experience or experience as a client service representative Excellent English communications skills Ability to listen and active problem solving skills Good interpersonal skills Ability to handle pressure Ability to multi-task, prioritize, and manage time effectively Walk-in Date/ Time: 14th February 2021, 9.30 AM - 5.30 PM Venue Details- Tech Mahindra Limited Delta 1, 2nd Floor, Giga Space, Vimanagar, Pune Interview Process- Telephonic/ Walk-in Work Location- Viman Nagar Giga Space IT Park Contact Person- Prachi -9579167599  ","location":"Pune","experience":"1-4Years"},{"date":"10, 11, 12 - Feb - 2021","skills":"HR Generalist Activities, IT Recruitment, HR Operations/ Recruitment","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Computer Junction Private Limited, C-129, Naraina Industrial Area, Phase-1, New Delhi - 110 028 (India)","phone":"011-42333333","profile":" HR Executive \nComputer Junction Private Limited","description":"Candidate should be Any Graduate with at least 3 year experience in Recruitment by Naukri.com, LinkedIn, other Social sites, HR Generalist role, letter drafting, employees records filling. Must have good knowledge of MS-Excel with excellent communication skills. Job Responsibility- Recruitment through Naukri.com, other portal, references Screening, interview line-up of short-listed candidates Joining Documentation filling of employees Background Verification Letter drafting, employees data update HR Operations Wishes E-mailer Walk-in Date/ Time: 10th - 12th February 2021, 2.00 PM - 5.00 PM Venue Details- Computer Junction Private Limited C-129, Naraina Industrial Area, Phase-1, New Delhi - 110 028. Contact - Jeetu Chauhan (011-42333333)  ","location":"Delhi","experience":"3-5Years"},{"date":"10 - Feb - 2021","skills":"General Administration, Office Management, Conflict Resolution, Office Coordination","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"The Mirador, 131 / B, Link Road, Chakala, Andheri East, Mumbai, Maharashtra - 400 099","phone":"Not Provided","profile":" Administration Executive \nSpice Healthcare Private Limited","description":"Educational Qualification: Any Graduate Work Experience: 1 - 4 years Required Skill Sets- Excellent Communication skills (English language) Excellent interpersonal and coordination skills Job Responsibilities- Keeping coordination with Head office and vendors for all requirements, supplies ,material management and bill verification for Laboratories. Keeping record of staff attendance and other admin related requirements of Labs. Handling small maintenance issues related to Lab facilities. Interested candidates may walk- in with their updated resume at the below mentioned interview and venue details: Walk-in Date: 10th February, 2021 Time: 10:00AM to 1:00 pm Venue: The Mirador 131 / B, Link Road, Chakala, Andheri East, Mumbai, Maharashtra - 400 099  ","location":"Mumbai","experience":"1-4Years"},{"date":"10 - Feb - 2021","skills":"Office Assistance, Office Administration, Front Office/ Receptionist Activities","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Kumar Prestige Point, 1st Floor, Office No. 11 A, 283, Shukrawar Peth, Opp. Chinchechi Talim, Near B, Pune","phone":"9667671155","profile":" Receptionist/ HR Admin Officer \nA S foundation - Leading CA's & Faculties Group","description":"Desired Candidate Profile Minimum 12th Pass/ Graduate Any Stream. Should Possess Good English, Hindi & Marathi Speaking Skills. Good organisational skills and attention to detail Exceptional multitasker Excellent communication skills Courteous, Strong customer service skills Roles and Responsibilities- Handling queries via phone, email and general correspondence Greeting all visitors, Transferring calls as necessary Possibly managing office supplies such as stationery, equipments etc Performing ad-hoc administration duties Maintaining office services as required (Admin Work) Receiving and dispatching deliveries Assisting with mail as required Taking and ensuring messages are passed to the appropriate staff member on a timely basis Assisting the HR team Perks and Benefits Monthly Sal Between 12k-15 K in Hand Plus Incentives. Freshers Can APPLY Ask For HR Manager Tehseen- 9667671155 Please Email Your Resumes at Tehseen@asfoundtation.co.in Mention Subject As HR Admin. Walk-in Date/ Time: 10th February 2021, 11.00 AM - 2.30 PM Venue Details- Kumar Prestige Point, 1st Floor, Office No. 11 A, 283, Shukrawar Peth, Opp. Chinchechi Talim, Near B, Pune, Maharashtra. Contact - HR Manager Tehseen (9667671155)  ","location":"Pune","experience":"0-1Years"},{"date":"10 - Feb - 2021","skills":"Customer Service, Voice Process, Customer Support","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Reliable Spaces Private Limited, Reliable Tech Park, 5th floor A-1 Wing, Lift No. 4/5 behind reliable plaza Airoli","phone":"8108298319","profile":" Customer Response Executive \nReliable Spaces Private Limited","description":"Job for Sales Experience and Linguist Fresher and any BPO Experienced Candidates. Candidates should know Good English and Hindi. Shift timing 9.30 am to 6.30 pm. Sunday Fixed WK Off Job location Airoli. Salary up to 8k to 18k CTC Walk-in Date/ Time: 10th February 2021, 9.30 AM - 5.30 PM Venue Details- Reliable Spaces Private Limited Reliable Tech Park, 5th floor A-1 Wing, Lift No. 4/5 behind reliable plaza Airoli Interested candidate can call or come for direct Interview. Meet HR Susheel. 8108298319  ","location":"Mumbai","experience":"1-2Years"},{"date":"10 - Feb - 2021","skills":"General Administration, Office Management, Conflict Resolution, Office Coordination","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"PVR Projects Limited, IIIrd Floor Sri Durga Chambers, Thakur Mansion Lane, Behind Khazana Jewellery, Somajiguda Circle, Punjagutta, Hyderabad - 500 082.","phone":"040-23348080","profile":" Administrative Assistant (Female) \nPVR Projects Limited","description":"Candidate should be Any Graduate with 2 to 3 years experience in General Administration, Office Management, Computer Operations, Conflict Resolution, Office Coordination and Facility Management. Should have excellent interpersonal & problem solving skills Walk-in Date/ Time: 10th February 2021, 11.00 AM - 5.30 PM Venue Details- PVR Projects Limited IIIrd Floor Sri Durga Chambers, Thakur Mansion Lane, Behind Khazana Jewellery, Somajiguda Circle, Punjagutta, Hyderabad - 500 082. Phone: 040-23348080/ 23418080  ","location":"Hyderabad","experience":"2-3Years"},{"date":"8, 9, 10, 11, 12 - Feb - 2021","skills":"ASP .NET, Web Services, SQL Server, HTML, CSS, Java Script, and C#/ VB .NET","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Flentis Corporation(Sister Concern of Opusing Information Services) C-56 A/12, 3rd Floor, Sector 62, Technopolis IT Hub building (Opposite Stellar IT Park) Noida - 201 301.","phone":"9310277794","profile":" ASP .Net Developers \nFlentis Corporation (Sister Concern of Opusing)","description":"Hunting for few good resources ASP .Net Developers' for our own organisation 'FLENTIS CORPORATION' - US Canada Based IT Setup (A Sister concern of OPUSING LLC INFORMATION SERVICES PVT. LIMITED) Technical Requirements: Fluent in ASP .Net, Database design and development (Microsoft SQL Server) Experience with not limited to ASP .NET, Web Services, SQL Server, HTML, CSS, JavaScript, and C#/ VB .NET Should have experience on multiple projects especially US Canada based projects that will be plus point. Must have excellent communication skills. Job Responsibilities: Analyze system requirements and prioritize tasks Upgrading/ Working on existing .NET websites and applications. Write clean, testable code using .NET programming languages Test and debug various .NET applications Review and refactor code Deploy fully functional applications Document development and operational procedures KINDLY WALKIN ONLY IF YOU ARE OK WITH US SHIFT-NIGHT SHIFT Shift timing: Summer: 6:30 pm to 3:30 am & Winter: 7:30 pm to 4:30 am IST Walk-in Date/ Time: 8th February - 12th February , 12.30 PM - 6.30 PM Venue Details- Flentis Corporation(Sister Concern of Opusing Information Services) C-56 A/12, 3rd Floor, Sector 62, Technopolis IT Hub building (Opposite Stellar IT Park) Noida - 201 301. Contact - Ruchi Garg (9310277794)  ","location":"Noida","experience":"5-10Years"},{"date":"2, 3, 4, 5, 6 - Feb - 2021","skills":"Front desk/ Receptionist Activities, Front Office Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"KSNR Immegration Services Pvt. Limited, H-49, ALPC Business Park, 4th Floor, Sector-63, Noida.","phone":"7290016169","profile":" Front Office Executive \nKSNR Immegration Services Pvt. Limited","description":"A front office executive is the one who is responsible for overseeing the interaction with clients and handling their service requests. The duty includes delegating the request to the appropriate person or serves them personally. The executive has to fulfill the administrative tasks as well as front office executive duties. Duties and Responsibilities The duties and responsibilities of a front office executive are as follows: The main duty is to do the Management of the front desk. The person should take in charge of all front desk operations. Has to attend incoming and outgoing calls and transfer calls to various departments. Has to be responsible for dispatching courier mails and keeping a record of them. Has to maintain the coordination of ID and other visitors cards. Has to distribute inwards documents received and responsible for the payments of bills. Has to handle all of the company's petty cash. Has to work as an in charge of the utilities and maintenance of furniture. Skills Required The required skills and specifications are as follows; The person must have a friendly personality to do the job. The others skills required are the excellent interpersonal and communication skills. Should be able to work well under pressure and may be independently or as part of a team. The person must have the ability to accurately record information. Should be multi tasking. Walk-in Date/ Time: 2nd February - 6th February , 9.30 AM - 5.30 PM Venue Details- KSNR Immegration Services Pvt. Limited H-49, ALPC Business Park, 4th Floor, Sector-63, Noida. Contact - Tania Kaul (7290016169)  ","location":"Noida","experience":"0-1Years"},{"date":"5 - Feb - 2021","skills":"Contract Staffing, IT Staffing/ IT Recruitment/ C2H Sourcing","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Artech Infosystems Private Limited, Cyber Park, 1st floor, B Block, Doddathogur, Electronic City Phase 1, Bangalore - 50","phone":"Not Provided","profile":" IT/ Technical Recruiter \nArtech Infosystems Private Limited","description":"We are looking for 'IT/ Technical Recruiter' for our company - Artech Infosystems Private Limited Educational Qualification: Any Graduate Work Experience: 2- 5 Years Good Communication skills (Spoken/ Written) Positive and Energetic. Keen learn more about Recruitment Dedicated towards work. Basic Knowledge in MS office IT Recruitment and Contract Staffing (C2H) is mandatory Notice period: Immediate or should be able to join within 15 days. Roles and Responsibilities Source resumes from Job Portals, LinkedIn and other channels for the requirements Screen the candidates as per the given requirements of the clients. Submit the resumes of the candidates for Internal and External review as instructed by the supervisor. Schedule telephonic discussion and in-person meetings for candidates shortlisted by the internal supervisor / client manager. Connect with the candidate to ensure that scheduled meetings happen on time and if there is a delay keep all the concerned parties informed. Submit a daily, weekly and monthly tracker as per the format suggested by the internal supervisor and the external client manager. Ensure that offer letters are released on time and keep in regular touch with the candidates till they join the required organization. Build a database of candidates with the relevant information (Name, contact info, skill sets, education, experience etc.) on a regular basis and share that with the internal supervisor. Strong Negotiating Skills with Go Getter attitude and ability to work under pressure Walk-in Date/ Time: 5th February 2021, 10.00 AM - 2.00 PM Venue Details- Artech Infosystems Private Limited Cyber Park, 1st floor, B Block, Doddathogur, Electronic City Phase 1, Bangalore - 50 Landmark: Close to Genpact Electronic City-1 Contact Person - Kalai  ","location":"Bangalore","experience":"2-5Years"},{"date":"5 - Feb - 2021","skills":"Creative Writing, Content Management, Content Editing, Web Content Writing","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Platinum Techno Park, 1001, 10th Floor, Plot No-17- A, Bhagwan Mahaveer Rd, Sector 18, Vashi, Navi Mumbai, Maharashtra - 400 703.","phone":"9136667791","profile":" Content Writer \nITM Edutech (India) Limited","description":"Job Opening for Content Writer with ITM Group of Institutions Navi Mumbai Qualification: Only Graduates can apply. General Shift: (9:30 am to 6 pm) Organization: ITM Group of Institution Job Location : Nerul, Navi Mumbai Benefits: Every Month 3 Paid leaves Walk-in Date/ Time: 5th February 2021, 10.00 AM - 3.00 PM Venue Details- Platinum Techno Park, 1001, 10th Floor, Plot No-17- A, Bhagwan Mahaveer Rd, Sector 18, Vashi, Navi Mumbai, Maharashtra - 400 703. Contact - Shony Yadav (9136667791) If interested email me your CV on yshony@itm.edu with the below details- Total Experience : Current CTC: Expected CTC: Notice Period: Availability of face to face interview on Friday ie 5th Feb 2021 . Note: Its Not work from Home Kindly Carry Hard copy your updated resume Wearing a mask is compulsory and please download the Aarogya Setu App Check our website itm.edu and study about our products/ programs for the interview  ","location":"Mumbai","experience":"1-5Years"},{"date":"5 - Feb - 2021","skills":"IT Recruitment, Human Resource Management","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Contact - ( 9884834539 )","phone":"9884834539","profile":" HR Executive/ IT Recruiter \nSixsigma Softsolutions Private Limited","description":"Candidate should be Any Graduate with 0 to 2 years experience in IT Recruitment, Human Resource Management. Must have fluent communication in English & should have basic knowledge in recruitment process. Freshers can also apply Only Female Candidates required Telephonic Interview- 5th February 2021, 10.30 AM - 4.00 PM Contact No - (9884834539)  ","location":"Mumbai","experience":"0-2Years"},{"date":"5 - Feb - 2021","skills":"HR/ Recruitment, BPO Hiring, Volume Hiring, Sourcing, Mass Hiring","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Policybazaar Insurance Brokers Pvt. Limited, Plot 110 Sector 44 Gurgaon, Haryana. Landmark- Near Ramada Hotel","phone":"Not Provided","profile":" HR Executive/ Recruiter \nPolicybazaar Insurance Brokers Pvt. Limited","description":"Candidate should be a Graduate with minimum 1 year of experience in BPO Recruitment, Bulk Hiring Roles & Responsibilities- To achieve the target assigned within agreed quality & timelines. Independently manage recruitment for all positions across all verticals. Co-ordinate/ liaison with placement consultants/ institutions etc. Conducting skill testing & interviews Planning & Sourcing for specific recruitment within defined time frames Ensuring that documentation and salary fitment is as per agreed guidelines, to maintain Green status in compliance front Contribute to creating an organizational image, which would help in attracting and recruiting the best talent Seek to expand the talent pool by evaluating new employee profiles and assess their suitability Stakeholder management What do we offer? Amazing work culture Complete Day shift 6 Days working Shift Timing - 10:00 AM to 07:00 PM Walk-in Date/ Time: 5th February 2021, 11.00 AM - 4.00 PM Interview Venue- Policybazaar Insurance Brokers Pvt. Limited Plot 110 Sector 44 Gurgaon, Haryana. Landmark- Near Ramada Hotel Contact - Sanjog Katyal  ","location":"Gurgaon","experience":"1-4Years"},{"date":"5 - Feb - 2021","skills":"HR/ Recruitment, BPO Hiring, Volume Hiring, Sourcing, Mass Hiring","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Policybazaar Insurance Brokers Pvt. Limited, Plot 110 Sector 44 Gurgaon, Haryana. Landmark- Near Ramada Hotel","phone":"Not Provided","profile":" HR Executive/ Recruiter \nPolicybazaar Insurance Brokers Pvt. Limited","description":"Candidate should be a Graduate with minimum 1 year of experience in BPO Recruitment, Bulk Hiring Roles & Responsibilities- To achieve the target assigned within agreed quality & timelines. Independently manage recruitment for all positions across all verticals. Co-ordinate/ liaison with placement consultants/ institutions etc. Conducting skill testing & interviews Planning & Sourcing for specific recruitment within defined time frames Ensuring that documentation and salary fitment is as per agreed guidelines, to maintain Green status in compliance front Contribute to creating an organizational image, which would help in attracting and recruiting the best talent Seek to expand the talent pool by evaluating new employee profiles and assess their suitability Stakeholder management What do we offer? Amazing work culture Complete Day shift 6 Days working Shift Timing - 10:00 AM to 07:00 PM Walk-in Date/ Time: 5th February 2021, 11.00 AM - 4.00 PM Interview Venue- Policybazaar Insurance Brokers Pvt. Limited Plot 110 Sector 44 Gurgaon, Haryana. Landmark- Near Ramada Hotel Contact - Sanjog Katyal  ","location":"Gurgaon","experience":"1-4Years"}]}