{"Walkins":[{"date":"23 - Jul - 2019","skills":"IT Recruitment, Sourcing HR Operations, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Info Edge India Limited, B 8, Sector 132, Noida (Opposite Jaypee Hospital)","phone":"Not Provided","profile":"Senior Executive - Recruitment \nInfo Edge India Limited","description":"Candidate should have minimum 1 years of Recruitment Experience. Understanding of skills, and other features in a CV and analyzing the same. Must have good communication skills Key Responsibilities: Analyzes jobs, resumes, skills, qualifications and other relevant parameters Provides inputs for better Job Recommendation Communicating with Job-Seekers to identify gaps in Job Recommendations Understanding the key skills required across industries and functional areas Screening of profiles with respect to Job Requirements of various industries Why should you join us? 5 days working ( Monday-Friday) Shuttle service available from office to botanical metro station. No Field job Back-end Job with Limited Calling Walk-in Date: July 23, 2019 (Tuesday) Time: 10 AM - 2 PM Interview Venue- Info Edge India Limited B 8, Sector 132, Noida (Opposite Jaypee Hospital) Note : This is not a recruitment profile, but experience in recruitment, consultancy firms or US Staffing will be preferred","location":"Noida","experience":"1 - 5 Years"},{"date":"19, 20 - Jul - 2019","skills":"Technical Support, Voice Process, IT Helpdesk","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"9th Floor, Vega Building, The V-Ascendas IT Park, Plot No 17, Software, Units Layout, HITEC City, Inorbit Mall Road, D Block, Madhapur, Hyderabad, Telangana - 500 081","phone":"8801546426","profile":"Technical Support/ IT Helpdesk \nDIEBOLD Nixdorf Private Limited","description":"DIEBOLD Nixdorf Private Limited, is hiring for IT Technical Support Process (IT Help Desk) Qualification: Graduate and above, Min Experience: 1-5 Years (even fresher can apply), Shifts: 24/7 which includes grave yard shifts as well, CTC: Based on experience and last package (hike will be provided as per expr), Cab: Yes, home pick and home drop, Max Age: 30, Week off: 2 days rotational week offs, Work Location: Hi-tech city (Ascends IT park, beside in orbit mall), Benefits: Both the way cab + Medical benefits as per policy and Night shift allowances provided. Please Note: We have only requirements for International Voice with rotational shifts. Walk-in Date: 19th and 20th July, Timing: 1pm to 5pm, Interview Venue : 9th Floor, Vega Building, The V-Ascendas IT Park, Plot No 17, Software, Units Layout, HITEC City, Inorbit Mall Road, D Block, Madhapur, Hyderabad, Telangana - 500 081 Contact: Arvind Balduri, Cell: 8801546426, (Please drop us a text if we missed you call) Be free to call us if you have any references that would be highly appreciated.","location":"Hyderabad","experience":"0 - 5 Years"},{"date":"22, 23 - Jul - 2019","skills":"General Administration, Housekeeping Pest Control, Travel Desk, Amc, Front Office Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Kotak Mahindra Life Insurance Company Limited, #337, 1st floor, 27th Main Road, HSR Layout Sector 2, Bangalore - 560 102 Landmark: Opposite to KLM MALL","phone":"022-66057050","profile":"Administration Executive \nKotak Mahindra Life Insurance Co. Limited","description":"FMG Role: Managing Front Office/ Reception/ Housekeeping/ Security/ Courier services/ Vendors Maintaining Registers & Reports. Budgeting and working for cost reduction/saving. Printing & Purchase of Stationeries Repairs and upkeep of branch infrastructure (AC, DG , telephone lines), Engineering Services(AC, UPS Electricity etc). Arranging all the required items for routine operations. Managing On time Vendor Payment Process Ensuring AMC's and contract copies are maintained at branch. Travel & stay Co-ordination with Centralised Travel desk Space Management (Seat allotment & Storage) HR Support at Branch level: Coordinating for Ecode, offer letter, Arranging Aptitude test for the candidates Support for new joiner & employee exit formalities. Pest Control. (To ensure that the office hygiene maintain) Coordinate / Deal with the Building and office landlord for admin related activities Organizing and conducting security audit checks as well as formulating and implementing the emergency procedures & mock drills. Preferences -(Only Female Candidates can apply) Candidates with experience in the below profiles will not be suitable - (Tele calling or customer care profiles (Insurance, Credit card, Holiday Selling etc), Sales background, Account Assistant/Purchase Assistant, Secretaries/Receptionists, Telephone Operators and Admin profiles from educational institutions.) Candidates should be a Graduate with minimum 6 month work-experience. Age should not be more than 28 Knowledge of Admin role is a must Aware of Local language must Walk-in Date: 22nd - 23rd July 2019 Time : 10:30 AM - 3:00 PM Interview Venue: Kotak Mahindra Life Insurance Company Limited #337, 1st floor, 27th Main Road, HSR Layout Sector 2, Bangalore - 560 102 Landmark: Opposite to KLM MALL Contact Person: Priyanka Prakash Contact No. 022-66057050 Email ID - kli.jayshree-bhati@kotak.com","location":"Bangalore","experience":"0 - 1 Years"},{"date":"20, 22, 23, 24, 25, 26 - Jul - 2019","skills":"General Administration, Office Management, Administrative Assistance, Front Office, Attendance Maintenance","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"New Resolution India, 85/ B, First Floor, Kamgar Nagar, Opposite Vishal Tower No. 1, Kurla East, Mumbai, Maharashtra - 400 024","phone":"Not Provided","profile":"Administration Executive \nNew Resolution India","description":"Candidate should be Any Graduate with 3 to 5 years of experience in General Administration, Office Management, Administrative Assistance, Front Office, Attendance Maintenance. Must have excellent communication skills Job Responsibility- Handle day to day administration of office Liaisoning with stake holders Search for office spaces Walk-in Date/ Time: 20th - 26th July 2019, 11 AM onwards Interview Venue: New Resolution India 85/ B, First Floor, Kamgar Nagar, Opposite Vishal Tower No. 1, Kurla East, Mumbai, Maharashtra - 400 024","location":"Mumbai","experience":"3 - 5 Years"},{"date":"20, 22, 23, 24, 25, 26, 27, 29, 30, 31 - Jul - 2019","skills":"General Administration, Front Office / Receptionist Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"R K Global Shares & Securities Pvt. Limited, 6B, 6th Floor, 6 Tilak Marg, Sagar Apartments, Near India Gate - 110 001 (Nearest Metro Station - Mandi House)","phone":"Not Provided","profile":"Front Office/ Admin Executive \nR K Global Shares & Securities Pvt. Limited","description":"Person should be Any Graduate with 1 to 4 years of experience in General Administration, Front Office / Receptionist Activities. Would be doing front office plus admin role. Smart Female candidates need to apply Job Responsibility- To answer incoming calls and address the concerns Greet guests courteously Dispatch of inward and outward courier Supervising Security & Housekeeping Team Walk-in Date/ Time: 20th - 31st July 2019, 10 AM onwards Interview Venue: R K Global Shares & Securities Pvt. Limited 6B, 6th Floor, 6 Tilak Marg, Sagar Apartments, Near India Gate - 110 001 (Nearest Metro Station - Mandi House)","location":"Delhi","experience":"1 - 4 Years"},{"date":"20, 21, 22 - Jul - 2019","skills":"Front Office Assistance, Front Desk/ Receptionist Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Raheja Developers Limited, 3rd Floor, Raheja Mall, Sohna Roadd, D1 Block, Malibu Town, Sector47, Gurugram, Haryana - 122 018","phone":"9958692607","profile":"Front End Desk/ Receptionist \nRaheja Developers Limited","description":"Required Skills: Pleasing personality Good communication skills Confident & extrovert Job Responsibility: Greetings clients Coordinating the meeting Calls Handling Handling the administrative work Work Experience: 2 - 7 Years Immediate joining is required Interview Date : 20th - 22nd July 2019 Time : 10 am to 5 pm Interview Venue: Raheja Developers Limited, 3rd Floor, Raheja Mall, Sohna Roadd, D1 Block, Malibu Town, Sector47, Gurugram, Haryana - 122 018 Contact Person: Priyanka Agarwal (HR) Please come along with your updated resume","location":"Gurgaon","experience":"2 - 7 Years"},{"date":"22, 23, 24, 25, 26 - Jul - 2019","skills":"Back Office Assistance, Customer Service","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Capita India Private Limited, Wing C Marisoft, Kalyani Nagar, Pune - 411 014","phone":"Not Provided","profile":"Customer Service - Insurance Back Office \nCapita India Private Limited","description":"We are hiring for UK International Customer Service - Insurance Back Office role in Capita. Mention below is the key skills. Any Graduate with excellent communications skills can apply.. Candidate need to be ok with UK shifts. Transport is provided (home pick-up and drop) Role & Responsibility: This is a back office customer service role which involves letter writing. The role requires an individual to comprehend and articulate a query or complaint raised by the customer and be able to provide an effective and accurate response to it. The individual is expected to take ownership and responsibility for personal performance targets. Role requires an individual to reflect on their performance and learn from their mistakes, seeing these as opportunities to improve on ones performance in the future. Interested candidates can directly WALK-IN with their updated CV and one photo ID proof on the mention below given address. Address:- Capita India Private Limited Wing C Marisoft, Kalyani Nagar, Pune - 411 014 Landmark - Opposite Gold Adlabs Contact Person :- Robinson/ Anushree Agrawal Walk-in Date: 22nd July to 26th July 2019 Starting Time: 9 AM","location":"Pune","experience":"0 - 3 Years"},{"date":"22, 23, 24, 25, 26 - Jul - 2019","skills":"Technical Support, Patch Management, Backup, Desktop Engineering, System Administration","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Inspirisys Solution Limited, 2nd Floor, Progress House, Pune Mumbai Road, Shivaji Nagar Pune - 411 005","phone":"Not Provided","profile":"Desktop Support Engineer \nInspirisys Solutions Limited","description":"Candidate should be Any Graduate with 1 to 3 years of experience in Technical Support, Patch Management, Backup, Desktop Engineering, System Administration, Application Support, Resource Utilization, Troubleshooting, User Management. Should have excellent communication skills. Job Responsibility- Install, upgrade, support and troubleshoot XP, Windows 7, Windows 8, Windows 10 and MicrosofOffice 2010, Office 2013 and any desktop applications. Install, upgrade, support and troubleshoot for printers, computer hardware and any other equipment. Performs general preventative maintenance tasks on computers, laptops, printers. Customize desktop hardware to meet user specifications and site standards. Resolved application related issues. Walk-in Date/ Time: 22nd - 26th July , 10 AM onwards Interview Venue: Inspirisys Solution Limited 2nd Floor, Progress house, Pune Mumbai Road, Shivaji Nagar Pune - 411 005 Contact Person: Ruqaiya Shaikh","location":"Pune","experience":"1 - 3 Years"},{"date":"19 - Jul - 2019","skills":"Technical Support, Java, SQL Database","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"In-Solutions Global Limited, 601 / 602, Palm Spring, Above Croma, Link Road, Malad West, Mumbai, Maharashtra - 400 064","phone":"Not Provided","profile":"Technical Support Engineer \nIn Solutions Global Limited","description":"Person should be Any Technical Graduate with 0 to 3 years of experience in Technical Support, Java, SQL Database. Must have excellent communication skills. Job Responsbility- Monitoring of Logs for Bank Analysis of transactions and making of reports. Assisting developers with reports & executing required DML & DDL commands. Deployment of database patches such as procedures and package changes on production. Walk-in Date/ Time: 19th July 2019, 10 AM onwards Interview Venue: In-Solutions Global Limited 601 / 602, Palm Spring, Above Croma, Link Road, Malad West, Mumbai - 400 064 Contact Person: Meena Sharma","location":"Mumbai","experience":"0 - 3 Years"},{"date":"19, 20, 21, 22, 23 - Jul - 2019","skills":"technical support, isp troubleshooting voice process bpo inbound process","qualification":"B.E./B.Tech","address":"Tech Mahindra Limited, Phase-3, Opposite TCS, Hinjewadi, Pune - 411 057","phone":"Not Mentioned","profile":"Technical Support Associates \nTech Mahindra Limited","description":"Tech Mahindra Limited, is hiring for Technical Support Associates (Monitoring profile) Resource should be BE/ B.Tech from any technical stream. Basic understanding of Telecom Network if experienced. Good Verbal, interpersonal and written communication skill. Should be confident to interact to customer. Day to day activity would involve technical and non-technical work. Should be ready to work in 24*7 rotational shift based on roster. Any 2 week offs in a week Transport available both ways Walk-in Date/ Time: 19th July - 23rd July , 12 PM onwards Interview Venue: Tech Mahindra Limited Phase-3, Opposite TCS, Hinjewadi, Pune - 411 057","location":"Pune","experience":"0 - 2 Years"},{"date":"20 - Jul - 2019","skills":"HR/ Recruitment, Hiring Process Compliance, Sourcing HR/ Operations","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"IndusInd Bank Limited, Solitaire Corporate Park, Guru Hargovindji Marg, Building No. 8, 3rd floor, Andheri Kurla Road, Andheri (East), Mumbai - 400 093","phone":"Not Provided","profile":"HR/ Recruitment Executive \nIndusInd Bank Limited","description":"Candidate should be Any Graduate/ MBA (HR) with 0 to 1 year experience in HR/ Recruitment, Hiring Process Compliance, Sourcing HR/ Operations. Must have excellent communication skills Job Responsibility- Recruitment (sourcing, screening, shortlisting candidates) from different tools and doing Operations role. Preparing Offer Letters and Coordinating and Salary Negotiation with the candidates. Doing payroll, on-boarding and exit formalities. Following up with the candidates for the date of joining, Training, Induction Programmes and handling their queries regarding other joining formalities. Regularly engage with Business and address their issues through appropriate HR interventions & solutions thereof. Identify & Drive hiring initiatives & ensure measurability & effectiveness across the concerned BU. It is a contractual role on payroll of the Bank. Immediate Joinee is preferable. Walk-in Date: 20th July 2019 Timing- 11 am to 4 pm Interview Venue: IndusInd Bank Limited, Solitaire Corporate Park, Guru Hargovindji Marg, Building No. 8, 3rd floor, Andheri Kurla Road, Andheri (East), Mumbai - 400 093 Concerned Person-Trisha","location":"Mumbai","experience":"2 - 5 Years"},{"date":"20 - Jul - 2019","skills":"ASP .Net 2008+, C#, SSIS, MS SQL Queries","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Nucsoft Limited, 301/ 302, Wing A, Sagar Tech Plaza, Andheri Kurla Road, Saki Naka, Andheri (East), Mumbai 400 072.","phone":"Not Provided","profile":"ASP .Net Developer \nNucsoft Limited","description":"Candidate should have 1+ years of experience in .Net Development Must have strong knowledge in ASP .Net 2008+, C# Basic understanding of SSIS Good hands on experience in MS SQL Queries Job Location : Mumbai Walk-in Date/ Time: 20th July 2019, 10 AM onwards Venue Details- Nucsoft Limited, 301/ 302, Wing A, Sagar Tech Plaza, Andheri Kurla Road, Saki Naka, Andheri (East), Mumbai 400 072. Landmark: Near Saki Naka Metro Station Mail ID : nazrana_alware@nucsoft.com","location":"Mumbai","experience":"1 - 6 Years"},{"date":"22 - Jul - 2019","skills":"ADO .NET, ASP .NET, C#, VB .NET (Windows/ Web Applications), SQL Server","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Exela Technologies (SourceHOV), 106, Annasalai, Guindy, Chennai - 32,","phone":"7550274743","profile":".NET Professionals \nSourcehov India Private Limited","description":"Qualification & Experience: # Any Graduate, Preferably BE (CSE), BTech (IT), MSC (IT) or MCA # Min of 2-7 Years of relevant experience in Software Development. Technical Skills: # Hands-on expertise in Programming Concepts. # Ability to think logically and solve basic problems. # Good coding techniques. # Proven experience in working on a large-scale Web/Data Applications. # Ability to work on multiple projects with strict deadlines. # Expertise in .NET Framework with any of the following: ADO .NET, ASP .NET, C#, VB .NET (Windows/ Web Applications) with strong exposure to SQL Server # Good experience in Front-End UI Design required. # Exposure in MVC Architecture an added advantage. # Domain knowledge in either Healthcare, F&A preferred Soft Skills: # Good communication & Inter-personal skills. # Strong in Numerical Ability & Logical Reasoning. # Go-Getter with positive attitude. Minimum Requirement to attend the Interview: # Excellent in Coding Skills and passionate towards writing Codes and Design. # Excellent in SQL / MySQL & MVC. # Good Understanding on Products and Product based company is an advantage. # A product Based / Healthcare / Financial background company is a plus. Walk-In Date: 22nd July 2019 Time: 10:00 AM Onwards Walk-In Venue: Exela Technologies (SourceHOV), 106, Annasalai, Guindy, Chennai - 32, Landmark: Near ABT Maruthi Showroom Contact Person : Sachin (HR) Note: - Kindly ignore the mail if you have already taken up the interview in the last 30 days.","location":"Chennai","experience":"2 - 7 Years"},{"date":"21 - Jul - 2019","skills":"C# Full Stack, .Net, ASP .Net","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"HCL Technologies Limited, Surya Saphire, Electronic City Phase 1, Behind Demart, Next to Bharat Petrol Bunk, First Floor, ODC 3, ODC8, Bangalore - 560 100.","phone":"Not Provided","profile":".Net/ Full Stack Developer \nHCL Technologies Limited","description":"HCL Technologies Limited is looking for Full Stack/ .Net Developers with good experience in MVC and C# Designation we are hiring : Senior Software Engineer/Technical Lead/ Senior Tech lead. Experience Looking for as below: 4 - 11 Years Work Location: Bangalore, HCL We are pleased to invite you for an interview process on 21st July'19 (Sunday) to explore the career opportunity in detail, and to get a better overview of your credentials and aspirations. Interview Date: 21st July' 2019 (Sunday) Timing: 9:00 AM to 2:30 PM Venue Details : HCL Technologies Limited Surya Saphire, Electronic City Phase 1, Behind Demart, Next to Bharat Petrol Bunk, First Floor, ODC 3, ODC8, Bangalore - 560 100 Please share your updated resume only to ahmed_s@hcl.com with below asked details at the earliest. Candidate Name: Mobile Number: Email ID: Total IT Experience: Current company: Notice Period: Are you serving Notice Period (if yes mention LWD): Current CTC in current company: Fixed CTC in current company: Variable CTC in current company: Expected CTC with HCL (with Variable pay only): Attending the F2F Scheduled interview on 21st July(Sunday) in Bangalore: Please share your updated resume to ahmed_s@hcl.com with the above asked details only ASAP.","location":"Bangalore","experience":"4 - 9 Years"},{"date":"19, 20 - Jul - 2019","skills":"VB .NET, ADO .Net, Web Technologies, ASP .Net, SQL Server","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Wipro Limited, 105, Annasalai, Guindy, Chennai - 600 032","phone":"Not Provided","profile":"Software Engineer (.Net) \nWipro Limited","description":"Job Responsibility: Utilizing VB .Net, ADO .Net, ASP .Net and SQL to help build out our Windows and web based solutions. Writing documentation to describe programming development, logic, and coding. Develop smart automation through VBA functionality. Skill Set: Good knowledge on VB & ASP .NET, VBA, VB SCRIPT (Mandate). Experienced in .NET Technologies including VB .NET, C#, ASP .NET, SQL Experience in Process Automation Tool creation on MS Office Applications and Mainframe and Web Application will be added advantage. Experience in BPS finance and accounts process automation & ERP applications - Added advantage. Educational Qualification: B-Tech/ BSc-IT, Bachelor's degree in Computer Science or related field. Work Experience: 1 to 4 Years Work Location: Chennai Notice Period: Immediate to 15 days Walk-in Date: 19th to 20th July 2019 Time: 9:30 am- 10:30 am Venue: Wipro Limited, 105, Annasalai, Guindy, Chennai - 600 032 Contact Person: Boopathy Documents to be carried: 3 copies of resume 1 passport size photo Govt. ID proof","location":"Chennai","experience":"1 - 4 Years"},{"date":"20 - Jul - 2019","skills":"Asp .Net & C# .Net, Angular/ Angular JS, JQuery & Java Script, SQL Server/ MySQL DBA","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"IMI Mobile Private Limited, Plot No. 770, Road No. 44, CBI Colony, Jubilee Hills, Near Police Station, CBI Colony, Jubilee Hills, Hyderabad, Telangana - 500 033","phone":"Not Provided","profile":".Net Developers \nIMI Mobile Private Limited","description":"IMImobile - Textlocal Product team is looking for .Net Developers with Angular experience. Kindly make yourself available for the In-Person discussion if your candidature suits the below Job description. Looking for only immediate joiners, notice period should be not more than 30 days Work Experience: Minimum 3 to 7 Years Should be having hands on experience with Asp .Net & C# .Net Should be having hand on experience in Angular/ Angular JS Good at Coding & Development (not support/ maintenance) Should be having hands on experience in JQuery & Java Script Should be having hand on experience in MVC SQL Server / MySQL DBA Interview Date: 20th July 2019 (Saturday) Time: 9:30 AM to 2:00 PM Venue Details: IMI Mobile Private Limited Plot No. 770, Road No. 44, CBI Colony, Jubilee Hills, Near Police Station, CBI Colony, Jubilee Hills, Hyderabad, Telangana - 500 033 Landmark: Opposite Lane of Madhapur Police Station Road and 2 Left (Diagonal Opposite to DMART) View in Google Map If interested, kindly help us with the below details. Total Experience: Current CTC: Expected CTC: Notice Period: Current Location: Available for Interviews on Saturday in between 9.30 AM to 2.00 PM: Reason for change: Attach your updated CV.","location":"Hyderabad","experience":"3 - 7 Years"},{"date":"20 - Jul - 2019","skills":"C#, ASP .Net, MVC, SQL Server","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"JNET Technologies Private Limited, Raghuma Towers, 5th Floor, 1-89/3/4, Hi-Tech City Main Road, Madhapur, Hyderabad - 500 081.","phone":"932399953","profile":".Net Developer \nJNET Technologies Private Limited","description":"WALK IN : DOT NET DEVELOPER : 20 JULY : 10.00 AM TO 4.00 PM Candidate should have 2 to 7 years of experience in C#, ASP .Net, MVC, SQL Server Very good analytical skills and problem solving ability. Should be good in communication MVC experience is mandatory. Below are the Interview rounds: 1. Technical Interview 2. Lead/ Manager round 3. HR Interview Walk-in Date/ Time: 20th July 2019, 10 AM onwards Interview Venue: JNET Technologies Private Limited Raghuma Towers, 5th Floor, 1-89/3/4, Hi-Tech City Main Road, Madhapur, Hyderabad - 500 081. Land Mark: Beside DCB Bank, Opposite to Syndicate Bank Note : Looking for the candidates who can join us immediately or within 30 days max. Candidates who have already attended interview in the last 3 months need not apply.","location":"Hyderabad","experience":"3 - 7 Years"},{"date":"19, 20 - Jul - 2019","skills":"HR Operations, HR and Recruitment, Onboarding","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Ujjivan Small Finance Bank Limited, Grape Garden, 3rd A Cross, 18th Main, 6th Block, Koramangala, Bengaluru - 560 095.","phone":"080-46585755","profile":"Officer \u0096 Talent Acquisition \nUjjivan Small Finance Bank Limited","description":"Candidate should be Any Garduate/ MBA HR with 1 to 5 years of experience in HR Operations, HR and Recruitment, Onboarding. Must have excellent communication skills Job Responsbility- Joining formalities Documentation On boarding processing Document Verification screening, shortlisting, scheduling interviews coordinating interviews Follow ups Walk-in Date/ Time: 19th July - 20th July from 10 AM onwards Interview Venue: Ujjivan Small Finance Bank Limited Grape Garden, 3rd A Cross, 18th Main, 6th Block, Koramangala, Bengaluru - 560 095. Recruiter Name: Ashwin Prasad","location":"Bangalore","experience":"1 - 5 Years"},{"date":"18, 19, 20 - Jul - 2019","skills":"General Administration, Customer Support, Public Relations/ Receptionist Activitie","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Albans Projects Private Limited, 2nd floor, Malhotra House, Above Tata Motors, Krishanlal Marwah Marg, Saki Vihar Road, Saki Naka, Mumbai - 400 072","phone":"8239970512","profile":"Front Office Executive \nAlbans Projects Private Limited","description":"Provides general office support with a variety of clerical activities and related tasks. The receptionist will be responsible for answering incoming calls, directing calls to appropriate associates, mail distribution, flow of correspondence, requisition of supplies as well as additional clerical duties. Receptionist Job Duties: Taking and directing calls, possibly through a switchboard Completing administrative tasks like filing and delivering and accepting mail Cleaning, organising, and maintaining the reception area Keeping basic office supplies like pens stocked and accessible to visitors Ordering supplies for the rest of the office Walk-in Date/ Time: 18th - 20th July , 11 AM onwards Interview Venue: Albans Projects Private Limited 2nd floor, Malhotra House, Above Tata Motors, Krishanlal Marwah Marg, Saki Vihar Road, Saki Naka, Mumbai - 400 072","location":"Mumbai","experience":"0 - 2 Years"},{"date":"18, 19 - Jul - 2019","skills":"Training/ Induction, MIS Reporting, Back Office","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"SWAN Solution & Services Pvt. Limited, 404-405, T-Square, 4th Floor, Saki Vihar Road, Andheri (East), Mumbai - 400 072","phone":"022-28034070","profile":"Trainee HR/ Back Office Executive \nSWAN Solution & Services Pvt. Limited","description":"We have an opening for Trainee HR/ Back Office Executive for Freshers (2019 Pass-outs) at SWAN Head office and your resume has been shortlisted for the same. Education: Any Graduate Work Experience: Fresher Responsibilities: Maintain MIS report Data Entry on MS-Excel / MS- Word Coordinate with internal departments through mail / phone regarding various data and reports Work on HR software to main up-to-date data of employees. Other responsibilities allotted by HR Head / Admin Manager Walk-in Date: 18th & 19th July 2019 Time: 10:00 AM to 4:00 PM Interview Venue: SWAN Solution & Services Private Limited, 404-405, T-Square, 4th Floor, Saki Vihar Road, Andheri (East), Mumbai - 400 072","location":"Mumbai","experience":"0 - 1 Years"},{"date":"20 - Jul - 2019","skills":"Software Testing, Manual Testing, Automation Testing","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"ISGN, Rattha Building No. 11, TEK Towers, 3rd Floor, Rajiv Gandhi Salai (OMR), Thoraipakkam, Chennai -600 097.","phone":"9994599336","profile":"Software Testing Engineer \nISGN","description":"Position: Testing Engineer/ Sr. Testing Engineer Employment Type: Permanent Educational Qualification: Any Graduate Work Experience: 1-5 years Job Location: Chennai Solid understanding of SDLC, STLC, QA Process, Methodology and Tools Should be willing to work on challenging assignments and drive ambiguous problem areas. Be creative and innovative to improve efficiency and quality of work. Zeal to learn and apply new technological advancements/ process improvements in testing area. Knowledge in of Agile is added advantage Able to provide end to end Testing solution Strong communication skills Technical Skills: Strong experience on Manual testing Experience in Automation Selenium web driver Experience on Database testing Experience on Nonfunctional testing and tools Knowledge on API testing Knowledge on Performance testing Excellent analytical and problem solving skills Self-driven and motivated. Please walk-in to our office on Saturday (20th July 2019) any time between 10 am to 3 pm to the below venue- ISGN Rattha Building No. 11, TEK Towers, 3rd Floor, Rajiv Gandhi Salai (OMR), Thoraipakkam, Chennai - 600 097. Land Mark: Near Jain college bus stop. Next to Barbeque Nation and opposite to Sangeetha Hotel Contact Person: Ravisankar (HR) 9994599336 Note: Please bring the below documents- 1) Updated Resume 2) Passport size photo 3) ID Proof 4) Address Proof 5) Pen Note: Preferred immediate joinee/ 30 days/45 days Please excuse 3 months notice candidates","location":"Chennai","experience":"1 - 5 Years"},{"date":"19 - Jul - 2019","skills":"ASP .NET (MVC), Web Services, Jquery/ JavaScript, WCF, MySQL, MS SQL, C#","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Inficare Technologies Private Limited, D-92, Second Floor, Sector - 2, Noida - 201301 (Nearest Metro Station- Noida Sector 16)","phone":"9958297287","profile":".Net Developer \nInficare Software Technologies Pvt. Limited","description":"Required Skills: * ASP .NET (MVC) * Web Services * Jquery / JavaScript * WCF * MySQL * MS SQL * C# * Should have good communication skills Walk-in Date/ Time: 19th July 2019, 10 AM onwards Interview Venue: Inficare Technologies Private Limited, D-92, Second Floor, Sector - 2, Noida - 201301 (Nearest Metro Station- Noida Sector 16)","location":"Noida","experience":"2 - 4 Years"},{"date":"19, 20 - Jul - 2019","skills":".Net and MVC Concepts","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Muthoot Microfin Limited, (IT Office), 2nd Floor, RKJ Tower, Kadavanthra, Cochin.","phone":"0484 4345666","profile":"Software Developer (.Net) \nMuthoot Microfin Limited","description":"Person must have sound knowledge in .Net and MVC Concepts Should have good Collaboration qualities and interpersonal skills Resilience, Achievement orientation, Initiative, Quality Focus Job Responsibility- To perform the duties with IT vertical/ functional units during on the job training, under guidance of experienced IT personnel. Support Testing and documentation of software for In-house applications. Support debugging software, in-house applications. Flexibility, Decisiveness, Tenacity, Independence, Risk taking, Personal integrity. Walk-in Date/ Time: 18th July - 20th July, 11 AM onwards Interview Venue: Muthoot Microfin Limited (IT Office), 2nd Floor, RKJ Tower, Kadavanthra, Cochin Landmark : Kotak Mahindra Bank, Kadavanthara Junction - Kaloor Kadavanthara Road. Tel: 0484 4345666","location":"Cochin","experience":"0 - 1 Years"},{"date":"20 - Jul - 2019","skills":"ASP .NET/ MVC / ASP.NET CORE 2.0 framework, SQL Server","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"New Vision Software Private Limited, 501, Pentagon Tower 1, Magarpatta City, Hadapsar, Pune","phone":"Not Provided","profile":".Net Professionals \nNew Vision Softcom & Consultancy Pvt. Limited","description":"For SSE (2-5 years of Experience) Proven experience as a .NET Developer Familiarity with the ASP .NET/ MVC / ASP.NET CORE 2.0 framework, SQL Server Knowledge of at least one of the .NET languages (e.g. C#) and HTML5/CSS3 Familiarity with architecture styles/APIs (REST, WCF) Understanding of Agile methodologies Should have experience of Angular for at least 1 year Excellent troubleshooting and communication skills Qualified in Computer Science and Engineering or a related field. For .Net Leads (8+ years of Experience) Experience in MVC .NET, Oops, Design Patterns Analyze Requirement Document Perform impact analysis Perform Software Design using EA tools Perform Coding and unit testing, ensure quality of delivery, Perform Support and defect fixes. Review and Support other peers Communicate Status and provide updates on Development task. Walk-in Date: 20th July 2019, Saturday Time: 10:00 AM to 1:00 PM Interview Venue: New Vision Software Private Limited 501, Pentagon Tower 1, Magarpatta City, Hadapsar, Pune Contact Person : Mohsin Khan Documents to be carried : One Hard Copy of your Resume","location":"Pune","experience":"2 - 7 Years"},{"date":"20 - Jul - 2019","skills":"Automation Testing, Manual Testing, ETL Testing, SQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Navigant BPM (India) Private Limited, 3rd Floor Bhavani Building Technopark Trivandrum, Kerala","phone":"Not Provided","profile":"Manual Tester \nNavigant BPM (India) Private Limited","description":"Candidate should have minimum 3+ years of experience in SQL/ ETL Testing. Should have experience in Automation Testing, Manual Testing, ETL Testing, SQL Walk-in Date/ Time: 20th July from 9 AM onwards Interview Venue: Navigant BPM (India) Private Limited 3rd Floor Bhavani Building Technopark Trivandrum, Kerala Contact Person: Bindu/ Anoop","location":"Trivandrum","experience":"3 - 5 Years"},{"date":"18, 19 - Jul - 2019","skills":"Manual Testing, Test Plan/ Test Case/ Test Scenario Reviews","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Amity Software Systems Limited, B-16, Sector-63 Noida, Opposite to Fortis Hospital.","phone":"8744058034","profile":"Manual Testing Engineer \nAmity Software Systems Limited","description":"Looking for Manual Testing Engineers, who are able to test a software application. Candidate should be well versed with the concepts of ERP systems that is being used in the industries. Should have hands on experience in Database testing. He/she should be a problem solver, and good analytical skills. Should be confident and have good communication skills. Working experience in Insurance Domain is good to have. Job Responsibilities: Creating test cases from the user stories or from test scenarios. Execute the test cases. Perform the task again where the defect is found. Make sure that the application is defect free. Send the test reports to test lead. Responsible for Test Plan/ Test Case/ Test Scenario Reviews. Perks and Benefits: PF, ESI, Health Insurance, Free OPD in reputed hospitals Walk-in Date/ Time: 18th - 19th July , 10 AM onwards Interview Venue: Amity Software Systems Limited B-16, Sector-63 Noida, Opposite to Fortis Hospital. NOTE: we are looking for only immediate joiners, or who can join within 15 days.","location":"Noida","experience":"2 - 4 Years"},{"date":"20 - Jul - 2019","skills":"C# Angularjs LINQ SOAP UI Github Html5 Software Testing Database Testing","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Johnson Controls India Private Limited, C 601, 6th Floor, RMZ Centennial, Kundalahalli Main Road, Whitefield Bangalore - 560 048","phone":"080-40527009","profile":"Senior/ Lead Test Engineer \nJohnson Controls India Private Limited","description":"We at Johnson Controls, are looking for Testing Engineer candidates (Multiple Openings) Work Experience: 4 to 10 Years Candidate must have experience in Quality Assurance & Tools (JIRA, Confluence) Good knowledge on Selenium & Appium and web service testing (Soap UI/ postman) Work closely with developers and PM to maximize product quality and maintain accurate defect tracking records Job Responsbility- Create, execute, and maintain automation scripts in C#/ Java. Product areas include: Reporting engine, data storage and analysis, desktop client, web, Mobile, Handheld (client and server), VM server infrastructure, and Automation tools Generate test data for automation / functional testing and document issues found during testing. Design and create automated test suites to verify the functionality and performance of software products and services. Debugging and fixing issues in automation scripts. Perform preliminary investigation of issues and report all data captured for an issue so that the ultimate resolution is more efficient. Walk-in Date/ Time: 20th July 2019, 10 AM onwards Interview Venue: Johnson Controls India Private Limited C 601, 6th Floor, RMZ Centennial, Kundalahalli Main Road, Whitefield Bangalore, Karnataka - 560 048 PoC - Abhijit","location":"Bangalore","experience":"4 - 10 Years"},{"date":"18 - Jul - 2019","skills":"Software Testing, Test Case, Manual Testing","qualification":"B.E./B.Tech","address":"Ebizon NetInfo Private Limited, 7th Floor, Tower-A, Logix Cyber Park, Sector-62, Noida","phone":"Not Provided","profile":"Quality Analyst/ Software Tester \nEbizon NetInfo Private Limited","description":"Education : B.Tech with 70% throughout the academics Only CBSE and ICSE board qualification preferred Experience: 6 Months to 2 Years Preferred : Immediate or early joiners Job Responsbility: Work with the development teams to ensure each release meets high quality standards Create test plans and test cases from wire-frames Execute manual test cases, report and track issues in ticketing systems, and verify fixes Building a strong working relationship with all the teams Must have good Analytical skills (i.e should be able to well understand the requirements) Should have experience in Usability Testing, UI testing and writing Test cases Should have good communication skills More to offer: Competitive salary and timely increments Potential Career Growth to Lead role for high performers Team & Individual Learning and Development is part of our culture Vibrant community and regular team outs Great team members & energy filled work environment Walk-in Date: Thursday/ 18th July 2019 Time: 11 AM - 3 PM Interview Venue: Ebizon NetInfo Private Limited 7th Floor, Tower-A, Logix Cyber Park, Sector-62, Noida (Landmark Near Fortis Hospital Sec-62 or JSS College) SPOC : Anushri","location":"Noida","experience":"0 - 2 Years"},{"date":"20 - Jul - 2019","skills":"C#, ASP .NET MVC, WebAPI/ WCF/ Web Services/ REST Services","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Baxture Technologies Private Limited, Office 902, 903, 904, Suratwala Mark Plazo, Hinjawadi, Pune, Maharashtra - 411 057","phone":"9604377560","profile":".NET Developer \nBaxture Technologies Private Limited","description":"Baxture Technologies Private Limited, is looking for a talented .NET Developer to work as part of our team. Technical Skills: Deep knowledge of the .NET 4.0 and above Frameworks C#, ASP .NET MVC, WebAPI/ WCF/ Web Services/ REST Services Front end: HTML5, CSS3, JavaScript, JQuery, AJAX, Angular/ React Interview Process: Please be prepared for a logical coding test also the basics should be clear. 1) Logical Coding Test 2) Technical F2F Round (Level 1) 3) Technical F2F Round (Level 2) 4) HR Discussion Direct Walk-In on 20th July 2019 (Saturday) Time: Between 12:00 PM - 2:00 PM Interview Venue: Baxture Technologies Private Limited Office 902, 903, 904, Suratwala Mark Plazo, Hinjawadi, Pune, Maharashtra - 411 057 Mobile: +91 9604377560","location":"Pune","experience":"1 - 2 Years"},{"date":"20 - Jul - 2019","skills":"Manual Testing, Integration and System Integration Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Corent Technology Private Limited, Super B3, MCM Towers, 3rd Floor, Thiru Vi Ka Industrial Estate, Guindy, Chennai, Tamil Nadu - 600 032","phone":"Not Provided","profile":"QA Engineer (Manual Testing) \nCorent Technology Private Limited","description":"We are looking for QA (Manual Testing) Professionals with the below skill sets- Relevant Experience: 2 - 3 years in Manual Testing Notice Period: Immediate join to 1 Month Only MALE Candidates required Good experience in Smoke and Sanity Testing Good experience in Integration and System Integration Testing Good verbal and written communication skills Should be able to work independently Database knowledge is desired Mode of Interview: Technical Discussion HR Discussion Walk-in Date: 20th July, Saturday Timings: 10:00 AM to 1:00 PM Interview Venue: Corent Technology Private Limited Super B3, MCM Towers, 3rd Floor, Thiru Vi Ka Industrial Estate, Guindy, Chennai, Tamil Nadu - 600 032 Contact Person: Surekha Please do carry a copy of this posting/ mail along with your resume.","location":"Chennai","experience":"2 - 3 Years"},{"date":"17, 18, 19 - Jul - 2019","skills":"Software Testing, Accessibility Testing","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Mobikasa Private Limited, 354, Jagat Complex, Second floor, 100 Feet Road, Ghitorni, New Delhi - 110 030","phone":"Not Provided","profile":"Accessibility Testing - Fresher \nMobikasa Private Limited","description":"Candidate should have good knowledge of accessibility and any accessibility testing tool would be considered a plus. Basic knowledge of software testing ethics. Good know-how of and familiar with e-commerce websites and apps. Familiar with accessibility implementation techniques like right use of ARIA attributes, logical order &correct semantics would be a huge plus Understand & Analyze Business, Functional & Technical requirements of the project Open to work in nighit shift. Best in the Industry, Lucrative Benefits Must have excellent communication skills Walk-in Date: 17th - 19th July 2019 Time: 3 pm to 5 pm Interview Venue: Mobikasa Private Limited 354, Jagat Complex, Second floor, 100 Feet Road, Ghitorni, New Delhi - 110 030","location":"Delhi","experience":"0 - 1 Years"},{"date":"19 - Jul - 2019","skills":"Core Java, Design Patterns, Web Services, Hibernate, Spring, SOAP, Rest, SQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Aspire Systems (India) Pvt. Limited, D-1, No.1, Sipcot IT Park Siruseri, Chennai","phone":"7824030311","profile":"Java Professionals \nAspire Systems (India) Private Limited","description":"Candidate should have strong experience in Oops and Core Java. Strong experience in Persistence Frameworks (Hibernate) & expertise in Spring Eco system. Should have good experience in Web Services REST/ SOAP. Must be good in SQL/ No SQL Experience in Angular JS, Micro Services will be an added advantage Should have experience in Design patterns, Build Tools/ Deployment Must have experience in Version Control System Exposure in cloud environment Should be with good communication skills. Work Experience Level: 5 to 9 Years Looking for Immediate joiners Interested candidates can share your updated resume to Rohini.rathinaraj@aspiresys.com with below updated details or can directly walk in to below Venue- Total Years of Experience Experience in Java Current CTC Expected CTC Notice Period Available to take interview on 19-July-19: Yes/ No Walk-in Date/ Time: 19th July 2019 from 10 AM onwards Interview Venue: Aspire Systems (India) Pvt. Limited D-1, No.1, Sipcot IT Park Siruseri, Chennai","location":"Chennai","experience":"5 - 9 Years"},{"date":"18, 19, 20, 21, 22, 23, 24, 25, 26, 27 - Jul - 2019","skills":"Front Office, Receptionist/ Front Desk Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Raj Hospitals, Mahatma Gandhi Main Road, Hindpiri, Ranchi, Jharkhand - 834 001","phone":"9771466647","profile":"Front Office Executive \nRaj Hospitals","description":"Candidate should be Any Graduate with 0 to 3 years of experience in Front Office, Receptionist/ Front Desk Activities. Must have excellent communication skills Job Responsbility- Welcomes patients and visitors by greeting patients and visitors, in person or on the telephone; answering or referring inquiries. Optimizes patients' satisfaction, provider time, and treatment room utilization by scheduling appointments in person. Walk-in Date/ Time: 18th July - 27th July , 11 AM onwards Interview Venue: Raj Hospitals Mahatma Gandhi Main Road, Hindpiri, Ranchi, Jharkhand - 834 001","location":"Ranchi","experience":"0 - 3 Years"},{"date":"16, 17, 18, 19 - Jul - 2019","skills":"Java, Hibernate, Spring, MVC","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Karvy Gateway Building Opposite to Karvy Fintech, Plot No 37 38 3rd Floor Financial District Gachibowli Hyderabad - 500 032","phone":"08639713681","profile":"JAVA Developer \nKarvy Data Management Services Limited","description":"Karvy Data Management Services Limited, is having an urgent opening for Java Developer Required Skills: Java, Hibernate, Spring, MVC Years of experience: 3.5+ Years Work Location: Hyderabad Walk-in Date/ Time: 16th July - 19th July , 9 AM onwards Interview Venue: Karvy Gateway Building Opposite to Karvy Fintech Plot No 37 38 3rd Floor Financial District Gachibowli Hyderabad - 500 032 If interested, please share your updated resume to tejaswini.mahapatro@karvy.com with some details below. Total Experience- Relevant Experience- Notice Period- Current CTC- Expected CTC- Current Location- Higher Education- Availability for face to face (Date /Time)-","location":"Hyderabad","experience":"3 - 8 Years"},{"date":"17, 18, 19, 20, 21, 22, 23 - Jul - 2019","skills":"Front Office/ Front desk, Telephone Operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Good Shepherd Hospitals Private Limited, Plot No 26 & 27, Shobana Colony, Near Maruthi Nursing Home, West Maredpally, Secunderabad, Telangana - 500 026","phone":"Not Provided","profile":"Front Office Executive \nGood Shepherd Hospitals Private Limited","description":"Candidate should be Any Garduate with 0 to 2 years of experience in Front Office/ Front desk, Telephone Operations. Must have pleasing personality with excellent communication skills Job Responsbility- Welcomes visitors by greeting them, in person or on the telephone; answering or referring inquiries. Directs visitors by maintaining employee and department directories,monitoring logbook; issuing visitor badges. Walk-in Date/ Time: 17th July - 23rd July , 9 AM onwards Interview Venue: Good Shepherd Hospitals Private Limited Plot No 26 & 27, Shobana Colony, Near Maruthi Nursing Home, West Maredpally, Secunderabad, Telangana - 500 026","location":"Hyderabad","experience":"0 - 2 Years"},{"date":"17, 18, 19, 20, 22, 23, 24 - Jul - 2019","skills":"Java/ J2ee, Core Java, Hibernate, Spring","qualification":"B.E./B.Tech, MCA/PGDCA","address":"iPRIMED Education Solutions Pvt. Limited, Megistic Terrace Building #62B, Phase 1 Electronic City, Bangalore. Opposite, Traffic Police Station","phone":"9902070375","profile":"Software Trainee (Java Fresher) \niPRIMED Education Solutions Pvt. Limited","description":"Quinnox is hiring Software Trainee (Java Fresher) Eligibility Criteria: B.E/ B.Tech/ MCA (CS/ IT/ IS) 60% aggregate (No year gap in between education) 2018 & 2019 Pass outs Only Job Location: Bangalore Salary: 3 - 3.40 LPA Immediate joiners Preferred Walk-in Date/ Time: 17th July - 24th July , 9 AM onwards Interview Venue: iPRIMED Education Solutions Pvt. Limited Megistic Terrace Building #62B, Phase 1 Electronic City, Bangalore Opposite, Traffic Police Station Contact Person : Umar A Ghaffer Tel: 9902070375 : Only Whtsapp","location":"Bangalore","experience":"0 - 1 Years"},{"date":"17 - Jul - 2019","skills":"Reception/ Front Office Activities, General Administration","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Zen3 infosolutions Private Limited, Manjeera Trinity Corporate, 12th Floor, JNTU Hitech City Road, Hyderabad. Next to Manjeera Mall","phone":"Not Provided","profile":"Front Office Executive \nZen3 infosolutions Private Limited","description":"Walk-in Drive for Front Office Executive- Receptionist @ Zen3 Infosolutions at Hyderabad Qualification: Any Graduation Experience: Freshers Work location: Hyderabad Should be Good in Communication (English, Telugu) Looking only Female Candidates Shift: General and 5 Days Working No Transport Facility Job Responsbility- Responsible for handling front office reception and administration duties, including greeting guests and offering them a beverage, answering phones, handling company inquiries, and sorting and distributing mail. Mail also schedule meetings and travel for executives. Interested Candidates can walk-in with updated CV to below Address Walk-in Date: 17 July 2019 Interview Timing: 10 Am to 3 PM Interview Venue: Zen3 infosolutions Private Limited Manjeera Trinity Corporate, 12th Floor, JNTU Hitech City Road, Hyderabad Landmark: Next to Manjeera Mall","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"17, 18, 19 - Jul - 2019","skills":"Java / Core Java, EJB, Spring/ Struts/ Hibernate","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Colan Infotech Private Limited, Murugesa Nayakar Complex, B Block, 4th Floor, Greams Road, Thousand Lights, Chennai - 600 006","phone":"90420 55 706","profile":"Java Developer \nColan Infotech Private Limited","description":"Candidate must have strong knowledge/ experience in Java / Core Java, EJB (Mandatory) Knowledge into any frameworks like Spring/ Struts/ Hibernate (Anyone is preferred) Must have strong communication & positive attitude Walk-in Date: 17 - 19 July 2019, Wednesday - Friday Time: 10:00 AM to 06:00 PM Interview Venue: Colan Infotech Private Limited Murugesa Nayakar Complex, B Block, 4th Floor, Greams Road, Thousand Lights, Chennai - 600 006 Landmark: Opposite Road to Seashell Hotel Mail: kalaichelvi@colanonline.com","location":"Chennai","experience":"2 - 6 Years"},{"date":"20 - Jul - 2019","skills":"JAVA, J2EE, Spring, Spring boot, Design Patterns, MVC Concepts","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Daffodil Software Private Limited 9th floor, Tower B1, SEZ DLF Silokhera, Sector 30, Gurugram, Haryana. Nearest Metro Station- Huda City Center Landmark-Star Mall, NH 8, Gurgaon","phone":"Not Provided","profile":"Java Developer \nDaffodil Software Private Limited","description":"Daffodil Software Pvt. Ltd. is looking for Java Developers to expand and strengthen its exceptional team at one of the most prime office spaces at DLF SEZ, Gurgaon. Designation: Associate/ Sr. Associate-IT Work Experience : 1+ Years Job Location: Gurgaon 1+ years of experience in JAVA, J2EE, Spring, Spring boot Thorough comprehension of object oriented programming Design patterns, MVC concepts, develop and document RESTful APIs Willing to work on existing code base and happy to refactor large scale code base JAVA SE 8 Maven build mechanism, Good Experience on Git Repository Spring framework, Spring boot, IOC concept, Spring Data concepts (Repositories), Familiarity with both xml and annotation based configuration Note: Opportunity is for immediate Joiners only. Please use the below mentioned link for Registration: https://bit.ly/2SkQxEq Walk-in Date: 20th July, 2019 Time: 9:00 AM - 12:00 PM Interview Venue: Daffodil Software Private Limited 9th floor, Tower B1, SEZ DLF Silokhera, Sector 30, Gurugram, Haryana Nearest Metro Station- Huda City Center Landmark-Star Mall, NH 8, Gurgaon Contact Person : Swati Chahar","location":"Gurgaon","experience":"1 - 5 Years"},{"date":"17, 18, 19 - Jul - 2019","skills":"HTML, CSS, Java Script","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"NIIT Limited, A-24, Sector 34, Infocity Technology Park 1, Gurugram, Haryana","phone":"Not Provided","profile":"Software Engineer/ Fresher \nNIIT Limited","description":"Qualification/ Skill Set: BE/ B.Tech (CS/ IT), MCA, BCA - Fresher Knowledge of HTML, CSS, Java Script Should be from Gurgaon, South Delhi, West Delhi or can relocate to these locations Ready to work on rotational shift (Not night shift) NIIT contract role Walk-in Date: 17th - 19th July 2019 Time: 10:00 AM - 4:00 PM Interview Location: NIIT Limited A-24, Sector 34, Infocity Technology Park 1, Gurugram, Haryana Email: divya.9.taneja@niit.com","location":"Gurgaon","experience":"0 - 1 Years"},{"date":"23 - Jul - 2019","skills":"Core Java, Advanced Java, JSP, MySQL & Oracle","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Bharti Airtel Limited, Plot No. 16, Udyog Vihar Phase IV, Sector 20, Gurugram, Haryana 122015.","phone":"Not Provided","profile":"Software Developer (Java) \nBharti Airtel Limited","description":"Educational Level: B.Tech/ B.E/ MCA Functional Competencies: Data Analytics Work Experience: 1 to 2 Years Required Skills: Hands on experience on Core Java, Advanced Java, JSP Good knowledge of MySQL & Oracle Certification would be an added advantage. Should have excellent communication skills PERSONAL CHARACTERISTICS & BEHAVIOURS Team player Result oriented Decisiveness Customer orientation Optimistic Walk-in Date/ Time: 23rd July from 10 AM onwards Interview Venue: Bharti Airtel Limited Plot No. 16, Udyog Vihar Phase IV, Sector 20, Gurugram, Haryana 122015. Contact person: Soumya (9205674115)","location":"Gurgaon","experience":"1 - 2 Years"},{"date":"27 - Jul - 2019","skills":"Java/ J2EE, Big Data, DevOps, Machine Learning","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"EPSoft Solutions Private Limited, Medha Hi-tech City, Kesarapalli, Gannavaram IT Park Road, Vijayawada, Andhra Pradesh - 521 102","phone":"Not Provided","profile":"Software Engineer (Java/ J2EE) \nEPSoft Solutions Private Limited","description":"There is a requirement for 15 candidates but the count can go to even 20 if we find the best and worthful candidates during the recruitment process. Looking for- Software Developers (Java/ J2EE, Big Data, DevOps, Machine Learning) Engineers (Network Engineer, IT Security Engineer) Analytics (Business Analyst, Data Analytics) Education: B.Tech (CSE/ IT/ ECE/ EEE), MBA, M.Sc 65% (NO BACKLOGS) Must have good Communications skills. Problem-Solving skills Team Player Leadership Skills Honesty Openness to Learning Candidate should be trained in this anyone of these technologies (Java/ J2EE, Big Data, DevOps, Machine Learning, Networking, IT Security) Walk-in Date/ Time: 27th July 2019, 9 AM onwards Interview Venue- EPSoft Solutions Private Limited Medha Hi-tech City, Kesarapalli, Gannavaram IT Park Road, Vijayawada, Andhra Pradesh - 521 102","location":"Vijayawada","experience":"0 - 2 Years"},{"date":"20 - Jul - 2019","skills":"Java, HTML, Java Script, Node JS, React JS, Angular JS","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Financial Software Systems Pvt. Limited, 1st Floor, Plot No D 1, Kalpataru Prime IT Park, Road No 16, Wagle Industrial Estate-Thane West, Thane - 400 604, Midc","phone":"Not Provided","profile":"Java Developers \nFinancial Software Systems Pvt. Limited","description":"Required Skills: Java (Node JS, React.JS, Angular.JS) Work Experience: 4 to 7 Years Knowledge in payments domain and Card Management Domain Solid experience in Front End technologies, ReactJs workflows Strong understanding of ReactJs and its core principles Must have strong proficiency in HTML, Java Script Deep knowledge of Angular JS practices Understanding of Cloud concepts and micro services is a plus UX design knowledge and proficiency with Git Experience with common front-end development tools Performance Tuning; Debugging issues. Knowledge of end-to-end Systems Development Life Cycles (i.e., waterfall, iterative and other modern approaches to software development) Walk-in Date/ Time: 20th July 2019, 9 AM onwards Interview Venue: Financial Software Systems Pvt. Limited 1st Floor, Plot No D 1, Kalpataru Prime IT Park, Road No 16, Wagle Industrial Estate-Thane West, Thane - 400 604, Midc","location":"Mumbai","experience":"4 - 7 Years"},{"date":"17, 18 - Jul - 2019","skills":"Receptionist, Soft Services Front Desk, administration, facility management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"CBRE South Asia Private Limited, Ground Floor, The, Hulkul Brigade Centre, No. 82, Lavelle Road, Shanthala Nagar, Ashok Nagar, Bengaluru - 560 001","phone":"Not Provided","profile":"Front Office Executive \nCBRE South Asia Private Limited","description":"Any Graduate with 2 to 7 years of experience Must be good in verbal and written communication Female Candidate only. Perks and Benefits 35K CTC Job Responsibilities: Greet clients and set a positive office atmosphere Answer the phone, take messages, and redirect calls to appropriate offices. Organize and maintain files and records; update when necessary Create and maintain updated documents and spreadsheets Oversee sorting and distribution of incoming mail Prepare outgoing mail (envelopes, packages, etc.) Operate office equipment, such as photocopier, printers, etc. Organize bookkeeping and issue invoices/checks Record meeting minutes and dictations Perform inventory of office supplies and order what is needed Interested candidates forward CV to Malti.Sharma@cbre.com Walk-in Date: 17th - 18th July 2019 Timing: 11 AM to 2 PM Interview Venue: CBRE South Asia Private Limited, Ground Floor, The, Hulkul Brigade Centre, No. 82, Lavelle Road, Shanthala Nagar, Ashok Nagar, Bengaluru - 560 001","location":"Bangalore","experience":"2 - 7 Years"},{"date":"17 - Jul - 2019","skills":"Technical Support, Email Support. writing html SQL","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"GlobalLogic Technologies Limited , ASF Insignia SEZ Private Ltd. Grand Canyon Building, 14th floor, Block D&E, Off Gurgaon, Faridabad Road, Tehsil Sohna, Gwal Pahari, Gurgaon, Haryana - 122003","phone":"Not Provided","profile":"Partner Support Specialist (Non Voice) \nGlobalLogic Technologies Limited","description":"Requirements- Good keyboarding skills along with basic computational ability and internet savviness. Knowledge of Basic SQL, Basic XML and Basic HTML preferred Strong analytical, problem solving and troubleshooting skills Ability to discern trends and suggest solutions to product/process related issues Team player with very good interpersonal skills and forward-looking attitude Open to feedback and zeal for learning new things Open to work in 24/7 environment (including holidays) We offer- Interesting and challenging work in a large and dynamically developing company Exciting projects involving newest technologies Professional development opportunities Excellent compensation and benefits package, performance bonus program Modern and comfortable office facilities Walk-in Date/ Time: 17th July 2019, 9 AM onwards Interview Venue: GlobalLogic Technologies Limited ASF Insignia SEZ Private Ltd. Grand Canyon Building, 14th floor, Block D&E, Off Gurgaon, Faridabad Road, Tehsil Sohna, Gwal Pahari, Gurgaon - 122 003 If interested, please apply through the Registration link given below and HR Team will get back to you. Registration Link- http://bit.ly/2Xn55s2","location":"Gurgaon","experience":"0 - 2 Years"},{"date":"16, 17, 18, 19, 20 - Jul - 2019","skills":"Technical Support, Desktop Support, IT Service Desk/ Helpdesk","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Dell International Services India Pvt. Limited, 12/1A, 12/2A, 13/1A, Divya Shree Green, Inner Ring Rd,, Near EGL Embassy Business Park, Challaghata Village, Domlur, Bengaluru - 560 071","phone":"Not Provided","profile":"Technical Support Associate \nDell International Services India Pvt. Limited","description":"Candidate requirement: Minimum Graduates in any stream. (10+2+3) Any relevant Certification/ Technical Qualification Undergraduates/Post graduates with at least 12 months of international call center / 24 months of domestic call center or any other work experience full time experience. Should be willing to work in shifts in a 24 x7 work environment Excellent telephone soft skills & thorough telephone functional skills Ability to handle stressful situations. Ability to deal professionally with irate customers Good Knowledge of PC Hardware/Software for desktop & portable systems Benefits- We offer highly competitive salaries, bonus programs, world-class benefits, and unparalleled growth and development opportunities all to create a compelling and rewarding work environment. Walk-in Date/ Time: 16th July - 20th July , 2 PM onwards Interview Venue: Dell International Services India Pvt. Limited 12/1A, 12/2A, 13/1A, Divya Shree Green, Inner Ring Rd,, Near EGL Embassy Business Park, Challaghata Village, Domlur, Bengaluru - 560 071","location":"Bangalore","experience":"1 - 4 Years"},{"date":"15, 16, 17, 18, 19 - Jul - 2019","skills":"Non Voice Process, Customer Service, Technical Support, Amazon Support","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Amazon Development Centre (India) Private Limited, 6th Floor in Tower 1 of Laxmi Infobahn Pvt. Limited SEZ, Survey No. 107(P), Kokapet Village, Gandipet Mandal, Ranga Reddy District","phone":"Not Provided","profile":"Alexa Support Associate (Digital & Device) \nAmazon Development Centre (India) Pvt. Limited","description":"Qualifications required: Minimum qualification is 10 + 2. Any Graduate/ PG is eligible to apply. Knowledge & Skills Required Excellent customer service skills, including maintaining focus on the customer issue in a fast-paced environment Ability to empathize with and prioritize customer needs Demonstrates interpersonal skills with a diverse customer base Demonstrates conflict resolution, negotiation, and de-escalation skills Demonstrates ownership to resolve challenging customer issues, escalating when necessary Salary Range: 2.6 LPA - 3.1 LPA Additional Benefit: Meal Vouchers, Night Shift Allowance, Over Time Payout, Transportation Allowance (work from office) Walk-in Date: 15th - 19th July 2019 Time: 10.30 am to 2 pm Interview Venue: Amazon Development Centre (India) Private Limited 6th Floor in Tower 1 of Laxmi Infobahn Pvt. Limited SEZ, Survey No. 107(P), Kokapet Village, Gandipet Mandal, Ranga Reddy District","location":"Hyderabad","experience":"0 - 5 Years"},{"date":"18 - Jul - 2019","skills":"Technical Support, Hardware/ Networking, Service Desk, Hardware Troubleshooting","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"DXC Technology India Private Limited, Surya tech Park, 100, Outer Ring Road, Electronics City Phase 1, Electronic City, Bengaluru, Karnataka - 560 100","phone":"Not Provided","profile":"Technical Support (Voice Process) \nDXC Technology India Private Limited","description":"Candidate should be Full time Graduates with excellent communication skills with 0-3 Years of work experience in IT Technical Support/ Service Desk is preferred. Flexible to work in any shifts including night shifts. Freshers can also apply Job Responsibility: Troubleshooting Hardware/ Networking/ OS related queries for our global customers over phone. This involves working across different time zones. Take calls from global customers and provide the right response, positively and professionally Walk-in Date: 18th July 2019 Timings : 11 AM to 2 PM Interview Venue: DXC Technology India Private Limited Surya tech Park, 100, Outer Ring Road, Electronics City Phase 1, Electronic City, Bengaluru, Karnataka - 560 100","location":"Bangalore","experience":"0 - 3 Years"},{"date":"16, 17 - Jul - 2019","skills":"Non Voice, Technical Support, Customer Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Knoah Solutions Private Limited, Unit No. 204, 2nd Floor, The Chambers, Samrat Chowk, Viman Nagar, Pune - 411014.","phone":"020-26630500","profile":"Technical Support (Non Voice Process) \nKnoah Solutions Private Limited","description":"Candidate should be Any Graduate with excellent communication skills. Provide customer service for electronic products such as High-definition Consumer goods, Smart phones and Tablets. Provide technical assistance through web-chat and email-based communication Walk-in Date: 15th to 17 July, 2019 Time: 3 PM - 6 PM Interview Venue: Knoah Solutions Private Limited Unit No. 204, 2nd Floor, The Chambers, Samrat Chowk, Viman Nagar, Pune - 411 014.","location":"Pune","experience":"0 - 2 Years"},{"date":"16, 17, 18, 19, 20 - Jul - 2019","skills":"Client Support, Customer Support, Software Support","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Spider Software Private Limited, 212, Rajhans Complex, Near Nirmal Hospital, Ring Road, Surat, Gujarat - 395 002.","phone":"Not Provided","profile":"Technical Support Executive \nSpider Software Private Limited","description":"Candidate must be Graduate (Compulsory) Fresher's & Experienced both can apply Good communication is required Age limit is Upto 28 years Only male can apply Job Responsbility- Responsible for giving software training to the clients Handling doubts & queries of clients. Retention activities. Candidates will get an opportunity to understand about Stock Market & Technical Analysis. Walk-in Date/ Time: 16th - 20th July 2019, 10 AM onwards Interview Venue: Spider Software Private Limited 212, Rajhans Complex, Near Nirmal Hospital, Ring Road, Surat, Gujarat - 395 002.","location":"Surat","experience":"0 - 2 Years"},{"date":"17, 18, 19 - Jul - 2019","skills":"Core PHP, MySQL, JavaScript, jQuery, Angular js","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Plaxonic Technologies Pvt. Limited, B-10 Sector-59 , Noida","phone":"Not Provided","profile":"Core PHP Developer \nPlaxonic Technologies Private Limited","description":"Candidate should have strong knowledge and experience in Core PHP, MySQL, JavaScript, jQuery, Angular JS. Must have a minimum of working knowledge in all stages of the Software Development Life Cycle: requirements gathering, design, development, testing, and implementation. Walk-in Date/ Time: 17th July - 19th July , 10 AM onwards Interview Venue: Plaxonic Technologies Pvt. Limited B-10 Sector-59 , Noida","location":"Noida","experience":"0 - 2 Years"},{"date":"17, 18, 19 - Jul - 2019","skills":"PHP / Wordpress / Mysql / Html5 / jQuery","qualification":"B.Sc, BCA/BCS","address":"Evision Technoserve Private Limited, E- 41 Sector 3, Behind HCL Technology, Noida - 201 301 Nearest Metro: Sector 16","phone":"9315179008","profile":"PHP Wordpress Developer \nEvision Technoserve Private Limited","description":"Candidate should have 0 to 1 year of experience in Custom theme development in Wordpress Working experience with Wordpress plugin development Good knowledge of MySql Database Strong experience of HTML5, CSS3, Javascript, Jquery Ability to convert HTML pages to Wordpress Walk-in Date/ Time: 16th July - 19th July , 11 AM onwards Interview Venue: Evision Technoserve Private Limited E- 41 Sector 3, Behind HCL Technology, Noida - 201 301 Nearest Metro: Sector 16 Contact HR Whatsapp No: Ganesh: 9315179008","location":"Noida","experience":"0 - 1 Years"},{"date":"16, 17 - Jul - 2019","skills":"Technical Support, Chat/ Email Process, Customer Service","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Knoah Solutions Private Limited, Maximus Towers, 2A, 4th floor, IT Raheja Park, Mindspace, Madhapur, Hyderabad - 31","phone":"040-44309780","profile":"Technical Support Executive \nKnoah Solutions Private Limited","description":"Candidate should be Any Graduate with 0 to 3 years of experience in Technical Support, Chat/ Email Process, Customer Service. Must have excellent communication skills. Job Responsbility- Provide customer service for electronic products such as High-definition Consumer goods, Smart phones and Tablets. Provide technical assistance through web-chat and email-based communication Walk-in Date: 15th to 17th July, 2019 Time:11 AM - 3 PM Interview Venue: Knoah Solutions Private Limited Maximus Towers, 2A, 4th floor, IT Raheja Park, Mindspace, Madhapur, Hyderabad - 31","location":"Hyderabad","experience":"0 - 3 Years"},{"date":"15, 16, 17, 18, 19 - Jul - 2019","skills":"Use Cases Software Testing Agile Product Life Cycle System Integration","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Paperchase Accountancy India Private Limited, 7th Floor Parswhanath Business Park, Prahaladnagar Ahmedabad","phone":"9687600733","profile":"Software Tester \nPaperchase Software Solution Pvt. Limited","description":"Duties and Responsibilities: Analysing users stories and/use cases/requirements for validity and feasibility Collaborate closely with other team members and departments Execute all levels of testing (System, Integration, and Regression) Design and develop automation scripts when needed Detect and track software defects and inconsistencies Provide timely solutions Apply quality engineering principals throughout the Agile product lifecycle Provide support and documentation Prepare use cases for through testing Required Candidate profile 3+ years of experience as a Software Tester or similar role Ability to create automation testing scripts Ability to handle multiple tasks simultaneously 2+ years of experience in data analysis Ability to work in a fast paced environment with minimal supervision Sense of ownership and pride in your performance and its impact on company's success Critical thinker and problem-solving skills Team player Good time-management skills Perks and Benefits No bar for deserving candidate Walk-in Date/ Time: 15th - 19th July 2019 Time: 12 PM onwards (Monday - Friday) Interview Venue: Paperchase Accountancy India Private Limited 7th Floor Parswhanath Business Park, Prahaladnagar Ahmedabad Opposite KFC Restaurant","location":"Ahmedabad","experience":"3 - 7 Years"},{"date":"15, 16, 17 - Jul - 2019","skills":"Core JAVA, JavaScript, Spring Framework, Java script, HTML, MySQL","qualification":"B.E./B.Tech","address":"Spoors Technology Solutions India Pvt. Limited, 4th Floor, Sai Prithvi - Cyber Arcades, Above Bata Showroom, Indian Oil Petrol Bunk, Madhapur, Hyderabad.","phone":"Not Provided","profile":"Java Developer \nSpoors Technology Solutions India Pvt. Limited","description":"Looking for recent pass-outs 2018,2019 for freshers, Exp candidate should have 2 to 4 years experience as a Java/ J2EE developer. Experience with Struts, Spring, Hibernate and Tomcat CSS, HTML, JavaScript, XML, JSON, AJAX and JSP Good in Core JAVA, JavaScript, Spring Framework. Knowledge of Java script and HTML is desirable. Database design and modelling skills (preferably in MySQL) Walk-in Date/ Time: 15th July - 17th July , 10 AM onwards Interview Venue- Spoors Technology Solutions India Pvt. Limited, 4th Floor, Sai Prithvi - Cyber Arcades, Above Bata Showroom, Indian Oil Petrol Bunk, Madhapur, Hyderabad.","location":"Hyderabad","experience":"0 - 4 Years"},{"date":"15, 16, 17, 18, 19 - Jul - 2019","skills":".Net Trained / Freshers","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Verinon Technology Solutions Private Limited, #305, 3rd Floor, Mayfair Complex, SP Road, Begumpet, Hyderabad - 500 003","phone":"Not Provided","profile":".Net Trainee - Developer \nVerinon Technology Solutions Private Limited","description":"Role : Software Engineer Job Location : Hyderabad Candidate must be trained on .Net Technology Good Communication skills required Good knowledge on SQL Server Interested candidates can walk - in to the below address. Walk-in Date: 15th to 19th July 2019 Time: 11:00 A.M to 5:00 P.M Interview Venue:: Verinon Technology Solutions Private Limited #305, 3rd Floor, Mayfair Complex, SP Road, Begumpet, Hyderabad - 500 003 Landmark - Opposite to Traffic Police Training Center, Above Vodafone Store Email- manasa.kopuri@verinon.com","location":"Hyderabad, Secunderabad","experience":"0 - 1 Years"},{"date":"15 - Jul - 2019","skills":"Test Engineering QA Testing Tools Product Development Regression Testing","qualification":"B.E./B.Tech","address":"eCIFM Solutions India Pvt. Limited, Plot -507 Udyog Vihar Phase 5, Gurgaon, Haryana","phone":"Not Provided","profile":"Software Test Engineer \neCIFM Solutions India Pvt. Limited","description":"Requirements: * Proven work experience in manual quality assurance. * Strong knowledge of Manual Testing. * Experience in writing clear, concise and comprehensive test plans and test cases * Hands-on experience in black box testing * Hands-on experience with manual testing. * Solid knowledge of SQL and scripting * Experience working in an Agile/Scrum development process * Experience with performance and/or security testing is a plus * BS/MS degree in Computer Science, Engineering or a related subject Perks and Benefits Best in the Industry Walk-in Date: 15th July 2019 Time: 11am to 1pm Interview Venue: eCIFM Solutions India Pvt. Limited Plot -507 Udyog Vihar Phase 5, Gurgaon, Haryana Nearest Metro Rapid Indusind.","location":"Gurgaon","experience":"0 - 3 Years"},{"date":"13, 15, 16, 17, 18, 19, 20, 22, 23, 24, 25, 26, 27, 29, 30, 31 - Jul - 2019","skills":"QA, Technical Process","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Cognizant Technology Solutions (India) Limited, Building No.12A, 1st floor, Raheja Mind space, Hi-tech city, Hyderabad - 500 032","phone":"Not Provided","profile":"QA/ Process Executive \nCognizant Technology Solutions (India) Limited","description":"Technical - Good Data Interpretation, Logical Reasoning, Quantitative Skills and Reading Comprehension Tech savvy - Ability to understand technological products and troubleshoot Strong familiarity with productivity and collaboration tools Communication - Excellent comprehension skills Good verbal and written communication skills Additional preferences - Experience working in a B2B or B2C environment Broad understanding of driving laws/lane guidelines/traffic signals. Driving experience will be an added advantage Education Criteria: Minimum 15 (10+2+3 / 4) years of education Candidates with standing arrears is not eligible, should be a graduate Interview will be a day long process Parking facility is not available inside Cognizant premises Referrals are invited Walk In Venue Details: Cognizant Technology Solutions (India) Limited Building No.12A, 1st floor, Raheja Mind space, Hi-tech city, Hyderabad - 500 032 Interview Date & Time: July 12th to July 31st (Monday-Saturday) Interview Time : 11AM to 2 PM Interview location & Work Location: Hyderabad Point of Contact: Ashish Joseph Candidates who have attended the interview in last 3 months are not eligible. If you cannot attend the walkin, and are interested in applying for this position, please write to Poojitha Kunduru at Poojitha.Kunduru@cognizant.com . Please mention Applying for [Role - Software Quality Testing Analyst - Tier 1] in your email subject line","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"15 - Jul - 2019","skills":"Testng Defect Life Cycle Automation Framework Automation Testing Test Analysis","qualification":"B.E./B.Tech, MCA/PGDCA","address":"GODREJ INFOTECH LIMITED, Plant 19-A, LBS MARG, VIKHROLI WEST","phone":"Not Provided","profile":"Automation Tester \nGodrej Infotech Limited","description":"Godrej Infotech Limited is on the look for Automation Tester. Job Location: Mumbai (Vikhroli) Experience Required: Within 2-5 Years Notice Period:1 month or 45 Days not more than that Essential Skills: 2-4 years- experience as test analyst Developing test strategies, test plans and test cases; Good web testing experience. At least 2-3 years of Automation testing experience using Selenium. SPECIAL SKILLS- Essential:Dedication to quality and meticulous approach, attention to detail, high level analytical and problem-solving skills, demonstrated ability to investigate complex issues and make informed decisions about them when written guidelines are not necessarily available Fluent English; Good Presentation and Communication skills (both written and verbal) Walk-in Details: 15th July 2019 Timing-9:00 Am to 12 pm Interview Venue: GODREJ INFOTECH LIMITED, Plant 19-A, LBS MARG, VIKHROLI WEST Interested candidate can send me their CV on shwethas@godrej.com","location":"Mumbai","experience":"2 - 5 Years"},{"date":"15, 16, 17, 18, 19 - Jul - 2019","skills":"Automation Testing, Test Scripts, Regression/ Manual testing, Agile, Sellinium","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Resulticks Digitals India Pvt. Limited, No. 37, 6th Floor, PM Tower, Greams Road, Thousand Lights, Chennai- 600 006 (Landmark: IDBI Bank on the Ground Floor)","phone":"Not Provided","profile":"Automation Testers (Selenium) \nResulticks Digitals India Pvt. Limited","description":"Person must have BS/ BA Degree in Computer Science or Information Systems 2+ years of experience in QA field using web-based technology is desired Experience in NCover and Nunit Effectively balance curiosity about tests, test results, and bugs with project constraints on budget and schedule. Good communication skills to work across groups and locations Must have a working knowledge of Quality Assurance methodologies Excellent analytical skills and problem solving ability are a must Must have great attention to detail ISQTP certification is Desirable Walk-in Date: 15th - 19th July 2019 Timing: 11.00 AM - 3.00 PM only Interview Venue: Resulticks Digitals India Pvt. Limited No. 37, 6th Floor, PM Tower, Greams Road, Thousand Lights, Chennai- 600 006 (Landmark: IDBI Bank on the Ground Floor)","location":"Chennai","experience":"4 - 8 Years"},{"date":"15, 16 - Jul - 2019","skills":"Test Engineering, Selenium/ Manual Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Crystal Solutions Limited, 716/717, Reena Complex, Ramdev Nagar Road, Vidya Vihar (West) Mumbai - 86","phone":"89399 19650","profile":"Software Tester/ Freshers \nExceljuta Talent Solution Private Limited","description":"We have an urgent requirement of freshers for the post of Trainee Test Engineer at the fastest growing software Company in Chennai, OMR road. Job location: Chennai, OMR road Looking forward for the support Requirements: Engineering candidates are eligible Testing course is mandatory (Selenium/ Manual) Knowledge in OOPS Concepts Excellent in oral and written communication skills. Walk-in Date: 15th & 16-July-2019 (Monday & Tuesday) Time: 10:30 AM - 3:00 PM Venue Details:- Exceljuta Talent Solution Pvt. Limited No: 30 Srinivasa nagar, 1st Street, Kandanchavadi, OMR, Chennai - 600 096 Landmark: Near Saravana Bhavan Hotel, Lane next to Prince Info Park Phase 1, Beside KVB ATM Contact Person: Pavithra / Santina Contact No: 89399 19650","location":"Chennai","experience":"0 - 1 Years"},{"date":"14 - Jul - 2019","skills":"Writing Test Cases Test Engineering Product Development product design","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"iDisha Infolabs Private Limited (Quick Ride) #96, First floor, 3rd Cross, Behind Coffee Lounge, Opposite Marathahalli Kalamandir Service Road, RJ Garden, Marathahalli, Bengaluru - 560 037","phone":"8197556770","profile":"Software Tester/ Developer (Fresher) \niDisha Infolabs Private Limited (Quick Ride)","description":"We are conducting walk in drive at our Organisation on 14 July 2019 Work Location: Marathahalli, Bangalore Need very good at Programming and keen to work in Product development start-up for minimum 2yrs, then candidate can come over for walk-in discussion . Freshers Required. B.E/ MCA/ M.Sc with CS/ IT/ ECE (Pass out : 2019) Min. Eligibility : 65% and above academics through out from 10th to Graduation. Excellent Java Programming skills is required. Interview Process for Developer 1. Written Test( Aptitude, Technical) 2. Java Programming 3. Managerial Round 4. Final round Interview Process for Test Engineer 1. Written Test( Aptitude, Technical) 2. Finding bugs on mobile app , writing test cases 3. Managerial Round 4. Final round Walk-In Date: 14 July 2019 Time: 9AM to 11AM Interview Address: iDisha Infolabs Private Limited (Quick Ride) #96, First floor, 3rd Cross, Behind Coffee Lounge, Opposite Marathahalli Kalamandir Service Road, RJ Garden, Marathahalli, Bengaluru - 560 037 For applying please fill the link below https://forms.gle/ffee5fmMZDFe8kFN9 For further query feel free to call :8197556770","location":"Bangalore","experience":"0 - 1 Years"},{"date":"15, 16, 17, 18, 19 - Jul - 2019","skills":"Non Voice Process, Customer Service, Technical Support, Customer Care","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Amazon Development Centre (India) Private Limited, 6th Floor in Tower 1 of Laxmi Infobahn Pvt. Limited SEZ Survey No. 107(P), Kokapet Village, Gandipet Mandal, Ranga Reddy District","phone":"Not Provided","profile":"Technical Support Associate \nAmazon Development Centre (India) Pvt. Limited","description":"Qualifications required: Minimum qualification is 10 + 2. Any graduate/ PG is eligible to apply. Technical Aptitude: Familiarity with variety of Device Platforms (Desktops, Laptops, Tablets, Mobiles, Gaming consoles, Streaming devices) and Digital Services (Videos, Music, Apps, Video Games, streaming content, Cloud Storage) and associated technical terminologies In-depth knowledge of Wi-Fi technologies (Devices / Connectivity / Types) Working knowledge of all kinds of mobile and computer OS ( Mac / iOS / Windows ) Ability to translate complex technical information / instructions into a simple language that would ensure seamless trouble shooting Basic awareness about Amazons Devices and Digital Services (Subscriptions) Awareness of latest trends and developments in the technology industry Technically inclined with a drive to challenge existing processes and innovate Communication Skills: Excellent communication skills (written and verbal) Ability to communicate correctly and clearly with all customers Excellent documentation skills Good comprehension skills ability to clearly understand and state the issues customers present Ability to concentrate follow customers issues without distraction to resolution Good composition skills ability to compose a grammatically correct, concise, and accurate written response Work successfully in a team environment as well as independently Problem Solving Skills: Effective problem solving skills including decision making, time management and immediate prioritization of tasks as assigned Ability to approach problems logically and rationally Action oriented and self-disciplined Organized and detail-oriented Ability to quickly and effectively prioritize work time in various departments to meet business need Ability to maintain composure in highly escalated situations Qualified candidates will be comfortable in a multi-tasking, high-energy environment. They will be creative and analytical problem solvers with a passion for excellent customer service Salary Range: 2.6 LPA - 3.1 LPA Additional Benefit: Meal Vouchers, Night Shift Allowance, Over Time Payout, Transportation Allowance (work from office) Walk in Details: Interview Date: 15th to 19th July 2019 (Monday- Friday) Time: 10.30 am to 2 pm Interview Venue: Amazon Development Centre (India) Private Limited 6th Floor in Tower 1 of Laxmi Infobahn Pvt. Limited SEZ Survey No. 107(P), Kokapet Village, Gandipet Mandal, Ranga Reddy District","location":"Hyderabad","experience":"0 - 5 Years"},{"date":"16 - Jul - 2019","skills":".Net Trained / Freshers","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Atlas Systems Private Limited, No. 56/3, Bannerghatta Main Road, Unit-1B, First Floor, Vakil Square, Gurappana Palya, Bengaluru, Karnataka - 560 029","phone":"080-42615071","profile":".Net Developer/ Freshers \nAtlas Systems Private Limited","description":"Atlas Systems Private Limited, is looking for .Net Fresher Night shift (Male only) Candidate must have good knowledge in .Net Technologies .Net Certification is mandatory Walk-in Date: 16th July 2019 Timing 11:00 AM to 5:00 PM Interview Venue: Atlas Systems Private Limited No. 56/3, Bannerghatta Main Road, Unit-1B, First Floor, Vakil Square, Gurappana Palya, Bengaluru, Karnataka - 560 029 Contact Person : Kalaivani","location":"Bangalore","experience":"0 - 1 Years"},{"date":"15, 16, 17, 18, 19 - Jul - 2019","skills":"Java, GWT, Servlets, Hibernate and RESTful APIs, MySQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"ProdEx Technologies, No: 45, Dr RadhaKrishnan Salai, Laxmi Towers, 1st Floor, Mylapore, Chennai - 600 004","phone":"Not Provided","profile":"Java Developers \nProdEx Technologies","description":"* 2+ years of relevant experience in the field of web development (Java, Servlets, MySQL). * Ability to develop and deploy server based applications. * Prototype various technologies and architectures to identify best solutions to given problems. * You will work with Java, GWT, Servlets, Hibernate and RESTful APIs on Windows/ Linux in a fast paced environment. * Opportunity to interact directly with the customer, collect requirements and implement. Desired Profile- * Proven experience building mobile applications for Android (using Java) * Ability to ensure the performance, quality, and responsiveness of applications * Knowledge of a database management systems like MySQL or Oracle, experience of handling big data is a plus. * Constant interest in staying upto date with the latest trends in UI design, Web design, Mobile Apps etc. * Passionate self-starter who can learn quickly. * Excellent verbal and written skills Walk-in Date: 15th to 19th July (Monday to Friday) Timings: 10.00 AM - 4.00 PM Interview Venue: ProdEx Technologies No: 45, Dr RadhaKrishnan Salai, Laxmi Towers, 1st Floor, Mylapore, Chennai - 600 004","location":"Chennai","experience":"2 - 3 Years"},{"date":"12 - Jul - 2019","skills":"Core Java /J2EE, Spring MVC, Hibernate, Jquery, JSP Servlets,Oracle /SQL.","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"NSEIT Limited, Trade Globe, Second Floor, J.B Nagar, Andheri - Kurla Road, Andheri (East), Mumbai - 400 059,","phone":"022-4254 7497","profile":"Core Java Developer \nNSEIT Limited","description":"Work Experience: 2 - 5 Years Must have Skills : - Core Java/ J2EE, Spring MVC, Hibernate, Jquery, JSP Servlets,Oracle /SQL. Technical Skills : Full life cycle J2EE solution implementation from conceptualization, requirements, design and specification through development (coding), integration testing, deployment and follow-up support. Knowledge/Experience in J2EE development, JSP, servlets, expression language, JSTL, XSLT etc. Good working knowledge of Web Technologies: JavaScript, CSS and HTML, AJAX Hands On experience on Spring MVC, Spring security and Spring Core. (Must Have) Working knowledge of MySQL or Oracle. Walk-in on 12th July' 2019 Time: 11 am to 5 pm Interview Venue: NSEIT Limited, Trade Globe, Second Floor, J.B Nagar, Andheri - Kurla Road, Andheri (East), Mumbai - 400 059, Landmark: Near Kohinoor Continental Hotel","location":"Mumbai","experience":"2 - 5 Years"},{"date":"13 - Jul - 2019","skills":"Java, object oriented analysis and design, coding and implementation","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Zuci Software Testing Solutions Pvt. Limited, No.11, Ground Floor, Rattha Tek Towers, OMR, Thoraipakkam, Chennai - 600 097.","phone":"Not Provided","profile":"Java Developers \nZuci Software Solutions Pvt. Limited","description":"Candidate should have hands-on experience in Java, object oriented analysis and design, coding and implementation in Java Work Experience: 1 - 3 Years Job Location: Chennai Walk-in directly if your profile is suitable! Date: 13th July 2019 Time: 9:30 AM to 3:00 PM Interview Venue: Zuci Software Testing Solutions Pvt. Limited No.11, Ground Floor, Rattha Tek Towers, OMR, Thoraipakkam, Chennai - 600 097. Landmark: Opposite to Hotel Sangeetha, OMR","location":"Chennai","experience":"1 - 3 Years"},{"date":"13 - Jul - 2019","skills":"CORE Java, REST, JavaScript, JQuery, Vue.JS, HTML, CSS","qualification":"B.E./B.Tech","address":"3D PLM Global Services Pvt. Limited, Flagship Infrastructure (P) Limited, SEZ, S. No. 123, Fourth Floor at Building IT 09, Rajiv Gandhi InfoTech Park, Phase -I, Hinjewadi, Pune - 411 057","phone":"Not Provided","profile":"Java Developers \n3D PLM Global Services Pvt. Limited","description":"Qualification: Bachelors of Engineering (Computer Science or others) Total Experience: 2 to 6 Years Job Location: Pune Should have experience in JavaScript, JQuery, Vue.JS, HTML, CSS Hands on experience in CORE Java, REST Good problem solving and analytical skills Good English communication skills Good to have the experience of Application Interface. Perks and Benefits- Best in the Industry Walk-in Date: 13th July 2019, Timings: 10 AM - 5 PM onwards Interview Venue: 3D PLM Global Services Pvt. Limited, Flagship Infrastructure (P) Limited, SEZ, S. No. 123, Fourth Floor at Building IT 09, Rajiv Gandhi InfoTech Park, Phase -I, Hinjewadi, Pune - 411 057","location":"Pune","experience":"2 - 6 Years"},{"date":"15, 16, 17 - Jul - 2019","skills":"Java/ J2ee, JSP, Core Java, Hibernate, Javascript , Spring, Advanced Java","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"RS Group of Technologies, New No.33, Old No.16, New Colony 2nd Main Road, Near Municipal Office, Chrompet, Chennai - 600 044","phone":"9962848578","profile":"Java Developer - Freshers \nRS Group of Technologies","description":"Educational Qualification- Diploma / Degree Experience- 0 to 1 year (Freshers only) Candidates with arrears can also apply Both Male & Female can apply Job Location- Chennai Direct walk-in & Direct Joining Process Date: 15th - 17th July 2019 Timing: 10 AM - 5 PM onwards Interview Venue: RS Group of Technologies New No.33, Old No.16, New Colony 2nd Main Road, Near Municipal Office, Chrompet, Chennai - 600 044 Phone No- 9962848578","location":"Chennai","experience":"0 - 1 Years"},{"date":"13 - Jul - 2019","skills":"CORE Java, REST, JavaScript, JQuery, Vue.JS, HTML, CSS","qualification":"B.E./B.Tech","address":"3D PLM Global Services Private Limited (A Dassault Systmes Company) No. 45, Nanda Towers, 22nd cross, 5th Main Road, 3rd block Jayanagar, Bangalore - 560 011","phone":"Not Provided","profile":"Java Developers \n3D PLM Global Services Pvt. Limited","description":"Bachelors of Engineering (Computer Science or others) Total Experience: 2 to 6 Years Job Location: Bangalore Should have experience in JavaScript, JQuery, Vue.JS, HTML, CSS Hands on experience in CORE Java, REST Good to have the experience of Application Interface. Good problem solving and analytical skills Good English communication skills Walk-in Date/ Time: 13th July 2019, 10 AM - 5 PM onwards Interview Venue: 3D PLM Global Services Private Limited (A Dassault Systmes Company) No. 45, Nanda Towers, 22nd cross, 5th Main Road, 3rd block Jayanagar, Bangalore - 560 011 Landmark: Near to NMKRV PU College for Women","location":"Bangalore","experience":"2 - 6 Years"},{"date":"17 - Jul - 2019","skills":"Core Java, Spring MVC, Hibernate, Javascript","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"eMudhra Limited, Survey No. 80/2 , Plot No. 23 , 24 - 25, 1st Floor Bellandur Village Varthur Hobli, Bangalore - 560 103","phone":"080-42275316","profile":"Java Developer \neMudhra Limited","description":"Mandatory Skills: 1. Core Java (mandatory) 2. Spring MVC (mandatory) 3. Hibernate (mandatory) 4. Javascript (mandatory) Work Experience: 1.6 to 4 years Notice Period: Immediate /15-30 days Face to face Interview: 17th July 2019 (Wednesday) Timings: 9 AM - 5 PM Interview Venue: eMudhra Limited Survey No. 80/2 , Plot No. 23 , 24 - 25, 1st Floor Bellandur Village Varthur Hobli, Bangalore - 560 103 Landmark: above ICICI Bank, Bellandur Branch Opposite to Akme Apartment Interested candidates who are willing to attend the interview can drop the resume to ramya.c@emudhra.com or can reach on 080-42275316","location":"Bangalore","experience":"1 - 4 Years"},{"date":"12 - Jul - 2019","skills":"Back Office Activities, Excel, Document Verification, Data Entry","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Integreon Managed Solutions (I) Pvt. Limited, 4th Floor, IT Building 03, Nesco IT Park, Nesco Complex, Western Express Highway, Goregaon East, Mumbai - 400 063","phone":"Not Provided","profile":"Back Office Executive \nIntegreon Managed Solutions (I) Pvt. Limited","description":"Key Objective: To work with the team leaders to produce quality assured documents. Educational Requirements: Graduate or equivalent preferred Strong Verbal and Written communication skills Professional approach to problem solving Good knowledge of Word, MS PowerPoint, Excel High level of positive attitude Should be Flexible in terms of movement internally and externally Should be flexible to work in rotating shifts Service mentally and Core value integration Previous Experience Requirements Immigration experience preferred Fluent in written and oral communication in English Specific Duties: To produce client worthy documents ensuring quality To carry out work smoothly and efficiently To continue to develop speed, accuracy To maintain confidentiality of all official and client information To have good co-ordination with team members/colleagues To understand, use and contribute best practices for production To assist the team leaders in training new recruits To follow all SOP maintained for every process Shift- Day shift Job Location: Mumbai CTC: Upto 2,75,000/- Walk-in Date: 12th July 2019 Timing- 10 AM onwards till 2:00 PM Interview Venue: Integreon Managed Solutions (I) Pvt. Limited 4th Floor, IT Building 03, Nesco IT Park, Nesco Complex, Western Express Highway, Goregaon East, Mumbai - 400 063 Contact Person: Anil Kumar","location":"Mumbai","experience":"0 - 3 Years"},{"date":"15, 16 - Jul - 2019","skills":"IT Recruitment recruiter it recruiter it staffing","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Zenith Software Limited, 'Zenith House' 4, Industrial Layout, Koramangala, Bangalore - 560 095","phone":"080 66958771","profile":"IT Recruiter \nZenith Software Limited","description":"We are looking Experienced IT recruiter for our Staffing team. If you are interested Walk -In to our Office of share your resume for further process. IT recruitment Experience - 1 to 3 Years Job Location - Koramangala, Bengaluru Candidate must haver good working experience in end to end IT recruitment Searching Candidates resumes from the job portals as per clients requirement Expertise in the areas of sourcing, screening, validating, interview coordination Build and Maintain candidates' relationship, pipeline, and proven ability to self-manage multiple positions Experience in sourcing and screening profiles from various Job portals Experience in C2H is a plus Walk-in Date/ Time: 15th - 16th July , 10 AM - 5 PM onwards Interview Venue: Zenith Software Limited 'Zenith House' 4, Industrial Layout, Koramangala, Bangalore - 560 095 Phone No: +91 80 66958771 / 72 /73 Email: nutanb@zenithsoft.com","location":"Bangalore","experience":"1 - 3 Years"},{"date":"12, 13, 14, 15, 16, 17, 18, 19 - Jul - 2019","skills":"HR Generalist Activities, Payroll Payroll Processing, Employee Engagement","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Radiance Realty Developers India Limited, Khivraj complex IInd phase 6th Floor, No: 420 Annasalai, Nandhanam, Chennai - 600 035.","phone":"Not Provided","profile":"HR Executive \nRadiance Realty Developers India Ltd.","description":"Candidate should be Any Graduate/ MBA (HR) with 3 to 5 years of experience in Recruitment, HR Generalist Activities, Payroll Payroll Processing, Employee Engagement, Employee Relations, Time Office. Walk-in Date/ Time: 12th - 19th July , 9 AM onwards Interview Venue- Radiance Realty Developers India Limited Khivraj complex IInd phase 6th Floor, No: 420 Annasalai, Nandhanam, Chennai - 600 035.","location":"Chennai","experience":"3 - 5 Years"},{"date":"12, 15, 16, 17, 18, 19, 22 - Jul - 2019","skills":"Recruitment HR Hiring Interviewing","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Photon Interactive Pvt Limited, DLF IT Park, 5th Block 2nd Floor, 1/124, Mount Poonamallee Road, Manapakkam, Chennai - 600 089","phone":"9300012736","profile":"HR Recruiter \nNeuroglia Health Private Limited","description":"We are hiring RECRUITERS! Keeping our strong growth plans in mind, We are growing our HR team to help our recruitment efforts. Young, energetic and great communicators 6 months to 1-year experience Ability to work on both technical and nontech positions Hands-on knowledge of job portals and alternate recruitment channels. Be a team player. work closely with business teams Ability to work with a target-oriented approach. Shift Time: 5 Days - Day shift. Location: JP Nagar 4th Phase, Bengaluru Salary: Open salary (Based on interview performance). Interview Details: Time: 10 AM - 6 PM Date: 12th July (Friday) - 22nd July (Monday) Venue: 3rd Foor, 393, 2nd Cross Road, JP Nagar 4th Phase, Dollars Colony, Phase 4, JP Nagar, Bengaluru - 560 078. POC: Shubham - 9300012736 Feel free to connect at 9300012736 or Mail @ shubham@marrowmed.com","location":"Bangalore","experience":"0 - 2 Years"},{"date":"13 - Jul - 2019","skills":"Java/ J2Ee, Spring, Mvc, Web Services","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"CenturyLink Technologies India Private Limited, Salarpuria Touchstone, Fourth Floor, Survey no. 15/3 & 16, Kadubeesana Halli, Varthur Hobli, Outer Ring Road, Bangalore - 560 087.","phone":"Not Provided","profile":"Java Developers \nCenturyLink Technologies India Pvt. Limited","description":"Openings for Java Developer (Permanent Role) Work Experience: 2 to 8 Years Job Location: Bangalore Good knowledge and hands on experience in Core Java / J2EE technologies. Essential to have good analytical, written and verbal communication skills Ability to go beyond just the tasks given, and proactively work on additional improvements. Experience with hibernate, Spring MVC & Oracle Strong knowledge and ability to implement/develop micro services. Experience in building soap/restful Webservices. Ability in understanding swagger document to build restful services. Understanding of CenturyLink Billing / Inventory systems Ability to analyze performance issues in the application. Interview Process: Java Online Test, Followed by technical Interviews & Manager Round Walk-in Date & Time: 13th July-2019 @ 9:00 AM to 4:00 PM Mode of Interview: Face 2 Face Interview Venue: CenturyLink Technologies India Private Limited. Salarpuria Touchstone, Fourth Floor, Survey no. 15/3 & 16, Kadubeesana Halli, Varthur Hobli, Outer Ring Road, Bangalore - 560 087. Contact Person: Sindhu / Sowjanya","location":"Bangalore","experience":"2 - 8 Years"},{"date":"13, 16, 17, 18, 19 - Jul - 2019","skills":"C#.Net 3.0/4.0/4.5, ASP .NET, ADO .NET, JQuery, MVC4, MVC5","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Info-X Software Technology Private Limited, 335 Udyog Vihar Phase 2, Gurugram - 122 016","phone":"836-831-8967","profile":"ASP .Net/ MVC Developer \nInfo-X Software Technology Pvt. Limited","description":"We are looking for a Self-motivated ASP .Net/ MVC Developer who can take up the challenge of developing applications in .NET, MVC and providing end to end solutions. Qualification - Any Graduate with relevant experience, Minimum of 1 year of experience on MVC and had done at least 2 projects on MVC. Candidates who can join immediately or within 10 to 15 days should only apply. Roles and Responsibilities:- Excellent knowledge of C#.Net 3.0/4.0/4.5, ASP .NET, ADO .NET, JQuery, MVC4, MVC5 Experience in developing web applications and web services. Good proficiency CSS, HTML, AJAX, XML, XML Schema, WPF, MVC, Knowledge of Data Adapter, Dataset, Data reader as a part of ADO.NET to access and update the database. Experience in developing T-SQL queries, stored procedures, and triggers using SQL Server 2008/2016 and database maintenance Effective in working independently and collaboratively in teams. Excellent communication skills Should possess knowledge of C# Windows forms / WPF with MVVM, Multithreading, WCF Knowledge of XML, XSLT, XSD (optional) Knowledge of EDI Integration using EDIFACT, Ansi X-12, SAML, FLAT File. Skill Set: Ability to understand the task quickly. Desired candidates should be time flexible along with being ready to work in a competitive and challenging environment. Understand the customer's query and provide an accurate resolution Candidate with a stopgap can also apply. We have multiple openings candidates who can join immediately are most welcome. Candidate should have high energy levels. Candidates who are not working and have a stop gap can also apply. Perks and Benefits Annual Bonus Walk-in Date: 12th July - 19th July, 2019 Timing - 3 PM to 7 PM (Monday to Friday) Interview Venue: Info-X Software Technology Private Limited 335 Udyog Vihar Phase 2, Gurugram - 122 016 Interested candidate kindly send profile on pramod@infoxwebware.net Phone No: 836-831-8967","location":"Gurgaon","experience":"1 - 6 Years"},{"date":"12 - Jul - 2019","skills":"HR/ Recruitment, Screening, Telephonic Interviewing, Sourcing","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Plot No. 319, Udhyog Vihar, Phase-4 Gurugram, Haryana - 122 016","phone":"3913939","profile":"Sr. HR Executive (Only Male) \nSpiceJet Limited","description":"We are conducting walk-in interviews for the position of Senior HR Executive (only Male) in our in Human Resources Department on 12th July' 2019 from 10:00 am to 12:00 Noon (Friday) Designation : Senior Executive - HR Department : Human Resources Job Location : Gurgaon Qualification : MBA/ PGDM - HR Experience: 3 - 5 Years Job Responsibilities: * Sourcing /Screening - Resumes/Profiles * End to End Recruitment * Taking Telephonic round of interviews/Face to Face interviews * Coordinating with candidates & interview panelist for the final rounds * Posting job vacancy on job portals * Documentation * Daily MIS * Daily assigned work Required Skills sets: * Willing to travel * Excellent Communication both written & Verbal * Having knowledge of Excel & power-point presentation * Out of the box thinking Kindly report at the below mentioned address and do carry a copy of your updated resume Date : 12th July ' 2019 ( Friday ) Timing: 10 am till 12 noon Interview Venue: Plot No. 319, Udhyog Vihar, Phase-4 Gurugram, Haryana - 122 016 Dress Code: Formals","location":"Gurgaon","experience":"3 - 5 Years"},{"date":"13 - Jul - 2019","skills":"Core Java, Spring, Microservices, Web Services, Web Technologies","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"e-Zest Solutions Limited, 3rd Floor, Building IT-09, Qubix business park, SEZ Blueridge, Rajiv Gandhi Infotech Park, Hinjewadi Phase 1, Pune - 411 057","phone":"7420073336","profile":"Java Full Stack Developer \ne-Zest Solutions Limited","description":"Walk-in Drive at e-Zest Solutions Limited for Java Full Stack Developer in Pune Position: Java full Stack (Junior) Work Experience: 2 to 5 Years Required Skills: Core Java, Spring 4+ Experience in Spring framework (Core, Data, Security, Cloud) with Spring Boot/ Spring Security Micro Services/ Webservices Angular 4 or 6 with 2 years + experience Elastic Search Experts Full Stack Developer Interview Day & Date: Saturday, July 13th, 2019 Interview Time: 10:00 AM IST Mode of interview: Face to Face Venue: e-Zest Solutions Limited, 3rd Floor, Building IT-09, Qubix business park, SEZ Blueridge, Rajiv Gandhi Infotech Park, Hinjewadi Phase 1, Pune - 411 057 Contact Person : Manjiri Wable (7420073336) / Niraj Rai Required Joiners only upto 15th August 2019 CTC as per market standards","location":"Pune","experience":"2 - 5 Years"},{"date":"13 - Jul - 2019","skills":".Net Framework 4.0, C#, ASP .Net MVC, SQL Server and Jquery","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"HCL Technologies Limited, A-11, Sector-16, Noida","phone":"Not Provided","profile":".Net Developer \nHCL Technologies Limited","description":"Work Experience: 1-8 Years Primary Skills: .Net Framework 4.0, C#, ASP .Net MVC, SQL Server and Jquery Secondary Sills: Web Services/ WCF/ WPF, Jquery Roles & Responsibilities: Build new systems with Dot Net Framework 4.0, C#, ASP.Net MVC,SQL Server and Jquery, Angular JS Maintenance of existing applications Develop new functionality on our existing software applications. Share knowledge through knowledge-sharing presentations. Under general direction, design, code, test, debug and document source code in order to improve business productivity and/or quality Strong written and oral communication skills Commitment to improvement of customer experience Experience in translating technical requirements into source code Ensure that projects are delivered on time and are of the highest quality, meeting all team standards Document, implement, and provide on-going production support for automation solutions as required Testing Walk-in Date: 13th July (Saturday) Time 9:30 AM 1:30 PM Interview Venue: HCL Technologies Limited, A-11, Sector-16, Noida Mode of interview- Two Rounds of interview Documents to carry Updated Resume, Photograph, and Govt. ID Proof (Dont carry laptops)","location":"Noida","experience":"1 - 8 Years"}]}