{"Walkins":[{"date":"6 - Jul - 2019","skills":"MVC, Javascript, JQuery, ASP .Net, C#, Entity Framework","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"PaAmar Jyothi House Building, No. 57 to 82, Domlur Village,, Civil Area, Kasaba Hobli, Bangalore North Taluk, 100 Feet Road, Bengaluru, Karnataka - 560 071","phone":"8216617777","profile":".Net Professionals \nCognizant Softvision","description":"We currently have a Full-time opportunity for a Sr .Net Developer Developer / .Net Technical Architect position with Cognizant Softvision Work Experience: 5 to 14 Years Skills: .Net, Asp .Net ,C#,MCV, Java Script, Jquery No of Positions 5 Place of Work: Bangalore Walk-In drive on 6th July 2019 9 AM onwards Interview Venue: PaAmar Jyothi House Building, No. 57 to 82, Domlur Village,, Civil Area, Kasaba Hobli, Bangalore North Taluk, 100 Feet Road, Bengaluru, Karnataka - 560 071","location":"Bangalore","experience":"5 - 14 Years"},{"date":"5 - Jul - 2019","skills":"Branch/ Banking Operations, Back Office Operations, Data Entry","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Kotak Infiniti, 2nd Floor, Building No 21, Infinity Park, Off Western Express Highway, General A K Vaidya Marg, Malad (East ), Mumbai - 400 097","phone":"Not Provided","profile":"Back Office/ Operations Executive \nKotak Mahindra Bank Limited","description":"Qualification: Any Graduate Fresher required. CTC To be Offered : 130000-155000 No. Of Position : 4 Job Responsbility- 1. Execution of system access requests through KRAMAN 2. Creation/ Modification of business roles in KRAMAN 3. Maintaining database for users for whom access is provided in respective applications according to their KRAMAN business role 4. Creation/Modification of user ids in various systems 5. Handling queries received through mails and calls 6. Timely execution of Remedy requests received 7. Co-ordination with PAN INDIA users on KRAMAN related issues 8. Conducting user access reviews and user access verifications in coordination with business 9. Coordination with group companies (KSEC, KLI, KMIL, Wealth) in order to provide system access to their users 10. Timely execution of requests received w.r.t. Treasury applications Interview Date : 5 July 2019 Timing : 11 am to 4 pm Interview Venue : Kotak Mahindra Bank Limited, Kotak Infiniti, 2nd Floor, Building No 21, Infinity Park, Off Western Express Highway, General A K Vaidya Marg, Malad (East ), Mumbai - 400 097 Contact Person : Khushbu Rathod","location":"Mumbai","experience":"0 - 1 Years"},{"date":"5 - Jul - 2019","skills":"Recruitment, Head Hunting, Job Posting/ Sourcing, Referencing, Social Media","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Tech Mahindra Limited, A-8 , Sector-62 , 1st Floor Knowledge Boulevard -Noida","phone":"Not Provided","profile":"Recruitment Executive \nTech Mahindra Limited","description":"Candidate should have excellent communication skills+ Convincing skills. Should have done leadership hiring for at least 2-5 years Have done bulk hiring for 2-4 Years Should be excellent in Headhunting and Networking Ability to work under pressure Have done work in Job portals Only BPO expr can apply Require only Male candidate Job Responsbility- Handle end to end recruitment solution delivery and Walk-ins. Interact with the internal stakeholders to get a clear briefing on the open positions. Analyse their requirements and identify the best ways to source talent. Source profiles from different job Portals, through Job Posting Referencing and Headhunting. Prepare and Analyse Recruitment Trackers & maintain MIS of work for review. Walk-in Date: 5th July 2019 Timing: 11 AM - 4 PM Interview Venue: Tech Mahindra Limited A-8 , Sector-62 , 1st Floor Knowledge Boulevard -Noida Next to IMS and Jaypee College.","location":"Noida","experience":"2 - 5 Years"},{"date":"5 - Jul - 2019","skills":"Back Office Operations Non Voice Hiring Interviewing Chat Insurance Processing","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"HCL Technologies Limited, 1st Floor, Navins WSS Towers, #107, Harris Road, Egmore, Pudupet, Chennai - 600 002","phone":"Not Provided","profile":"Backend Process Executive \nHCL Technologies Limited","description":"HCL Technologies Limited, is hiring for Insurance Process for Back Office Operations, Please find below details for further clarification. Basic Criteria's: Graduation is a must (Without any standing Arrears) Decent Communication Skills in English (Written and spoken) Should have good basic knowledge in Banking & Insurance Fresher's can apply if you are good in Communication and MS office Skills (2019 passed out please ignore) Process Name : Insurance Back office Shifts : U.S Night Shifts Skills : Good Email Etiquette's/ Insurance Processing/ Chat Work Location : Sholinganallur, Chennai Walk in Date: 5th July, 2019 Timings : 10 AM to 1 PM Interview Venue: HCL Technologies Limited, 1st Floor, Navins WSS Towers, #107, Harris Road, Egmore, Pudupet, Chennai - 600 002 (Land Mark : Near Casino Theater) Contact HR : Sharmi Sai","location":"Chennai","experience":"0 - 3 Years"},{"date":"4, 5, 6 - Jul - 2019","skills":"General Administration, Front Office/ Receptionist Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"WebReinvent Technologies Pvt. Limited, 1st Floor, Plot 6-7, Near Metro Pillar No. 770 Rama Park, Dwarka Mor Metro Station, New Delhi - 110 059","phone":"8588864948","profile":"HR Recruiter - Fresher \nWebReinvent Technologies Pvt. Limited","description":"Walk-in interview for Fresher HR Recruiters. Immediate joiner will be preferred. Basic Training will be provided to fresher Job Responsibility: End to End Recruitment Coordinating with Candidates Scheduling Interviews Walk-in Date/ Time: 4th July - 6th July , 11 AM onwards Interview Venue: WebReinvent Technologies Pvt. Limited 1st Floor, Plot 6-7, Near Metro Pillar No. 770 Rama Park, Dwarka Mor Metro Station, New Delhi - 110 059","location":"Delhi","experience":"0 - 1 Years"},{"date":"4, 5 - Jul - 2019","skills":"Office Administration, Travel Arrangements, Back Office Assistance","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Chetu India Private Limited, A Block 186, Sector 63, Noida, Uttar Pradesh - 201 301","phone":"9667427662","profile":"Administration Executive \nChetu India Private Limited","description":"Person must have proven experience as an office administrator, office assistant or relevant role. Must have outstanding communication and interpersonal abilities. Excellent organizational and leadership skills. Familiarity with office management procedures and basic accounting principles Job Responsbility: Coordinating office activities and operations to secure efficiency and compliance to company policies. Supervising administrative staff and dividing responsibilities to ensure performance Keep stock of office supplies and place orders when necessary Walk-in Date/ Time: 4th - 5th July 2019 from 3 PM onwards Interview Venue: Chetu India Private Limited A Block 186, Sector 63, Noida, Uttar Pradesh - 201 301","location":"Noida","experience":"3 - 8 Years"},{"date":"5, 6 - Jul - 2019","skills":"General Administration, Back Office Assistance","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Bharat Institute of Engineering & Technology (BIET) Mangalpally (V), Ibrahimpatnam (M) Hyderabad, Telengana - 501 510","phone":"Not Provided","profile":"Admin/ Office Assistant \nBharat Institutions- Division of Chinta Reddy","description":"Educational Qualification: Any Degree Work Experience: 0 to 8 Years Age: 21-35 Years Freshers Can apply Salary: 8,000/- to 15,000/- Candidate should have good communication skills. Should be well versed with MS word and MS Excel. Should be proficient in typing. Screening phone calls, emails, letters and personal visits. Ability to communicate effectively in English, both orally and in writing. Should have the knowledge & able to perform the office related activities. Job Locations: 1. Bharat Institute of Engineering & Technology (BIET) Mangalpally (V), Ibrahimpatnam (M) Hyderabad, Telengana - 501 510 2. Bharat Institute for Degree & PG college for Women Address: 3-4-781, Opposite Tourist Hotel, Kachiguda Station Rd, Barkatpura, Kachiguda, Hyderabad, Telangana - 500027 Interested candidates can send your resume to mbapgrec@gmail.com Please bring your updated resume with one passport size photo for Interview. Note: 1) The selected candidates should execute an Service Agreement for Min 1 year. 2) Academic Original Certificates submission is mandatory; for which an Acknowledgment receipt will be issued. Candidates who have attended Interview in last 6 months need not to Apply.","location":"Hyderabad","experience":"0 - 8 Years"},{"date":"6 - Jul - 2019","skills":"hr operationsrecruitmentemployee referralbanking operations","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Amazon Development Centre India Pvt. Limited, Orion Building, Ground floor, Bagmane Constellation Business Park, K. R. Puram - Marathalli Ring Road, Mahadevpura, Bangalore - 560 048","phone":"Not Provided","profile":"HR Operations Executive \nAmazon Development Centre (India) Pvt. Limited","description":"Join Amazons HR team and help make a difference for all Amazonians! We are recruiting for an Employee Services Sr. Associates based out of Bangalore, India. Roles that we are hiring for: - Sr Associate - Recruiting Services - Sr Associate - Screening Services - Sr Associate - Data Management - Sr Associate - Data Management, Leaves Eligibility Criteria : Work experience in any Operations or Corporate environment 1 to 6 years (Max) Minimum Qualification Graduate Excellent Communication Skills Flexible to work in night shifts and staggered week offs. Notice Period- Immediate to 1 month Mega hiring walk-in on 6th July, 2019, 10 AM 1 PM Venue: Amazon Development Centre India Pvt. Limited, Orion Building, Ground floor, Bagmane Constellation Business Park, K. R. Puram - Marathalli Ring Road, Mahadevpura, Bangalore - 560 048 Please bring along: Resume (Your login ID and Source as Employee Referral should be mentioned on top) original PAN & Adhaar Card Passport size photograph","location":"Bangalore","experience":"1 - 6 Years"},{"date":"9, 10 - Jul - 2019","skills":"Front Office Reception Front Desk Administration","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"SpiceJet Limited, Plot No. 319, Udhyog Vihar, Phase-4 Gurugram, Haryana 122016","phone":"Not Provided","profile":"Front Office Executive \nSpiceJet Limited","description":"SpiceJet is conducting walk-in interviews for the position Front Office Executive - Administration in our Administration Department on 9th & 10th July ' 2019 from 10:00 am Till 12:00 noon (Tuesday & Wednesday) Designation: Front Office Executive - Administration ( Female Only) Department: Administration Location: Gurugram Educational Qualification: Graduate (Any Stream) REQUIRED SKILLS: Candidate should have prior experience in front desk customer experience Must have good verbal communication skills in both Hindi and English. JOB RESPONSIBILITIES: Attending Guest. Attending Calls Maintaining the reception area Take care of the courier entry Handling candidates for interviews. Coordination with departments internally Kindly report at the below mentioned address and do carry a copy of below listed documents: 1) PAN CARD 2) ADHAAR CARD/PASSPORT/VOTERS ID CARD 3) 10th, 12th & Graduation (Mark sheet/ Certificate) Age Criteria - 21 Yrs - 28 Years Dress Code - Formals Date - 9th July '19 & 10th July '19 (Tuesday & Wednesday) Timing -10:00 am -12:00 noon Venue - Plot No. 319, Udhyog Vihar, Phase-4 Gurugram, Haryana - 122 016","location":"Gurgaon","experience":"1 - 6 Years"},{"date":"9, 10, 11, 12 - Jul - 2019","skills":"front office front desk reception receptionist activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Cheers Interactive (India) Pvt. Limited, Millennium Business Park, Sector 3, Building # 4, Mahape, Navi Mumbai - 400710","phone":"022 6772 5700","profile":"Front Desk Executive/ Receptionist \nCheers Interactive (India) Pvt. Limited","description":"Candidate should be well-versed with MS Office & EPBAX / EPBX system Should be presentable & have good communication skills Job Responsbility- Greet and welcome guests as soon as they arrive at the office Direct visitors to the appropriate person and office Answer, screen and forward incoming phone calls Ensure reception area is tidy and presentable, with all necessary stationery and material (e.g. pens, forms, brochures etc.) Provide basic and accurate information in-person and via phone/email Receive, sort and distribute daily mail/deliveries Order front office supplies and keep inventory of stock Update calendars and schedule meetings Arrange travel and accommodations, and prepare vouchers Keep updated records of office expenses and costs Walk-in Date: 9th - 12th July 2019 Time : 10 am to 5 pm Interview Venue: Cheers Interactive (India) Pvt. Limited Millennium Business Park, Sector 3, Building # 4, Mahape, Navi Mumbai - 400710 Tel: 022 6772 5700","location":"Mumbai","experience":"1 - 6 Years"},{"date":"6 - Jul - 2019","skills":"ASP .NET framework, SQL Server MVC, WCF","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Techwave Consulting Inc., Level 4, Buildig No. H6 Phoenix Avance Business Hub, Hitech City, Behind Dell Campus, Hyderabad - 500 081","phone":"Not Provided","profile":"Junior .Net Developer \nTechwave Consulting India Pvt. Limited","description":"Candidate should have 2 to 4 years of proven experience as a C# .NET Developer Good working knowledge with the ASP .NET framework, SQL Server MVC, WCF Should have good communication skills. Job timings : Should work in Rotational shifts (24/7) Looking for immediate joiners Interview process : System test (.Net related) Technical round Walk-in Date/ Time: 6th July from 9 AM onwards Interview Venue: Techwave Consulting Inc., Level 4, Buildig No. H6 Phoenix Avance Business Hub, Hitech City, Behind Dell Campus, Hyderabad - 500 081 Please send profiles to kanusha@techwave.net","location":"Noida","experience":"2 - 4 Years"},{"date":"6 - Jul - 2019","skills":".NET, C#, ASP .NET, Web Forms, AJAX, ADO.NET, VB.Net, WCF","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"eClerx Services Limited, Airoli East, Mindspace, Bulding No 11, 5th & 6th Floor, K Raheja Mindspace, Pot # 3, TTC Industrial Area, Thane Belpur Road, Airoli, Navi Mumbai, Maharashtra - 400 708","phone":"9619554943","profile":".Net Developer \neClerx Services Limited","description":"Person should have extensive knowledge of Software Development Life Cycle (SDLC) and have worked using Water-Fall and Agile methodologies. Expertise in Microsoft .NET technologies such as Visual Studio .NET, C#, ASP .NET, Web Forms, AJAX, ADO.NET, VB .Net, WCF, Microsoft SQL Server, SSIS, SSRS and SSAS. Experience in Designing, Modeling and Development of Database using SQL Server 2000/2005/2008. Have worked on highly complex Stored Procedures and Functions. Strong knowledge of Object Oriented Design Methodologies and OOPs along with SOA. Walk-in Date/ Time: 6th July , 10 AM onwards Interview Venue: eClerx Services Limited Airoli East, Mindspace, Bulding No 11, 5th & 6th Floor, K Raheja Mindspace, Pot # 3, TTC Industrial Area, Thane Belpur Road, Airoli, Navi Mumbai, Maharashtra - 400 708 Kindly send resumes on sailee.chaudhari@eclerx.com","location":"Mumbai","experience":"2 - 7 Years"},{"date":"6, 7 - Jul - 2019","skills":"ASP.Net MVC C# WCF SQL Server","qualification":"B.E./B.Tech","address":"ZipBooks Software Solutions Pvt. Limited, 410, Pinnacle Business Park, Corporate Road, Prahladnagar, Prahlad Nagar, Ahmedabad, Gujarat - 380 015","phone":"07940037105","profile":".Net Developers \nZipBooks Software Solutions Pvt. Limited","description":"Candidate should have 0 to 4 years of experience in developing enterprise applications on .NET platform. Write well-designed, testable and Reusable software code. Troubleshoot- Debug & Update systems. Walk-in Date/ Time: 6th July - 7th July , 11 AM onwards Interview Venue: ZipBooks Software Solutions Pvt. Limited 410, Pinnacle Business Park, Corporate Road, Prahladnagar, Prahlad Nagar, Ahmedabad, Gujarat - 380 015","location":"Ahmedabad","experience":"0 - 4 Years"},{"date":"6 - Jul - 2019","skills":".Net Framework, C#/ VB.Net, ASP.Net, SQL Server","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Sparsh Communications Pvt. Limited, #8-2-293/ 82/A/ 854-M, Road No. 44, Jubilee Hills, Near Express TV (News Channel), Hyderabad - 500 033.","phone":"9703304411","profile":".Net Developer \nSparsh Communications Pvt. Limited","description":"Minimum 2 years of experience in .Net Framework, C#/ VB.Net, ASP.Net, SQL Server 2005/ 2008. Well-versed with JavaScript, AJAX, Web services Have strong concepts of OOPS. Hands on experience in product/ project development using MVC Strong database programming skills(T-SQL) Either Angular or Web API experience is Mandatory Should have hands on experience in working on complex business applications. Job Work Timings: Indian Time Zone Week Days: Five Day Week Interview Date - 6th July 2019 (Saturday) Time 11: 00 AM to 3:00 PM Interview Venue: Sparsh Communications Pvt. Limited #8-2-293/ 82/A/ 854-M, Road No. 44, Jubilee Hills, Near Express TV (News Channel), Hyderabad - 500 033. Landmark: Lane between Rangoli and Trisha Showrooms, Near Peddamma Temple Contact No: 9703304411 If your profile fits the below requirement don't hesitate to send your updated resume to venkat.akula@sparshcom.net and get the Interview schedule and Immediate Offer.","location":"Hyderabad","experience":"2 - 5 Years"},{"date":"6 - Jul - 2019","skills":"C#, ASP.Net, MVC, Web API, (RDBMS) SQL Server","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"RGBSI: 18/7 I Floor, Narayana Business Chambers, Hosur Main Road, Wilson Garden, Bangalore - 27","phone":"9620248463","profile":"ASP .Net Developer \nAcculogix Software Solutions India (P) Limited","description":"Person should have 1+ years of experience in full stack software development (web development). Must have excellent communication skills. Experience working in a product development background would be preferred. Individual Contributor having Strong knowledge and Hands on Experience doing projects in C#, ASP.Net, MVC, Web API. Hands on experience in Client side language like JavaScript or JQuery or Angular JS etc. Good understanding in Microsoft Technologies like ASP.NET Web Applications , LINQ to Entities. Strong knowledge in Database Management System (RDBMS) SQL Server. Good knowledge in Bootstrap. Working exposure to Agile/Scrum methodologies. Strong Knowledge in HTML, CSS and a basic knowledge of Object Oriented Programming Concepts. Knowledge of debugging web API with tools like fiddler, Postman. Notice period of 30 days or less!!! 60% throughout academics is mandatory. Walk-in Date/ Time: 6th July 2019, 10 AM onwards Interview Venue: RGBSI: 18/7 I Floor, Narayana Business Chambers, Hosur Main Road, Wilson Garden, Bangalore - 27 Interested candidates kindly share your updated resume to RL1@rgbsi.co.in","location":"Bangalore","experience":"1 - 5 Years"},{"date":"10 - Jul - 2019","skills":"HTML, CSS, JavaScript, jQuery, C#, ADO .NET, Entity Framework core, ASP .NET MVC","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"G7CR Technologies India Private Limited, Mitra towers,3rd Floor, Kasturba Road, Ashoka Nagar, Bengaluru - 560 001","phone":"080-46414200","profile":"Software Engineer (ASP .Net) \nG7CR Technologies India Pvt. Limited","description":"Candidate must have minimum one year work experience in ASP .Net MVC, C#, Web API. Should create necessary documentations and perform unit test of the work. Design, Develop & Modify Microsoft ASP .NET, MVC applications, .NET components & Web services Design, Develop & maintain Microsoft SQL database schemas & scripts, including views, triggers & stored procedures. Work in a team environment using a structured development process & deliver applications on time. Technical Skills: HTML, CSS, JavaScript, jQuery, C#, ADO .NET, Entity Framework core, ASP.NET MVC, Microsoft SQL server, Web API, JSON, AJAX, Bootstrap. Development Tools: SSMS, Visual Studio 2013/ 2015/ 2017, Chrome Developer Tool Walk-in Drive/ Time: 10th July 2019, 10 AM onwards Interview Venue: G7CR Technologies India Private Limited, Mitra Towers, 3rd Floor, Kasturba Road, Ashoka Nagar, Bengaluru - 560 001 You can reach us on 080-46414200 or send email to richa.agrawal@g7cr.in for any other details.","location":"Bangalore","experience":"1 - 4 Years"},{"date":"6 - Jul - 2019","skills":"C#/ .Net, MVC, Angular JS, JQuery, Linq, Entity Frameworks, MySQL, Micro Services","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Q3 Infotech Private Limited, 6th Floor JMD Megapolis, Sohna Road, Sector 48, Gurugram - 122 001","phone":"0124-6656028","profile":"Software Developer (.Net) \nQ3 Infotech Private Limited","description":"Candidate should have 1 to 5 years of experience in Software Development using C#/ .Net, MVC, Angular JS, JQuery, Linq, Entity Frameworks, MySQL, Micro Services. Requirements: - 60% and above throughout academics Excellent Oral and written Skills Immediately available or <2 months notice period Interview Date: 6th July 2019 Timings: 9.30 AM to 2.00 PM Interview Venue : Q3 Infotech Private Limited 6th Floor JMD Megapolis, Sohna Road, Sector 48, Gurugram - 122 001 Kindly do call on 0124-6656028 or 0124-6656011 (Shalini) for further details or any query.","location":"Gurgaon","experience":"1 - 5 Years"},{"date":"8 - Jul - 2019","skills":".Net Trained/ Freshers","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Atlas Systems Private Limited, No. 56/3, Bannerghatta Main Road, Unit-1B, FIrst Floor, Vakil Square, Gurappana Palya, Bengaluru, Karnataka - 560 029","phone":"080-42615071","profile":".Net Trainee/ Developers \nAtlas Systems Private Limited","description":"Permanent Job Opening for a Product Base for .Net Fresher Night shift (only) Candidate must have good knowledge in .Net Microsoft Certification - mandatory Walk-in Date: 8th July 2019 Timing 11:00 AM to 5:00 PM Interview Venue: Atlas Systems Private Limited No. 56/3, Bannerghatta Main Road, Unit-1B, FIrst Floor, Vakil Square, Gurappana Palya, Bengaluru, Karnataka - 560 029 Contact Person: Kalaivani","location":"Bangalore","experience":"0 - 1 Years"},{"date":"6 - Jul - 2019","skills":"Software Testing, Manual Testing","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Amazon Development Centre (India) Pvt. Limited, Ground Floor, Infinity tower, Tata Ramanujam IT City SEZ, Rajiv Gandhi Salai, Near Tidal Park, Old Mahabalipuram Road, Taramani, Chennai - 600 113","phone":"Not Provided","profile":"Software Testing Engineer \nAmazon Development Centre (India) Pvt. Limited","description":"Amazon is hiring Associate, Quality Services for Chennai location, this is a Full Time Role related to Software device testing. Please find the below Job Description for the same and criteria to apply for this role. You may appear for the interview if you find yourself matching the below criteria. Eligibility: BE/ B Tech or BCA/ MCA/ BSC/ MSC are only eligible to appear for the interviews Candidate pursuing Graduation or awaiting results will not be eligible to apply Freshers / candidates with less than one year of experience into Testing Candidates who have appeared for the same role in the last 6 months will not be eligible to reapply Immediate Joiners preferred Interview Date : 06 July 2019 Walk-in : 10:00 AM to 12:00 PM Building Address - Amazon Development Centre (India) Pvt. Limited Ground Floor, Infinity tower, Tata Ramanujam IT City SEZ, Rajiv Gandhi Salai, Near Tidal Park, Old Mahabalipuram Road, Taramani, Chennai - 600 113 Documents to Carry: 2 copies of Resume (Mandatory) 10th Standard Mark sheet (Mandatory) Photo Copies Pan Card (Mandatory) Photo Copies Provisional Certificate and/or Degree Certificate (Mandatory) Photo Copies 2019 Passouts Please carry all semester mark sheets along with the internet copy of your final semester results (Mandatory) Photo Copies","location":"Chennai","experience":"0 - 1 Years"},{"date":"5, 6, 8, 9, 10, 11, 12, 13, 15, 16, 17 - Jul - 2019","skills":"Java, Struts, Spring, or WebLogic JMS","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"AGS House, Plot No. EL 82 & 83, TTC Industrial Estate, MIDC Electronic Zone, Navi Mumbai - 400 705.","phone":"Not Provided","profile":".Net Developers \nAGS Transact Technologies Limited","description":"Urgent hiring for .Net Developer in AGS Transact Technologies Limited Job Location : Ghansoli Shift timings : day shift We are into payment industry and we are hiring candidates who have worked for projects related to banks Walk-in Date/ Time: 5th July - 17th July , 9 AM onwards Interview Venue: AGS House, Plot No. EL 82 & 83, TTC Industrial Estate, MIDC Electronic Zone, Navi Mumbai - 400 705. Contact person : Rasika HR Team","location":"Mumbai","experience":"1 - 4 Years"},{"date":"6 - Jul - 2019","skills":"Selenium Performance Testing Load Testing Functional Testing JMeter SQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Eurofins IT Solutions India Private Limited, Lemon Tree Hotels Limited Lemon Tree Premier, HITEC City Plot No. 2, Survey No. 64, HITEC City, Madhapur, Hyderabad - 500 081","phone":"Not Provided","profile":"Automation Test Engineer \nEurofins IT Solutions India Pvt. Limited","description":"TITLE: QA / Sr.QA Test Engineer Automation REPORTING TO: Manager WORKING LOCATION : Bangalore QUALIFICATIONS: BE/ MCA or any other equivalent degree 3 to 10 years of experience Experience in C#, Testing API/ Web Services, preferably REST Able to write scripts that deal with JSON parameterization Good understanding of SQL Experience in any automation tools: Selenium, Coded UI, UIA, etc. Strong preference to Selenium. Good to have: Exposure to Performance testing tools and processes LoadRunner, JMETER, Visual Studio Load Test, etc. Personal Qualities: Excellent analytical and problem solving skills Excellent verbal and written communication skills Successful teamwork experience Proven ability to transfer knowledge and stay aware of current trends and technical advancements Ability to articulate and present different points-of-views on various technologies Walk-in Date/ Time: 6th July 2019, 9 AM onwards Interview Venue: Eurofins IT Solutions India Private Limited Lemon Tree Hotels Limited Lemon Tree Premier, HITEC City Plot No. 2, Survey No. 64, HITEC City, Madhapur, Hyderabad - 500 081","location":"Hyderabad","experience":"0 - 10 Years"},{"date":"4, 5 - Jul - 2019","skills":"Software Testing, Automation Testing, Software Engineering, Manual Testing, Selenium","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Novac Technology Solutions, Office No: 275, Statesman One, R.K. Mutt Road, Mylapore, Chennai - 600 004 (Landmark: Near to Bata Showroom/ Mylapore Railway Station)","phone":"Not Provided","profile":"Software Testing Engineer \nNovac Technology Solutions","description":"Novac Technology Solution is currently hiring for Software Engineer Trainee (Certified Software Testing Engineers) for Chennai Location. Who can apply? Candidate with 70% above in 10th, 12th, UG / PG are eligible. Certification in Software Testing (Manual or Automation) is must. BE/ B Tech (CSE/ IT/ ECE) MCA, MSc (Computers) from 2018 & 2019 batch only BSc (CS) & BCA from 2018 & 2019 batch only Work Experience: Fresher Age criteria Not more than 26 Years Job Location: Chennai Selection Process: Online Aptitude Test Technical Online Round Technical F2F round Candidates who are interested, walk-in to the below mentioned venue directly with your updated CV. Walk-in Date: 4th & 5th July 2019 Time: 10 am to 3 pm Interview Venue: Novac Technology Solutions Office No: 275, Statesman One, R.K. Mutt Road, Mylapore, Chennai - 600 004 (Landmark: Near to Bata Showroom/ Mylapore Railway Station) *Note: If you have appeared for the same process in last 6 months you wont be eligible.","location":"Chennai","experience":"0 - 1 Years"},{"date":"4 - Jul - 2019","skills":"Software Testing, Manual Testing","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Amazon Development Centre (India) Private Limited, Ground Floor, Infinity tower, Tata Ramanujam IT City SEZ, Rajiv Gandhi Salai, Near Tidal Park, Old Mahabalipuram Road, Taramani, Chennai - 600 113","phone":"Not Provided","profile":"QA/ Testing Engineer \nAmazon Development Centre (India) Pvt. Limited","description":"Amazon is hiring Associate, Quality Services for Chennai location, this is a Full Time Role related to Software device testing. Please find the below Job Description for the same and criteria to apply for this role. You may appear for the interview if you find yourself matching the below criteria. Eligibility Cretria: BE/ B.Tech or BCA/ MCA/ BSc/ MSc are only eligible to appear for the interviews Candidate pursuing Graduation or awaiting results will not be eligible to apply Freshers / candidates with less than one year of experience into Testing Candidates who have appeared for the same role in the last 6 months will not be eligible to reapply Immediate Joiners preferred Walk-in Date : 04 July 2019 Time: 10 AM to 12 PM Interview Venue: Amazon Development Centre (India) Private Limited Ground Floor, Infinity tower, Tata Ramanujam IT City SEZ, Rajiv Gandhi Salai, Near Tidal Park, Old Mahabalipuram Road, Taramani, Chennai - 600 113 Documents to Carry: 2 Copies of Resume (Mandatory) 10th Standard Mark sheet (Mandatory) Photo Copies Pan Card (Mandatory) Photo Copies Provisional Certificate and/or Degree Certificate (Mandatory) Photo Copies 2019 Passouts Please carry all semester mark sheets along with the internet copy of your final semester results (Mandatory) Photo Copies","location":"Chennai","experience":"0 - 1 Years"},{"date":"6 - Jul - 2019","skills":"Core Java, Servlets, JSPs and J2EE","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Hetero Healthcare Limited, New Mark House, Plot No. 48-51 & 54-57 Survey# 78, 3rd Floor, Patrikanagar, Madhapur, Hyderabad - 500 081","phone":"Not Provided","profile":"Java Developers \nHetero Healthcare Limited","description":"Work Experience: 1 to 3 years of experience Design, develop, implement and maintain series of programs, subsystem, revision and enhancement of current system. Must be a self-starter and able to work with peer groups AJAX, jQuery knowledge is an advantage. Database knowledge is required. Experience with Web Services is an advantage. Strong Core Java, Servlets, JSPs and J2EE knowledge. JavaScript, HTML, CSS knowledge, Java frame work knowledge such as Spring, Hibernate Experience in integrating web services with mobile clients such as iPhone/iPad applications is optional. Walk-in Date/ Time: 6th July 2019, 10 AM Onwards Interview Venue: Hetero Healthcare Limited New Mark House, Plot No. 48-51 & 54-57 Survey# 78, 3rd Floor, Patrikanagar, Madhapur, Hyderabad - 500 081 Land Mark :Near Maxcure Hospital","location":"Hyderabad","experience":"1 - 3 Years"},{"date":"4, 5, 6, 8, 9, 10, 11, 12, 13, 14, 15 - Jul - 2019","skills":".Net Technologies, Trained Freshers","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Awapal Solutions Private Limited, E-38, First Floor, Sector-63, Noida - 201 301","phone":"9911886563","profile":"Manual Tester/ Client Support \nAwapal Solutions Private Limited","description":"Candidate should have 6 months to 1 year of relevant experience. Must be having good Knowledge of Manual testing, Automation Testing and Security testing. Must be comfortable in client support & software training to clients. Must have positive attitude Walk-in Date/ Time: 4th - 15th July, 11 AM onwards Interview Venue: Awapal Solutions Private Limited E-38, First Floor, Sector-63, Noida - 201 301","location":"Noida","experience":"0 - 1 Years"},{"date":"4, 5, 6, 8, 9, 10, 11, 12, 13 - Jul - 2019","skills":"Software Testing, Poduct Implementation, Bug fixing","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Talent Times Private Limited, 7-1-617/A, Third Floor, Unit # 305, Imperial Towers, Ameerpet, South India Shopping Mall Building Hyderabad, Telangana - 500 016","phone":"8367788879","profile":"Software Testing/ Support Engineer \nTalent Times Private Limited","description":"Qualification: Any Graduate/ B.E/ B.Tech/ MCA Work Experience: Fresher's / 0- 1 year Job Location: Hyderabad Key Responsibilities- Responsible for software testing, product implementation, Bug fixing, minor application issues and any adhoc requirements from client. Including PF, ESI, Insurance, Professional Tax Walk-in Date: 4th July - 31st August 2019 Time: 10 AM onwards Interview Venue: Talent Times Private Limited 7-1-617/A, Third Floor, Unit # 305, Imperial Towers, Ameerpet, South India Shopping Mall Building Hyderabad, Telangana - 500 016 Phone No. 8367788879","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"4, 5, 6 - Jul - 2019","skills":"Software Testing, Test Engineering, Developing Test Plans & Use cases","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Netedge Computing Solutions Pvt. Limited, NetEdge Tower C - 56/ 39, Sector - 62 Noida - 201 301","phone":"78388-37993","profile":"Senior Test Engineer/ Lead \nNetedge Computing Solutions Pvt. Limited","description":"The person must have experience in: Analyzing Business requirements & Developing Test Plans & Use cases Creating Test Cases for various Modules & Test Execution Reporting bugs with severity & priority according to customer Requirement & project. The person will be responsible for: Managing the Testing Team Assigning the work & ensuring the work gets completed as per project plan Interaction with Developers & Project Managers / Customers (if required) Development of Test Cases Walk-in Date/ Time: 2nd - 6th July 2019, 11 AM onwards Interview Venue: Netedge Computing Solutions Pvt. Limited NetEdge Tower C - 56/ 39, Sector - 62 Noida - 201 301","location":"Noida","experience":"3 - 5 Years"},{"date":"13 - Jul - 2019","skills":"Software Testng, Selenium, Java, Automation Testing, Rest, Test Cases, XML, Jenkins","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Carat Lane Trading Private Limited, No, 32, Khader Nawaz Khan Road, Thousand Lights West, Nungambakkam, Chennai, Tamil Nadu - 600 006","phone":"Not Provided","profile":"Software Engineer/ Tester \nCarat Lane Trading Private Limited","description":"Candidate should have minimum 3 to 5 years of experience in Web/ App Automation. Should have experience in writing automation test cases and implementing automation frameworks (Selenium, Appi, TestNG, RestAssured/ Httpclient). Must be proficient in Java and object oriented programming Good to have development experience Should have been part of automation solutions / test automation frameworks development Strong automation experience UI, API, Mobile app Experience with versioning systems (Subversion-SVN, Git / Git Hub) Experience with Continuous Integration (Jenkins , others ) Understanding of XML, JSON, REST, graphql etc and demonstrated experience with web services APIs Ability to learn new testing tools and approaches appropriate to the technologies being utilized Must be able to work independently and with minimum supervision Positive attitude towards taking new challenges. Good Problem solving and Analytical skills Walk-in Date/ Time: 13th July 2019, 9 AM onwards Interview Venue: Carat Lane Trading Private Limited No, 32, Khader Nawaz Khan Road, Thousand Lights West, Nungambakkam, Chennai, Tamil Nadu - 600 006","location":"Chennai","experience":"3 - 5 Years"},{"date":"4 - Jul - 2019","skills":"Software Testing, Selenium (testing tool), Test methodologies, Test Strategies","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Prometric Testing Private Limited, 2nd Floor, DLF Infinity Tower-A, DLF Phase 2, GURGAON, Haryana - 122 001","phone":"0124-4517145","profile":"Manual Testing Engineer \nPrometric Testing Private Limited","description":"Bachelors / Masters Degree in Computer Science, Engineering or a related subject Proven work experience in manual quality assurance. Strong knowledge of Manual Testing. Experience in writing clear, concise and comprehensive test plans and test cases Hands-on experience with manual testing. Experience with performance and/or security testing is a plus Excellent communication skills Good analytical skills Only Female candidates need to apply Job Hoppers please avoid to come for the interview Job Responsbility- Perform quality testing to ensure the exams operate as expected once delivered to the candidate Understand and analyze specification documents Executing tests as per the specification documents Review for any logical/documentation defects Reporting defects found during testing. Reporting and documentation. Co ordinate with all stake holders for successful completion of testing process Shift Timings: 9:00 am - 5:30 pm Saturdays & Sunday Fixed Weekly Off Interview Details: Date: 4-July-2019 (Thursday) Timings: 12:00 pm - 4:00 pm Venue: Prometric Testing Private Limited 2nd Floor, Infinity Tower A, DLF Cyber City, Gurgaon - 122002","location":"Gurgaon","experience":"2 - 3 Years"},{"date":"5 - Jul - 2019","skills":"Core Java, Selenium, Software Testing, Automation Testing, Software Engineering","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"CourseCube Private Limited, 57, 1st Floor, 7th Main, 17th Cross Road, NS Palya, BTM 2nd Stage, Bengaluru, Karnataka - 560 076","phone":"Not Provided","profile":"Trainee Engineer - Core Java/ QA \nAtmecs Technologies Private Limited","description":"Only B-Tech, M-Tech, MCA, MSc students from 2017/ 18/ 19 Passouts are eligible. Candidates should have scored 60% throughout in UG/ PG. Must have excellent communication skills. Must have undergone training or course in Core Java/ QA Should be comfortable with bond for 2 years. Job location will be in Hyderabad. Walk-in Date/ Time: 5th July 2019 from 9 AM onwards Interview Venue: CourseCube Private Limited 57, 1st Floor, 7th Main, 17th Cross Road, NS Palya, BTM 2nd Stage, Bengaluru, Karnataka - 560 076 Note: Interested students should report to venue by 8:30 AM only.","location":"Bangalore","experience":"0 - 1 Years"},{"date":"4, 5 - Jul - 2019","skills":"Software Testing/ Manual/ Automation/ Selenium Trained","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Changepond Technologies Private Limited, H-2, SIPCOT IT Park, Old Mahabalipuram Road, Siruseri, Chennai, Tamil Nadu - 603 103","phone":"044-47480037","profile":"Testing/ Quality Analyst Trainee \nChangepond Technologies Pvt. Limited","description":"Changepond Technologies Pvt. Limited, is hiring Quality Analyst Trainees for Chennai location Educational Qualification: BE/ B. Tech/ MCA Eligibility: Aggregate of 60% in 10th, 12th, UG & PG (if any) Year of Passing: 2016, 2017 & 2018 Should have completed a course in Testing from any training institute. Must have Good Communication Skills Required Skills: Testing/ Manual/ Automation/ Selenium Trained or Certified Freshers. Male candidates preferred Walk-in Date: 4th & 5th July 2019 (Thursday/ Friday) Time: 9:30 AM to 4:00 PM Interview Venue: Changepond Technologies Private Limited H-2, SIPCOT IT Park, Old Mahabalipuram Road, Siruseri, Chennai, Tamil Nadu - 603 103 Interview Rounds: 1. Combined Apps (Testing & Logical reasoning), 2. Technical face to face 3. HR Interview. Contact Person: Kalaiselvan, Human Resources","location":"Chennai","experience":"0 - 1 Years"},{"date":"3, 4, 5 - Jul - 2019","skills":"QA/ Manual Testing, Python, Android, iOS","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"SPA Systems Private Limited, 1st Floor, Mahalaxmi Plaza, Sector-3 Vaishali, Ghaziabad - 201 010","phone":"9599226764","profile":"QA Manual Testing/ Trainee \nSPA Systems Private Limited","description":"Candidate should have 6 Months of training in QA/ Manual Testing, Python, Android, iOS. Must have good knowledge of one or more programming languages relevant to the role Walk-in Date/ Time: 3rd - 5th July 2019, 10Am onwards Interview Venue: SPA Systems Private Limited 1st Floor, Mahalaxmi Plaza, Sector-3 Vaishali, Ghaziabad - 201 010 (Walking Distance from Vaishali Metro Station)","location":"Ghaziabad","experience":"0 - 1 Years"},{"date":"6 - Jul - 2019","skills":"Manual Testing, Software Testing","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"QualityKiosk Technologies Pvt. Limited, A Wing - 419, Rupa Solitaire Millennium Business Park, Mahape, Navi Mumbai - 400 709","phone":"Not Provided","profile":"Manual Tester (Freshers) \nQualityKiosk Technologies Pvt. Limited","description":"B.E /B.Tech /MCA/ B.Sc/ BCA/ M.Sc/ M.tech- Passing Year- 2017 or 2018 Percentage Criteria-Mandatory 2 academics 60%+ AND 1 academic 55%-60% Java knowledge added advantage Should be willing to work in Manual Testing Open to travel anywhere in Mumbai (Western, Central, Navi Mumbai) Good Analytical approach & Logical reasoning skills Good Communication Skills Education gap not more than 1 Year 2 year bond Walk-in Date: 6 July 2019- Saturday Time: 11:00 AM till 2:00 PM Interview Venue: QualityKiosk Technologies Pvt. Limited, A Wing - 419, Rupa Solitaire Millennium Business Park, Mahape, Navi Mumbai - 400 709, Lift Number 24 & 25 (Directions: next to Mastek, take a right from the main entrance) Contact Person: Mausimi Sardar/ Leena Bhor Note: Requested to be prepared on manual testing before coming for the interview Candidate location from Western Line & till Bhandup. No Navi Mumbai","location":"Mumbai","experience":"0 - 1 Years"},{"date":"11 - Jul - 2019","skills":"Java, Spring boot, Microservices, Spring Mvc, E-commerce, Migration","qualification":"B.E./B.Tech, MCA/PGDCA","address":"FTD India Private Limited, Block D Wing II, 5th Floor, Cyber Gateway Building, HitechCity, Madhapur, Hyderabad - 500 081","phone":"040-66030303","profile":"Java Developers \nFTD India Private Limited","description":"FTD India Private Limited, is seeking passionate software application developers to work with our highly talented team of young dedicated professionals who aim to give our customers a memorable shopping experience. Education: BE/ B.Tech/ MCA with 70% throughout academics from premier institutions Experience Range: 1 to 3 Years Place of Work: Hyderabad Duties & Responsibilities: Architect, build and deploy cloud platform microservices by using spring boot. Follow Agile Software Development methodology. Adhere to best practices in coding, documentation, test automation, and deployment. Ensure code quality with code design review participation and 100% pass rate on automated regression test suite. Knowledge, Skills & Abilities: Expert level Java skills: Can write non trivial distributed applications using Java libraries. Excellent understanding of Generics, concurrency, streams, java collections Strong understanding of Microservices and Cloud Native Application architectures. Excellent in development and deployment of MicroServices by using Spring Boot, Spring Cloud and API gateway (Netflix Zuul). Strong Core Spring and the Spring ecosystem (Spring Boot, Spring Cloud, Spring Data, Spring Security) skills. Experience with Test Driven Development (TDD ) and testing tools such as Junit and Mockito. Strong demonstrated usage of CI/CD pipelines and tools such as Jenkins, Git, SonarCube etc. Strong DB experience in Relational DB's and at least one NOSQL db, like for example MongoDB. Experience with Docker containers on Google Cloud Platform, powered by Kubernetes. Strong understanding of implementing and consuming Restful/HTTP protocols. Experience with Web frameworks like React, Redux and Webpack is a plus. Requires excellent spoken and written English skills. Date of Drive: 11th July, 2019 Time: 9:00 AM to 2:00 PM Interview Venue: FTD India Private Limited Block D Wing II, 5th Floor, Cyber Gateway Building, Hitech City, Madhapur, Hyderabad - 500 081 Interview Process: Candidates who clear Code Assessment test will be processed for further technical discussions. Note: Candidate who attended our interview process in last 6 months are not eligible for this drive.","location":"Hyderabad","experience":"1 - 3 Years"},{"date":"6 - Jul - 2019","skills":"Core Java/ J2EE 7.0 above, Hibernate, JPA, Spring 3.0+, Web Services","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Tech Mahindra Limited, A-20, Sector-60 (Near Sector 59 Metro Station) Noida (U.P)","phone":"Not Provided","profile":"Core Java Developer \nTech Mahindra Limited","description":"Person should have 3 to 8 year of professional software development experience in following skills: Strong understanding of Core Java/ J2EE 7.0 above Experience in frameworks Hibernate, JPA, Spring 3.0+, Experience in producing and consuming Web Services and Experience in using Application servers like WebLogic, JBOSS Working knowledge of RDBMS, SQL and PL/SQL. Experience in developing and consuming REST Web Services (Spring Boot). Experience in implementing J2EE Design Patterns. Must be willing to work in shifts from 1 PM to 10:30 PM IST Work Location - Noida/ Pune Shift- 1 PM to 10:30 PM Interview Day- 6th July 2019 Venue Details Tech Mahindra Limited A-20, Sector-60 (Near Sector 59 Metro Station) Noida (U.P) Contact Person- Nitesh Singh Reporting Time- 10 Am to 1 Pm","location":"Noida","experience":"3 - 8 Years"},{"date":"8, 9, 10, 11, 12 - Jul - 2019","skills":"Core Java, Spring framework (Core, Data, Security, Cloud)","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"CRIF Solutions Private Limited, Unit No. 01, Ground Level, Survey No. 114 & 115 Icon Towers, Baner Road, Pune - 411 045","phone":"Not Provided","profile":"Java Developers \nCRIF Solutions Private Limited","description":"Candidates who are meeting below criteria will only be considered: Should have 3 to 6 years of experience Drive will start from 11:00 to 6:00 PM Should match below skill sets also - 3 to 6 years Experience in Core Java - 2+ years of experience in Spring framework (Core, Data, Security, Cloud) - Spring Boot - Micro Services and Web Services - Angular 4/6 with 2+ years of experience - XML Parsing, XML Validation, Xslt, Xsd Walk-in Date/ Time: 8th - 12th July, 2019 10 AM onwards Interview Venue: CRIF Solutions Private Limited Unit No. 01, Ground Level, Survey No. 114 & 115 Icon Towers, Baner Road, Pune - 411 045 Tel: 020-67642952","location":"Pune","experience":"3 - 6 Years"},{"date":"6 - Jul - 2019","skills":"Java, Core Java, Servlets, Hibernate, Struts, Spring","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Full Creative Private Limited, Ascendas Tech Park, Pinnacle Building, Phase I, 4th Floor, CSIR Road, Taramani, Chennai.","phone":"Not Provided","profile":"Software Engineer - Java \nFULL Creative Private Limited","description":"Candidate should have excellent programming skills in Java Script & Core Java Experience in Amazon-AWS/ Google Cloud Design & implementation experience in SQL/NoSQL (MySQL, PostgreSQL, Google's Cloud Datastore, MongoDB) Knowledge of version control systems like GIT & TDD. Must have good communication skills Write well designed & efficient codes. Ensure the designs are in compliance with specifications Should build an interface with the customers, management & the team. Walk-in Date/ Time: 6th July 2019, 10 AM onwards Interview Venue: Full Creative Private Limited, Ascendas Tech Park, Pinnacle Building, Phase I, 4th Floor, CSIR Road, Taramani, Chennai.","location":"Chennai","experience":"1 - 4 Years"},{"date":"6 - Jul - 2019","skills":"Java, Spring, Hibernate with Microservices / Springboot / Angular /Unix /PL SQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Virtusa Consulting Services Pvt. Limited, Virtusa, Capital, 203, Financial District, Gachibowli, Hyderabad - 500 019","phone":"Not Provided","profile":"Java Developers/ Lead \nVirtusa Consulting Services Pvt. Limited","description":"Virtusa Consulting Services Pvt. Limited is hiring for Java - Senior Developers/ Lead for Hyderabad location. Work Experience: 4- 10 Years Job Location: Hyderabad Notice Period: Max 30 Days Person should have good hands on experience on Java, Spring, Hibernate with Microservices / Springboot / Angular /Unix /PL SQL. Should have good communication skills Walk-in Date/ Time: 6th July 2019 from 10 AM onwards Interview Venue: Virtusa Consulting Services Pvt. Limited Virtusa, Capital, 203, Financial District, Gachibowli, Hyderabad - 500 019 Land Mark - Near Wipro Circle, Opposite to CA. Recruiter Name 'Surabhi' need to be mentioned on the top of the resume","location":"Hyderabad","experience":"4 - 10 Years"},{"date":"6 - Jul - 2019","skills":"Java / J2EE including frameworks like Spring boot, Hibernate etc.","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Purpletalk India Private Limited, Plot No. 12th Floor, Watermark Technopark, Survey No. 9, Whitefields, Kondapur, Whitefields, Kondapur, Hyderabad, Telangana - 500 084","phone":"Not Provided","profile":"Java Developer \nPurpletalk India Private Limited","description":"The Java Developer will be responsible for writing code to build and support enterprise applications. This role will interface with the business and other developers to ensure business requirements are translated into detailed technical specifications. Essential Responsibilities: Design and build scalable REST APIs. develop, test, tune for performance and deploy web services. Work with product team to build innovative, robust, and easy-to-use features. Collaborate with the team, optimize and refactor the back-end architecture. Conduct code reviews to uphold high-quality code and standard. Own teams output drive sprint planning, prioritize tasks; Keep key stakeholders updated on progress, milestones and any potential slippages. Build systems that process big data in a distributed environment. Qualifications/ Requirements: Bachelors Degree in Computer Science, or related computer field. 3 years of minimum experience in Java software development. Strong in Java / J2EE including frameworks like Spring boot, Hibernate etc. Experience with micro services based architecture including building Good knowledge on SQL (MySQL / Oracle / SQL Server / Postgres), NoSQL (MangoDB / Cassandra), App server Knowledge (Tomcat/JBoss etc.), OSGi, REST Web Services Working / Usage experience of Docker or similar and Container Experience with Cloud computing in added advantage (AWS / Azure) Assist production support team with any system issues as they arise. Strong Debugging and Troubleshooting expertise. Strong communication skills (oral and written). Walk-in Date/ Time: 6th July 2019, 10 am Onwards Interview Venue: Purpletalk India Private Limited Plot No. 12th Floor, Watermark Technopark, Survey No. 9, Whitefields, Kondapur, Whitefields, Kondapur, Hyderabad, Telangana - 500 084","location":"Hyderabad","experience":"4 - 9 Years"},{"date":"6 - Jul - 2019","skills":"Java HTML XML CSS Javascript & JQuery Web Frameworks Spring SQL & PL SQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Equiniti India Private Limited, Block 10, 8th Floor, DLF IT Park, 1/124, Mt Poonamalle High Road, Ramapuram, Chennai, Tamil Nadu - 600 089","phone":"7358465533","profile":"Java Developers \nEquiniti India Private Limited","description":"BE/ ME/ MCA/ M.Sc. Computer Science with excellent track record. Should have good experience in developing application on Java Technology stack. Sound knowledge of OO design principles and patterns Work Experience : 2-4 Years Job Location : Chennai Should be a Team player with good interpersonal skills and a drive to take ownership of and responsibility for the tasks assigned to you. Ability to work calmly and methodically even under pressure. Good understanding of the Software Development Lifecycle. Should have appropriate level of expertise of using several of the following technologies: Java HTML XML CSS Javascript & JQuery Web Frameworks Spring SQL & PL SQL DB Server: MS SQL Resful services or web services mybatis/Hibernate IDEs NetBeans/Eclipse, MS SQL Studio JUnit / Integration and system testing Interested candidates can directly walk-in into the below mentioned address on 6th July 2019 (Saturday) : Equiniti India Private Limited Block 10, 8th Floor, DLF IT Park, 1/124, Mt Poonamalle High Road, Ramapuram, Chennai, Tamil Nadu - 600 089","location":"Chennai","experience":"2 - 4 Years"},{"date":"6 - Jul - 2019","skills":"API development, Core Java, J2EE technologies, JPA, Hibernate, Spring-boot, Spring framework","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Infogain India Private Limited, The Bristol, DLF Phase-1 Qutub Enclave, Near Sikanderpur Metro Station, Gurugra","phone":"Not Provided","profile":"Java Developer/ Lead \nInfogain India Private Limited","description":"Candidate should have 3 to 8 years of hands on experience in API development, Core Java, J2EE technologies, JPA, Hibernate, Spring-boot, Spring framework. Should be able to deliver in a fast paced Agile Environment. Must have strong analytical skills. Walk-in Date/ Time: 6th July 2019, 10 AM onwards Interview Venue: Infogain India Private Limited The Bristol, DLF Phase-1 Qutub Enclave, Near Sikanderpur Metro Station, Gurugram","location":"Gurgaon","experience":"3 - 8 Years"},{"date":"4, 5, 6 - Jul - 2019","skills":"Core Java, Advanced Java, Java Script, PhP, SQL, ASP .Net","qualification":"B.E./B.Tech, MCA/PGDCA","address":"9, Wadhwani Plaza, Nr. Vishal E-Square, Ambedkar Chowk, Old Pune Mumbai Highway, Pimpri, PUNE, Maharashtra - 411018,","phone":"7083614983","profile":"Software Developer (Java/ Php/ .Net) \nSynetica","description":"Candidates should have good knowledge of Core Java, Advanced Java, Java Script, PhP, SQL, ASP .Net Internet Tools : HTML5, CSS3, JavaScript, Ajax, WPF, JQuery, XML, Web Services, Must have excellent communication and collaboration skills. Walk-in Date/ Time: 4th July - 6th July , 9 AM onwards Interview Venue: Synetica, Shop No.9, Wadhwani Plaza, Near Vishal E-Square, Ambedkar Chowk, Old Pune-Mumbai Highway, Pimpri, Pune - 411 018 Mobile: 7083614983","location":"Pune","experience":"0 - 5 Years"},{"date":"6 - Jul - 2019","skills":"Core Java 7/8, Spring, Spring Boot & Micro Services, MVC Architecture","qualification":"B.E./B.Tech","address":"Capgemini India Private Limited, Campus 6B, Pritech Park, RMZ Ecospace, Bellandur BANGALORE - 37","phone":"Not Provided","profile":"Java Fullstack Developer \nCapgemini Technology Services India Limted","description":"We are hiring Java Developers with 4 to 8 years of experience for Bangalore location Person must be a Graduate in Computers or Engineering from a reputed university. Hands on experience in Core Java 7/8, Spring, Spring Boot & Micro-services. Experience in MVC Architecture, object oriented design and test driven development. Strong understanding regarding the usage of version management tools (such as Git, SVN), Jenkins, Maven, ANT and Test Driven development. Good to have knowledge Hibernate, HTML, Java Script, Angular JS. Must have strong SQL skills Good stakeholder management experience and communication skills Nice to have knowledge on Node JS. Walk-in Date/ Time: 6th July, 2019, 10 am onwards Interview Venue: Capgemini India Private Limited Campus 6B, Pritech Park, RMZ Ecospace, Bellandur BANGALORE - 37 Contact Person - Priyanka/ Pampa","location":"Bangalore","experience":"4 - 8 Years"},{"date":"5 - Jul - 2019","skills":"C/ C++ algorithms oops android Java","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Pride Hulkul, #116, 802, Lal Bagh Main Road, SGN Layout, Doddamavalli, Sudhama Nagar, Bengaluru, Karnataka - 560 027","phone":"Not Provided","profile":"Android Developers - Java \nOottru Technologies Private Limited","description":"We are looking for Fresh Android developers who are trained on Android and have good analytical and programming skills. Candidate should have completed minimum a Engineering degree in Computer Science or Information Science/ MCA/ M.Tech with Computer Science major disciplines. Should have passed out in 2017 or later. Must have a minimum score of 60% in their latest degree. Must know the basics of programming - C/ C++ Good in analytical and problem solving abilities Should know the basics of OOPS concepts Must have learnt Android app development: Should be good in algorithms Walk-in Date: 5 July 2019, Friday Timings: 10 AM to 12 PM Interview Venue: Oottru Technologies Private Limited Pride Hulkul, #116, 802, Lal Bagh Main Road, SGN Layout, Doddamavalli, Sudhama Nagar, Bengaluru, Karnataka - 560 027","location":"Bangalore","experience":"0 - 1 Years"},{"date":"6 - Jul - 2019","skills":"Core Java, Spring framework, SQL/ PL SQL Queries, Stored Procedure","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Ness Technologies (India) Pvt. Limited, No. 33, 6th Block, 17 H Main Road, Koramangala, Bangalore - 560 095. Landmark: Near Apollo Cradle Hospital","phone":"Not Provided","profile":"Senior Java Developer \nNess Technologies (India) Pvt. Limited","description":"Candidate must have excellent Core Java programming skills (6+ years) including multi-threading; Practical experience of using the Spring framework (Spring Boot, Spring Batch, Spring Controllers); Good in writing SQL/ PL SQL Queries, Stored Procedures, Functions, SQL tools. Understands synchronous vs asynchronous communication must have worked on Kafka/Rabbit MQ or some messaging system Walk-in Date/ Time: 6th July 2019 from 9 AM onwards Interview Venue: Ness Technologies (India) Pvt. Limited No. 33, 6th Block, 17 H Main Road, Koramangala, Bangalore - 560 095. Landmark: Near Apollo Cradle Hospital","location":"Bangalore","experience":"6 - 8 Years"},{"date":"4 - Jul - 2019","skills":"Background Verification, Non Voice/ Backend Operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Neeyamo Enerprise Solutions Pvt. Limited, NTPL SEZ (Blueridge) IT 05, 1st Floor, 154/06 Phase 1, Hinjewadi, Pune - 411 057","phone":"020-67934007","profile":"Service Delivery Executive \nNeeyamo Enerprise Solutions Pvt. Limited","description":"Designation: 1) Service Delivery Executive (BGV Executive) 2) Associate Team Lead (ATL) Job Responsbility: Connecting with various educational institutes &/or corporate offices for verification of credentials given by clients. Conducting research & analysis to validate authenticity of the aforementioned data. Has the ability to work under stringent deadlines and tough client conditions. The ATL will have a team of 2-4 Service Delivery Executives under him/her. Strictly freashers or 0-1 year experience allowed only for ATLs. Qualification: Any Graduate (Except Post Graduates like M.Tech, MBA, etc) Eligibility Criteria:- Must be comfortable working in night Comfortable with a voice profile Strong analytical & problem solving skills Can work under pressure Immediate Joining No standing arrears Levels of Interview:- Aptitude test Face to face interview HR Discussion Reporting time: 11:00 am Contact Person: Harpreet Note : Please bring 2 copies of your resume.","location":"Pune","experience":"0 - 2 Years"},{"date":"2, 3 - Jul - 2019","skills":"Recruitment, conducting interviews, HR/ Interviewing, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Prime Focus Technologies Limited, 2nd floor, Janardhan Towers, Bilekahalli, Bannerghatta Road, Bangalore - 560 076","phone":"Not Provided","profile":"HR Recruiter \nPrime Focus Technologies Ltd Limited","description":"We have an excellent opportunity for MBA (HR) freshers/ experienced candidates. Prime Focus Technologies (PFT) is hiring talented, passionate Recruiters for its Talent Acquisition team to assist in end-to-end recruitment process. Roles & Responsibilities: Assist to Design and implement overall recruiting strategy. Perform job and task analysis to document job requirements and objectives. Prepare recruitment materials and post jobs. Source and recruit candidates by using databases, social media etc Screen candidates resumes and job applications Prepare & maintain the documented recruiting reports. Conduct interviews. Job Location: Bangalore Walk-in Date/ Time: 2nd & 3rd July, 10 AM Onwards Venue Details: Prime Focus Technologies Limited 2nd floor, Janardhan Towers, Bilekahalli, Bannerghatta Road, Bangalore - 560 076 Landmark : After Brand Factory and Opposite Rainbow Children's Hospital","location":"Bangalore","experience":"0 - 3 Years"},{"date":"2, 3, 4, 5 - Jul - 2019","skills":"interviewing hiring recruitment hr ta social media events","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Busybees Logistics Solutions Pvt. Limited, (Xpressbees) B1 Building, 1st Floor, Cerebrum IT Park Kalyani nagar, Pune - 411 014.","phone":"Not Provided","profile":"HR Executive \nBusybees Logistics Solutions Pvt. Limited","description":"Roles & Responsibilities- Source potential candidates from various online channels (e.g. social media and professional platforms like StackOverflow and Behance) Craft recruiting emails to attract passive candidates Screen incoming resumes and application forms Interview candidates (via phone, video and in-person) Prepare and distribute assignments and numerical, language and logical reasoning tests Advertise job openings on companys careers page, social media, job boards and internally Provide shortlists of qualified candidates to hiring managers Send job offer emails and answer queries about compensation and benefits Monitor key HR metrics, including time-to-fill, time-to-hire and source of hire Participate in job fairs and host in-house recruitment events Collaborate with managers to identify future hiring needs Act as a consultant to new hires and help them onboard Walk-in Date/ Time: 2nd July - 5th July, 10 am Onwards Interview Venue: Busybees Logistics Solutions Pvt. Limited, (Xpressbees) B1 Building, 1st Floor, Cerebrum IT Park Kalyani nagar, Pune - 411 014.","location":"Pune","experience":"1 - 2 Years"},{"date":"3, 4, 5 - Jul - 2019","skills":"General Administration, MIS Preparation, Back Office Operations, Non Voice Process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Karvy Fintech Private Limited, Tower- B, Plot No. 31 & 32, Selenium building Gachibowli Road Financial District, Nanakramguda, Serilingampally Mandal, Hyderabad - 500 032","phone":"Not Provided","profile":"Back Office Executive \nKarvy Fintech Private Limited","description":"We are hiring both Freshers as well as experienced candidates. The ideal candidate should be preferably from a Finance background and should be knowing basics of excel. Educational Qualification - Graduate and Above Other Requirement : Knowledge on Financial Industry and hands on knowledge on Excel Job Responsbility- Meet performance standards of respective sub-function. Operational efficiency & effectiveness. Able deliver the output within agreed timelines Responsible for cheque stop and reissue. Responsible for responding customer mails within TAT. Responsible for MIS preparations, attending queries and client calls. Responsible for executing SIP transactions. Responsible for checking daily reports and maintaining the quality. Regular touch with all vendor / banks & AMC for daily activities Walk-in Date/ Time: 3rd July - 5th July from 11 AM onwards Interview Venue: Karvy Fintech Private Limited Tower- B, Plot No. 31 & 32, Selenium building Gachibowli Road Financial District, Nanakramguda, Serilingampally Mandal, Hyderabad - 500 032","location":"Hyderabad","experience":"0 - 5 Years"},{"date":"1, 2, 3 - Jul - 2019","skills":"PHP, HTML, CSS, Python or Node JS, SQL/ MySQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"MS Technology Private Limited, 2, Community Centre, IInd Floor, Basant Lok, Vasant Vihar, New Delhi - 110 057","phone":"011-41669396","profile":"Web Developer - Php \nMS Technology Private Limited","description":"Experience with PHP, HTML, CSS Familiarity with Wordpress and Angular Python or Node.js SQL/ MySQL database experience Bootstrap and or Material Design Comfortable jumping in to unfamiliar frameworks/codebases Experience using version control systems Web optimization Walk-in Date/ Time: 1st - 3rd July , 11 AM onwards Interview Venue: MS Technology Private Limited 2, Community Centre, IInd Floor, Basant Lok, Vasant Vihar, New Delhi - 110 057","location":"Delhi","experience":"2 - 3 Years"},{"date":"1, 2, 3, 4 - Jul - 2019","skills":"Software Testing, Automation Testing, Manual Testing, Script Writing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Ganapathi Raja Enclave, #75 /A, 1st and 2nd Floor, 100 Feet Road, 15th Cross Road, Sarakki, 1st Phase, J. P. Nagar, Bengaluru - 560 078","phone":"080-43358090","profile":"Automation Test Engineers \nFIME India","description":"WALK IN for Test Engineers to join our team! As a Test Engineer you will be responsible for planning and implementing of tests that prove the functional and non-functional requirements of the system.: Skills Required: Test and prove that the software meets major business requirements Good Scripting Knowledge in Java, Python, JavaScript, etc. 0-2 years experience in Manual and Automation Testing - functionality, regression, use case and system testing Experience in any test management tools Prove for scalability and performance of a software Ensuring the quality of the system as a whole Develop and automate tests for software validation Prepare defect reports and report test progress Excellent communication, analytical, problem solving skills and should be able to work independently Job Location: Bangalore Interested candidates please Walk-in with your updated resume from Tuesday to Thursday between 10.00 am to 4.00 pm to the below mentioned address or share your updated resume to Nirmala.madyangala@fime.com Ganapathi Raja Enclave, #75 /A, 1st and 2nd Floor, 100 Feet Road, 15th Cross Road, Sarakki, 1st Phase, J. P. Nagar, Bengaluru - 560 078 Near JP-Nagar Metro Railway Station Contact Person: Nirmala Contact Number: 080-43358090/ 9901650716","location":"Bangalore","experience":"0 - 2 Years"},{"date":"1, 2, 3, 4, 5, 8, 9, 10, 11, 12 - Jul - 2019","skills":".Net technologies/ C#, .NET, C#, Web API, Web Services","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Ganapathi Raja Enclave, # 75 /A, 1st and 2nd Floor, 100 Feet Road, 15th Cross Road, Sarakki, 1st Phase, J. P. Nagar, Bengaluru, Karnataka - 560 078","phone":"Not Mentioned","profile":".Net Developers \nSilicomp India Private Limited","description":"Person must be Graduate with at least fifteen (15) years of education in any discipline and 1 to 3 years of relevant experience on .Net technologies/ C#, .NET, C#, Web API, Web Services. Must be excellent in Hibernate & MongoDB. Functional analysis of existing software Job Location: Bangalore Interested candidates please Walk-in with your updated resume from Tuesday to Thursday between 10.00 am to 4.00 pm to the below mentioned address- Ganapathi Raja Enclave, # 75 /A, 1st and 2nd Floor, 100 Feet Road, 15th Cross Road, Sarakki, 1st Phase, J. P. Nagar, Bengaluru, Karnataka - 560 078 Near JP-Nagar Metro Railway Station/ Sindoora Convention Hall. Contact Person: Nirmala","location":"Bangalore","experience":"1 - 3 Years"},{"date":"2, 3, 4, 5 - Jul - 2019","skills":"C# with Oops Concepts, Dotnet, Javascript","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Janya IT Technologies Pvt. Limited, 301, Fortune Chambers, Silicon Valley, Image Garden Function Hall lane, Opp. HDFC Bank, Madhapur, Hyderabad - 500 081","phone":"Not Provided","profile":".Net Trained/ Freshers \nJanya IT Technologies Pvt. Limited","description":"We have a urgent opening for .Net trained candidates of 2017/2018 & 2019 pass outs of B.Tech/ BCA/ M.Tech/ MCA. Candidate must have good knowledge in C# with Oops Concepts, Dotnet, Javascript Walk-in Date: 2nd to 5th July 2019 Timings: 10 am to 12 pm Interview Venue: Janya IT Technologies Pvt. Limited 301, Fortune Chambers, Silicon Valley, Image Garden Function Hall lane, Opp. HDFC Bank, Madhapur, Hyderabad - 500 081","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"1, 2, 3, 4, 5 - Jul - 2019","skills":"Technical Support, IT Helpdesk, Customer Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Digital Minds Software Solutions Pvt. Limited, 2nd Floor, A-Wing, Softsol Building,, #4 Infocity, Beside Mindspace, Hi-tech City, Madhapur, Hyderabad, Telangana - 500 081","phone":"040 66885669","profile":"Technical Support Executives \nDigital Minds Software Solution Pvt. Limited","description":"Digital Minds Software Solution Pvt. Limited, is conducting Walk in Drive for Technical Support Executives. Educational Qualification: Any Degree Work Experience: 3 - 6 Years Job Location: Hyderabad Shift Timings (IST): Australian Voice Process (2:30 Am to 11:30 Am or 4:00 Am to 1:00 Pm or 6:00 Am to 03:00 Pm) (Shifts can change depending on Roster or Day light saving (Rotational) Required Skills- Excellent Comm Skills / Technical Skills / Trouble shooting skills / Customer Handling Skills Good in Active Directory, Basic Exchange Server or Office 365 administration, DHCP & DNS Excellent Knowledge of desktop OS Windows 8.1 / 10 and Trouble Shooting. Support hardware issues related to PC desktops, laptops, networking and Cisco phones. Able to work effectively with vendors and suppliers by logging tickets and service requests. Hands on experience with Ticketing tools is essentials(Jira / Alloy Navigator etc ) Knowledge of VMware(VSphere 5.5) and Citrix Xen Server. Knowledge of Cisco CUCM / Unity/ PLM - Not mandatory Knowledge on Backup (Veritas Backup, Veeam Backup, etc...) Walk-in Date: 1st to 5th July 2019 Timings: 10 AM -1 PM & 2 PM - 4 PM Interview Venue: Digital Minds Software Solution Private Limited 2nd Floor, A-Wing, Softsol Building,, #4 Infocity, Beside Mindspace,Hi-tech City, Madhapur, Hyderabad, Telangana - 500 081 Phone No: 9063610208/ 040 6688 5669 Note: Those attended the interview with in Six Months, Kindly Ignore. Salary:","location":"Hyderabad","experience":"3 - 6 Years"},{"date":"2 - Jul - 2019","skills":"Customer Support, Technical Support, Voice Process","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Cognizant Technology Solutions, No.F-2, Mahogany, Embassy Manyata Business Park, Rachenahalli, Hebbal Outer Ring Road, Bangalore.","phone":"Not Provided","profile":"Technical Support (Voice Process) \nCognizant Technology Solutions India Ltd","description":"We are looking for Candidates form Any International Voice process @SPE Bangalore Location. Degree : Any Graduate Work Experience: 1-4 Years Skill : Any International Voice Process Designation : Senior Process Executive (SPE) Package : As per company norms Shift : Flexible Industry : BPO / ITES Candidates must have 1 year of international BPO Voice experience Must have good English narrative skills. Willingness to work in International Voice process Good to have analytical, presentation & communication skill Excellent Communication & Listening skills. Willingness to work in any shift. Any international Voice Experience Preferably US Interview location & Work Location : Bangalore Walk-in Date: 2nd July 2019 (Tuesday) Time:10 am to 12:30 pm Venue Details : Cognizant Technology Solutions No.F-2, Mahogany, Embassy Manyata Business Park, Rachenahalli, Hebbal Outer Ring Road, Bangalore. Point of Contact : Meghana The following documents are mandatory and we request you to bring these for the discussion: Updated Resume Original Government ID proof Passport Size Photograph Aadhar Card Pan Card Voter ID / Passport Candidates with excellent communication are applicable for this process Candidates should be flexible to work in any shifts Education criteria Minimum 15 (10+2+3 / 4) years of education Candidates with standing arrears is not eligible, should be a graduate Interview will be a day long process Parking facility is not available inside Cognizant premises Referrals are invited NOTE : Mention Vijaya Shanthi/ Meghana HR at the top of the resume Please do not carry laptops/ cameras/ Pen drives or such other devices/ materials that are prohibited within premises or by law, as these will not be allowed due to security restrictions. We expect you to respect the security requirements of this Organization during your presence at the venue Candidates attended interview in the last 3 months is not eligible for this interview process","location":"Noida","experience":"1 - 4 Years"},{"date":"1, 2, 3, 4, 5 - Jul - 2019","skills":"Technical Support, Customer Service/ Troubleshooting","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Dell Technologies, Plot # 42, Hitec City Layout, Opposite to Deloitte, Madhapur, Hyderabad - 500 081","phone":"Not Provided","profile":"Technical Support Associate \nDell Technologies Private Limited","description":"Educational Qualifications : Any Graduates/ Post Graduates are eligible to apply with minimum 6 months to maximum 39 months of work experience. Any 10+2,10+3 with 12 months international calling experience /24 months domestic calling experience may apply (Mandatory). Candidates should be flexible to work in night shifts. Must have excellent communication skills. Should have good technical knowledge 2 way transport provided Role Overview Responsible for providing telephone/ email/ chat, online, social media and remote diagnostic technical support of desktops, portables, peripherals (e.g., printers, projectors, etc.) and software Role Responsibilities Responsible for providing diagnostic technical support related to installation, operation, configuration,performance, and usage of assigned products Diagnosis & resolving of the hardware problems and troubleshooting. Verifies warranty entitlement and determines appropriate action. Applies diagnostic techniques to identify problems, investigate causes and recommend solutions to correct failures. Documents problems in the support solution database for diagnostics and solution implementation. Provides basic remote deployment, maintenance and consulting services. Walk-in Date/ Time: 1st to 5th July 1 PM Onwards Interview Venue : Dell Technologies, Plot # 42, Hitec City Layout, Opposite to Deloitte, Madhapur, Hyderabad - 500 081 Timings : 1:00 PM to 3 :00 PM, Monday to Friday . Important Note : Please carry an updated CV, a valid Govt. ID proof & passport size photographs.","location":"Hyderabad","experience":"1 - 4 Years"},{"date":"6 - Jul - 2019","skills":"Technical Support, Technical Helpdesk, Service Desk, End User Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Microland Limited, Ground Floor, #6 & 7, Palm Court, Sector 14 20/4 Sukrali Chowk, Opp. Huda Park, Gurugram - 122 001","phone":"0124-6754030","profile":"Technical Support Engineer \nMicroland Limited","description":"Candidate should have with minimum 1 year of experience in technical helpdesk Experience in the domain of voice technical support/ helpdesk is must Knowledge in International service delivery standards such as ITIL, eSCM or CMMi Excellent verbal & written communication - Interpersonal skills Should be in a position to resolve L1 and L1.5 calls Should be able to drive customer experience via HD support Must be familiar with Microsoft technologies and windows environment Smartphone/Desktop and Laptop hardware/software troubleshooting. Office utility tools, antivirus tools, personal firewall tools or other business productivity tools troubleshooting Job Role: Service Desk & Helpdesk Engineers Experience Required: 0.6 - 5 year Salary:-1 Lpa to 3.20 Lpa Job Location:- Gurgaon, Manesar, Rohtak Job Responsbility: Single Point Of Contact (SPOC) assistance for End User Support To respond to the incidents /problem/change reported by Customer predominantly through Voice Interaction and also through email, chat and web portal Log Tickets in the call-logging tool on behalf of users Take necessary action viz resolves (over phone or remote) or assigns the issue to right assignment group Monitor the service desk tool for open and pending incidents Own the incident and provide end to end resolution for the ticket Interested candidates can turn up directly at Microland premises:- Walk-in Date:- 6th July 2019 Timing:-10:00 am to 5:00 pm max Venue:- Ground Floor, #6 & 7, Palm Court, Sector 14 20/4 Sukrali Chowk, Opp. Huda Park, Gurugram - 122 001 Interested candidate can call on 0124-6754030 or can send their CV at manishaSh@microland.com","location":"Gurgaon","experience":"1 - 5 Years"},{"date":"4 - Jul - 2019","skills":"Customer Care, Customer Support, Helpdesk","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"BT Global Business Services Pvt. Limited, Building No. 14, tower C, 8th Floor, Cyber city, Gurgaon","phone":"Not Specified","profile":"Support Associate/ Freshers \nBT Global Business Services Pvt. Limited","description":"Fresher Walk-in for BBA & BCOM (2017, 2018 & 2019) pass outs for the role of Associate CDS Operations at BT Global, Gurgaon Responsibilities: Managing the end customer deliverable (and in most cases speaking to the end customer) i.e. processing tasks including low complexity projects & order management, PO creation, commercial management in an efficient and accurate fashion for CDS customers. Analyse and interpret financial statistics and other data and produce relevant reports. Drive Date: 4th July 19 (Thursday) Timings: 10 AM to 12 Noon Drive Venue: BT Global Business Services Pvt. Limited Building No. 14, tower C, 8th Floor, Cyber city, Gurgaon","location":"Gurgaon","experience":"0 - 1 Years"},{"date":"1, 2, 3, 4, 5, 6 - Jul - 2019","skills":"Technical Support, Customer Support, Desktop Support","qualification":"Diploma, B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Aegis Customer Support Services Pvt. Limited, 41, St. Johns Road Bangalore - 560 042","phone":"6361675363","profile":"Technical Support Executive \nAegis Customer Support Services Pvt. Limited","description":"Qualification: Diploma OR Any Graduate are welcome Minimum 6 months experience (Any Experience) Good Communication Skills English & Hindi Mandatory Knowledge of installation of windows OS Job Responsbility- Troubleshooting and Installation of Laptop OS Troubleshooting and Installation of Printers, Scanners. Office and Business application client installation and configuration. Installation/ Configuration / archive of Outlook E-Mail client. Shift Timing: 9 Am to 6 Pm Working Hrs: 9hrs including 1hr break Week Off: Sunday is fixed off Walk-in Date/ Time: 1st - 6th July 2019, 9 AM Onwards Interview Venue: Aegis Customer Support Services Pvt. Limited, 41, St. Johns Road Bangalore - 560 042 Land Mark : Ulsoor Lake OR OLD Lakshmi Theater Building Contact Person : Bala - 6361275363","location":"Bangalore","experience":"0 - 5 Years"},{"date":"1, 2, 3 - Jul - 2019","skills":"Team Handling Team Leading Recruitment Management Employee Retention","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Plot No. A356/ 357, Road No.26, Wagle Industrial Estate, Thane (West), Maharashtra - 400 604.","phone":"7678009271","profile":"Recruitment Manager \nDealmoney Securities Private Limited","description":"Person should be ANy Graduate/ MBA (HR) with 3 to 5 years of experience in the below mentioned roles- Recruitment team handling Bulk hiring End to end recruitment Employee retention Employee engagement Handling end to end recruitments, selection, induction & orientation programme and joining Handling employee relations and employee engagement activities. Handling Recruitment team Walk-in Date/ Time: 1st July - 3rd July, 10 AM Onwards Venue Details- Plot No. A356/ 357, Road No.26, Wagle Industrial Estate, Thane (West), Maharashtra - 400 604. Recruiter Name: Rupali Devlekar Telephone: 7678009271","location":"Mumbai","experience":"3 - 5 Years"},{"date":"1, 2, 3, 4, 5, 6, 8, 9, 10, 11, 12, 13 - Jul - 2019","skills":"Payroll Process, Profession tax, Accounting, etc","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"TopSource Infotech Solutions Pvt. Limited, 3rd Floor ,Gamma 1, Giga Space, Viman Nagar, Opp. Maruti Showroom Pune - 411 014","phone":"Not Provided","profile":"India Payroll Executive \nTopSource Infotech Solutions Pvt. Limited","description":"We are looking for Payroll Professionals Freshers in TopSource. Any candidate who has 3 months of Payroll experience, who is good in communication and has desire to make a career in India Payroll is eligible to apply. Candidate must have 1 years of overall experience with at least last 3 months of Payroll experience. Preference would be given to candidates who have experience in worked for India payroll process. B.com background would be an added advantage Personal Characteristics Should have excellent written and spoken English. Motivated, self-starter individual with high level of integrity, intensity and activity with a can-do attitude. Disciplined process oriented work style Able to work effectively under pressure Ability to work equally well either independently or as part of a team Experience: 0.3 - 3 year Job Location : Pune Salary : As per Market standards Please don't call us if Interested then please Walk-In with updated resume from 1st July to 24th July 2019 between 12.30 PM and 7:30 PM) at the address mentioned below- TopSource Infotech Solutions Pvt. Ltd 3rd Floor ,Gamma 1, Giga Space, Viman Nagar, Opp. Maruti Showroom Pune - 411 014 Contact Person : Pawan Kumar Email id :pawan.burman@topsource.co.in *Kindly carry a copy of your updated resume when you visit us Note: 1) please ignore this email if you have already attended interview in TopSource in last 90 days. 2) Please ignore this email if the job advertisement mentioned above is not relevant to your profile. 3) Outstation candidates need to confirm their schedule by mailing at pawan.burman@topsource.co.in before coming for interview. We dont re-imburse travelling expenses)","location":"Pune","experience":"1 - 4 Years"},{"date":"2, 3 - Jul - 2019","skills":"Recruitment Screening Telephonic Interviewing Sourcing HR","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"SpiceJet Limited, Plot No. 319, Udhyog Vihar, Phase-4 Gurugram, Haryana - 122 016","phone":"Not Provided","profile":"Senior Executive - HR (Only Male) \nSpiceJet Limited","description":"We are conducting walk-in interviews for the position of Senior Executive - HR (only Male) in our in Human Resources Department on 2nd & 3rd July' 2019 (Tuesday & Wednesday) from 10:00 am to 12:00 Noon Designation : Senior Executive - HR Department : Human Resources Location : Gurgaon Educational Qualification : MBA/ PGDM - HR Work Experience: 3 - 5 Years Required Skills sets: * Willing to travel * Excellent Communication both written & Verbal * Having knowledge of Excel & power-point presentation * Out of the box thinking Job Responsibilities: * Sourcing /Screening - Resumes/ Profiles * End to End Recruitment * Taking Telephonic round of interviews/Face to Face interviews * Coordinating with candidates & interview panelist for the final rounds * Posting job vacancy on job portals * Documentation * Daily MIS * Daily assigned work Kindly report at the below mentioned address and other details and do carry a copy of your updated resume. Date : 2nd & 3rd July '19 (Tuesday & Wednesday) Timing: 10 am till 12 noon Interview Venue: Plot No. 319, Udhyog Vihar, Phase-4 Gurugram, Haryana - 122 016 Dress Code: Formals","location":"Gurgaon","experience":"3 - 5 Years"},{"date":"1 - Jul - 2019","skills":"Human Resource Management, Employee Engagement, Employee Relations","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Fareportal India Private Limited, 199, Sainik Nagar, Clover Park, Viman Nagar, Pune - 411 014","phone":"7020420840","profile":"HR Executive/ Freshers \nFareportal India Private Limited","description":"We are looking for dynamic human resources professionals for a HR- Business Partner role. Educational Qualification: MBA - HRM Excellent communication skills required Comfortable with 24/7 shifts Location - Pune (Viman Nagar) Should be having good interpersonal skills. Candidate should be having basic knowledge and clarity of HR concepts. Joining - Immediate joiners Walk-in Date/ Time: 1st July 2019 from 1 PM onwards Interview Venue: Fareportal India Private Limited 199, Sainik Nagar, Clover Park, Viman Nagar, Pune - 411 014 Contact Person - Vickram P (7020420840)","location":"Pune","experience":"0 - 1 Years"},{"date":"1, 2 - Jul - 2019","skills":"NSE, General Insurance, Branch Management, Sales Operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Chola MS General Insurance Company Ltd., #No. 302, 3rd Floor, SR Arcade, Parklane, Secunderabad - 500 003.","phone":"9866907114","profile":"Assistant Branch Manager \nCholamandalam MS General Insurance Company Limited","description":"CHOLA MS General Insurance is hiring Asst. Branch Managers Qualification : Any Graduate Age : 25 Years Location : At your home town Male candidates only need to apply Salary : 3LPA Walk-in Date : 1st & 2nd July 2019 Time : 10am to 11 am & 2pm to 3pm Interview Venue: Chola MS General Insurance Company Ltd., #No. 302, 3rd Floor, SR Arcade, Parklane, Secunderabad - 500 003. Contact: HR - Dheeraj (9866907114)","location":"Hyderabad","experience":"0 - 3 Years"},{"date":"29 - Jun - 2019","skills":"Core Java, JavaScript, JSP, Servlets","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Ebix Software India Private Limited, S. No. 303/2/2, Bavdhan (BK) Mumbai Bangalore Highway (Bypass) PUNE - 411 021","phone":"020-22952520","profile":"Java Developers \nEbix Software India Private Limited","description":"We are conducting a drive this weekend (29th June 2019) for Java Developers Person should have strong work experience on Core Java, JavaScript, JSP, Servlets Writing Program Specifications Document. Code components and peer reviews. Prepare unit and Integration Test Scripts. Review of Test Cases and codes. Version Management as per the project requirements. Configuration Controller report creation. Domain knowledge in LOS /LMS knowledge is an advantage Interested candidates needs to share their profiles at sanghmitra.mistry@ebixcash.com Post which we will be sharing the interview confirmation and time slots for attending the interview.","location":"Pune","experience":"1 - 6 Years"},{"date":"29 - Jun - 2019","skills":"JAVA/ C/ C++/ .NET/ OOPS Concept","qualification":"B.E./B.Tech","address":"Trident Information Systems Pvt. Limited, M-31 A, 'M'-Block Market, Greater Kailash Part -II, New Delhi - 110 048","phone":"011 2921 9927","profile":"IT Freshers (C/ C++, Java) \nTrident Information Systems Pvt. Limited","description":"Eligibility Cretria: BE/ B.Tech (IT/CS) - 2018-2019 Pass-outs Good knolwdge of JAVA/ C/ C++/ .NET/ OOPS Concept Should have good communication & presentation skills Throughout 65% in academics (Xth Standard till highest degree) Open to travel Can join immediately Candidate will be responsible for coding, testing, implementation and maintenance of ERP system built on Microsoft Dynamics Navision/ Axapta. Profile is into software development & customization not into IT Support The interview process would be as follows: 1) GD round (Communication round) 2) Written Test based on the technical skills required (C,C++ ,Java)_Offline 3) Technical Interview with the panel(For those shortlisted in the written test) 4) Managerial round (At our corporate office) Designation: Associate Technical Consultant Ctc Offered: 1.8 LPA 3LPA (Based on the Technical knowledge & interview process & feedback)","location":"Delhi","experience":"0 - 1 Years"},{"date":"29 - Jun - 2019","skills":"Java/ J2EE, SOA Webservices (SOAP and REST), ESBs, Open Source","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Wipro Limited, A-23, Sarita Vihar, Mohan Co-operative Industrial Area, Mathura Road, New Delhi - 110 044 (Nearest Metro Station-Sarita Vihar) HR SPOC - Vikas","phone":"Not Provided","profile":"Java Developers \nWipro Limited","description":"Wipro Limited is Hiring for Java Developer/ Senior Developer on 29th June at Sarita Vihar Work Experience: 2 to 8 Years Production implementation level experience in large enterprise applications using Java/ J2EE, SOA Webservices (SOAP and REST), ESBs, Open Source products, and strong working knowledge of SOA, SOAP, WSDL, Service Orchestration, Spring MVC and JSON. Knowledge of Web Technologies such as Html 5, CSS 3, jQuery, Spring MVVC and WebServices (SOAP/REST). Knowledge of technology areas of Messaging, Transaction Management, Spring MVC, Hibernate, DAO, etc. Strong command on Java/J2EE concepts and current industry trends. Experience in implementing Webservices Security using WS-Security, SAML, Kerberos and integrating with Identity provides, LDAP and ADFS. Strong knowledge on design and integration patterns specially in applications involving Portals/SSO, legacy applications, B2B Applications, external partners using ESB. Strong understanding of Object Oriented design methodologies and design patterns. Must have excellent written and verbal communication skills. Experience with Agile development methodology. Experience with Cloud Computing. Walk-in Date - 29th June 2019 (Saturday) Time - 10 am to 4 pm Interview Venue - Wipro Limited, A-23, Sarita Vihar, Mohan Co-operative Industrial Area, Mathura Road, New Delhi - 110 044 (Nearest Metro Station-Sarita Vihar) HR SPOC - Vikas Please carry updated resumes along with ID proof. And no laptop/ media/USB etc. allowed in the office premise.","location":"Delhi","experience":"2 - 8 Years"},{"date":"1 - Jul - 2019","skills":"HR Operations, HR Generalist Activities","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"DXC Technology India Private Limited, RGA Techpark, Sarjapur Main Road, Carmelaram, Hadosiddapura, Chikkakannalli, Bengaluru - 560 035","phone":"Not Provided","profile":"HR/ Backend Operations Executive \nDXC Technology India Private Limited","description":"Candidate should be Any Garduate/ Post Graduate (MBA HR) with 1 to 3 years of experience in HR Operations, HR Generalist Activities. Must have good knowledge in Excel & Excellent Communication Skills. Good To Have: Experience in using HRIS or HR PORTAL Job Responsbility: Backend HR Operations (US shift) Payment Processing and Car lease Program Walk-in Date/ Time: 1st July 2019 from 11 AM Onwards Interview Venue: DXC Technology India Private Limited RGA Techpark, Sarjapur Main Road, Carmelaram, Hadosiddapura, Chikkakannalli, Bengaluru - 560 035","location":"Bangalore","experience":"1 - 3 Years"},{"date":"29 - Jun - 2019","skills":"J2EE, Core Java ,Collection and Multithreading, Hibernate, Spring or Spring boot","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Panamax Infotech Limited, Panamax House-1, Next to Dinner Bell -2 / ICICI Bank , Subhas Chowk, Memnagar, Ahmedabad - 380 052","phone":"Not Provided","profile":"Software Engineer - Java \nPanamax Infotech Limited","description":"We have arranged a Walk-in Interview for Java Developers on June 29 from 10:00 AM to 4 PM Educational Qualification: BE or MCA or MSc(IT) At least 1 years of software development experience in J2EE Experience with Core Java ,Collection and Multithreading Experience with Frameworks: Hibernate, Spring or Spring boot Experience in working with Webservices (SOAP, Restful) Database skills (at least one): MySQL or Oracle Java application servers: Tomcat Version control system : SVN Strong Unit Test writing skills Preferred Area of Expertise: Core JAVA, Spring or spring boot, Hibernate Functional Competencies: Carry out assigned code implementation Active participation product design and testing Should be able to lead module if assigned General Competencies/Soft Skills: - Good at technical communication with team mates (written and oral) KEY RESPONSIBILITY AREAS: Excellent at carrying out R&Ds independently Able to work in cross technologies team environments Able to contribute in technical discussions Able to implement and support enterprise-scale applications Walk-in Date/ Time: 29th June from 9 AM onwards Interview Venue: Panamax Infotech Limited, Panamax House-1, Next to Dinner Bell -2 / ICICI Bank , Subhas Chowk, Memnagar, Ahmedabad - 380 052","location":"Ahmedabad","experience":"1 - 5 Years"},{"date":"29 - Jun - 2019","skills":"Administration, Office Management, Front Office and Vendor Management","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Virtusa Consulting Services Pvt. Limited, Foundation Building, No. 34 IT Highway, Rajiv Gandhi Salai , Navallur, Chennai - 600 130","phone":"Not Provided","profile":"Core Java Developer \nVirtusa Consulting Services Pvt. Limited","description":"We are looking out for strong Core Java Developers who is good working with Struts. Hands on experience on Struts project. Knowledge on SDLC Work Experience: 2-5 Years Candidates who are interested in the above skills below drop in to our venue on time- Walk-in Date: 29th June 2019 Time: 10 AM - 12 Noon Interview Venue- Virtusa Consulting Services Pvt. Limited Foundation Building, No. 34 IT Highway, Rajiv Gandhi Salai , Navallur, Chennai - 600 130","location":"Chennai","experience":"2 - 5 Years"},{"date":"29 - Jun - 2019","skills":"Core Java, Data Structures, Multithreading, Concurrency, Collections, OOAD, Design Patterns","qualification":"B.E./B.Tech, MCA/PGDCA","address":"QuEST Global Engineering Services Pvt. Limited, 2nd Floor, Primrose 7B, Embassy Tech Village, Near New Horizon College, Devarabisanahalli, Outer Ring Road, Bellandur, Bengaluru - 560 103.","phone":"Not Provided","profile":"Core Java Developer \nQuEST Global Engineering Services Pvt. Limited","description":"Candidate should have 3+ years of experience in the design and development Java applications. Experience in REST Services and Spring framework. Experience in developing and deploying micro services. Extensive experience in Unit Testing and BDD. Must have Core Java with knowledge of Data Structures, Multithreading, Concurrency, Collections, OOAD, Design Patterns, SOA. Working experience with JavaScript/ JavaScript frameworks Job Responsibility: Responsible for programming a component, feature and or feature set. Works independently and contributes to the immediate team and work with Architects, PO and other team leads. Contributes to design discussions. Job Location: Bangalore Experience : 3 - 8 Years We are pleased to invite you for an Interview of the opportunities for Core Java developers. Please refer to the interview details below: Walk-in Date: 29 June, 2019 Time: 9.30 AM 2.00 PM Interview Venue: QuEST Global Engineering Services Pvt. Limited 2nd Floor, Primrose 7B, Embassy Tech Village, Near New Horizon College, Devarabisanahalli, Outer Ring Road, Bellandur, Bengaluru - 560 103. If you are interested for the said opportunity, kindly walk-in for an interview with your updated resume.","location":"Bangalore","experience":"3 - 8 Years"},{"date":"1 - Jul - 2019","skills":"J2Ee, Struts, Hibernate, Core Java, Servlets, PLSQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Godrej Infotech Limited, Plant 19A, 2nd floor, Pirojshanagar, Vikhroli (West), Mumbai","phone":"022-67966193","profile":"Java Developer \nGodrej Infotech Limited","description":"Qualification Required: Any Graduation (Full time; No Diploma) Experience Required:- Within 2-5 years (Not less than 2 years and not 5 or more than 5 years) Requisite Experience: 1) Need to have good experience in PLSQL/SQL 2) Need to have good experience on JSP 3) Need to have good experience in core Java Primary Skills- 1)Must have strong background / knowledge in Core Java. JSP/Servlet, Maven, Spring Framework. 2)MS SQl database design and writing SQL queries & stored procedures. 3)Sound knowledge in HTML, CSS, AJAX and JavaScript. 4)Should be capable of doing Code Review and testing for team members. 5)Should have sound knowledge of Software Development 6)Life cycle and should be able to lead a module with 3-4 team members. Secondary Skills:- 1) Should know deployment process on application servers like Apache Tomcat/JBOSS 6 2) Have Good knowledge of Angular 2 or above. Key result areas: 1) Requirement Analysis and Design 2) Preparation of Technical specification documents Software development as per technical specifications 3) Software Testing to ensure defect-free software Following ISO procedures Walk-in details:- Date: 1st July 2019 (Monday) Timings: 2:00 pm to 4.00 pm Venue: Godrej Infotech Limited Plant 19A, 2nd floor, Pirojshanagar, Vikhroli (West), Mumbai Entry from: Gate no. 4 , Godrej Petroleum, LBS Road Entry from: ( by Vehicle ) From Gate No. 7 - Eastern Express Highway Vikhroli ( East ) or Gate No. 1 - Opposite R city Mall. Vikhroli ( West )","location":"Mumbai","experience":"2 - 4 Years"},{"date":"29 - Jun - 2019","skills":"Core Java, Data Structures and Algorithms, Collections","qualification":"B.E./B.Tech, MCA/PGDCA","address":"2ND FLOOR, NO.139/26, SOLITAIRE, AMARJYOTHI LAYOUT, KORAMANGALA INTERMEDIATE RING ROAD BANGALORE - 560 071","phone":"Not Provided","profile":"Core Java Developer \nSaggezza India Private Limited","description":"Were looking for a talented Java Developer to work with our clients in Bangalore. Candidate should have 3 to 11 years of application development experience in Core Java Programming. Experience with Data Structures and Algorithms, Collections, Every project will be different, but youll always be in charge of: Designing and developing solutions to our clients problems using Java frameworks. Partnering effectively with clients in-house project teams. Managing the projects entire lifecycle, from beginning to end. Walk-in Date/ Time: 29th June 2019, 11 AM Onwards VENUE: 2ND FLOOR, NO.139/26, SOLITAIRE, AMARJYOTHI LAYOUT, KORAMANGALA INTERMEDIATE RING ROAD BANGALORE - 560 071 Note: Candidates attending after 2 PM will be sent back.","location":"Bangalore","experience":"3 - 11 Years"},{"date":"1, 2, 3, 4, 5 - Jul - 2019","skills":"Backend, Back Office, Non Voice Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Provana India Private Limited, A-32, Sector- 2, Noida","phone":"Not Provided","profile":"Back End Associate \nProvana India Private Limited","description":"Any Graduate with good analytical ability & time management skills; Good typing skills with a typing speed of 35 WPM with 97% accuracy Should possess good English communication skills Ability to follow instructions and clearly defined objectives; Ability to proactively identify process improvements; Fast learner (on both process and systems) Should be comfortable for rotational shift. Cab & Meal facility in night shift Both Fresher/ Experienced can apply Interested candidates can directly walk-in from 1st - 5th July at the below address- Provana India Private Limited A-32, Sector- 2, Noida Nearest Metro Station - Noida Sec 15 Contact Person : Nida Khan","location":"Noida","experience":"0 - 2 Years"},{"date":"29 - Jun - 2019","skills":"Java/ J2EE, Core Java, Spring/ Hibernate, MySQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Tech Mahindra Limited, ITC 4, Ground Floor A Wing, Site No: 44(P) 46(P), KIADB Industrial Area, Electronic City, Phase -2 Bangalore - 560 100","phone":"Not Provided","profile":"Java/ J2EE Developer \nTech Mahindra Limited","description":"Tech Mahindra Limited is having weekend drive for Java/ Full-stack Developers at Bangalore Looking for Java/ J2EE Developer's who are good in Core Java in any of the framework (Spring/ Hibernate), Experience in writing SQL queries of MySQL DB and scripting language experience in Unix Shell Scripting/ PERL Java Full stack developer is preferred Title: Java Full-stack Developers Work Experience: 4 to 9 Years Immediate Joiner/ Notice period should not exceed four weeks Drive Date: 29th June 2019 (Saturday) Time: 9 AM onwards Venue Details: Tech Mahindra Limited, ITC 4, Ground Floor A Wing, Site No: 44(P) 46(P), KIADB Industrial Area, Electronic City, Phase -2 Bangalore - 560 100 Contact Person: Shreya Bhaskar","location":"Bangalore","experience":"4 - 9 Years"},{"date":"29 - Jun - 2019","skills":"Core Java, Javascript, Maven, Jboss, J2EE","qualification":"B.E./B.Tech","address":"ASG World Wide Private Limited, 2-D, iLabs Centre, Plot # 18, Software Unit Layout, Madhapur, Hyderabad - 500 081","phone":"Not Provided","profile":"Senior Java Developer \nASG World Wide Private Limited","description":"Candidate should have 6+ years of experience in Core Java and J2EE technologies Advanced knowledge of application, data and infrastructure architecture disciplines Working proficiency in developmental toolsets Ability to collaborate with high-performing teams and individuals both in person and virtually Ability to communicate effectively with and to influence team members and external groups Ability to present formal and informal presentations in various settings; one-on-one, small and large groups, with peers, and senior management Walk-in Date/ Time: 29th June, 2019 from 9 AM onwards Interview Venue: ASG World Wide Private Limited, 2-D, iLabs Centre, Plot # 18, Software Unit Layout, Madhapur, Hyderabad - 500 081","location":"Hyderabad","experience":"6 - 9 Years"},{"date":"29 - Jun - 2019","skills":"ack Office, Branch Operations, Domestic BPO, Inbound Process, Customer Service","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Nimbus Adcom Private Limited, 13, F3, 2nd Floor, 2nd Main Road, Nehru Nagar, Adyar, Chennai - 600 020","phone":"6200288246","profile":"Back Office Executive \nNimbus Adcom Private Limited","description":"We are Hiring Big! for Multiple position at Nimbus Adcom Private Limited Candidate should be Any Graduate with 0 to 5 years of experience in Back Office, Branch Operations, Domestic BPO, Inbound Process, Customer Service, Outbound, Telemarketing, etc. Must have excellent communication skills Salary: INR 1,00,000 - 1,50,000 PA No. of Openings: 30 Walk-in Date/ Time: 29th June 2019, 10 AM Onwards Interview Venue: Nimbus Adcom Private Limited 13, F3, 2nd Floor, 2nd Main Road, Nehru Nagar, Adyar, Chennai - 600 020 Call HR-6200288246","location":"Chennai","experience":"0 - 5 Years"},{"date":"29 - Jun - 2019","skills":"Manual Testing, Test Engineering, Test Scripts, Software Testing, Automation Testing, Writing test cases","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"PLOT NO 6 DEVELOPED PLOTS ELECTRICAL, AND ELECTRONIC KHIVRAJ MOTORS OFFICE, COMPLEX RAJEEV GANDHI IT HIGHWAY PERUNGUDI Chennai Tamil Nadu - 600 096","phone":"43201092","profile":"Software Testing Engineer \nAigilx Health Technologies Private Limited","description":"Candidate should have 0 to 2 years of experience in Manual Testing, Test Engineering, Test Scripts, Software Testing, Automation Testing, Writing test cases, Test case creation & Testing concepts. Roles & Responsibilities: Responsible for understanding API functionality, work flow, writing Testcases(TCs) using Test Framework, Reviewing the TCs and execution of TCs for the application made in Angular 5, Node.JS Responsible for Test Automation of web pages, web services or servers which involves automating web user scenarios/TCs, Writing Test Scripts for regression/stress test, TCs review and TCs execution Initiative to propose ideas / improvements in tools/process Walk-in Date/ Time: 29th June 2019, 10 AM Onwards Interview Venue: PLOT NO 6 DEVELOPED PLOTS ELECTRICAL, AND ELECTRONIC KHIVRAJ MOTORS OFFICE, COMPLEX RAJEEV GANDHI IT HIGHWAY PERUNGUDI Chennai Tamil Nadu - 600 096","location":"Chennai","experience":"0 - 2 Years"},{"date":"29, 30 - Jun - 2019","skills":"C# .NET, ASP .NET framework, SQL Server MVC, WCF","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Techwave Consulting Inc., Level 4, Buildig No. H6 Phoenix Avance Business Hub, Hitech City, Behind Dell Campus, Hyderabad - 500 081","phone":"040-66583513","profile":"Senior .Net Developer/ Lead \nTechwave Consulting India Pvt. Limited","description":"Role : Sr .Net Developer / Lead (5 positions) Experience : 8-12 years Job Location : Hyderabad Duration : Permanent Person should have 8 to 12 years of proven experience as a C# .NET Developer .Should have atleast 2 years of experience working as a lead. Extensive experience with the ASP .NET framework, SQL Server MVC, WCF Strong knowledge on .NET framework, HTML5/CSS3, jquery, JavaScript,LINQ Experience on design and implementation of API (Web API, REST, JSON, etc.) Excellent troubleshooting and communication skills Understanding of Agile methodologies is a plus Experience using Team Foundation Server (TFS) Experience in developing web applications on Microsoft Azure Cloud is a plus Walk-in Date/ Time: 29th - 30th June from 9 AM onwards Interview Venue: Techwave Consulting Inc., Level 4, Buildig No. H6 Phoenix Avance Business Hub, Hitech City, Behind Dell Campus, Hyderabad - 500 081","location":"Gurgaon","experience":"8 - 12 Years"},{"date":"29 - Jun - 2019","skills":"C# .NET, ASP .NET, MVC, Web API, LINQ, ADO.NET / EF","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Hexaware Technologies Limited, SEZ, Plot No. 19, Rajiv Gandhi Infotech Park Phase III, MIDC, Hinjewadi, Pune - 411057","phone":"Not Provided","profile":".Net Professionals \nHexaware Technologies Limited","description":"Minimum 4 years working experience in jQuery with experience in C# .NET, ASP .NET, MVC, Web API, LINQ, ADO.NET / EF. Exposure to WCF / Angular 4 is a Plus Exposure to client and server side best practices Experienced on Agile/Scrum development Good knowledge on OOPS and Design patterns Good Communication skills. Technology: Asp .Net Experience: 4 - 12 Years Skills: MVC, WebAPI Notice Period: Immediate to 90 days Interested candidates please walk-in to the below venue- Interview date: 29th June 2019 Time: 9am to 2pm Venue: Hexaware Technologies Limited SEZ, Plot No. 19, Rajiv Gandhi Infotech Park Phase III, MIDC, Hinjewadi, Pune - 411057 Contact Person: Prethiba T","location":"Pune","experience":"4 - 12 Years"}]}