{"Walkins":[{"date":"4, 5 - Jul - 2019","skills":"Software Testing, Automation Testing, Software Engineering, Manual Testing, Selenium","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Novac Technology Solutions, Office No: 275, Statesman One, R.K. Mutt Road, Mylapore, Chennai - 600 004 (Landmark: Near to Bata Showroom/ Mylapore Railway Station)","phone":"Not Provided","profile":"Software Testing Engineer \nNovac Technology Solutions","description":"Novac Technology Solution is currently hiring for Software Engineer Trainee (Certified Software Testing Engineers) for Chennai Location. Who can apply? Candidate with 70% above in 10th, 12th, UG / PG are eligible. Certification in Software Testing (Manual or Automation) is must. BE/ B Tech (CSE/ IT/ ECE) MCA, MSc (Computers) from 2018 & 2019 batch only BSc (CS) & BCA from 2018 & 2019 batch only Work Experience: Fresher Age criteria Not more than 26 Years Job Location: Chennai Selection Process: Online Aptitude Test Technical Online Round Technical F2F round Candidates who are interested, walk-in to the below mentioned venue directly with your updated CV. Walk-in Date: 4th & 5th July 2019 Time: 10 am to 3 pm Interview Venue: Novac Technology Solutions Office No: 275, Statesman One, R.K. Mutt Road, Mylapore, Chennai - 600 004 (Landmark: Near to Bata Showroom/ Mylapore Railway Station) *Note: If you have appeared for the same process in last 6 months you wont be eligible.","location":"Chennai","experience":"0 - 1 Years"},{"date":"6 - Jul - 2019","skills":"Manual Testing, Software Testing","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"QualityKiosk Technologies Pvt. Limited, A Wing - 419, Rupa Solitaire Millennium Business Park, Mahape, Navi Mumbai - 400 709","phone":"Not Provided","profile":"Manual Tester (Freshers) \nQualityKiosk Technologies Pvt. Limited","description":"B.E /B.Tech /MCA/ B.Sc/ BCA/ M.Sc/ M.tech- Passing Year- 2017 or 2018 Percentage Criteria-Mandatory 2 academics 60%+ AND 1 academic 55%-60% Java knowledge added advantage Should be willing to work in Manual Testing Open to travel anywhere in Mumbai (Western, Central, Navi Mumbai) Good Analytical approach & Logical reasoning skills Good Communication Skills Education gap not more than 1 Year 2 year bond Walk-in Date: 6 July 2019- Saturday Time: 11:00 AM till 2:00 PM Interview Venue: QualityKiosk Technologies Pvt. Limited, A Wing - 419, Rupa Solitaire Millennium Business Park, Mahape, Navi Mumbai - 400 709, Lift Number 24 & 25 (Directions: next to Mastek, take a right from the main entrance) Contact Person: Mausimi Sardar/ Leena Bhor Note: Requested to be prepared on manual testing before coming for the interview Candidate location from Western Line & till Bhandup. No Navi Mumbai","location":"Mumbai","experience":"0 - 1 Years"},{"date":"3, 4, 5 - Jul - 2019","skills":"QA/ Manual Testing, Python, Android, iOS","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"SPA Systems Private Limited, 1st Floor, Mahalaxmi Plaza, Sector-3 Vaishali, Ghaziabad - 201 010","phone":"9599226764","profile":"QA Manual Testing/ Trainee \nSPA Systems Private Limited","description":"Candidate should have 6 Months of training in QA/ Manual Testing, Python, Android, iOS. Must have good knowledge of one or more programming languages relevant to the role Walk-in Date/ Time: 3rd - 5th July 2019, 10Am onwards Interview Venue: SPA Systems Private Limited 1st Floor, Mahalaxmi Plaza, Sector-3 Vaishali, Ghaziabad - 201 010 (Walking Distance from Vaishali Metro Station)","location":"Ghaziabad","experience":"0 - 1 Years"},{"date":"4, 5 - Jul - 2019","skills":"Software Testing/ Manual/ Automation/ Selenium Trained","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Changepond Technologies Private Limited, H-2, SIPCOT IT Park, Old Mahabalipuram Road, Siruseri, Chennai, Tamil Nadu - 603 103","phone":"044-47480037","profile":"Testing/ Quality Analyst Trainee \nChangepond Technologies Pvt. Limited","description":"Changepond Technologies Pvt. Limited, is hiring Quality Analyst Trainees for Chennai location Educational Qualification: BE/ B. Tech/ MCA Eligibility: Aggregate of 60% in 10th, 12th, UG & PG (if any) Year of Passing: 2016, 2017 & 2018 Should have completed a course in Testing from any training institute. Must have Good Communication Skills Required Skills: Testing/ Manual/ Automation/ Selenium Trained or Certified Freshers. Male candidates preferred Walk-in Date: 4th & 5th July 2019 (Thursday/ Friday) Time: 9:30 AM to 4:00 PM Interview Venue: Changepond Technologies Private Limited H-2, SIPCOT IT Park, Old Mahabalipuram Road, Siruseri, Chennai, Tamil Nadu - 603 103 Interview Rounds: 1. Combined Apps (Testing & Logical reasoning), 2. Technical face to face 3. HR Interview. Contact Person: Kalaiselvan, Human Resources","location":"Chennai","experience":"0 - 1 Years"},{"date":"5 - Jul - 2019","skills":"Core Java, Selenium, Software Testing, Automation Testing, Software Engineering","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"CourseCube Private Limited, 57, 1st Floor, 7th Main, 17th Cross Road, NS Palya, BTM 2nd Stage, Bengaluru, Karnataka - 560 076","phone":"Not Provided","profile":"Trainee Engineer - Core Java/ QA \nAtmecs Technologies Private Limited","description":"Only B-Tech, M-Tech, MCA, MSc students from 2017/ 18/ 19 Passouts are eligible. Candidates should have scored 60% throughout in UG/ PG. Must have excellent communication skills. Must have undergone training or course in Core Java/ QA Should be comfortable with bond for 2 years. Job location will be in Hyderabad. Walk-in Date/ Time: 5th July 2019 from 9 AM onwards Interview Venue: CourseCube Private Limited 57, 1st Floor, 7th Main, 17th Cross Road, NS Palya, BTM 2nd Stage, Bengaluru, Karnataka - 560 076 Note: Interested students should report to venue by 8:30 AM only.","location":"Bangalore","experience":"0 - 1 Years"},{"date":"13 - Jul - 2019","skills":"Software Testng, Selenium, Java, Automation Testing, Rest, Test Cases, XML, Jenkins","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Carat Lane Trading Private Limited, No, 32, Khader Nawaz Khan Road, Thousand Lights West, Nungambakkam, Chennai, Tamil Nadu - 600 006","phone":"Not Provided","profile":"Software Engineer/ Tester \nCarat Lane Trading Private Limited","description":"Candidate should have minimum 3 to 5 years of experience in Web/ App Automation. Should have experience in writing automation test cases and implementing automation frameworks (Selenium, Appi, TestNG, RestAssured/ Httpclient). Must be proficient in Java and object oriented programming Good to have development experience Should have been part of automation solutions / test automation frameworks development Strong automation experience UI, API, Mobile app Experience with versioning systems (Subversion-SVN, Git / Git Hub) Experience with Continuous Integration (Jenkins , others ) Understanding of XML, JSON, REST, graphql etc and demonstrated experience with web services APIs Ability to learn new testing tools and approaches appropriate to the technologies being utilized Must be able to work independently and with minimum supervision Positive attitude towards taking new challenges. Good Problem solving and Analytical skills Walk-in Date/ Time: 13th July 2019, 9 AM onwards Interview Venue: Carat Lane Trading Private Limited No, 32, Khader Nawaz Khan Road, Thousand Lights West, Nungambakkam, Chennai, Tamil Nadu - 600 006","location":"Chennai","experience":"3 - 5 Years"},{"date":"4, 5, 6 - Jul - 2019","skills":"Software Testing, Test Engineering, Developing Test Plans & Use cases","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Netedge Computing Solutions Pvt. Limited, NetEdge Tower C - 56/ 39, Sector - 62 Noida - 201 301","phone":"78388-37993","profile":"Senior Test Engineer/ Lead \nNetedge Computing Solutions Pvt. Limited","description":"The person must have experience in: Analyzing Business requirements & Developing Test Plans & Use cases Creating Test Cases for various Modules & Test Execution Reporting bugs with severity & priority according to customer Requirement & project. The person will be responsible for: Managing the Testing Team Assigning the work & ensuring the work gets completed as per project plan Interaction with Developers & Project Managers / Customers (if required) Development of Test Cases Walk-in Date/ Time: 2nd - 6th July 2019, 11 AM onwards Interview Venue: Netedge Computing Solutions Pvt. Limited NetEdge Tower C - 56/ 39, Sector - 62 Noida - 201 301","location":"Noida","experience":"3 - 5 Years"},{"date":"4 - Jul - 2019","skills":"Software Testing, Selenium (testing tool), Test methodologies, Test Strategies","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Prometric Testing Private Limited, 2nd Floor, DLF Infinity Tower-A, DLF Phase 2, GURGAON, Haryana - 122 001","phone":"0124-4517145","profile":"Manual Testing Engineer \nPrometric Testing Private Limited","description":"Bachelors / Masters Degree in Computer Science, Engineering or a related subject Proven work experience in manual quality assurance. Strong knowledge of Manual Testing. Experience in writing clear, concise and comprehensive test plans and test cases Hands-on experience with manual testing. Experience with performance and/or security testing is a plus Excellent communication skills Good analytical skills Only Female candidates need to apply Job Hoppers please avoid to come for the interview Job Responsbility- Perform quality testing to ensure the exams operate as expected once delivered to the candidate Understand and analyze specification documents Executing tests as per the specification documents Review for any logical/documentation defects Reporting defects found during testing. Reporting and documentation. Co ordinate with all stake holders for successful completion of testing process Shift Timings: 9:00 am - 5:30 pm Saturdays & Sunday Fixed Weekly Off Interview Details: Date: 4-July-2019 (Thursday) Timings: 12:00 pm - 4:00 pm Venue: Prometric Testing Private Limited 2nd Floor, Infinity Tower A, DLF Cyber City, Gurgaon - 122002","location":"Gurgaon","experience":"2 - 3 Years"},{"date":"4, 5, 6, 8, 9, 10, 11, 12, 13 - Jul - 2019","skills":"Software Testing, Poduct Implementation, Bug fixing","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Talent Times Private Limited, 7-1-617/A, Third Floor, Unit # 305, Imperial Towers, Ameerpet, South India Shopping Mall Building Hyderabad, Telangana - 500 016","phone":"8367788879","profile":"Software Testing/ Support Engineer \nTalent Times Private Limited","description":"Qualification: Any Graduate/ B.E/ B.Tech/ MCA Work Experience: Fresher's / 0- 1 year Job Location: Hyderabad Key Responsibilities- Responsible for software testing, product implementation, Bug fixing, minor application issues and any adhoc requirements from client. Including PF, ESI, Insurance, Professional Tax Walk-in Date: 4th July - 31st August 2019 Time: 10 AM onwards Interview Venue: Talent Times Private Limited 7-1-617/A, Third Floor, Unit # 305, Imperial Towers, Ameerpet, South India Shopping Mall Building Hyderabad, Telangana - 500 016 Phone No. 8367788879","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"4 - Jul - 2019","skills":"Software Testing, Manual Testing","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Amazon Development Centre (India) Private Limited, Ground Floor, Infinity tower, Tata Ramanujam IT City SEZ, Rajiv Gandhi Salai, Near Tidal Park, Old Mahabalipuram Road, Taramani, Chennai - 600 113","phone":"Not Provided","profile":"QA/ Testing Engineer \nAmazon Development Centre (India) Pvt. Limited","description":"Amazon is hiring Associate, Quality Services for Chennai location, this is a Full Time Role related to Software device testing. Please find the below Job Description for the same and criteria to apply for this role. You may appear for the interview if you find yourself matching the below criteria. Eligibility Cretria: BE/ B.Tech or BCA/ MCA/ BSc/ MSc are only eligible to appear for the interviews Candidate pursuing Graduation or awaiting results will not be eligible to apply Freshers / candidates with less than one year of experience into Testing Candidates who have appeared for the same role in the last 6 months will not be eligible to reapply Immediate Joiners preferred Walk-in Date : 04 July 2019 Time: 10 AM to 12 PM Interview Venue: Amazon Development Centre (India) Private Limited Ground Floor, Infinity tower, Tata Ramanujam IT City SEZ, Rajiv Gandhi Salai, Near Tidal Park, Old Mahabalipuram Road, Taramani, Chennai - 600 113 Documents to Carry: 2 Copies of Resume (Mandatory) 10th Standard Mark sheet (Mandatory) Photo Copies Pan Card (Mandatory) Photo Copies Provisional Certificate and/or Degree Certificate (Mandatory) Photo Copies 2019 Passouts Please carry all semester mark sheets along with the internet copy of your final semester results (Mandatory) Photo Copies","location":"Chennai","experience":"0 - 1 Years"},{"date":"6 - Jul - 2019","skills":"Selenium Performance Testing Load Testing Functional Testing JMeter SQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Eurofins IT Solutions India Private Limited, Lemon Tree Hotels Limited Lemon Tree Premier, HITEC City Plot No. 2, Survey No. 64, HITEC City, Madhapur, Hyderabad - 500 081","phone":"Not Provided","profile":"Automation Test Engineer \nEurofins IT Solutions India Pvt. Limited","description":"TITLE: QA / Sr.QA Test Engineer Automation REPORTING TO: Manager WORKING LOCATION : Bangalore QUALIFICATIONS: BE/ MCA or any other equivalent degree 3 to 10 years of experience Experience in C#, Testing API/ Web Services, preferably REST Able to write scripts that deal with JSON parameterization Good understanding of SQL Experience in any automation tools: Selenium, Coded UI, UIA, etc. Strong preference to Selenium. Good to have: Exposure to Performance testing tools and processes LoadRunner, JMETER, Visual Studio Load Test, etc. Personal Qualities: Excellent analytical and problem solving skills Excellent verbal and written communication skills Successful teamwork experience Proven ability to transfer knowledge and stay aware of current trends and technical advancements Ability to articulate and present different points-of-views on various technologies Walk-in Date/ Time: 6th July 2019, 9 AM onwards Interview Venue: Eurofins IT Solutions India Private Limited Lemon Tree Hotels Limited Lemon Tree Premier, HITEC City Plot No. 2, Survey No. 64, HITEC City, Madhapur, Hyderabad - 500 081","location":"Hyderabad","experience":"0 - 10 Years"},{"date":"4, 5, 6, 8, 9, 10, 11, 12, 13, 14, 15 - Jul - 2019","skills":".Net Technologies, Trained Freshers","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Awapal Solutions Private Limited, E-38, First Floor, Sector-63, Noida - 201 301","phone":"9911886563","profile":"Manual Tester/ Client Support \nAwapal Solutions Private Limited","description":"Candidate should have 6 months to 1 year of relevant experience. Must be having good Knowledge of Manual testing, Automation Testing and Security testing. Must be comfortable in client support & software training to clients. Must have positive attitude Walk-in Date/ Time: 4th - 15th July, 11 AM onwards Interview Venue: Awapal Solutions Private Limited E-38, First Floor, Sector-63, Noida - 201 301","location":"Noida","experience":"0 - 1 Years"},{"date":"2, 3 - Jul - 2019","skills":"Recruitment, conducting interviews, HR/ Interviewing, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Prime Focus Technologies Limited, 2nd floor, Janardhan Towers, Bilekahalli, Bannerghatta Road, Bangalore - 560 076","phone":"Not Provided","profile":"HR Recruiter \nPrime Focus Technologies Ltd Limited","description":"We have an excellent opportunity for MBA (HR) freshers/ experienced candidates. Prime Focus Technologies (PFT) is hiring talented, passionate Recruiters for its Talent Acquisition team to assist in end-to-end recruitment process. Roles & Responsibilities: Assist to Design and implement overall recruiting strategy. Perform job and task analysis to document job requirements and objectives. Prepare recruitment materials and post jobs. Source and recruit candidates by using databases, social media etc Screen candidates resumes and job applications Prepare & maintain the documented recruiting reports. Conduct interviews. Job Location: Bangalore Walk-in Date/ Time: 2nd & 3rd July, 10 AM Onwards Venue Details: Prime Focus Technologies Limited 2nd floor, Janardhan Towers, Bilekahalli, Bannerghatta Road, Bangalore - 560 076 Landmark : After Brand Factory and Opposite Rainbow Children's Hospital","location":"Bangalore","experience":"0 - 3 Years"},{"date":"2, 3, 4, 5 - Jul - 2019","skills":"interviewing hiring recruitment hr ta social media events","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Busybees Logistics Solutions Pvt. Limited, (Xpressbees) B1 Building, 1st Floor, Cerebrum IT Park Kalyani nagar, Pune - 411 014.","phone":"Not Provided","profile":"HR Executive \nBusybees Logistics Solutions Pvt. Limited","description":"Roles & Responsibilities- Source potential candidates from various online channels (e.g. social media and professional platforms like StackOverflow and Behance) Craft recruiting emails to attract passive candidates Screen incoming resumes and application forms Interview candidates (via phone, video and in-person) Prepare and distribute assignments and numerical, language and logical reasoning tests Advertise job openings on companys careers page, social media, job boards and internally Provide shortlists of qualified candidates to hiring managers Send job offer emails and answer queries about compensation and benefits Monitor key HR metrics, including time-to-fill, time-to-hire and source of hire Participate in job fairs and host in-house recruitment events Collaborate with managers to identify future hiring needs Act as a consultant to new hires and help them onboard Walk-in Date/ Time: 2nd July - 5th July, 10 am Onwards Interview Venue: Busybees Logistics Solutions Pvt. Limited, (Xpressbees) B1 Building, 1st Floor, Cerebrum IT Park Kalyani nagar, Pune - 411 014.","location":"Pune","experience":"1 - 2 Years"},{"date":"3, 4, 5 - Jul - 2019","skills":"General Administration, MIS Preparation, Back Office Operations, Non Voice Process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Karvy Fintech Private Limited, Tower- B, Plot No. 31 & 32, Selenium building Gachibowli Road Financial District, Nanakramguda, Serilingampally Mandal, Hyderabad - 500 032","phone":"Not Provided","profile":"Back Office Executive \nKarvy Fintech Private Limited","description":"We are hiring both Freshers as well as experienced candidates. The ideal candidate should be preferably from a Finance background and should be knowing basics of excel. Educational Qualification - Graduate and Above Other Requirement : Knowledge on Financial Industry and hands on knowledge on Excel Job Responsbility- Meet performance standards of respective sub-function. Operational efficiency & effectiveness. Able deliver the output within agreed timelines Responsible for cheque stop and reissue. Responsible for responding customer mails within TAT. Responsible for MIS preparations, attending queries and client calls. Responsible for executing SIP transactions. Responsible for checking daily reports and maintaining the quality. Regular touch with all vendor / banks & AMC for daily activities Walk-in Date/ Time: 3rd July - 5th July from 11 AM onwards Interview Venue: Karvy Fintech Private Limited Tower- B, Plot No. 31 & 32, Selenium building Gachibowli Road Financial District, Nanakramguda, Serilingampally Mandal, Hyderabad - 500 032","location":"Hyderabad","experience":"0 - 5 Years"},{"date":"4 - Jul - 2019","skills":"Background Verification, Non Voice/ Backend Operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Neeyamo Enerprise Solutions Pvt. Limited, NTPL SEZ (Blueridge) IT 05, 1st Floor, 154/06 Phase 1, Hinjewadi, Pune - 411 057","phone":"020-67934007","profile":"Service Delivery Executive \nNeeyamo Enerprise Solutions Pvt. Limited","description":"Designation: 1) Service Delivery Executive (BGV Executive) 2) Associate Team Lead (ATL) Job Responsbility: Connecting with various educational institutes &/or corporate offices for verification of credentials given by clients. Conducting research & analysis to validate authenticity of the aforementioned data. Has the ability to work under stringent deadlines and tough client conditions. The ATL will have a team of 2-4 Service Delivery Executives under him/her. Strictly freashers or 0-1 year experience allowed only for ATLs. Qualification: Any Graduate (Except Post Graduates like M.Tech, MBA, etc) Eligibility Criteria:- Must be comfortable working in night Comfortable with a voice profile Strong analytical & problem solving skills Can work under pressure Immediate Joining No standing arrears Levels of Interview:- Aptitude test Face to face interview HR Discussion Reporting time: 11:00 am Contact Person: Harpreet Note : Please bring 2 copies of your resume.","location":"Pune","experience":"0 - 2 Years"},{"date":"1, 2, 3, 4, 5, 8, 9, 10, 11, 12 - Jul - 2019","skills":".Net technologies/ C#, .NET, C#, Web API, Web Services","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Ganapathi Raja Enclave, # 75 /A, 1st and 2nd Floor, 100 Feet Road, 15th Cross Road, Sarakki, 1st Phase, J. P. Nagar, Bengaluru, Karnataka - 560 078","phone":"Not Mentioned","profile":".Net Developers \nSilicomp India Private Limited","description":"Person must be Graduate with at least fifteen (15) years of education in any discipline and 1 to 3 years of relevant experience on .Net technologies/ C#, .NET, C#, Web API, Web Services. Must be excellent in Hibernate & MongoDB. Functional analysis of existing software Job Location: Bangalore Interested candidates please Walk-in with your updated resume from Tuesday to Thursday between 10.00 am to 4.00 pm to the below mentioned address- Ganapathi Raja Enclave, # 75 /A, 1st and 2nd Floor, 100 Feet Road, 15th Cross Road, Sarakki, 1st Phase, J. P. Nagar, Bengaluru, Karnataka - 560 078 Near JP-Nagar Metro Railway Station/ Sindoora Convention Hall. Contact Person: Nirmala","location":"Bangalore","experience":"1 - 3 Years"},{"date":"1, 2, 3, 4, 5 - Jul - 2019","skills":"Technical Support, IT Helpdesk, Customer Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Digital Minds Software Solutions Pvt. Limited, 2nd Floor, A-Wing, Softsol Building,, #4 Infocity, Beside Mindspace, Hi-tech City, Madhapur, Hyderabad, Telangana - 500 081","phone":"040 66885669","profile":"Technical Support Executives \nDigital Minds Software Solution Pvt. Limited","description":"Digital Minds Software Solution Pvt. Limited, is conducting Walk in Drive for Technical Support Executives. Educational Qualification: Any Degree Work Experience: 3 - 6 Years Job Location: Hyderabad Shift Timings (IST): Australian Voice Process (2:30 Am to 11:30 Am or 4:00 Am to 1:00 Pm or 6:00 Am to 03:00 Pm) (Shifts can change depending on Roster or Day light saving (Rotational) Required Skills- Excellent Comm Skills / Technical Skills / Trouble shooting skills / Customer Handling Skills Good in Active Directory, Basic Exchange Server or Office 365 administration, DHCP & DNS Excellent Knowledge of desktop OS Windows 8.1 / 10 and Trouble Shooting. Support hardware issues related to PC desktops, laptops, networking and Cisco phones. Able to work effectively with vendors and suppliers by logging tickets and service requests. Hands on experience with Ticketing tools is essentials(Jira / Alloy Navigator etc ) Knowledge of VMware(VSphere 5.5) and Citrix Xen Server. Knowledge of Cisco CUCM / Unity/ PLM - Not mandatory Knowledge on Backup (Veritas Backup, Veeam Backup, etc...) Walk-in Date: 1st to 5th July 2019 Timings: 10 AM -1 PM & 2 PM - 4 PM Interview Venue: Digital Minds Software Solution Private Limited 2nd Floor, A-Wing, Softsol Building,, #4 Infocity, Beside Mindspace,Hi-tech City, Madhapur, Hyderabad, Telangana - 500 081 Phone No: 9063610208/ 040 6688 5669 Note: Those attended the interview with in Six Months, Kindly Ignore. Salary:","location":"Hyderabad","experience":"3 - 6 Years"},{"date":"1, 2, 3 - Jul - 2019","skills":"PHP, HTML, CSS, Python or Node JS, SQL/ MySQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"MS Technology Private Limited, 2, Community Centre, IInd Floor, Basant Lok, Vasant Vihar, New Delhi - 110 057","phone":"011-41669396","profile":"Web Developer - Php \nMS Technology Private Limited","description":"Experience with PHP, HTML, CSS Familiarity with Wordpress and Angular Python or Node.js SQL/ MySQL database experience Bootstrap and or Material Design Comfortable jumping in to unfamiliar frameworks/codebases Experience using version control systems Web optimization Walk-in Date/ Time: 1st - 3rd July , 11 AM onwards Interview Venue: MS Technology Private Limited 2, Community Centre, IInd Floor, Basant Lok, Vasant Vihar, New Delhi - 110 057","location":"Delhi","experience":"2 - 3 Years"},{"date":"1, 2, 3, 4 - Jul - 2019","skills":"Software Testing, Automation Testing, Manual Testing, Script Writing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Ganapathi Raja Enclave, #75 /A, 1st and 2nd Floor, 100 Feet Road, 15th Cross Road, Sarakki, 1st Phase, J. P. Nagar, Bengaluru - 560 078","phone":"080-43358090","profile":"Automation Test Engineers \nFIME India","description":"WALK IN for Test Engineers to join our team! As a Test Engineer you will be responsible for planning and implementing of tests that prove the functional and non-functional requirements of the system.: Skills Required: Test and prove that the software meets major business requirements Good Scripting Knowledge in Java, Python, JavaScript, etc. 0-2 years experience in Manual and Automation Testing - functionality, regression, use case and system testing Experience in any test management tools Prove for scalability and performance of a software Ensuring the quality of the system as a whole Develop and automate tests for software validation Prepare defect reports and report test progress Excellent communication, analytical, problem solving skills and should be able to work independently Job Location: Bangalore Interested candidates please Walk-in with your updated resume from Tuesday to Thursday between 10.00 am to 4.00 pm to the below mentioned address or share your updated resume to Nirmala.madyangala@fime.com Ganapathi Raja Enclave, #75 /A, 1st and 2nd Floor, 100 Feet Road, 15th Cross Road, Sarakki, 1st Phase, J. P. Nagar, Bengaluru - 560 078 Near JP-Nagar Metro Railway Station Contact Person: Nirmala Contact Number: 080-43358090/ 9901650716","location":"Bangalore","experience":"0 - 2 Years"},{"date":"6 - Jul - 2019","skills":"Technical Support, Technical Helpdesk, Service Desk, End User Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Microland Limited, Ground Floor, #6 & 7, Palm Court, Sector 14 20/4 Sukrali Chowk, Opp. Huda Park, Gurugram - 122 001","phone":"0124-6754030","profile":"Technical Support Engineer \nMicroland Limited","description":"Candidate should have with minimum 1 year of experience in technical helpdesk Experience in the domain of voice technical support/ helpdesk is must Knowledge in International service delivery standards such as ITIL, eSCM or CMMi Excellent verbal & written communication - Interpersonal skills Should be in a position to resolve L1 and L1.5 calls Should be able to drive customer experience via HD support Must be familiar with Microsoft technologies and windows environment Smartphone/Desktop and Laptop hardware/software troubleshooting. Office utility tools, antivirus tools, personal firewall tools or other business productivity tools troubleshooting Job Role: Service Desk & Helpdesk Engineers Experience Required: 0.6 - 5 year Salary:-1 Lpa to 3.20 Lpa Job Location:- Gurgaon, Manesar, Rohtak Job Responsbility: Single Point Of Contact (SPOC) assistance for End User Support To respond to the incidents /problem/change reported by Customer predominantly through Voice Interaction and also through email, chat and web portal Log Tickets in the call-logging tool on behalf of users Take necessary action viz resolves (over phone or remote) or assigns the issue to right assignment group Monitor the service desk tool for open and pending incidents Own the incident and provide end to end resolution for the ticket Interested candidates can turn up directly at Microland premises:- Walk-in Date:- 6th July 2019 Timing:-10:00 am to 5:00 pm max Venue:- Ground Floor, #6 & 7, Palm Court, Sector 14 20/4 Sukrali Chowk, Opp. Huda Park, Gurugram - 122 001 Interested candidate can call on 0124-6754030 or can send their CV at manishaSh@microland.com","location":"Gurgaon","experience":"1 - 5 Years"},{"date":"4 - Jul - 2019","skills":"Customer Care, Customer Support, Helpdesk","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"BT Global Business Services Pvt. Limited, Building No. 14, tower C, 8th Floor, Cyber city, Gurgaon","phone":"Not Specified","profile":"Support Associate/ Freshers \nBT Global Business Services Pvt. Limited","description":"Fresher Walk-in for BBA & BCOM (2017, 2018 & 2019) pass outs for the role of Associate CDS Operations at BT Global, Gurgaon Responsibilities: Managing the end customer deliverable (and in most cases speaking to the end customer) i.e. processing tasks including low complexity projects & order management, PO creation, commercial management in an efficient and accurate fashion for CDS customers. Analyse and interpret financial statistics and other data and produce relevant reports. Drive Date: 4th July 19 (Thursday) Timings: 10 AM to 12 Noon Drive Venue: BT Global Business Services Pvt. Limited Building No. 14, tower C, 8th Floor, Cyber city, Gurgaon","location":"Gurgaon","experience":"0 - 1 Years"},{"date":"2 - Jul - 2019","skills":"Customer Support, Technical Support, Voice Process","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Cognizant Technology Solutions, No.F-2, Mahogany, Embassy Manyata Business Park, Rachenahalli, Hebbal Outer Ring Road, Bangalore.","phone":"Not Provided","profile":"Technical Support (Voice Process) \nCognizant Technology Solutions India Ltd","description":"We are looking for Candidates form Any International Voice process @SPE Bangalore Location. Degree : Any Graduate Work Experience: 1-4 Years Skill : Any International Voice Process Designation : Senior Process Executive (SPE) Package : As per company norms Shift : Flexible Industry : BPO / ITES Candidates must have 1 year of international BPO Voice experience Must have good English narrative skills. Willingness to work in International Voice process Good to have analytical, presentation & communication skill Excellent Communication & Listening skills. Willingness to work in any shift. Any international Voice Experience Preferably US Interview location & Work Location : Bangalore Walk-in Date: 2nd July 2019 (Tuesday) Time:10 am to 12:30 pm Venue Details : Cognizant Technology Solutions No.F-2, Mahogany, Embassy Manyata Business Park, Rachenahalli, Hebbal Outer Ring Road, Bangalore. Point of Contact : Meghana The following documents are mandatory and we request you to bring these for the discussion: Updated Resume Original Government ID proof Passport Size Photograph Aadhar Card Pan Card Voter ID / Passport Candidates with excellent communication are applicable for this process Candidates should be flexible to work in any shifts Education criteria Minimum 15 (10+2+3 / 4) years of education Candidates with standing arrears is not eligible, should be a graduate Interview will be a day long process Parking facility is not available inside Cognizant premises Referrals are invited NOTE : Mention Vijaya Shanthi/ Meghana HR at the top of the resume Please do not carry laptops/ cameras/ Pen drives or such other devices/ materials that are prohibited within premises or by law, as these will not be allowed due to security restrictions. We expect you to respect the security requirements of this Organization during your presence at the venue Candidates attended interview in the last 3 months is not eligible for this interview process","location":"Noida","experience":"1 - 4 Years"},{"date":"1, 2, 3, 4, 5 - Jul - 2019","skills":"Technical Support, Customer Service/ Troubleshooting","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Dell Technologies, Plot # 42, Hitec City Layout, Opposite to Deloitte, Madhapur, Hyderabad - 500 081","phone":"Not Provided","profile":"Technical Support Associate \nDell Technologies Private Limited","description":"Educational Qualifications : Any Graduates/ Post Graduates are eligible to apply with minimum 6 months to maximum 39 months of work experience. Any 10+2,10+3 with 12 months international calling experience /24 months domestic calling experience may apply (Mandatory). Candidates should be flexible to work in night shifts. Must have excellent communication skills. Should have good technical knowledge 2 way transport provided Role Overview Responsible for providing telephone/ email/ chat, online, social media and remote diagnostic technical support of desktops, portables, peripherals (e.g., printers, projectors, etc.) and software Role Responsibilities Responsible for providing diagnostic technical support related to installation, operation, configuration,performance, and usage of assigned products Diagnosis & resolving of the hardware problems and troubleshooting. Verifies warranty entitlement and determines appropriate action. Applies diagnostic techniques to identify problems, investigate causes and recommend solutions to correct failures. Documents problems in the support solution database for diagnostics and solution implementation. Provides basic remote deployment, maintenance and consulting services. Walk-in Date/ Time: 1st to 5th July 1 PM Onwards Interview Venue : Dell Technologies, Plot # 42, Hitec City Layout, Opposite to Deloitte, Madhapur, Hyderabad - 500 081 Timings : 1:00 PM to 3 :00 PM, Monday to Friday . Important Note : Please carry an updated CV, a valid Govt. ID proof & passport size photographs.","location":"Hyderabad","experience":"1 - 4 Years"},{"date":"1, 2, 3, 4, 5, 6 - Jul - 2019","skills":"Technical Support, Customer Support, Desktop Support","qualification":"Diploma, B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Aegis Customer Support Services Pvt. Limited, 41, St. Johns Road Bangalore - 560 042","phone":"6361675363","profile":"Technical Support Executive \nAegis Customer Support Services Pvt. Limited","description":"Qualification: Diploma OR Any Graduate are welcome Minimum 6 months experience (Any Experience) Good Communication Skills English & Hindi Mandatory Knowledge of installation of windows OS Job Responsbility- Troubleshooting and Installation of Laptop OS Troubleshooting and Installation of Printers, Scanners. Office and Business application client installation and configuration. Installation/ Configuration / archive of Outlook E-Mail client. Shift Timing: 9 Am to 6 Pm Working Hrs: 9hrs including 1hr break Week Off: Sunday is fixed off Walk-in Date/ Time: 1st - 6th July 2019, 9 AM Onwards Interview Venue: Aegis Customer Support Services Pvt. Limited, 41, St. Johns Road Bangalore - 560 042 Land Mark : Ulsoor Lake OR OLD Lakshmi Theater Building Contact Person : Bala - 6361275363","location":"Bangalore","experience":"0 - 5 Years"},{"date":"2, 3, 4, 5 - Jul - 2019","skills":"C# with Oops Concepts, Dotnet, Javascript","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Janya IT Technologies Pvt. Limited, 301, Fortune Chambers, Silicon Valley, Image Garden Function Hall lane, Opp. HDFC Bank, Madhapur, Hyderabad - 500 081","phone":"Not Provided","profile":".Net Trained/ Freshers \nJanya IT Technologies Pvt. Limited","description":"We have a urgent opening for .Net trained candidates of 2017/2018 & 2019 pass outs of B.Tech/ BCA/ M.Tech/ MCA. Candidate must have good knowledge in C# with Oops Concepts, Dotnet, Javascript Walk-in Date: 2nd to 5th July 2019 Timings: 10 am to 12 pm Interview Venue: Janya IT Technologies Pvt. Limited 301, Fortune Chambers, Silicon Valley, Image Garden Function Hall lane, Opp. HDFC Bank, Madhapur, Hyderabad - 500 081","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"1, 2, 3 - Jul - 2019","skills":"Team Handling Team Leading Recruitment Management Employee Retention","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Plot No. A356/ 357, Road No.26, Wagle Industrial Estate, Thane (West), Maharashtra - 400 604.","phone":"7678009271","profile":"Recruitment Manager \nDealmoney Securities Private Limited","description":"Person should be ANy Graduate/ MBA (HR) with 3 to 5 years of experience in the below mentioned roles- Recruitment team handling Bulk hiring End to end recruitment Employee retention Employee engagement°ïƒ˜ Handling end to end recruitments, selection, induction & orientation programme and joining Handling employee relations and employee engagement activities. Handling Recruitment team° Walk-in Date/ Time: 1st July - 3rd July, 10 AM Onwards Venue Details- Plot No. A356/ 357, Road No.26, Wagle Industrial Estate, Thane (West), Maharashtra - 400 604. Recruiter Name: Rupali Devlekar Telephone: 7678009271","location":"Mumbai","experience":"3 - 5 Years"},{"date":"2, 3 - Jul - 2019","skills":"Recruitment Screening Telephonic Interviewing Sourcing HR","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"SpiceJet Limited, Plot No. 319, Udhyog Vihar, Phase-4 Gurugram, Haryana - 122 016","phone":"Not Provided","profile":"Senior Executive - HR (Only Male) \nSpiceJet Limited","description":"We are conducting walk-in interviews for the position of Senior Executive - HR (only Male) in our in Human Resources Department on 2nd & 3rd July' 2019 (Tuesday & Wednesday) from 10:00 am to 12:00 Noon Designation : Senior Executive - HR Department : Human Resources Location : Gurgaon Educational Qualification : MBA/ PGDM - HR Work Experience: 3 - 5 Years Required Skills sets: * Willing to travel * Excellent Communication both written & Verbal * Having knowledge of Excel & power-point presentation * Out of the box thinking Job Responsibilities: * Sourcing /Screening - Resumes/ Profiles * End to End Recruitment * Taking Telephonic round of interviews/Face to Face interviews * Coordinating with candidates & interview panelist for the final rounds * Posting job vacancy on job portals * Documentation * Daily MIS * Daily assigned work Kindly report at the below mentioned address and other details and do carry a copy of your updated resume. Date : 2nd & 3rd July '19 (Tuesday & Wednesday) Timing: 10 am till 12 noon Interview Venue: Plot No. 319, Udhyog Vihar, Phase-4 Gurugram, Haryana - 122 016 Dress Code: Formals","location":"Gurgaon","experience":"3 - 5 Years"},{"date":"1, 2 - Jul - 2019","skills":"NSE, General Insurance, Branch Management, Sales Operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Chola MS General Insurance Company Ltd., #No. 302, 3rd Floor, SR Arcade, Parklane, Secunderabad - 500 003.","phone":"9866907114","profile":"Assistant Branch Manager \nCholamandalam MS General Insurance Company Limited","description":"CHOLA MS General Insurance is hiring Asst. Branch Managers Qualification : Any Graduate Age : 25 Years Location : At your home town Male candidates only need to apply Salary : 3LPA Walk-in Date : 1st & 2nd July 2019 Time : 10am to 11 am & 2pm to 3pm Interview Venue: Chola MS General Insurance Company Ltd., #No. 302, 3rd Floor, SR Arcade, Parklane, Secunderabad - 500 003. Contact: HR - Dheeraj (9866907114)","location":"Hyderabad","experience":"0 - 3 Years"},{"date":"1 - Jul - 2019","skills":"Human Resource Management, Employee Engagement, Employee Relations","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Fareportal India Private Limited, 199, Sainik Nagar, Clover Park, Viman Nagar, Pune - 411 014","phone":"7020420840","profile":"HR Executive/ Freshers \nFareportal India Private Limited","description":"We are looking for dynamic human resources professionals for a HR- Business Partner role. Educational Qualification: MBA - HRM Excellent communication skills required Comfortable with 24/7 shifts Location - Pune (Viman Nagar) Should be having good interpersonal skills. Candidate should be having basic knowledge and clarity of HR concepts. Joining - Immediate joiners Walk-in Date/ Time: 1st July 2019 from 1 PM onwards Interview Venue: Fareportal India Private Limited 199, Sainik Nagar, Clover Park, Viman Nagar, Pune - 411 014 Contact Person - Vickram P (7020420840)","location":"Pune","experience":"0 - 1 Years"},{"date":"1, 2, 3, 4, 5, 6, 8, 9, 10, 11, 12, 13 - Jul - 2019","skills":"Payroll Process, Profession tax, Accounting, etc","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"TopSource Infotech Solutions Pvt. Limited, 3rd Floor ,Gamma 1, Giga Space, Viman Nagar, Opp. Maruti Showroom Pune - 411 014","phone":"Not Provided","profile":"India Payroll Executive \nTopSource Infotech Solutions Pvt. Limited","description":"We are looking for Payroll Professionals Freshers in TopSource. Any candidate who has 3 months of Payroll experience, who is good in communication and has desire to make a career in India Payroll is eligible to apply. Candidate must have 1 years of overall experience with at least last 3 months of Payroll experience. Preference would be given to candidates who have experience in worked for India payroll process. B.com background would be an added advantage Personal Characteristics Should have excellent written and spoken English. Motivated, self-starter individual with high level of integrity, intensity and activity with a can-do attitude. Disciplined process oriented work style Able to work effectively under pressure Ability to work equally well either independently or as part of a team Experience: 0.3 - 3 year Job Location : Pune Salary : As per Market standards Please don't call us if Interested then please Walk-In with updated resume from 1st July to 24th July 2019 between 12.30 PM and 7:30 PM) at the address mentioned below- TopSource Infotech Solutions Pvt. Ltd 3rd Floor ,Gamma 1, Giga Space, Viman Nagar, Opp. Maruti Showroom Pune - 411 014 Contact Person : Pawan Kumar Email id :pawan.burman@topsource.co.in *Kindly carry a copy of your updated resume when you visit us Note: 1) please ignore this email if you have already attended interview in TopSource in last 90 days. 2) Please ignore this email if the job advertisement mentioned above is not relevant to your profile. 3) Outstation candidates need to confirm their schedule by mailing at pawan.burman@topsource.co.in before coming for interview. We dont re-imburse travelling expenses)","location":"Pune","experience":"1 - 4 Years"},{"date":"29 - Jun - 2019","skills":"Administration, Office Management, Front Office and Vendor Management","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Virtusa Consulting Services Pvt. Limited, Foundation Building, No. 34 IT Highway, Rajiv Gandhi Salai , Navallur, Chennai - 600 130","phone":"Not Provided","profile":"Core Java Developer \nVirtusa Consulting Services Pvt. Limited","description":"We are looking out for strong Core Java Developers who is good working with Struts. Hands on experience on Struts project. Knowledge on SDLC Work Experience: 2-5 Years Candidates who are interested in the above skills below drop in to our venue on time- Walk-in Date: 29th June 2019 Time: 10 AM - 12 Noon Interview Venue- Virtusa Consulting Services Pvt. Limited Foundation Building, No. 34 IT Highway, Rajiv Gandhi Salai , Navallur, Chennai - 600 130","location":"Chennai","experience":"2 - 5 Years"},{"date":"1 - Jul - 2019","skills":"HR Operations, HR Generalist Activities","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"DXC Technology India Private Limited, RGA Techpark, Sarjapur Main Road, Carmelaram, Hadosiddapura, Chikkakannalli, Bengaluru - 560 035","phone":"Not Provided","profile":"HR/ Backend Operations Executive \nDXC Technology India Private Limited","description":"Candidate should be Any Garduate/ Post Graduate (MBA HR) with 1 to 3 years of experience in HR Operations, HR Generalist Activities. Must have good knowledge in Excel & Excellent Communication Skills. Good To Have: Experience in using HRIS or HR PORTAL Job Responsbility: Backend HR Operations (US shift) Payment Processing and Car lease Program Walk-in Date/ Time: 1st July 2019 from 11 AM Onwards Interview Venue: DXC Technology India Private Limited RGA Techpark, Sarjapur Main Road, Carmelaram, Hadosiddapura, Chikkakannalli, Bengaluru - 560 035","location":"Bangalore","experience":"1 - 3 Years"},{"date":"29 - Jun - 2019","skills":"ack Office, Branch Operations, Domestic BPO, Inbound Process, Customer Service","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Nimbus Adcom Private Limited, 13, F3, 2nd Floor, 2nd Main Road, Nehru Nagar, Adyar, Chennai - 600 020","phone":"6200288246","profile":"Back Office Executive \nNimbus Adcom Private Limited","description":"We are Hiring Big! for Multiple position at Nimbus Adcom Private Limited Candidate should be Any Graduate with 0 to 5 years of experience in Back Office, Branch Operations, Domestic BPO, Inbound Process, Customer Service, Outbound, Telemarketing, etc. Must have excellent communication skills Salary: INR 1,00,000 - 1,50,000 PA No. of Openings: 30 Walk-in Date/ Time: 29th June 2019, 10 AM Onwards Interview Venue: Nimbus Adcom Private Limited 13, F3, 2nd Floor, 2nd Main Road, Nehru Nagar, Adyar, Chennai - 600 020 Call HR-6200288246","location":"Chennai","experience":"0 - 5 Years"},{"date":"29 - Jun - 2019","skills":"J2EE, Core Java ,Collection and Multithreading, Hibernate, Spring or Spring boot","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Panamax Infotech Limited, Panamax House-1, Next to Dinner Bell -2 / ICICI Bank , Subhas Chowk, Memnagar, Ahmedabad - 380 052","phone":"Not Provided","profile":"Software Engineer - Java \nPanamax Infotech Limited","description":"We have arranged a Walk-in Interview for Java Developers on June 29 from 10:00 AM to 4 PM Educational Qualification: BE or MCA or MSc(IT) At least 1 years of software development experience in J2EE Experience with Core Java ,Collection and Multithreading Experience with Frameworks: Hibernate, Spring or Spring boot Experience in working with Webservices (SOAP, Restful) Database skills (at least one): MySQL or Oracle Java application servers: Tomcat Version control system : SVN Strong Unit Test writing skills Preferred Area of Expertise: Core JAVA, Spring or spring boot, Hibernate Functional Competencies: Carry out assigned code implementation Active participation product design and testing Should be able to lead module if assigned General Competencies/Soft Skills: - Good at technical communication with team mates (written and oral) KEY RESPONSIBILITY AREAS: Excellent at carrying out R&Ds independently Able to work in cross technologies team environments Able to contribute in technical discussions Able to implement and support enterprise-scale applications Walk-in Date/ Time: 29th June from 9 AM onwards Interview Venue: Panamax Infotech Limited, Panamax House-1, Next to Dinner Bell -2 / ICICI Bank , Subhas Chowk, Memnagar, Ahmedabad - 380 052","location":"Ahmedabad","experience":"1 - 5 Years"},{"date":"1 - Jul - 2019","skills":"J2Ee, Struts, Hibernate, Core Java, Servlets, PLSQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Godrej Infotech Limited, Plant 19A, 2nd floor, Pirojshanagar, Vikhroli (West), Mumbai","phone":"022-67966193","profile":"Java Developer \nGodrej Infotech Limited","description":"Qualification Required: Any Graduation (Full time; No Diploma) Experience Required:- Within 2-5 years (Not less than 2 years and not 5 or more than 5 years) Requisite Experience: 1) Need to have good experience in PLSQL/SQL 2) Need to have good experience on JSP 3) Need to have good experience in core Java Primary Skills- 1)Must have strong background / knowledge in Core Java. JSP/Servlet, Maven, Spring Framework. 2)MS SQl database design and writing SQL queries & stored procedures. 3)Sound knowledge in HTML, CSS, AJAX and JavaScript. 4)Should be capable of doing Code Review and testing for team members. 5)Should have sound knowledge of Software Development 6)Life cycle and should be able to lead a module with 3-4 team members. Secondary Skills:- 1) Should know deployment process on application servers like Apache Tomcat/JBOSS 6 2) Have Good knowledge of Angular 2 or above. Key result areas: 1) Requirement Analysis and Design 2) Preparation of Technical specification documents Software development as per technical specifications 3) Software Testing to ensure defect-free software Following ISO procedures Walk-in details:- Date: 1st July 2019 (Monday) Timings: 2:00 pm to 4.00 pm Venue: Godrej Infotech Limited Plant 19A, 2nd floor, Pirojshanagar, Vikhroli (West), Mumbai Entry from: Gate no. 4 , Godrej Petroleum, LBS Road Entry from: ( by Vehicle ) From Gate No. 7 - Eastern Express Highway Vikhroli ( East ) or Gate No. 1 - Opposite R city Mall. Vikhroli ( West )","location":"Mumbai","experience":"2 - 4 Years"},{"date":"1, 2, 3, 4, 5 - Jul - 2019","skills":"Backend, Back Office, Non Voice Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Provana India Private Limited, A-32, Sector- 2, Noida","phone":"Not Provided","profile":"Back End Associate \nProvana India Private Limited","description":"Any Graduate with good analytical ability & time management skills; Good typing skills with a typing speed of 35 WPM with 97% accuracy Should possess good English communication skills Ability to follow instructions and clearly defined objectives; Ability to proactively identify process improvements; Fast learner (on both process and systems) Should be comfortable for rotational shift. Cab & Meal facility in night shift Both Fresher/ Experienced can apply Interested candidates can directly walk-in from 1st - 5th July at the below address- Provana India Private Limited A-32, Sector- 2, Noida Nearest Metro Station - Noida Sec 15 Contact Person : Nida Khan","location":"Noida","experience":"0 - 2 Years"},{"date":"29 - Jun - 2019","skills":"Java/ J2EE, Core Java, Spring/ Hibernate, MySQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Tech Mahindra Limited, ITC 4, Ground Floor A Wing, Site No: 44(P) 46(P), KIADB Industrial Area, Electronic City, Phase -2 Bangalore - 560 100","phone":"Not Provided","profile":"Java/ J2EE Developer \nTech Mahindra Limited","description":"Tech Mahindra Limited is having weekend drive for Java/ Full-stack Developers at Bangalore Looking for Java/ J2EE Developer's who are good in Core Java in any of the framework (Spring/ Hibernate), Experience in writing SQL queries of MySQL DB and scripting language experience in Unix Shell Scripting/ PERL Java Full stack developer is preferred Title: Java Full-stack Developers Work Experience: 4 to 9 Years Immediate Joiner/ Notice period should not exceed four weeks Drive Date: 29th June 2019 (Saturday) Time: 9 AM onwards Venue Details: Tech Mahindra Limited, ITC 4, Ground Floor A Wing, Site No: 44(P) 46(P), KIADB Industrial Area, Electronic City, Phase -2 Bangalore - 560 100 Contact Person: Shreya Bhaskar","location":"Bangalore","experience":"4 - 9 Years"},{"date":"29 - Jun - 2019","skills":"Java/ J2EE, SOA Webservices (SOAP and REST), ESBs, Open Source","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Wipro Limited, A-23, Sarita Vihar, Mohan Co-operative Industrial Area, Mathura Road, New Delhi - 110 044 (Nearest Metro Station-Sarita Vihar) HR SPOC - Vikas","phone":"Not Provided","profile":"Java Developers \nWipro Limited","description":"Wipro Limited is Hiring for Java Developer/ Senior Developer on 29th June at Sarita Vihar Work Experience: 2 to 8 Years Production implementation level experience in large enterprise applications using Java/ J2EE, SOA Webservices (SOAP and REST), ESBs, Open Source products, and strong working knowledge of SOA, SOAP, WSDL, Service Orchestration, Spring MVC and JSON. Knowledge of Web Technologies such as Html 5, CSS 3, jQuery, Spring MVVC and WebServices (SOAP/REST). Knowledge of technology areas of Messaging, Transaction Management, Spring MVC, Hibernate, DAO, etc. Strong command on Java/J2EE concepts and current industry trends. Experience in implementing Webservices Security using WS-Security, SAML, Kerberos and integrating with Identity provides, LDAP and ADFS. Strong knowledge on design and integration patterns specially in applications involving Portals/SSO, legacy applications, B2B Applications, external partners using ESB. Strong understanding of Object Oriented design methodologies and design patterns. Must have excellent written and verbal communication skills. Experience with Agile development methodology. Experience with Cloud Computing. Walk-in Date - 29th June 2019 (Saturday) Time - 10 am to 4 pm Interview Venue - Wipro Limited, A-23, Sarita Vihar, Mohan Co-operative Industrial Area, Mathura Road, New Delhi - 110 044 (Nearest Metro Station-Sarita Vihar) HR SPOC - Vikas Please carry updated resumes along with ID proof. And no laptop/ media/USB etc. allowed in the office premise.","location":"Delhi","experience":"2 - 8 Years"},{"date":"29 - Jun - 2019","skills":"Core Java, JavaScript, JSP, Servlets","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Ebix Software India Private Limited, S. No. 303/2/2, Bavdhan (BK) Mumbai Bangalore Highway (Bypass) PUNE - 411 021","phone":"020-22952520","profile":"Java Developers \nEbix Software India Private Limited","description":"We are conducting a drive this weekend (29th June 2019) for Java Developers Person should have strong work experience on Core Java, JavaScript, JSP, Servlets Writing Program Specifications Document. Code components and peer reviews. Prepare unit and Integration Test Scripts. Review of Test Cases and codes. Version Management as per the project requirements. Configuration Controller report creation. Domain knowledge in LOS /LMS knowledge is an advantage Interested candidates needs to share their profiles at sanghmitra.mistry@ebixcash.com Post which we will be sharing the interview confirmation and time slots for attending the interview.","location":"Pune","experience":"1 - 6 Years"},{"date":"29 - Jun - 2019","skills":"Core Java, Data Structures, Multithreading, Concurrency, Collections, OOAD, Design Patterns","qualification":"B.E./B.Tech, MCA/PGDCA","address":"QuEST Global Engineering Services Pvt. Limited, 2nd Floor, Primrose 7B, Embassy Tech Village, Near New Horizon College, Devarabisanahalli, Outer Ring Road, Bellandur, Bengaluru - 560 103.","phone":"Not Provided","profile":"Core Java Developer \nQuEST Global Engineering Services Pvt. Limited","description":"Candidate should have 3+ years of experience in the design and development Java applications. Experience in REST Services and Spring framework. Experience in developing and deploying micro services. Extensive experience in Unit Testing and BDD. Must have Core Java with knowledge of Data Structures, Multithreading, Concurrency, Collections, OOAD, Design Patterns, SOA. Working experience with JavaScript/ JavaScript frameworks Job Responsibility: Responsible for programming a component, feature and or feature set. Works independently and contributes to the immediate team and work with Architects, PO and other team leads. Contributes to design discussions. Job Location: Bangalore Experience : 3 - 8 Years We are pleased to invite you for an Interview of the opportunities for Core Java developers. Please refer to the interview details below: Walk-in Date: 29 June, 2019 Time: 9.30 AM 2.00 PM Interview Venue: QuEST Global Engineering Services Pvt. Limited 2nd Floor, Primrose 7B, Embassy Tech Village, Near New Horizon College, Devarabisanahalli, Outer Ring Road, Bellandur, Bengaluru - 560 103. If you are interested for the said opportunity, kindly walk-in for an interview with your updated resume.","location":"Bangalore","experience":"3 - 8 Years"},{"date":"29 - Jun - 2019","skills":"JAVA/ C/ C++/ .NET/ OOPS Concept","qualification":"B.E./B.Tech","address":"Trident Information Systems Pvt. Limited, M-31 A, 'M'-Block Market, Greater Kailash Part -II, New Delhi - 110 048","phone":"011 2921 9927","profile":"IT Freshers (C/ C++, Java) \nTrident Information Systems Pvt. Limited","description":"Eligibility Cretria: BE/ B.Tech (IT/CS) - 2018-2019 Pass-outs Good knolwdge of JAVA/ C/ C++/ .NET/ OOPS Concept Should have good communication & presentation skills Throughout 65% in academics (Xth Standard till highest degree) Open to travel Can join immediately Candidate will be responsible for coding, testing, implementation and maintenance of ERP system built on Microsoft Dynamics Navision/ Axapta. Profile is into software development & customization not into IT Support The interview process would be as follows: 1) GD round (Communication round) 2) Written Test based on the technical skills required (C,C++ ,Java)_Offline 3) Technical Interview with the panel(For those shortlisted in the written test) 4) Managerial round (At our corporate office) Designation: Associate Technical Consultant Ctc Offered: 1.8 LPA 3LPA (Based on the Technical knowledge & interview process & feedback)","location":"Delhi","experience":"0 - 1 Years"},{"date":"29 - Jun - 2019","skills":"Core Java, Javascript, Maven, Jboss, J2EE","qualification":"B.E./B.Tech","address":"ASG World Wide Private Limited, 2-D, iLabs Centre, Plot # 18, Software Unit Layout, Madhapur, Hyderabad - 500 081","phone":"Not Provided","profile":"Senior Java Developer \nASG World Wide Private Limited","description":"Candidate should have 6+ years of experience in Core Java and J2EE technologies Advanced knowledge of application, data and infrastructure architecture disciplines Working proficiency in developmental toolsets Ability to collaborate with high-performing teams and individuals both in person and virtually Ability to communicate effectively with and to influence team members and external groups Ability to present formal and informal presentations in various settings; one-on-one, small and large groups, with peers, and senior management Walk-in Date/ Time: 29th June, 2019 from 9 AM onwards Interview Venue: ASG World Wide Private Limited, 2-D, iLabs Centre, Plot # 18, Software Unit Layout, Madhapur, Hyderabad - 500 081","location":"Hyderabad","experience":"6 - 9 Years"},{"date":"29 - Jun - 2019","skills":"Core Java, Data Structures and Algorithms, Collections","qualification":"B.E./B.Tech, MCA/PGDCA","address":"2ND FLOOR, NO.139/26, SOLITAIRE, AMARJYOTHI LAYOUT, KORAMANGALA INTERMEDIATE RING ROAD BANGALORE - 560 071","phone":"Not Provided","profile":"Core Java Developer \nSaggezza India Private Limited","description":"Were looking for a talented Java Developer to work with our clients in Bangalore. Candidate should have 3 to 11 years of application development experience in Core Java Programming. Experience with Data Structures and Algorithms, Collections, Every project will be different, but youll always be in charge of: Designing and developing solutions to our clients problems using Java frameworks. Partnering effectively with clients in-house project teams. Managing the projects entire lifecycle, from beginning to end. Walk-in Date/ Time: 29th June 2019, 11 AM Onwards VENUE: 2ND FLOOR, NO.139/26, SOLITAIRE, AMARJYOTHI LAYOUT, KORAMANGALA INTERMEDIATE RING ROAD BANGALORE - 560 071 Note: Candidates attending after 2 PM will be sent back.","location":"Bangalore","experience":"3 - 11 Years"},{"date":"28 - Jun - 2019","skills":"PHP/ MySQL, OOP Concept, Magento 2 and WordPress/ Woo Commerce","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Futurism House, Survey No. 105, Opp. Sadanand Resort, Mumbai-Bengaluru Bypass Highway, Baner, Pune, Maharashtra - 411 045","phone":"020-67120769","profile":"PHP Developer - Team Lead \nFuturism Technologies Pvt. Limited","description":"Strong and proved PHP/ MySQL Programming and OOP Concepts Experience in Magento 2 and WordPress/ Woo Commerce Must have: Experience in Magento 2 Please ignore if you do not have experience in Magento 2. Education: UG - A degree either in Computer Science/ Engineering PG A masters degree in Computer Science/ Engineering/ Applications (optional) Work Experience: 4 to 8 years Hands on experience in analyzing the business logic and converting to class designs. Candidate should have working knowledge of JavaScript, JQuery, Ajax, JSON. MySQL experience is a must. Hands on experience in writing SQL Queries, Triggers, Stored procedures and Functions. Should have worked in an n-tier environment. Experience in E-Commerce Domain. Job Location: Baner, Pune Working Days: Monday to Friday Shift time: 2:00 PM to 11:00 PM Walk-in Date: 26th to 28th June 2019 Time: 7 pm to 9 pm Interview Venue: Futurism House, Survey No. 105, Opp. Sadanand Resort, Mumbai-Bengaluru Bypass Highway, Baner, Pune, Maharashtra - 411 045 You can reach me at danishk@futurismtechnologies.com or call me on (020) 67120769 for any queries.","location":"Pune","experience":"4 - 8 Years"},{"date":"1 - Jul - 2019","skills":"Software Testing, Manual Testing","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"QA InfoTech, A-8 , Sector 68 , Noida","phone":"0120-6101814","profile":"QA Consultant - Manual Test Engineer \nPERSEVERANCE IT Solutions Pvt. Limited","description":"Qualification: BE in CS/ IT, BCA/ MCA, BE in EC, BSc in CS, B.Tech CS/ IT / ECE Only B.tech/MCA can apply - (2016 to 2019 Batch only) Work Experience: 0 to 1 Years MUST BE EXCELLENT COMMUNICATION SKILLS. Position Type: Contractual Position: Software Testing Engineer Joining- Immediate Monthly Pay: INR 12,000 for the first three months, INR 14,000 to INR 18,000 after completion of 3 months Holidays: one weekly off Interview Date: Monday, July 1st, 2019 Time: 10:00 AM to 12:00 PM Interview Venue: QA InfoTech A-8 , Sector 68 , Noida NOT ALLOWED AFTER 12:00 PM","location":"Noida","experience":"0 - 1 Years"},{"date":"29 - Jun - 2019","skills":".Net, Angular JS, SQL, MVC","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Indecomm Global Services, Maruthi Infotech Centre Block A ,4th floor, Inner Ring road Amarjyothi Layout(Next to EGL) Domlur, Bangalore","phone":"080-66960406","profile":".Net/ Software Engineer \nIndecomm Global Services India Pvt. Limited","description":"Indecomm Global Services India Pvt. Limited, is hiring .Net/ Software Engineer for Domlur, Bangalore location Required Skills- 2-4 years of Mandatory experience in Dot Net development Experience in working on projects related to Angular JS, SQL, MVC Interested candidates please walk in to the below mentioned address- Date: 29th June 2019, 2 PM onwards Indecomm Global Services Maruthi Infotech Centre Block A ,4th floor, Inner Ring road Amarjyothi Layout(Next to EGL) Domlur, Bangalore Also can share resumes to vidya.g@indecomm.net Contact no: 080-66960406 / 482 Contact Person - Vidya","location":"Bangalore","experience":"2 - 4 Years"},{"date":"29 - Jun - 2019","skills":"Winforms C# .Net C#.Net SQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Software Lab & Technical Support Center Anjaneya Techno Park, 1st Floor, 147, HAL Airport Road, Kodihalli, Bengaluru - 560 017","phone":"Not Provided","profile":"Software Developers (.Net) \nSheorey Digital Systems Limited","description":"Work Experience: 3 to 5 Years Preferably immediate to 15 days notice period Required Skills- C#, .Net SQL Windowns Applications Winforms Walk-in Date/ Time: 29th June 19 - 10:00am to 1:00pm Interview Venue: Software Lab & Technical Support Center Anjaneya Techno Park, 1st Floor, 147, HAL Airport Road, Kodihalli, Bengaluru - 560 017 Please carry a copy of your resume, passport size photo & aadhar copy","location":"Bangalore","experience":"3 - 5 Years"},{"date":"29 - Jun - 2019","skills":".NET 3.5 or above, ASP, ASP.NET, MVC, C#, JavaScript, JQuery","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Hilton garden-inn Trivandrum, Punnen Road, Statue, Palayam, Thiruvananthapuram, Kerala - 695 039","phone":"Not Provided","profile":".Net Developers \nBroadridge Financial Solutions (India) Pvt. Limited","description":"Education: BE / B.Tech / MCA or equivalent 2 - 8 years of experience in .NET technology with OOPS Expertise required in MS .NET 3.5 or above, ASP, ASP.NET, MVC, C#, JavaScript, JQuery Expertise in database related development (SPs, Views, Triggers etc.) of SQL server 2008/2012/2014 Should have thorough knowledge of SQL querying techniques, performance tuning, LINQ for SQL Experience in WCF, Web API, SSIS and Knockout JS, Angular JS, Multi-threaded/parallel programming, design patterns will be a plus Willingness to work in rotational shifts on the need basis Excellent communication and written skills Job Location: Bangalore Walk-In Dates: 29th June 2019 Time: 10:00 AM to 5:00 PM Walk-In Venue: Hilton garden-inn Trivandrum Punnen Road, Statue, Palayam, Thiruvananthapuram, Kerala - 695 039","location":"Trivandrum","experience":"2 - 8 Years"},{"date":"29, 30 - Jun - 2019","skills":"C# .NET, ASP .NET framework, SQL Server MVC, WCF","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Techwave Consulting Inc., Level 4, Buildig No. H6 Phoenix Avance Business Hub, Hitech City, Behind Dell Campus, Hyderabad - 500 081","phone":"040-66583513","profile":"Senior .Net Developer/ Lead \nTechwave Consulting India Pvt. Limited","description":"Role : Sr .Net Developer / Lead (5 positions) Experience : 8-12 years Job Location : Hyderabad Duration : Permanent Person should have 8 to 12 years of proven experience as a C# .NET Developer .Should have atleast 2 years of experience working as a lead. Extensive experience with the ASP .NET framework, SQL Server MVC, WCF Strong knowledge on .NET framework, HTML5/CSS3, jquery, JavaScript,LINQ Experience on design and implementation of API (Web API, REST, JSON, etc.) Excellent troubleshooting and communication skills Understanding of Agile methodologies is a plus Experience using Team Foundation Server (TFS) Experience in developing web applications on Microsoft Azure Cloud is a plus Walk-in Date/ Time: 29th - 30th June from 9 AM onwards Interview Venue: Techwave Consulting Inc., Level 4, Buildig No. H6 Phoenix Avance Business Hub, Hitech City, Behind Dell Campus, Hyderabad - 500 081","location":"Gurgaon","experience":"8 - 12 Years"},{"date":"29 - Jun - 2019","skills":"Microsoft SQL, C#, ASP .Net, MVC","qualification":"B.E./B.Tech, MCA/PGDCA","address":"OMD Solutions, 308, Atlanta Estate, Dr Ambedkar Chowk, Goregaon, Mumbai - 400 063","phone":"022-45405999","profile":"Software Developer (.Net) \nOMD Solutions","description":"Essential Skills- - Proficient in web development technologies : HTML, CSS, Java - Proficient in Microsoft SQL, C#, ASP .Net, MVC - Understanding of software version management and release - Understanding of unit testing and system testing of software - Team work Walk-in Date: 29th June 2019 Time: 10 AM Onwards Interview Venue: OMD Solutions 308, Atlanta Estate, Dr Ambedkar Chowk, Goregaon, Mumbai - 400 063","location":"Mumbai","experience":"2 - 3 Years"},{"date":"29 - Jun - 2019","skills":"C# .NET, ASP .NET, MVC, Web API, LINQ, ADO.NET / EF","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Hexaware Technologies Limited, SEZ, Plot No. 19, Rajiv Gandhi Infotech Park Phase III, MIDC, Hinjewadi, Pune - 411057","phone":"Not Provided","profile":".Net Professionals \nHexaware Technologies Limited","description":"Minimum 4 years working experience in jQuery with experience in C# .NET, ASP .NET, MVC, Web API, LINQ, ADO.NET / EF. Exposure to WCF / Angular 4 is a Plus Exposure to client and server side best practices Experienced on Agile/Scrum development Good knowledge on OOPS and Design patterns Good Communication skills. Technology: Asp .Net Experience: 4 - 12 Years Skills: MVC, WebAPI Notice Period: Immediate to 90 days Interested candidates please walk-in to the below venue- Interview date: 29th June 2019 Time: 9am to 2pm Venue: Hexaware Technologies Limited SEZ, Plot No. 19, Rajiv Gandhi Infotech Park Phase III, MIDC, Hinjewadi, Pune - 411057 Contact Person: Prethiba T","location":"Pune","experience":"4 - 12 Years"},{"date":"29 - Jun - 2019","skills":"MVC Framework, ASP .Net, C#, N-Tier Architecture, Javascript JQuery, Ajax","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Burgeon Software Private Limited, 2nd floor D 247/1, Sector 63 Noida - 201 301","phone":"0120-4508685","profile":".Net Programmer \nBurgeon Software Private Limited","description":"We are seeking and exceptional .Net developer to build software using languages and technologies in the .NET framework. You will create applications from scratch, configure existing systems and provide user support. Technical Skills: MVC Framework (MANDATORY) ASP .Net with C# (MANDATORY) N-Tier Architecture (MANDATORY) Javascript JQuery, Ajax Good in writing SQL Queries, Store Procedures, Views, Functions, Joins (inner/ outer/ left/ right) Worked on shopping carts, payment gateways and CMS sites Added advantage: WCF Service, angular js, vb.net Other Skills Required: Strong analytical thinking Communication skills Ability to understand assigned projects and work with minimal supervisor guidance Plus Skills (Optional) Basic English speaking and/or understanding Qualification: BCA/ MCA/ B.Tech in Computer Science/IT, related field Experience: 1.5-3 years Job Location: Noida","location":"Noida","experience":"1 - 3 Years"},{"date":"29 - Jun - 2019","skills":"Manual Testing, Test Engineering, Test Scripts, Software Testing, Automation Testing, Writing test cases","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"PLOT NO 6 DEVELOPED PLOTS ELECTRICAL, AND ELECTRONIC KHIVRAJ MOTORS OFFICE, COMPLEX RAJEEV GANDHI IT HIGHWAY PERUNGUDI Chennai Tamil Nadu - 600 096","phone":"43201092","profile":"Software Testing Engineer \nAigilx Health Technologies Private Limited","description":"Candidate should have 0 to 2 years of experience in Manual Testing, Test Engineering, Test Scripts, Software Testing, Automation Testing, Writing test cases, Test case creation & Testing concepts. Roles & Responsibilities: Responsible for understanding API functionality, work flow, writing Testcases(TCs) using Test Framework, Reviewing the TCs and execution of TCs for the application made in Angular 5, Node.JS Responsible for Test Automation of web pages, web services or servers which involves automating web user scenarios/TCs, Writing Test Scripts for regression/stress test, TCs review and TCs execution Initiative to propose ideas / improvements in tools/process Walk-in Date/ Time: 29th June 2019, 10 AM Onwards Interview Venue: PLOT NO 6 DEVELOPED PLOTS ELECTRICAL, AND ELECTRONIC KHIVRAJ MOTORS OFFICE, COMPLEX RAJEEV GANDHI IT HIGHWAY PERUNGUDI Chennai Tamil Nadu - 600 096","location":"Chennai","experience":"0 - 2 Years"},{"date":"1, 2, 3, 4, 5 - Jul - 2019","skills":"Back Office Assistance, General Administration","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Matrix Business Services India Pvt. Limited, 3rd Floor, E 14B, Sector 8, Noida, 201 301","phone":"9953404600","profile":"Back Office Executive \nMatrix Business Services India Pvt. Limited","description":"We are currently looking for candidates for the position of Back Office Executive/ Sr Executive for Background verification process based at Noida Location. Key Requirements: a) Any UG/ PG Fresher/ 1 - 3 years experience in any backend operations b) Good communication and interpersonal skills c) Good team player d) Good in typing e) CTC (15K to 17K)Based on the candidates potential G) Only day shift no night shift If you are interested you can walk in to our below address on weekdays between 10 am to 3pm Matrix Business Services India Pvt. Limited 3rd Floor, E 14B, Sector 8, Noida, 201 301 Contact Person : Ms.Kamiya (9953404600)","location":"Noida","experience":"0 - 3 Years"},{"date":"29 - Jun - 2019","skills":"HR Administration, Payroll Processing, Office Administration / Facility Management","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Capita India Private Limited, Godrej & Boyce, Gate No 2, Plant No. 6, LBS Marg, Opp Vikhroli Bus Depot, Vikhroli (West), MUMBAI - 400 079","phone":"Not Provided","profile":"HR/ Operations Executive \nCapita India Private Limited","description":"Capita India Private Limited is hiring for HR Operations (Payroll and Administration) roles for UK process - Candidates with excellent communications can apply Academic: Graduation (in any discipline) Professional Know-how Primary Responsibilities- Data Entry and Validation of multiple fields on SAP and ORN Calculate pay (Statutory, Occupational, etc) basis T&C of the line of business. To deliver the highest quality HR/ Payroll query resolution and administration service Respond to queries logged by employees within 72 hours of the enquiry being logged on CRM. Calculate pay (Statutory, Occupational, etc) basis T&C of the line of business. Prepare, calculate and raise CHAPS & BACS payments where required. Walk-in Date/ Time: 29th June 2109, 10 AM Onwards Interview Venue: Capita India Private Limited Godrej & Boyce, Gate No 2, Plant No. 6, LBS Marg, Opp Vikhroli Bus Depot, Vikhroli (West), MUMBAI - 400 079","location":"Mumbai","experience":"0 - 4 Years"},{"date":"2, 3, 4 - Jul - 2019","skills":"HR Assistance Front Office Management Hotel Management","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Sodexo Food Solutions India Pvt. Limited, B-21, Sector 58, Noida","phone":"9818396658","profile":"Office Executive/ HR Assistant \nSodexo Food Solutions India Pvt. Limited","description":"Sodexo is looking for smart Hospitality Professionals for it's renowned site. Looking for Smart Hospitality Professionals with work experience of 4 & 5 Star Indian and International Hotel Groups. Hiring for Multiple vacancies- *Operation Manager (Housekeeping Background) * Executive Housekeeper (Only Female) * Front Office Manager (Only Female) *Assistant Front Office Manager * HR Assistant * Front Office Executive (Only Females) * Butler * Housekeeping Supervisor 02 positions * Housekeeping Associate 11 positions * Stewards *Bell Boy * Bell Captain *Office Executive *QHSE Executive Apart from relevant experience candidates with Hotel Management Degree will be highly preferred. Remuneration will be best in industry, apart from salary company will be providing food & accommodation. Walk In On 2nd, 3th & 4th July 2019 Time- 11:00 am to 06:00 pm Interview Venue- Sodexo Food Solutions India Pvt. Limited B-21, Sector 58, Noida Interested candidates kindly share your resume at disha.bharadwaj@sodexo.com Or connect at 9818396658","location":"Noida","experience":"1 - 3 Years"},{"date":"29 - Jun - 2019","skills":"PHP, MVC frameworks like Laravel, Symphony, YII etc.","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Hetero Healthcare Limited, Melange Towers 4th Floor, C-Wing Patrikanagar, Madhapur Hyderabad","phone":"Not Provided","profile":"Full Stack/ PHP Developer \nHetero Healthcare Limited","description":"Experience in PHP and PHP based MVC frameworks like Laravel, symphony, YII etc. Proficient in MySQL, proficient with database design, optimization and tuning in MySQL. Expertise in versioning control, preferably GIT. Strong knowledge of Linux Walk-in Date/ Time: 29th June from 2 PM onwards Interview Venue: Hetero Healthcare Limited Melange Towers 4th Floor, C-Wing Patrikanagar, Madhapur Hyderabad","location":"Hyderabad","experience":"2 - 6 Years"},{"date":"28, 29 - Jun - 2019","skills":"Java, Spring, Hibernate, J2Ee, Struts, EJB","qualification":"B.E./B.Tech, MCA/PGDCA","address":"The Lalit New Delhi - Barakhamba Avenue, Connaught Place, New Delhi - 110 001","phone":"Not Provided","profile":"Java Developers \nBroadridge Financial Solutions (India) Pvt. Limited","description":"Educational Qualification: BE / B.Tech / MCA or Equivalent Work Experience: 3 to 7 years in JAVA/ J2EE Job Location: Bangalore Must have strong knowledge on Software best practices (Object-Oriented design, Patterns, Algorithms, Data Structures). JBoss Application Server, Apache Web Server (familiar with different modules of Apache including rewrite rules), J2EE and Struts1.x and higher HTTP Client 3.x and higher, HTML, JavaScript and CSS Struts, EJB, Web services, AJAX, JPA, Hibernate, Spring, consuming and hosting Jax Web Services Relational Database Operations (Sybase, Oracle, MSSQL or MySQL Must be Open to work in shifts Walk-In dates: 28th & 29th June 2019 Time: 10:00 AM to 5:00 PM Walk-In Venue: The Lalit New Delhi - Barakhamba Avenue, Connaught Place, New Delhi - 110 001","location":"Delhi","experience":"3 - 7 Years"},{"date":"29 - Jun - 2019","skills":"Desktop Support, Windows Installation, Troubleshooting/ Configuration, L1 Support","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Altran (Aricent) Technology, Vector Block, Prestige Tech Park III Kadubesanahalli, Outer Ring Road, Belland, Bengaluru - 560 103","phone":"080-41067863","profile":"Automation Testing Engineer \nAltran Technologies India Private Limited","description":"Altran Technologies India Private Limited, is organizing mega Walk-in Drive for Python/ Automation Testing Engineer Work Experience- 3+Years Mandatory Skills: o Strong knowledge of programming languages: python with Monte Carlo simulation, shell scripts o Very good knowledge of embedded software development, and ability to interact with firmware developpers to get issues solved quickly o Ability to develop, review, execute, and debug FW tests o Significant experience in embedded firmware test development o Significant experience in the usage of automated test platforms o Experience in NFC testing and/or standards o Ability of improving processes, especially test processes, toward speed and quality o High level of commitment o Structured and analytical thinking o Willing to work cross sites in a multicultural context. o Ability to travel abroad for short period of time, on short notice Date of Interview 29th June 2019 Time- 09:30 AM to 1 PM (After 1 pm will be not allowed ) Interview Venue: Altran (Aricent) Technology, Vector Block, Prestige Tech Park III Kadubesanahalli, Outer Ring Road, Belland, Bengaluru - 560 103 Contact Person: Rinisha G B Note: There will be only Python Test conducted on Saturday, shortlisted engineers will be called for Tcon/ F2F interview on Weekdays","location":"Bangalore","experience":"3 - 6 Years"},{"date":"29 - Jun - 2019","skills":"PHP Web Development Web Technologies Database","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Rooster Properties Private Limited, E-59, 1st Main, Manyata Residency, Manyata Tech Park, Nagawara, Bangalore - 560 045","phone":"Not Provided","profile":"Web/ Php Developer \nRooster Properties Private Limited","description":"*Programming with PHP and related Frameworks. * Candidate should be aware of building creative web pages. * Proficient understanding of code. * Understanding Database concepts and commands. * Able to customize the web pages. Walk-in Date/ Time: 29th June - 6th July , 11 AM onwards Interview Venue: Rooster Properties Private Limited E-59, 1st Main, Manyata Residency, Manyata Tech Park, Nagawara, Bangalore - 560 045 Walk in Allowed only on 29/06/2019 and 06/07/2019","location":"Bangalore","experience":"1 - 3 Years"},{"date":"1, 2, 3 - Jul - 2019","skills":"Technical Support, Customer Service, International Voice Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Vodafone House, Building B, Ground Floor, Corporate Road, Off. S. G. Highway, Prahllad Nagar, Ahmedabad - 380 051","phone":"Not Provided","profile":"Technical Support (Voice Process) \nVodafone India Services Private Limited","description":"Candidate should be Any Graduate with excellent communication skills Must have willingness to work in 24*7 environment Job Responsibility- Rotational Shifts Voice Process Customer Service International Call Center International Voice Process Walk-in Date/ Time: 1st - 3rd July 2109, 10 AM onwards Interview Venue: Vodafone House, Building B, Ground Floor, Corporate Road, Off. S. G. Highway, Prahllad Nagar, Ahmedabad - 380 051","location":"Ahmedabad","experience":"0 - 5 Years"},{"date":"28 - Jun - 2019","skills":"C, C++, Basic of JAVA , PHP or .NET","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Choice TechLab Solutions Pvt. Limited, 1001, Sumer Plaza, Opposite Tirupati Hotel, Marol Maroshi Road, Andheri East, Mumbai - 400 059.","phone":"9322432424","profile":"Trainee Developer (JAVA/ PHP/ .NET) \nChoice TechLab Solutions Pvt. Limited","description":"Choice TechLab Solutions Pvt. Limited is having multiple job opportunity for Freshers. Related Technologies: C, C++, Basic of JAVA , PHP or .NET Qualifications: B.E/ B.Tech / B.Sc. (IT)/ M.Tech/ BCA/ MCA (Any computer graduate or relevant diploma holder) 60% aggregate in graduation Certified application developer is a plus. Behavioral Competencies Quick Learner Good Communication Professional Approach to Challenges Innovative Thinking Technology - Dot Net, Ionic, Android, iOS, Node JS, HTML. Kindly note that the technology will be decided after 1 month of training given by us. Walk-in Interview on 28th June, 2019 (Friday) at 11.30am on the below mentioned address. Address: Choice TechLab Solutions Pvt. Limited 1001, Sumer Plaza, Opposite Tirupati Hotel, Marol Maroshi Road, Andheri East, Mumbai - 400 059. Contact Person: Manoj- 9322432424 You are requested to come prepared with Database and logical questions.","location":"Mumbai","experience":"0 - 1 Years"},{"date":"27, 28, 29 - Jun - 2019","skills":"PHP, OOPS, MVC, Laravel, MySQL, jQuery, AJAX, JSON, JavaScript, HTML5","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Maiwand Technologix Private Limited, ELCOSEZ, 4th floor, Tidel Park Coimbatore Limited, Villankurichi Road, Aerodrome Post, Coimbatore - 641 014","phone":"9894025103","profile":"PHP Developers \nMaiwand Technologix Private Limited","description":"Hands on experience in any PHP framework like Laravel or codeigniter Strong exposure in Core PHP and developing secure web applications Project Management, Agile Development and AWS are added skills Should have knowledge in skills like PHP, OOPS, MVC, Laravel, MySQL, jQuery, AJAX, JSON, JavaScript, HTML5, CSS3, Web Services/REST API, Linux Environment (Linux, Apache, MySQL, PHP), Git Good experience in web services (REST full APIs) creations. Problem solving skills and a proactive working style. Walk-in Date/ Time: 27th - 29th June , 10 AM onwards Interview Venue: Maiwand Technologix Private Limited ELCOSEZ, 4th floor, Tidel Park Coimbatore Limited, Villankurichi Road, Aerodrome Post, Coimbatore - 641 014","location":"Coimbatore","experience":"3 - 7 Years"},{"date":"27, 28, 29 - Jun - 2019","skills":"PHP & Wordpress","qualification":"B.E./B.Tech, MCA/PGDCA","address":"QuantumLeap HR, #30, 1st Floor, 2nd Cross Nanjappa Reddy Layout Opp to Koramangala Passport Office Koramangala, Bangalore - 560 095","phone":"7829230108","profile":"Php Wordpress Developer \nQuantumLeap HR","description":"We are looking for candidates with experience in PHP & Wordpress with min of 3 years of experience for one of our reputed clients Interested candidates can walk-in to our location from 27th June - 15th July , 9 AM onwards Address QuantumLeap HR #30, 1st Floor, 2nd Cross Nanjappa Reddy Layout Opp to Koramangala Passport Office Koramangala, Bangalore - 560 095 Contact Person: Aman/ 7829230108 Zabi / 9108336679","location":"Bangalore","experience":"3 - 5 Years"},{"date":"1 - Jul - 2019","skills":"VBA VBA Developer Macros MIS Reporting MIS Development Data Analysis","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Info Edge India Limited, B-36, 6 Floor, ETT Towers, Tower-2, Sector-132, Noida Opposite to JBM School","phone":"Not Provided","profile":"Software Engineers (VBA/ PHP) \nInfo Edge India Limited","description":"Role involves VBA / PHP developments, PHP/ Python based Web Crawling, System Automations, MIS and Data mining. Key Responsibility Areas: Develop automated systems through VBA / PHP / Python Manage and optimize existing crawlers and PMS Data Mining / Lead Management Scrub daily data against DNC and other relevant databases to fetch relevant dataset. Fetch data to allocation MISs / interfaces Requirements: Technical Graduate / MCA Excellent Knowledge of Excel and Functions Excellent Knowledge of Writing Macros Excellent Knowledge of Classes and HTML 1-3 years of Experience in BPO or Backoffice. Interested candidates should walk-in on 1st July at 10 am at the below mention address- Info Edge India Limited B-36, 6 Floor, ETT Towers, Tower-2, Sector-132, Noida Opposite to JBM School Contact Person: Mehak Goel","location":"Noida","experience":"1 - 3 Years"},{"date":"29 - Jun - 2019","skills":"HR/ Administration, Recruitment, Marketing, Real Estate, Front Desk","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"EliteEvince Technologies, A 713, Dev Aurum Commercial, Deer Circle, Anand nagar Road, Prahllad Nagar, Ahmedabad - 380 015","phone":"Not Provided","profile":"Senior PHP Developer \nEliteEvince Technologies","description":"Urgent opening for Sr. PHP Developer Required Experience: 3 to 5 Years Job Location: Ahmedabad Responsibilities & Duties- * Must have expertise in PHP Web based solutions * Should have good communication skills * Write well designed, testable, and efficient code Skills and Qualifications- * Core PHP, MVC, Wordpress knowledge is must * HTML, CSS, jQuery is must * Database: MySQL * CodeIgniter / Laravel will be plus * AngularJS will be plus Benefits- * Professional Development * Friendly Environment * 5 Days Working Walk-in Date/ Time: 29th June 2019, 10 AM onwards Interview Venue: EliteEvince Technologies A 713, Dev Aurum Commercial, Deer Circle, Anand nagar Road, Prahllad Nagar, Ahmedabad - 380 015","location":"Ahmedabad","experience":"2 - 5 Years"},{"date":"29 - Jun - 2019","skills":"General Administration, Back Office Activities, Facility Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Bharat Institute of Engineering & Technology (BIET) Mangalpally (V), Ibrahimpatnam (M) Hyderabad - 501510","phone":"Not Provided","profile":"Back Office Assistant \nBharat Institutions - Division of Chinta Reddy","description":"Qualification: Any Degree Age: 21-35 Years Experience: 0 to 8 Years Freshers Can apply Required Skills- Should have good Communication skills. Should be well versed with MS word and MS Excel. Should be proficient in typing. Screening phone calls, emails, letters and personal visits. Ability to communicate effectively in English, both orally and in writing. Knowledge & able to perform the office related activities. Salary: 8,000/- to 15,000/- Job Locations: 1. Bharat Institute of Engineering & Technology (BIET) Mangalpally (V), Ibrahimpatnam (M) Hyderabad - 501510, Telengana State. 2. Bharat Institute for Degree & PG college for Women Address: 3-4-781,Opposite Tourist Hotel, Kachiguda Station Rd, Barkatpura, Kachiguda, Hyderabad, Telangana - 500 027 For further details: www.biet.ac.in Interested candidates can send your resume to mbapgrec@gmail.com Please bring your updated resume with one passport size photo for Interview. Note: 1) The selected candidates should execute an Service Agreement for Min 1 year. 2) Academic Original Certificates submission is mandatory; for which an Acknowledgment receipt will be issued. Candidates who have attended Interview in last 6 months need not to Apply.","location":"Hyderabad","experience":"0 - 8 Years"},{"date":"26 - Jun - 2019","skills":"HR Administration, Recruitment, Joining Formalities/ Exit Formalities, Office Administration","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Nuctech India Private Limited (Formerly Known as Nucetech Security Solutions Pvt. Limited), 505/ 506, 5th Floor, Palm Spring Plaza, Sector 54, Golf Course Road, Gurugram, Haryana - 122 003.","phone":"9899609400","profile":"Asst. Manager - HR & Admin \nNuctech India Private Limited","description":"Candidate should be Any Graduate/ MBA (HR) with 2 to 5 years of strong experience in HR Administration, Recruitment, Joining Formalities/ Exit Formalities, Office Administration. Must have excellent communication skills. Job Responsbility- Handling profile of front desk executive. Update the employee records in the master sheet. Take care of the in-house recruitment. Follow end to end recruitment process. Taking care of new joiners joining, exit formalities and Full and Final Settlement. Explaining Sales Travel Policy, HR Policy and Organization Structure to New Joiners. Issues of Offer Letter & Explain the CTC Break up. Managing advance Salary & Preparation of Different Reports. Handling Induction. handling petty cash. Maintain records of new employees to track status of joining formalities & also checked background verifications of employees before the date of joining Supervise and manage Day to Day office administrative activities. Walk-in Date/ Time: 26th June 2019, 9 AM onwards Interview Venue: Nuctech India Private Limited (Formerly Known as Nucetech Security Solutions Pvt. Limited) 505/506, 5th Floor, Palm Spring Plaza, Sector 54, Golf Course Road, Gurugram, Haryana - 122 003.","location":"Bangalore","experience":"2 - 5 Years"},{"date":"27 - Jun - 2019","skills":"Manual Testing Integration Testing Regression Testing Web Services Testing System Testing","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Techila Global Services Private Limited, 601, 602 6th Floor, P 3 Pentagon, Magarpatta City, Hadapsar, Pune, Maharashtra - 411 013","phone":"020844608402","profile":"Junior Testing Engineer \nTechila Global Services Pvt. Limited","description":"Minimum 6 months to 1 year experience is a must. Immediate joiners preferred. Candidate should have already been trained on Manual, Performance and Selenium, Webservices Testing. Responsibilities- Preparation of test cases. Update existing test case in the Manual test suite. Collect and create test data for functional and non-functional testing. Run functional and non-functional tests Excellent in regression testing, integration testing, system testing. Knowledge on Testing Concepts and Scripting Languages Responsible for Test Plans, Analyze Functional Requirements, Writing Manual Test Scripts, Mining test data & Execute manual test scripts. Follow best QA practices/design techniques for creating/updating test cases. Walk-in Date/ Time: 27th June 2019, 3 PM onwards Interview Venue: Techila Global Services Private Limited 601, 602 6th Floor, P 3 Pentagon, Magarpatta City, Hadapsar, Pune, Maharashtra - 411 013","location":"Pune","experience":"0 - 1 Years"},{"date":"29 - Jun - 2019","skills":"Manual Testing/ Fresher","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"QualityKiosk Technologies Pvt. Limited, A Wing - 419, Rupa Solitaire, Millennium Business Park, Mahape, Navi Mumbai - 400 709","phone":"Not Provided","profile":"Manual Tester/ Freshers \nQualityKiosk Technologies Pvt. Limited","description":"Qualification: BE/ B.Tech/ MCA/ B.Sc/ BCA/ M.Sc/ M.Tech Passing Year- 2017 or 2018 (Education gap not more than 1 Year) Percentage Criteria- 2 academics 60%+ AND 1 academic 55%-60% Required Skills- Java knowledge added advantage Should be willing to work in Manual Testing Open to travel anywhere in Mumbai (Western, Central, Navi Mumbai) Candidates are requested to be prepared on manual testing before coming for the interview Good Analytical approach & Logical reasoning skills Good Communication Skills 2 year bond required Walk-in Date: 29 June 2019- Saturday Time: 11:00 A.M till 2:00 P.M Venue Details: QualityKiosk Technologies Pvt. Limited A Wing - 419, Rupa Solitaire, Millennium Business Park, Mahape, Navi Mumbai - 400 709 (Directions: next to Mastek, take a right from the main entrance) Lift Number 24 & 25 Contact Person: Mausimi Sardar/Leena Bhor Please Note:- Should have completed or pursuing course in Manual Testing & Flexible to travel anywhere in Mumbai","location":"Mumbai","experience":"0 - 1 Years"},{"date":"27, 28 - Jun - 2019","skills":"General Administration, Facilities/ Maintenance, Team Management, Security Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Concentrix Daksh Services India Pvt. Limited, 1st Floor, D4, Manyata Embassy Business Park, Nagawara Outer Ring Road Bangalore, Karnataka - 560 045","phone":"7686839463","profile":"Facilities/ Admin Executive \nConcentrix Daksh Services India Pvt. Limited","description":"Walk-in drive for Facilities Admin, Team Lead experience with our organisation on Thursday and Friday (27th and 28th June 2019) Qualification: Degree/ Diploma Holder 3 Years Work Experience: 3 - 5 Years Location: Bengaluru (Hebbal) Key Skills & Knowledge: Analytical skills - To understand and apply research and statistics in decision-making Critical Thinking Using logic and reasoning to identify the strengths and weaknesses of alternative solutions, conclusions or approaches to problems Organizational skills Role & Responsibility- The candidate required to handle facility operation, Cafeteria and security management, Site Engineering, Project Management. Responsible for general maintenance of plumbing, Carpentry and electrical equipments. Plan and manage facility central services such as reception, security, medical staff, cleaning, catering, waste disposal and parking Maintenance and facility operations Managing resources including budget, staff, contractors & procurement functions. Safety inspections: ensure compliance with health and safety standards and industry codes. Asset Management. Walk-in Date: 27th - 28th June 2019 Time- 11 AM-3 PM Interview Venue: Concentrix Daksh Services India Pvt. Limited 1st Floor, D4, Manyata Embassy Business Park, Nagawara Outer Ring Road Bangalore, Karnataka - 560 045 Interested candidates may directly walk-in at the mentioned venue","location":"Bangalore","experience":"3 - 5 Years"},{"date":"26, 27, 28 - Jun - 2019","skills":".NET, ASP .NET, C#, MVC and SQL Server","qualification":"B.E./B.Tech","address":"Halcyon Technologies Private Limited, Plot No 56/8, 2nd Floor, Power Mech Infra Building, Jubilee Enclave Road, Opp to HITEX Arch Road, Madhapur, Hyderabad, Telangana - 500 081.","phone":"040-23115591","profile":".Net Developer/ Fresher \nHalcyon Technologies Private Limited","description":"Halcyon Technologies Private Limited, is looking for .NET Developer to join its close-knit and extremely talented technical team. We're looking for people who are ambitious about building a quality service. Candidate should be B.Tech (2018/ 2019 Pass outs only) with good knowledge on .NET, ASP .NET, C#, MVC and SQL Server. Subject knowledge on MVC is Must. Should have good communication skills. Willing to join on immediate Basis. Interested candidates can Walk inn at the venue below- Walk-in Drive on 26th / 27th / 28th June 2019 Timings : Wednesday to Friday 10:00 am to 4:30 pm Interview Venue: Halcyon Technologies Private Limited Plot No 56/8, 2nd Floor, Power Mech Infra Building, Jubilee Enclave Road, Opp to HITEX Arch Road, Madhapur, Hyderabad, Telangana - 500 081.","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"29 - Jun - 2019","skills":"ASP .Net, ASP .NET","qualification":"B.E./B.Tech, MCA/PGDCA","address":"HCL Technologies Limited, (AMB-4), 94, South Phase, Ambattur Industrial Estate Rd, Ambattur, Chennai - 600058. Landmark: Near Vaavin Bus Stop","phone":"Not Provided","profile":"ASP .NET Developer \nHCL Technologies Limited","description":"HCL Technologies Limited, Chennai, is looking for candidates who satisfy the criteria given below: Skill Set Required: 1. Excellent Knowledge of ASP .NET 2. Good at MS-Excel Qualification: BE / BTech / MCA Experience Required: 1 to 5 years Work Location: Chennai WALK-IN VENUE: HCL Technologies Limited, (AMB-4), 94, South Phase, Ambattur Industrial Estate Rd, Ambattur, Chennai - 600058 Landmark: Near Vaavin Bus Stop WALK-IN DATE: 29th June 2019 (Saturday) TIME: 11 AM To 5 PM Rounds of Interview: Written & Online Test and Interview Contact Person : Hemamalini / Sangeetha / Kiruba CANDIDATES MUST BRING THE FOLLOWING DOCUMENTS: 1. Resume 2. Naukri Invite Letter 3. Government ID Proof","location":"Chennai","experience":"1 - 5 Years"},{"date":"28 - Jun - 2019","skills":"Technical Support, International Voice Process, Troubleshooting","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Dell International Services India Pvt. Limited, Vipul Tech Square, Sector - 43, Gurgaon - 122002 Near Sector 42-43 Rapid Metro Station","phone":"Not Provided","profile":"Technical Support Associate \nDell International Services India Pvt. Limited","description":"Educational Qualifications: Any Graduate with 0-2 year of relevant work experience required Undergrad with 1 year of relevant work experience required Should be willing to work in shifts in a 24 x7 work environment Should be residing within Transport Boundaries Excellent telephone soft skills, thorough telephone functional skills & email etiquettes Excellent spoken and written English Ability to handle stressful situations. Goal/ Career oriented and self-motivated Essential Requirements : Fluent communication & Time management skills Knowledge of job associated database, software and documentation Results driven with Problem-solving skills Strong technical aptitude and troubleshooting skills Benefits: We offer highly competitive salaries, bonus programs, world-class benefits, and unparalleled growth and development opportunities all to create a compelling and rewarding work environment. Interview Date : 28th June 2019 Timings : 12:00 pm to 3:00 pm Interview Venue: Dell International Services India Pvt. Limited Vipul Tech Square, Sector - 43, Gurgaon - 122002 Near Sector 42-43 Rapid Metro Station *Note - Please carry a resume & valid Govt. ID proof","location":"Gurgaon","experience":"0 - 2 Years"},{"date":"27, 28 - Jun - 2019","skills":"Customer Service, Blended Process, Semi Voice Technical Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech, B.A., B.Com, B.B.A, B.Sc","address":"HCL Technologies Limited, A 22, Sector 60, Noida","phone":"Not Provided","profile":"Customer Support (Blended Process) \nHCL Technologies Limited","description":"Education Qualification: Any Graduate Technical/ Non-Technical Work Experience: 1 - 4 Years Shifts: Fixed night shifts only Skill Set Required- Industry benchmark customer service skills required candidates are provided with strong opportunities to influence customer opinion and direction. Demonstrated ability to utilize MS Office software to document issues/ concerns/ and areas of opportunity for effective communication. Advanced oral and written communication standards in the English language. Roles & Responsibilities- Monitor and balance call activity and workload of Service Providers (SP) using Service Edge and Siebel software Identify & communicate barriers that impede Service Provider workload optimization and effective call queue management. Collaborate with field management to resolve or overcome these barriers Identify, assign, and monitor successful completion of calls, Walk-in Date: 27th & 28th June 2019 Time: 12 to 4 PM Interview Venue: HCL Technologies Limited A 22, Sector 60, Noida Contact Person: Ankit/ Niharika","location":"Noida","experience":"1 - 4 Years"},{"date":"30 - Jun - 2019","skills":"Service Desk/ Technical Support (Voice Process)","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Rajagiri College of Management and Applied Sciences, Rajagiri Valley Road, Rajagiri Valley, Kakkanad, Kochi","phone":"Not Provided","profile":"Technical Support/ Service Desk \nAllianz Technology SE","description":"Candidate should be Any Graduate with 0 to 3 years of experience in Service Desk/ Technical Support (Voice) Technical Skills- Excellent written and verbal communication skills Provision of remote desktop support to all customers IT Support of all office, overseas and home based customers who use a broad variety of mainstream and bespoke applications on Windows 10, Windows 7 operating system Delivery of excellent customer service Support of Home Workers with experience of home routers/modems Call, Incident, Request and Desktop Management through logging, escalation and resolution using Service Now and remote support tools Raising accurate tickets In the CRM Tool (Service Now) Maintenance of 75% first line fix rate Assignment of calls/ requests/ incidents to internal and external support teams where calls cannot be fixed by the Service Desk Incident management encompassing incidents assigned to other support teams Setting customer expectation by allocating an appropriate priority to an incident Walk-in Date: 30th June 2019, Sunday Time: 9.30 AM to 2 PM Interview Venue: Rajagiri College of Management and Applied Sciences, Rajagiri Valley Road, Rajagiri Valley, Kakkanad, Kochi","location":"Kochi","experience":"0 - 3 Years"},{"date":"29 - Jun - 2019","skills":"Technical Support, Application Support, Incident Management","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"MphRx Plot-115, Sector-44, Gurugram Nearest metro-Huda city center","phone":"Not Provided","profile":"Technical Support Engineer \nMy Personal Health Record Express (India) Pvt. Limited","description":"Candidate should be Any Graduate with good knowledge of Unix operating system, MySQL queries, monitoring/management systems, troubleshooting & support for customer escalation & incident tickets. Have worked closely with Client related issues, answer calls & support them for technical issues. Only Male Candidates need to apply Walk-in Date/ Time: 29th June 2019, 9 AM onwards Interview Venue: MphRx Plot-115, Sector-44, Gurugram Nearest metro-Huda city center","location":"Gurgaon","experience":"0 - 4 Years"},{"date":"26, 27, 28 - Jun - 2019","skills":"PL/ SQL, Procedure Debugging, Extract build, Datafixes","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Datamatics Global Services Limited, Knowledge Centre, Plot No. 58, Street No. 17, Near Akruti Trade Center, Opposite to Ranbaxy Laboratory MIDC, Andheri (East), Mumbai - 400 093","phone":"Not Provided","profile":"Technical Support - Freshers \nDatamatics Global Services Limited","description":"Education Qualification: BSc-IT/ CS, BCA, BE/ B.Tech -IT/CS, MSc- IT/CS or MCA 2018, 2019 Passed out (2019 Pass out without any KT) Technology Skills: PL/ SQL, Procedure Debugging, Extract build, Datafixes (DML statement), LINUX/ UNIX Job Responsibility: Regular client communication via ticketing system and calls. Organize, schedule and liaise with the Development and QA teams Provide timely responses and resolutions as per the SLA Prioritize work based on client and business needs Document and maintain records of customer interactions, transactions, comments and complaints Maintain good service understanding to resolve customer queries Availability as per project requirements Shift Timings: Rotational shifts (including night shift) Note: Only male candidates required Interview Date: 26th - 28th June 2019 Time: 11am - 2 pm Interview Venue: Datamatics Global Services Limited Knowledge Centre, Plot No. 58, Street No. 17, Near Akruti Trade Center, Opposite to Ranbaxy Laboratory MIDC, Andheri (East), Mumbai - 400 093 Contact Person: Neha Vora","location":"Mumbai","experience":"0 - 1 Years"},{"date":"27, 28 - Jun - 2019","skills":"Technical Support, Voice Process, Customer Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Tech Mahindra Limited, A20 (Basement) Sector 60 Noida","phone":"9568145170","profile":"Technical/ Customer Support (Voice) \nTech Mahindra Limited","description":"Eligibility Criteria: Any Graduates Freshers and Experienced Can Apply Should be Impeccable in Communication Skills Should be flexible to work with 24/7 shifts (Rotational shifts) Basic knowledge on customer service/ Trouble shooting of PCs and Laptops. Candidate should be aware of basic technical knowledge in LAN, WAN and handling basic Internet issues. Troubleshooting of technical related issues and ensure to resolve the issues or queries over the call. Research, diagnose, troubleshoot and identify solutions to resolve customer issues Candidate should be flexible to work in 24*7 environments (Rotational Shift), comfortable to work in night shifts. 5 days working. Transportation Facilities: Both way Interview Date : 27th to 29th Jun 2019 Timing : 11 AM - 5 PM Venue Details : Tech Mahindra Limited, A20 (Basement) Sector 60 Noida Documents required for walk-in: Copy of CV Original ID proof (Aadhaar - Mandate) Contact Person: Prachi Tiwari","location":"Noida","experience":"0 - 5 Years"}]}