{"Walkins":[{"date":"21, 23, 24, 25 - Mar - 2020","skills":"Android SDK, Java, OOPs & Design Patterns, Eclipse","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Tekege Solutions Private Limited, 128 B, Second Floor, Shahpur Jat, New Delhi - 110 049","phone":"8287854151","profile":"Android Developer \nTekege Solutions Private Limited","description":"Candidate should have experience in Java, OOPs & Design Patterns, Eclipse Strong knowledge of Android SDK, different versions of Android & how to deal with different screen sizes Understanding of Algorithms and Data Structures Excellent logical and problem-solving skills Job Responsibility- Writing innovative Android applications for business analytics. Full cycle of Android application development & release. Collaborate with cross-functional teams to define, design & ship new features Core, hands-on development work on live projects Walk-in Date/ Time: 18th March - 25th March 2020, 11 AM onwards Interview Venue: Tekege Solutions Private Limited 128 B, Second Floor, Shahpur Jat, New Delhi - 110 049 Landmark- Slice of Italy, Next to UCO Bank Nearest Metro- Greenpark/ Hauzkhas/ Panchshee Contact Person- Diksha / Arpita (8287854151)","location":"Delhi","experience":"1 - 3 Years"},{"date":"23, 24, 25 - Mar - 2020","skills":"JAVA & JEE internals, Relational databases, MySQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Tekege Solutions Private Limited, 128 B, Second Floor, Shahpur Jat, New Delhi - 110 049","phone":"8287854151","profile":"Java Developer \nTekege Solutions Private Limited","description":"Candidate must have profound Insight of JAVA & JEE internals. Excellent knowledge of relational databases, MySQL. Knowledge of Servers. Experience in Hibernate. Experience in developing web applications using at least one popular web framework. Job Responsibility- Development in JAVA. Project management. Understand business process Coordinating with technical personnel as needed to meet customer needs Understanding application architecture, as well as various services issues with the components. Walk-in Date/ Time: 18th March - 25thh March 2020, 11 AM onwards Interview Venue: Tekege Solutions Private Limited 128 B, Second Floor, Shahpur Jat, New Delhi - 110 049 Landmark- Slice of Italy, Next to UCO Bank Nearest Metro- Greenpark/ Hauzkhas/ Panchshee Contact Person- Diksha / Arpita (8287854151)","location":"Delhi","experience":"1 - 4 Years"},{"date":"21, 23, 24, 25, 26, 27, 28, 30, 31 - Mar - 2020","skills":"Java Angular Spring Hibernate Spring Boot SQL Oracle 11g and above","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Thumbay Technologies Private Limited, 4th Floor, Prestige Tower, Beside Ritz Carlton Hotel, Residency Road, Bangalore.","phone":"080-68220152","profile":"Software Engineer (Java) \nThumbay Technologies Private Limited","description":"Skills Required: Java Angular Spring Hibernate Spring Boot SQL Oracle 11g and above Responsible to Analyze, design, coordinate and supervise the development of software systems to form a basis for the solution of information processing problems in line with the set guidelines and protocols in order to achieve the objective of the department. Walk-in Date/ Time: 4th March - 31st March , 10 AM onwards Interview Venue: Thumbay Technologies Private Limited 4th Floor, Prestige Tower, Beside Ritz Carlton Hotel, Residency Road, Bangalore. Contact - Nisha (080-68220152) Email ID- nisha@hr.thumbay.com","location":"Bangalore","experience":"2 - 4 Years"},{"date":"21, 23, 24, 25, 26, 27, 28, 30, 31 - Mar - 2020","skills":"Payroll Management, Statutory Compliance/ Legal Compliance","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Yashmit Human Resource Management Services Pvt. Limited, #466/39, Anjan Towers, 1st Floor, 10th main road, 12th Cross, Wilson Garden, Bengaluru - 560 027","phone":"7353468116","profile":"HR Compliance \nYashmit Human Resource Management Services","description":"We have job openings for HR Compliance Work Experience:- 2 to 3 Years Gender - Male or Female Work Location- Wilson Garden, Bangalore Walk-in Date/ Time: 21st March - 31st March 2020, 9 AM onwards Interview Venue: Yashmit Human Resource Management Services Pvt. Ltd #466/39, Anjan Towers, 1st Floor, 10th main road, 12th Cross, Wilson Garden, Bengaluru - 560 027 Contact Person- Veeresh (7353468116)","location":"Bangalore","experience":"2 - 3 Years"},{"date":"21, 23, 24 - Mar - 2020","skills":"J2EE Application servers (Tomcat, JBoss), Active MQ, REDIS, Zookeeper, Solr etc.","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Unistal Systems Private Limited, 408 Siddhartha Building,4th Floor 96, Nehru Place New Delhi - 110 019","phone":"8287478881","profile":"HR Manager (Only Female) \nUnistal Systems Private Limited","description":"Full Time MBA in HR with minimum 4 to 6 years of relevant experience. Excellent verbal and written communications skills in English. Must have experience in handling individual contributor roles. Candidate having experience in IT Recruitment is preferred. Job Responsibility- Handling end to end IT Recruitments, On boarding and exit formalities Maintaining the employee database in HRMS Leave and attendance record management Handling Employee Compliances/ Grievances Managing Employee Engagement Activities Walk-in Date/ Time: 21st March - 24 March 2020, 11 AM onwards Interview Venue: Unistal Systems Private Limited 408 Siddhartha Building,4th Floor 96, Nehru Place New Delhi - 110 019 Contact Person- Tapasya (8287478881)","location":"Delhi","experience":"4 - 6 Years"},{"date":"21, 23, 24, 25, 26, 27, 28 - Mar - 2020","skills":"HR/ Recruitment, Talent Acquisition, BPO Hiring","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Reliable Business Solutions & Services Pvt. Limited, No. 51, Rajiv Gandhi Salai (OMR) | Rattha TEK MEADOWS, C Block, 1st Floor | Sholinganallur | Chennai - 600 119.","phone":"7904356739","profile":"HR Executive \nReliable Business Solutions & Services Pvt. Limited","description":"We have Immediate job openings for HR Executive Candidate should be Any Graduate with good communications skills. Should have experience in BPO hiring for atleast 2 years Good in portals e.g Naukri, LinkedIn, Monster Will handle end to end recruitment. Good in sales hiring candidates. Walk-in Date/ Time: 21st March - 28 March , 10 AM onwards Venue Details: Reliable Business Solutions & Services Pvt. Limited No. 51, Rajiv Gandhi Salai (OMR) | Rattha TEK MEADOWS, C Block, 1st floor | Sholinganallur | Chennai - 600 119. Contact No : 7904356739 If number isn't reachable, please message / whatsapp. Email: indra.kumar@reliablebss.com","location":"Chennai","experience":"2 - 3 Years"},{"date":"21 - Mar - 2020","skills":"MS Office, MIS Reporting, Power Point Presentations","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Heritage Nutriver Limited, 6-3-541/ C, Panjagutta, Hyderabad.","phone":"9133101222","profile":"Back Office Assistant/ PPC Executive \nHeritage Nutriver Limited","description":"We have opening for the position of Executive Assistant / PPC Executive. Interested Candidates shall attend the interview on Saturday i.e 21st March 2020 at 10 am - 12 pm the following venue or can share the updated profile to hr7@heritagenutrivet.in Venue Details: Heritage Nutriver Limited, 6-3-541/ C, Panjagutta, Hyderabad. Core Responsibilities- Production Planning & Control of respective Category. Planning & Execution of daily activities of reporting authority. Calendar Management. Effective Coordination, Communication & Organize Meetings as per schedule. Coordination, Follow-up & obtain the information/data on time. Preparation of Periodical MIS reports as per the business requirement. Effective usage & regular updating of data in SAP. Maintain good relationship with both Internal & External Customers. Core Competencies: Very good communication skills (both oral, written) Fully knowledge on Ms Office, Ms Excel, Power Point Presentations. Analytical skills. Prerequisite: Candidate should have 2 to 5 years of relevant experience in any manufacturing industry Graduation with good academic record in the age group of 22-28 years. Should know minimum 3 languages (English, Hindi, Telugu). Male candidates shall be preferable. Work Location: Heritage Nutrivet Ltd Panjagutta, Hyderabad Required Candidate profile Candidates who are having manufacturing experience shall be an added advantage.","location":"Hyderabad","experience":"2 - 5 Years"},{"date":"21, 23, 24, 25, 26, 27, 28, 30, 31 - Mar - 2020","skills":"Java/ J2EE, Java 8, Spring/ Spring boot, Hibernate, DB,Socket Programming","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Amazin Automation Solutions India Pvt. Limited, JMD MEGAPOLIS UNIT NO 50-51, SOHNA ROAD GURGAON","phone":"Not Provided","profile":"Java Developer \nAmazin Automation Solutions India Pvt. Limited","description":"Candidate should have good knowledge end-to-end project development Experience in Java 8, Spring/ Spring boot, Hibernate, DB,Socket Programming Working experience in building enterprise web application using Java/ J2EE technologies Extensive experience in J2EE Framework, Integration Frameworks, JPA, Hibernate, REST. Must have excellent knowledge of databases (SQL) Should have experience in testing tools (Postman) Good Knowledge in AJAX Walk-in Date/ Time: 21st March - 30 April 2020, 9 AM onwards Interview Venue: Amazin Automation Solutions India Pvt. Limited JMD MEGAPOLIS UNIT NO 50-51, SOHNA ROAD GURGAON Contact Person- Vikas Sharma","location":"Gurgaon","experience":"2 - 6 Years"},{"date":"23, 24, 25, 26, 27, 28 - Mar - 2020","skills":"Angular 4/6/8, C#, Web API, Entity Framework, LINQ to Entities","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Ground Floor, 8-2-293/82/ A/379 & 379A, Plot 379, Road Number 10, Jubilee Hills, Hyderabad, Telangana - 500 033.","phone":"9100927755","profile":"Full Stack .Net Developer \nQuixy","description":"Expert in Programming using Angular 4/6/8, C#, Web API, Entity Framework, LINQ to Entities. Should have knowledge in Relational and Non-Relational databases (NO SQL). Strong knowledge of SDLC methodologies - Agile/Scrum Very good development skills in front end technologies/java script libraries like angular etc. Good understanding of Object-Oriented Programming, Design Concepts & Whitebox Unit Testing The ideal candidate is a self-motivated, multi-tasker, and demonstrated team-player. You will be a developer responsible for the product development and maintenance. You should excel in working with large-scale applications and frameworks and have outstanding communication skills. Key Responsibilities: Writing clean, high-quality, high-performance, maintainable code Develop and support software including applications, database integration, interfaces, and new functionality enhancements Analyze and resolve performance bottle necks Walk-in Date/ Time: 23rd March - 28 March 2020, 9 AM onwards Interview Venue: Ground Floor, 8-2-293/82/ A/379 & 379A, Plot 379, Road Number 10, Jubilee Hills, Hyderabad, Telangana - 500 033. Contact Person- Joshna Jupaka ( 9100927755 )","location":"Hyderabad","experience":"2 - 7 Years"},{"date":"23, 24, 25, 26, 27 - Mar - 2020","skills":"Software Testing, Test Engineering, Automation tools, Selenium testing tools","qualification":"B.E./B.Tech, MCA/PGDCA","address":"The Forum Vijaya Mall, 10th Floor, Prestige Center Court, 183, N.S.K. Salai, Kumaran Colony, Vadapalani, Chennai - 600 026.","phone":"66051102","profile":"Automation Testing Engineer \nExpeditors International (India) Pvt. Limited","description":"Qualifications: Preferably MCA/ B Tech/ BE/ Bachelors Degree in Computer Science Essential Experience: Candidate should have 5+ years of experience in a technical Quality Assurance role Proficient in at least one object-oriented programming language (Preferably Java Proficient in automation tool Protractor with Jasmine for Angular application Proficient at scripting in one or more languages (Preferably Type Script/ Java Script) Proficient at working with databases, web application frameworks and command line interfaces Proficient at developing test automation framework from scratch Good to have experience in Selenium with Cucumber Should train and enhance other QA team members Preferred Experience: Bachelor's degree in Computer Science, Computer Engineering or equivalent job related experience Strong object-oriented design and coding skills Working knowledge of Java application development and Windows/ UNIX/ Linux Systems Understanding of the transportation/ global logistics industry Experience in Agile development Walk-in Date/ Time: 23rd - 27th March 2020, 11 AM onwards Interview Venue: The Forum Vijaya Mall, 10th Floor, Prestige Center Court, 183, N.S.K. Salai, Kumaran Colony, Vadapalani, Chennai - 600 026. Contact Person- Sindhuja Amilthamozhian","location":"Chennai","experience":"5 - 7 Years"},{"date":"21 - Mar - 2020","skills":".Net Core, MVC, WebAPI, WCF, HTML5, Bootstrap 3/4, jQuery, Angular, SQL Server, Oracle","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Synoverge Technologies Private Limited, The Summit, 3-Sunrise Park, Near Himalaya Mall, Sunrise Park Road, Bodakdev, Ahmedabad - 380054","phone":"079 49062116","profile":"ASP .Net/ MVC Developer \nSynoverge Technologies Private Limited","description":"Work Experience: 1 to 6 Years Job Location: Ahmedabad Open Positions: 5 Required Skill Sets: Back-End: .Net Core, MVC, WebAPI, WCF Front-End: HTML5, Bootstrap 3/4, jQuery, Angular Database: SQL Server, Oracle Primary Role- Software development as per project schedule Troubleshooting and debugging as required for bug fixing Source code version maintenance in version control software Unit testing of the application to ensure quality release to QA Adherence of coding standards while performing development Daily status reporting / progress updates / timesheets Secondary Role- Prepare project specific documentation as required by project UAT / Implementation support as required by project Client interaction and communication as required by project Walk-in Date: 21st March 2020 Timings: 10 AM to 2.00 PM Interview Venue: Synoverge Technologies Private Limited The Summit, 3-Sunrise Park, Near Himalaya Mall, Sunrise Park Road, Bodakdev, Ahmedabad - 380054 Landline: +91 79 49062116 / 117 Contact Person- Ms. Kavita Sharma","location":"Ahmedabad","experience":"1 - 6 Years"},{"date":"22, 23, 24, 25, 26 - Mar - 2020","skills":"C#, MVC, ASP .Net, SQL, WCF, Web Technologies, Winform, Windows Services","qualification":"B.E./B.Tech, MCA/PGDCA","address":"KSNR Immegration Services Pvt. Limited, ( B/113) Sector 64 Noida","phone":"9599964819","profile":"Senior .Net Developer/ Lead \nKSNR Immegration Services Private Limited","description":"We are hiring for the position of Team Lead for our Software Development Team with experience of maximum 7+ years in Dot Net, WCF, MVC, Entity Framework, LINQ, C#, SQL Database. Candidate must have of experience into C#, MVC, ASP .Net, SQL, WCF, and relevant Web Technologies. Knowledge of Winform, Windows Services, Kendo UI framework. Hands on experience in .NET MVC, LINQ, AJAX, XML, Web API, Entity Framework, Repository Pattern. Strong and effective inter-personal and communication skills (verbal and written). Experience in designing and developing the services using WCF, Web API Experience in designing databases and writing the complex Queries and Stored Procedures, Triggers, Indexes etc using SQL Server Database. Experience in CSS, JQuery, Java Script, HTML5, Bootstrap Demonstrated ability to incorporate new technologies and techniques. Knowledge of Winform, WPF, Windows Services, Multi-threading Familiarization with UML diagrams and Use Cases is expected Experience in working with Source Control System like TFS. Knowledge of micro services architecture implementation, web api, web services is desirable. Knowledge of agile/ scrum development processes. Need an Immediate Joiner (Maximum 25/30 days' Notice Period) Location - Noida Sector 64 Salary - No Bar (According to the Last drawn) 5 Days Working Walk-in Date/ Time: 20th - 26th March 2020, 12 PM onwards Interview Venue: KSNR Immegration Services Private Limited ( B/113) Sector 64 Noida Contact - Pallavi Jha If interested kindly get connected at pallabi.jha@ksnronline.co.in Or call at 9599964819","location":"Noida","experience":"6 - 11 Years"},{"date":"21 - Mar - 2020","skills":"ASP .NET, Web Services/ WCF, JQuery, WebApi and SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA","address":"KFIN Technologies Private Limited, Tower - B, Plot No 31 & 32, Selenuim Building Financial District, Nanakramguda, Gachibowli, Hyderabad, Telangana 500 032.","phone":"040-33215106","profile":".Net Developers \nKFIN Technologies Private Limited","description":"We are seeking a .NET developer responsible for building .NET applications (Asp .Net, C#, JQuery, WCF & SQL Server). Applicant should have minimum 4 to 5 years of hands-on development experience with the following technologies: ASP .NET, Web Services/ WCF, JQuery, WebApi and SQL Server . Hands on experience in design using object oriented programming principles. Strong understanding of object-oriented programming Skill for writing reusable libraries Familiar with various design and architectural patterns Familiarity with Microsoft SQL Server Experience with popular web application frameworks Understanding of fundamental design principles for building a scalable application. Interested please attend F2F interview on 21st March 2020, between 11:00 am to 3:00 pm. Interview Venue: KFIN Technologies Private Limited Tower - B, Plot No 31 & 32, Selenuim Building Financial District, Nanakramguda, Gachibowli, Hyderabad, Telangana 500 032. Contact Person- Sushma (040-33215106)","location":"Hyderabad","experience":"4 - 6 Years"},{"date":"21 - Mar - 2020","skills":"ASP .Net, MVC 3 and above Framework. JQuery, Angular WCF, WEB API Entity Framework","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Resulticks Digitals India Private Limited, No. 37, 6th Floor, PM Tower, Greams Road, Thousand Lights, Chennai - 600 006","phone":"9940234334","profile":".Net Developer \nResulticks Digitals (India) Private Limited","description":"Candidate should have 3 to 10 years of experience in the complete systems design and development where development in a controlled environment is a plus points. Should have a relevant experience on .Net application development project where development in web-based is a must (C#) ASP .Net MVC 3 and above Framework. JQuery, Angular WCF, WEB API Entity Framework. SQL Server Reporting Services SSIS Familiar with Agile methodologies Notice Period: Immediate/ 15 Days Walk-in Date: 21st March 2020 Timing - 11.00 AM - 03.00 PM Interview Venue: Resulticks Digitals India Private Limited No. 37, 6th Floor, PM Tower, Greams Road, Thousand Lights, Chennai - 600 006 (Landmark: IDBI Bank on the Ground Floor) Interested candidates send your updated resumes to karthick.ravi@resulticksmail.com","location":"Chennai","experience":"3 - 10 Years"},{"date":"23, 24, 25, 26, 27 - Mar - 2020","skills":"Core Php, Zend Framework, or any MVC","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Belair Travel & Cargo Private Limited, C-101, 2nd Floor, Sector-2, Noida.","phone":"011-43149007","profile":"PHP Developer \nBelair Travel & Cargo Private Limited","description":"Candidate should have knowledge of Core Php, Zend Framework, or any MVC. Must be able to work on projects independently for Integration of API's/ XML for Online Flights & Hotels Work Experience: 1 to 6 Years Walk-in Date/ Time: 23rd - 27th March 2020, 9 AM onwards Interview Venue: Belair Travel & Cargo Private Limited C-101, 2nd Floor, Sector-2, Noida, Near Metro Station Sector-15 Noida For further details email your resume at hr@belair.in Or call on 011-43149007","location":"Noida","experience":"1 - 6 Years"},{"date":"19, 20 - Mar - 2020","skills":"HR/ Recruitment, Screening/ Onboarding, Office Administration, Attendance Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Million Minds Management Services Limited, C-124 , Sector 2 Noida.","phone":"9599192004","profile":"Front Office Executive \nMillion Minds Management Services Limited","description":"Candidate should be Any Graduate with 0 to 1 year of experience in Front Desk, Front Office/ Receptionist Activities. Must have excellent communication skills. Keeping front desk tidy and presentable with all necessary. Greeting and welcoming desks as they approach front desk. Answering questions and addressing complaints. Taking care of Voice of Associate Answer questions and address complaints Answer all incoming calls and redirect them or keep messages Receive letters, packages etc. and distribute them Prepare outgoing mail by drafting correspondence, securing parcels etc. Time and Venue 19th March - 20th March , 10 AM onwards Interview Venue: Million Minds Management Services Limited C-124 , Sector 2 Noida. Near By Noida Sector 15 Contact Person- Chit (9599192004)","location":"Noida","experience":"0 - 1 Years"},{"date":"20, 21 - Mar - 2020","skills":"Desktop Support, Troubleshooting, Windows 10, Operating Systems","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Emind Technologies, #71, Metha Arcade, 3rd Floor, 100ft Ring Road. 6th Phase, JP Nagar, Bengaluru.","phone":"8147359206","profile":"Desktop Support Engineer \nEmind Technologies","description":"Candidate should be Any Technical Graduate with excellent communication skills. Dealing with and resolving helpdesk requests e.g. Outlook issues, Operating system issues, printer, Standard software's, Antivirus. teams, backup technology. Windows 10 OS, Installation, configuration Walk-in Date/ Time: 20th March - 21st March 2020, 11 AM onwards Interview Venue: Emind Technologies #71, Metha Arcade, 3rd Floor, 100ft Ring Road. 6th Phase, JP Nagar, Bengaluru. Near JP Nagar Metro Station Near Sarakki Signal, Opp. ICICI Bank Above Blue Dart Courier Contact Person- Arvind (8147359206)","location":"Bangalore","experience":"0 - 1 Years"},{"date":"20 - Mar - 2020","skills":"Desktop Support, Product Support, Hardware Support/ Troubleshooting","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"HCL Technologies Limited, BSERV A-22, Sector -60, Noida. Nearest Metro Station- Noida, Sector-59.","phone":"Not Provided","profile":"Product Support Engineer \nHCL Technologies Limited","description":"Candidate should be a Technical Graduate with 12 months of experience in Hardware Trouble shooting and Desktop Support. Should posses excellent communication skills. Must be comfortable to work in 24/7 environment. Max Salary Upto: 4.75 LPA Walk-in Interview on 20th March 2020 from 11 AM onwards Venue details : HCL Technologies Limited BSERV A-22, Sector -60, Noida. Nearest Metro Station- Noida, Sector-59. Kindly mention 'Vikas Kapoor' as a source on top of your CV.","location":"Noida","experience":"1 - 6 Years"},{"date":"20, 21 - Mar - 2020","skills":"Client Management, Customer Support, Technical Support, Client Engagement, Customer Handling","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Volty IOT Solutions Private Limited, Plot No. 703/A, 4th Floor, Road No. 36, Jubilee Hills, Hyderabad","phone":"Not Provided","profile":"Technical Support Executive \nVolty IOT Solutions Private Limited","description":"Candidate should be Any Graduate with 0 to 1 year experience in Client Management, Customer Support, Technical Support, Client Engagement, Customer Handling, Outbound Calling, Client Handling. Should have excellent communication skills. Job Responsibility: 1. Answering calls and provide information about products and services. 2. Maintaining records of transactions and interactions. 3. Appropriate and timely follow-ups wherever required. 4. Handling customer in a soft manner. 5. Resolving customer queries within the time line. Walk-in Date/ Time: 20th March - 21st March 2020, 11 AM onwards Interview Venue: Volty IOT Solutions Private Limited Plot No. 703/A, 4th Floor, Road No. 36, Jubilee Hills, Hyderabad Contact Person- Sandhya Rani","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"26 - Mar - 2020","skills":"HR/ Recruitment, Training, Induction Program, Compensation Management, Employee Engagement","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Lobo Staffing Solutions Private Limited, No. 212, 2nd Floor, Prabhadevi Industrial Estate, Veer Savarkar Marg, Mumbai - 400 025.","phone":"Not Provided","profile":"Interview for HR / Admin Executive \nLobo Staffing Solutions Pvt. Limited","description":"Candidate should have 2 to 6 years of experience in HR/ Recruitment, Training, Induction Program, Compensation Management, Employee Engagement, Sourcing, Performance Management, Employee Induction, Employee Retention. Job Responsibility- 1. On boarding Formalities & Orientation 2. Inputs, employee data maintenance 3. Ensures accurate payment to employees. 4. Audit Reconciliation for all Billing & Payout details. 5. Processing other reimbursement like L.T.A, traveling reimbursement, working on incentive calculations, bonus calculations, etc. 6. Collecting Investment Declaration/review on time from Staffers/Employees. Verifying the actual Investment proof. 7. Maintaining files of all hard copies of input and reimbursements, IT declaration and actual investment proofs. At the end of the year, ensure all documents are binded properly and delivered to customer. 8. Manage statutory compliances for all client companies and co-ordinate the same with internal departments. 9. Ensuring relevant payroll information is provided to other internal departments (eg. PF, PT, TDS etc). 10. Strictly adhere to all deadlines committed to clients. 11. Be responsible to query resolution and ensure all queries are resolved. This includes queries through mail and issue base. 12. Preparation of full and final settlements and ensure the same is checked Walk-in Date/ Time: 26 March 2020, 9 AM onwards Interview Venue: Lobo Staffing Solutions Private Limited No. 212, 2nd Floor, Prabhadevi Industrial Estate, Veer Savarkar Marg, Mumbai - 400 025. Landmark: Opposite to Kamat Hotel","location":"Mumbai","experience":"2 - 6 Years"},{"date":"19, 20 - Mar - 2020","skills":"HR/ Recruitment, Talent Acquisition, Sourcing","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Supportmart Global Services, 30, Udyog Vihar, Phase 1, Gurgaon, Haryana - 122 016.","phone":"9953106610","profile":"HR Recruiter/ Team Lead \nSupportmart Technical Services Pvt. Limited","description":"At least minimum 3 years of core experience in BPO recruiting Male candidate would be preferred Excellent understanding of recruitment processes Proficiency in using applicant tracking systems (ATS) Good knowledge of candidates selection methods Minimum 3 years of experience with candidate sourcing tools and methods Excellent knowledge of area of expertise (market status, trends, best practices) Effective negotiation, influencing and communication skills Integrity and confidentiality Critical thinker and problem-solving skills Team player with Good time-management skills Key Responsibilities : Responsible for bulk hiring using different channels. Should have worked on end to end Recruitment. Responsible for taking interviews, Shortlisting the candidates. Experience of recruiting IT / Non IT Candidates. Sourcing, coordinating and driving new and existing vendors. Should have the right spirit and enthusiasm to achieve his / her targets within TAT and drive team for achieving their targets too. Should have sourced through Job Portals (Naukri, Monster & Other Portals), social networking sites and employee referrals. Would be responsible to prepare and publish various hiring reports. Should be good positive team player. Should have experience of headhunting & working on various portals. Manage Inductions & joining formalities for all new joiners. Maintains detailed reports such as - Exit reports, Audit Reports, & Misc Reports. Coordinate with Finance team for statutory compliance. Job Location : Gurgaon Shift Timings : 10 am - 7 pm & 1 p.m - 10 pm, 5 days working Interview Date: 19 & 20 March, 2020 Timings : 11 am - 4 pm OR If interested, kindly forward your updated resume to gagandeep.mohan@supportmart.com","location":"Gurgaon","experience":"3 - 6 Years"},{"date":"20 - Mar - 2020","skills":"Customer Support, IT Support, Desktop Support, Technical Support, Service Desk","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"DXC Technology (India) Private Limited, Maruti Concorde Business Park, ervice Road, Konappana Agrahara, Electronics City, Bengaluru - 560 010.","phone":"Not Provided","profile":"Technical Support Engineer \nDXC Technology (India) Private Limited","description":"Global Service Centers are made up of teams that provide remote (offsite) service; customer access and service delivery. Technical teams focus is to solve various business systems and applications problems for customers, onsite engineering personnel and Authorized Service Providers on standard, specialized or complex systems. Responsibilities & Duties: The primary responsibility is to attend inbound calls for customer support from the existing customers Resolve the quires of the Customers, in case there are any issues, escalate the same to the higher officials in the team/company Create reports on the work done and submit it to the team lead/manager Required Experience, Skills and Qualifications Only Graduates (BE/ B.Tech/ BSc/ BCA/MCA etc) Freshers with 0 to 1 years of experience Good communication in English Benefits Good infrastructure domain knowledge Two Way Cabs provided from us 5 Days Working 2 Days Off Additional shift allowance will be provided. Ready to work in global shift(night shift) Walk-in Date: 20th March' 2020 (Saturday) Timing: 11:00 AM to 1:00 PM Interview Venue: DXC Technology (India) Private Limited Maruti Concorde Business Park, ervice Road, Konappana Agrahara, Electronics City, Bengaluru - 560 010. Point of Contact : Gopala BR List Of Mandatory Documents to carry for interview 1 Pan Card 2 Aadhar card 3 10th Marks card 4 12th Marks card 5 Degree Certificate & Last sem marks card 6 If Experience (Relieving Letter/ Full and Final Settlement /Service Certificate / Offer Letter) Interview Rounds : Group Discussion/ Written Test/ Operations round","location":"Bangalore","experience":"0 - 1 Years"},{"date":"19, 20 - Mar - 2020","skills":"HR Recruitment, MIS Preparation, Employee Engagement, General Administration, Facilities Management","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Chetu India Private Limited, A-186/ 187, Sector 63 Road, A Block, Sector 63, Noida - 201 301","phone":"Not Provided","profile":"HR Generalist/ Executive \nChetu India Private Limited","description":"Preferred candidate - Male only Joining formalities & On boarding formalities. Docs collection & verify from new joiner and update on ATS. Employee engagement & handle performance review meeting. Participate in developing organizational guidelines and procedures. Assist with the recruitment process by identifying candidates, conducting reference checks and issuing employment contracts. Investigate complaints brought forward by employees. Coordinate employee development plans and performance management. Perform orientations and update records of new staff. Manage the organizations employee database and prepare reports. Produce and submit reports on general HR activity. Keep up-to-date with the latest HR trends and best practice. Walk-in Date/ Time: 19th - 20th March 2020 from 2 PM onwards Interview Venue: Chetu India Private Limited A-186/ 187, Sector 63 Road, A Block, Sector 63, Noida - 201 301","location":"Noida","experience":"2 - 6 Years"},{"date":"20, 21, 23, 24, 25, 26, 27, 28 - Mar - 2020","skills":"PHP, Laravel, Codeigniter, Java Script, HTML5, and CSS3","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Bitibe Technologies Private Limited, No. 11 Sai Kuberan Mansion 2nd floor 7th Main Road Ksrtc layout chikklasandra Uttarahalli main Road Bangalore - 560 061","phone":"Not Provided","profile":"Senior Php Developer \nBitibe Technologies Private Limited","description":"We are looking for a PHP Developer responsible for managing back-end services and the interchange of data between the server and the users. Your primary focus will be the development of all server-side logic, definition and maintenance of the central database, and ensuring high performance and responsiveness to requests from the front-end. You will also be responsible for integrating the front-end elements built by your co-workers into the application. Therefore, a basic understanding of front-end technologies is necessary as well. Skills & Qualifications: Strong knowledge of PHP web frameworks s uch as Laravel, Codeigniter Understanding the fully synchronous behavior of PHP Understanding of MVC design patterns Basic understanding of front-end technologies, such as JavaScript, HTML5, and CSS3 Knowledge of object oriented PHP programming Understanding accessibility and security compliance Strong knowledge of the common PHP or web server exploits and their solutions Understanding fundamental design principles behind a scalable application User authentication and authorization between multiple systems, servers, and environments Integration of multiple data sources and databases into one system Familiarity with limitations of PHP as a platform and its workarounds Creating database schemas that represent and support business processes Familiarity with SQL/NoSQL databases and their declarative query languages Proficient understanding of code versioning tools, such as Git Job Responsibilities: Integration of user-facing elements developed by front-end developers Build efficient, testable, and reusable PHP modules Solve complex performance problems and architectural challenges Integration of data storage solutions MySql, Oracle etc Walk-in Date/ Time: 18th March - 4th April 2020, 11 AM onwards Interview Venue: Bitibe Technologies Private Limited No. 11 Sai Kuberan Mansion 2nd floor 7th Main Road Ksrtc layout chikklasandra Uttarahalli main Road Bangalore - 560 061 Next to Bangalore International Public school Contact - Nitin ( 9845028292 )","location":"Bangalore","experience":"1 - 3 Years"},{"date":"20, 21, 23, 24, 26, 27, 28, 30, 31 - Mar - 2020","skills":"HTML, HTML5, CSS, Javascript, Web Development, Web Design, Web Services, React JS","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Agrima Exim Private Limited, 21/22, Bandal Dhankude Plaza, Opp. PMT Depot, Paud Road, Bhusari Colony, Kothrud, Pune - 38","phone":"Not Provided","profile":"PHP/ Android Developer \nAgrima Exim Private Limited","description":"We are looking for talented Web Designers who can develop web pages from scratch using the tech stack given below. Candidate must be good with web UI and implementation with APIs or stand alone static or dynamic websites. Implementation of all features into the website related to Company Pages, E-Commerce, Brands, etc. Website optimization for various platforms and devices and maintenance of all up and running websites. AWS hosting with relevant securities in place. For Android Developer API knowledge will be added advantage Responsibilities & Duties: Dynamic and Static UI design HTML, HTML5, CSS & JS languages API + Model Integration AJAX and JavaScript Dom manipulation Techniques. RESTful services JavaScript build tools like grunt or gulp Modern JavaScript MVC frameworks (React JS, AngularJS, JQuery, NodeJS, GruntJS) Implements complex web applications, directives, controllers & services Communication & Expression Agile Project Management Working with the designers on Website layouts and Designs Creating websites for our own company and our clients Key Skills: HTML, HTML5, CSS, Javascript, Web Development, Web Design, Web Services, React JS, Fullstack Developer and API knowledge for Android developer is added advantage. Walk-in Date: 20th March - 31st March , 10 AM onwards Interview Venue: Agrima Exim Private Limited 21/22, Bandal Dhankude Plaza, Opp. PMT Depot, Paud Road, Bhusari Colony, Kothrud, Pune - 38 Please Note : Please do confirm the date and time by email with prior intimation before coming to the interview as if there could be changes in interview schedules if required due to emergency. Also, there will not be any interview or walk-in scheduled on all Sundays and on 25th March.","location":"Pune","experience":"0 - 1 Years"},{"date":"20 - Mar - 2020","skills":"Back Office Operations, Non Voice Process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"HCL Technologies Limited, 1st Floor Pioneer Square, Building, Sector 62, Near, Rapid Metro Station 55-56, Gurgaon.","phone":"9028243027","profile":"Backend Process Executive \nHCL Technologies Limited","description":"Career Opportunity in Insurance Industry for Non Technical Graduate fresher, with HCL Technologies Ltd - Business Services for the profile of Customer Service Executive (Back Office Process). Educational Requirement: BBA, BA, B Com, B.SC Graduates (Only 2016/2017/2018 and 2019 Pass-outs are eligible for this opening). CS can also apply for the same. Note: Technical graduates / Regular MBA's are not eligible for this opening. Work Experience: Freshers/ Maximum 6 months experience Roles & Responsibilities:- Manage and update Insurance Member and Plan data on multiple systems. Enter new member data into excel and enrollment forms. Processes customer requests in a timely and accurate manner. Communicates with customers through written correspondence. Using PC application and functions such as Excel and Word to update and load data sets. To answer queries coming from end user customers in a polite and professional manner. Skill Set Required:- Good typing speed (25 wpm with 80% Accuracy). Strong commitment to customer service and quality Excellent Keyboard Skills Demonstrates a strong customer service orientation. Takes responsibility to follow up with customers to ensure their needs and expectations are satisfied. Shifts : 24*7 (Rotational) Salary: Upto 2.50 LPA Job Location: Gurgaon Interview Date: 20th March' 2020 (Friday) Timings - 11 AM to 3 PM Interview Venue:- HCL Technologies Limited 1st Floor Pioneer Square, Building, Sector 62, Near, Rapid Metro Station 55-56, Gurgaon. Please write Chinju S on the top of your resume for entry. Contact No: 9028243027 Need to Carry: Updated CV, All education certificates (Original & Xerox Copy) & Govt address / ID proof.","location":"Gurgaon","experience":"0 - 1 Years"},{"date":"19 - Mar - 2020","skills":"Technical Support - troubleshooting of technical related problems","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Hetero Drugs Limited, Hetero Corporate, 7-2-A2, Industrial Estates, Sanath nagar, Hyderabad - 18.","phone":"Not Provided","profile":"HR Executive/ Recruiter (Fresher) \nHetero Drugs Limited","description":"Walk-in Interview for MBA (HR) fresher's on 19th March 2020 (Thursday). Qualification: MBA (HR)/ PGDM-HR/ MHRM Year of Pass out : 2017 / 2018 / 2019 (Without Backlogs) Preferably Male Candidates Job Location: Hyderabad Key Skills: Should be fluent in English (Spoken and Written) Candidate should be able to speak in English and Hindi for internal coordination. Hands-on exposure in using MS-Office applications (MS Word, Excel and PowerPoint) Good Academic Background Highly motivated, Quick Learner, Resourceful, Creative and Energetic Walk-in Date: 19th March 2020 (Thursday) Time: 9:30 AM - 12.30 PM Address: Hetero Drugs Limited Hetero Corporate, 7-2-A2, Industrial Estates, Sanath nagar, Hyderabad - 18. Interested candidates can attend interview with updated Resume and a photograph.","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"21 - Mar - 2020","skills":"Core JAVA, Spring, Hibernate, J2EE, Core Java, IBM DB2, Swing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"RAVSoft Solutions India Private Limited, MPL Silicon Towers No. 23-1/B3 5th Floor, Velachery Tambaram Main Road, Pallikaranai Chennai - 600 100.","phone":"044-66105808","profile":"Java Professionals \nRAVSoft Solutions India Private Limited","description":"Candidate should have overall, 2 to 6 years of experience in Core JAVA, Swing, HornetQ/ JMS, Apache, Test Complete automation (OR) Java with Microservices (Experience : 2-10 years) (OR) Spring, Hibernate, J2EE, Core Java, IBM DB2, Swing, C++, Cassandra, Spring boot Should have good verbal & written communication skills. Good Knowledge in SDLC Process Good interpersonal skills Looking for short notice candidates (0-30 days) Walk-in Date: 21st March 2020 Timing : 10:00 am to 01:00 pm Interview Venue: RAVSoft Solutions India Private Limited MPL Silicon Towers No. 23-1/B3 5th Floor, Velachery Tambaram Main Road, Pallikaranai Chennai - 600 100. Contact Person- Arun/ Marcina Phone No. 044-66105808/ 66936440 Please Carry (mandatory) : Updated Resume Copy Passport size Photograph For details please contact : 044-66105808/ 66936440 Email : careers@ravsoftsolutions.com","location":"Chennai","experience":"2 - 6 Years"},{"date":"18 - Mar - 2020","skills":"Java, web applications & mobile apps for I-phone & Android","qualification":"B.E./B.Tech","address":"Frontline Electronics Limited, EL-35, Electronic Zone, J-Block MIDC, Bhosari, Pune- 411 026.","phone":"Not Provided","profile":"Software Developer (Android/ Java) \nFrontline Electronics Limited","description":"Looking for B.Tech/ B.E. in Electronics/ Telecommunication, Computers To develop web applications & mobile apps for I-phone & Android phones & Desktops. Work Experience: Fresher/ 0 to 1 Year Walk-in Date/ Time: 18th March 2020, 4 PM onwards Interview Venue: Frontline Electronics Limited EL-35, Electronic Zone, J-Block MIDC, Bhosari, Pune- 411 026. Contact Person- Sayali Joshi","location":"Pune","experience":"0 - 1 Years"},{"date":"17, 18, 19, 20, 21 - Mar - 2020","skills":"Android Studio, Eclipse, Design Principles, Core Java","qualification":"B.E./B.Tech, MCA/PGDCA","address":"AGS Transact Technologies Limited, AGS House, Plot No. EL 82 & 83, TTC Industrial Estate, MIDC Electronic Zone, Navi Mumbai - 400 705.","phone":"Not Provided","profile":"Android Developer \nAGS Transact Technologies Limited","description":"Person must have strong knowledge of Android , different versions of Android, and how to deal with different screen sizes. Familiarity with Android Studio and Eclipse. knowledge of Android design principles. Must have excellent knowledge in Core Java Walk-in Date/ Time 17th March - 21st March , 11 AM onwards Interview Venue: AGS Transact Technologies Limited AGS House, Plot No. EL 82 & 83, TTC Industrial Estate, MIDC Electronic Zone, Navi Mumbai - 400 705. Contact Person : Rasika (HR team)","location":"Mumbai","experience":"2 - 6 Years"},{"date":"18, 19, 20, 21 - Mar - 2020","skills":"Front desk/ Receptionist Activities, Front Office Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Naveen Merico Engineering Co. Private Limited, 176, C.S.T. Road, Jugal Jyoti House. 4th Floor Opp Mercedes Showroom, Santacruz (East), Mumbai - 400 098","phone":"022-62430000","profile":"Front Office Executive \nNaveen Merico Engineering Co. Private Limited","description":"Language Proficiency: English, Hindi, Marathi Marital Status: Married Document drafting skills Software Skills: MS Office, Internet, Email Should be very fluent in English writing and speaking Able to Prepare official emails Manage incoming outgoing emails. Monitor office supplies and orders. Greet and manage walk-ins and clients Front desk handling Make Travel bookings Client and supplier coordination Act as a call and messages operator Manage incoming outgoing packages and deliveries Walk-in Date/ Time: 18th March - 31st March 2020, 1 PM onwards Interview Venue: Naveen Merico Engineering Co. Private Limited 176, C.S.T. Road, Jugal Jyoti House. 4th Floor Opp Mercedes Showroom, Santacruz (East), Mumbai - 400 098 Landmark Mahesh Hotel Contact Person- MILIND JADHAV Phone No. 022-62430000","location":"Mumbai","experience":"2 - 3 Years"},{"date":"18, 19, 20, 21, 23, 24, 25, 26, 27, 28, 30, 31 - Mar - 2020","skills":"HR Generalist Activities, Recruitment, Campus Hiring, Policy Formulation","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Kanban Infosystem Private Limited, H-221, Infinity Business Park, 2nd Floor, Office No- 212, Sector -63, Noida","phone":"7835057389","profile":"HR Generalist (Only Female) \nKanban Infosystem Private Limited","description":"Candidate must have good understanding of PF/ ESI Must have good communication & analytical skills. Only Females need to apply Must have good experience on Internal hiring. Must be capable of making policy. Should have good presentation skills. Walk-in Date/ Time: 18th March - 31st March 2020, 10 AM onwards Interview Venue: Kanban Infosystem Private Limited H-221, Infinity Business Park, 2nd Floor, Office No- 212, Sector -63, Noida Contact Person- Ragini Sharma Phone No: 7835057389","location":"Noida","experience":"2 - 6 Years"},{"date":"18, 19, 20, 21, 23, 24, 25, 26, 27, 28 - Mar - 2020","skills":"Back Office, Document Management, Data Entry","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Alankit Limited, 1-8/ 54/1/1, Ist Floor, Prenderghast Road (P. G. Road) Secundrabad - 500 003","phone":"040-40300820","profile":"Back Office Executive \nAlankit Limited","description":"Candidate should be Any Graduate with excellent communication skills Must have good working knowledge of MS-Excel. Typing speed should be min. 30-40 wpm. Eligibility:- 1 to 2 years of experience in data entry. Freshers can also apply. Job Responsibility: Prepare, compile and sort documents for data entry Combine and rearrange data from source documents where required. Enter data from source documents into prescribed computer database, files and forms. Scan documents into document management systems or databases. To maintain MIS on Daily/ Weekly/ Monthly basis. Walk-in Date: 18th - 28th March 2020 Timing:- 10:00 AM to 4:00 PM Interview Venue:- Alankit Limited, 1-8/ 54/1/1, Ist Floor, Prenderghast Road (P. G. Road) Secundrabad - 500 003 Contact Person:- Mr. Imran Contact Details:- 040-40300820/ 7290067031 Note:- Interested candidates can share their resume on ushar@alankit.com OR call on 7290012325.","location":"Hyderabad","experience":"0 - 2 Years"},{"date":"17, 18, 19, 20 - Mar - 2020","skills":"JavaScript/ jQuery/ Core Java/ SQL/ HTML5, SQL, JIRA","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Datazoic Machines Private Limited, 141, TVH Agnitio Park, 2nd Floor, OMR, Kandanchavadi, Chennai - 96.","phone":"Not Provided","profile":"Java Developer/ Technical Lead \nDatazoic Machines Private Limited","description":"Candidate should have 8 to 12 years of solid hands-on experience in JavaScript/ jQuery/ Core Java/ SQL/ HTML5. Must have strong fundamentals in any J2EE application server/ Web server. Strong fundamentals in object-oriented concepts and hands-on experience in design and development of object-oriented applications. Strong knowledge and hands-on experience in SQL, JIRA Experienced in managing teams, mentoring members. Strong desire to learn new functional areas and technologies. Excellent written and verbal communication skills Role & Responsibilities: Responsible for providing a technical design of the solution to meet the requirements as explained in the BRD. Develop class diagrams, database diagrams based on existing methodologies and best practices, explain to the team members. Work with and under the directions of the manager to develop new modules and enhance existing modules of the product. Contribute to the development process by providing enhancements to the methodology and best practices. Provide technical support and work with the implementation team to deploy the product. Create Unit test plans, explain to the team members, perform unit-testing using Junit. Provide technical leadership during certain scenarios, mentor the juniors in the team and assist them in understanding requirements, coding, unit-testing and other development related activities. Depending on the requirements, work on JavaScript/jQuery/Java/ SQL to build/enhance modules of the product. Be flexible enough to switch between these platforms to meet the demands in development and deployment of the products. Walk-in Date/ Time: 17th - 20th March 2020, 11 AM onwards Interview Venue: Datazoic Machines Private Limited 141, TVH Agnitio Park, 2nd Floor, OMR, Kandanchavadi, Chennai - 96. Contact Person- Naveen Kumar","location":"Chennai","experience":"8 - 12 Years"},{"date":"18, 19 - Mar - 2020","skills":"Document Verification, HR, Onboarding","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Muthoot Finance Limited, Zonal Office Plot No. 90 Kacharakanahalli Kariyanapalya, Post, St Thomas Town, Lingarajapuram, Bengaluru - 560084","phone":"Not Provided","profile":"HR Executive \nMuthoot Finance Limited","description":"Candidate should have good communication skills. Must have good convincing skills. Kannda language is Mandatory Documentation checking, Onboarding, Document verification, issuing appointment letters, issuing offer letters etc Walk-in Date/ Time: 18th March - 19th March 2020, 9 AM onwards Interview Venue: Muthoot Finance Limited, Zonal Office Plot No. 90 Kacharakanahalli Kariyanapalya, Post, St Thomas Town, Lingarajapuram, Bengaluru - 560084","location":"Bangalore","experience":"0 - 1 Years"},{"date":"17 - Mar - 2020","skills":"ASP .Net, MVC, Web API, REST Services, MS SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA","address":"MINFY Technologies Private Limited, Hive Space Building, 1st Floor Near Laxmi Cyber City, Whitefields, HITEC City, Hyderabad, Telangana","phone":"Not Provided","profile":".Net Developer \nMINFY Technologies Private Limited","description":"Candidate should have good experience in ASP .Net MVC Application Development using C# Must have good hand on experience in MVC, Web API, REST Services etc. Database expertise using MS SQL Server Should have experience with designing and implementing REST full/ ASP .Net/ MVC Web API. Knowledge of HTML5, CSS3 (Bootstrap), JavaScript (jQuery) and other client-side technologies. Ability to work with small teams as a strong team player. Walk-in Date/ Time: 17th March 2020, 2 PM onwards Interview Venue: MINFY Technologies Private Limited Hive Space Building, 1st Floor Near Laxmi Cyber City, Whitefields, HITEC City, Hyderabad, Telangana Land Mark: Jayaberi Bustop/ Seetharamaswamy temple Contact Person- Shivani Phone No. 040-68325707 Mode of interview: Face to Face Note: Looking out for Immediate to 30 Days Notice period.","location":"Hyderabad","experience":"4 - 6 Years"},{"date":"23, 24, 25, 26, 27 - Mar - 2020","skills":"Test Engineering, Automation tools, Selenium, Quality Assurance","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Expeditors International (India) Private Limited, The Forum Vijaya Mall, 10th Floor, Prestige Center Court, 183, N.S.K. Salai, Kumaran Colony, Vadapalani, Chennai, Tamil Nadu - 600 026.","phone":"66051102","profile":"Automation Test Engineer \nExpeditors International (India) Private Limited","description":"The Information Systems team is looking for strong candidates who want to help design and expand our growing library of automation tools and frameworks. You will be responsible for shaping the direction and quality of our unique business applications and the frameworks utilized to test them. The Developer in Test designs, develops and maintains complex automation and custom test tools.They participate in the design and development of systems with an eye towards assuring quality and testability. They fully understand and support the role of the Quality Assurance Engineer by providing automation test strategies and tools for our technologies and systems. Qualifications: Preferably MCA/ B Tech/ BE/ Bachelors degree in Computer Science Essential Experience: Candidate should have 5+ years of experience in a technical Quality Assurance role Proficient in at least one object-oriented programming language (Preferably Java Proficient in automation tool Protractor with Jasmine for Angular application Proficient at scripting in one or more languages(Preferably TypeScript/ JavaScript) Proficient at working with databases, web application frameworks and command line interfaces Proficient at developing test automation framework from scratch Good to have experience in Selenium with Cucumber Should train and enhance other QA team members Preferred Experience: Strong object-oriented design and coding skills Working knowledge of Java application development and Windows/UNIX/Linux systems Experience in Agile development Understanding of the transportation/global logistics industry Walk-in Date/ Time: 23rd to 27th March 2020, 11 AM onwards Interview Venue: Expeditors International (India) Private Limited The Forum Vijaya Mall, 10th Floor, Prestige Center Court, 183, N.S.K. Salai, Kumaran Colony, Vadapalani, Chennai, Tamil Nadu - 600 026. Contact Person- Sindhuja Amilthamozhian Phone No: 66051102","location":"Chennai","experience":"5 - 7 Years"},{"date":"16, 17, 18, 19, 20 - Mar - 2020","skills":"Java, Software Testing, API Testing, Automation Testing, Manual Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"GMO GlobalSign Certificate Services Pvt. Limited, Building No-23, Okhla Phase 3, New Delhi","phone":"9319835781","profile":"Software Testing Engineer \nGMO GlobalSign Certificate Services Pvt. Limited","description":"Looking for a highly skilled professional with development and testing knowledge. Who can automate the acceptance test by leveraging coding skills. Constantly striving to improve life for both your customers and your team, you embrace Agile Testing, developing test automation tools on multiple applications platforms. You are passionate about delivering the best possible service and quality to support this goal. Roles & Responsibilities: Creation of test related artifacts such as test cases and automation test scripts and their execution i.e. Analyze, design and develop Automated and Manual tests. Works with engineers to drive improvements in code quality via manual and automated testing Involved in the review of the user story backlog and requirements specifications for completeness and weaknesses in function, performance, reliability, scalability, testability, usability, and security and compliance testing, and provides recommendations Plans and defines testing approach, providing advice on prioritization of testing activity in support of identified risks in project schedules or test scenarios Good to Have: Experience in Quality Assurance doing test automation in at least one of the following: Java, Python or Go language. Excellent knowledge of different testing methods such as exploratory testing, performance testing, automation, manual etc. Knowledge of API testing skill, using tools such as: Postman, JMeter or SoapUI. Experience automating API test scripts using tools like Katalon, RestAssured, Karate DSL etc. Experience creating automated tests, using frameworks such as Cucumber Champion of agile Scrum methodology Good knowledge of the SDLC and development methodologies such as, BDD and TDD Experience with CI/CD pipelines and quality gates, such as Bamboo or Jenkins Capable with test management software such as Zephyr, SmartBear, XRay. knowledge on security preferred. Walk-in Date: 16th March - 20th March 2020 Timings: 11.00 AM - 4.30 PM Interview Venue: GMO GlobalSign Certificate Services Pvt. Limited GMO Tower, Building No-23, Okhla Phase 3, New Delhi Contact Person- Yogyata Hardasani Phone: 9319835781","location":"Delhi","experience":"3 - 6 Years"},{"date":"16, 17, 18, 19, 20, 21 - Mar - 2020","skills":"Automation Testing, Performing smoke, Functional, and Regression testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Extramarks Education India Pvt. Limited, D-180, Sector 63 Noida - 201 301.","phone":"Not Provided","profile":"Automation Testing Engineer \nExtramarks Education India Pvt. Limited","description":"Candidate should have 2+ years of experience performing smoke, functional, and regression testing on mobile apps and websites. Should have good experience with Manual & Automation testing. As a Software Quality Assurance Engineer you will work with engineers to drive improvements in code quality via automated testing. Create, maintain automated test and enhancing existing Automation framework. Experience & Exposure Required : Hands-on with Java and good understanding of program logic Experience in Selenium, TestNg, SOAP, browser development tool, Jira Experience in the Microsoft Office suite (Word, Excel) Must have working knowledge of SQL. Developing and executing formal test scripts for quality releases Test execution, defect management and test results reporting Defining and tracking QA metrics like defect count by stages Walk-in Date/ Time: 16th March - 21st March , 10 AM onwards Interview Venue: Extramarks Education India Pvt. Limited D-180, Sector 63 Noida - 201 301. Contact Person- Mr. Sungkrityayan Khan","location":"Noida","experience":"2 - 4 Years"},{"date":"16, 17 - Mar - 2020","skills":"Automation Testing, Manual Testing, Data Warehousing, Database testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Arctern - A Volt Information Sciences Company, Shreeji Asia, 4th Floor, Siddappa Layout, Bommanahalli, Bangalore - 560 068","phone":"8068103300","profile":"Quality Assurance/ Testing Analyst \nArctern Consulting Private Limited","description":"Arctern Consulting Private Limited is hiring for Quality Assurance/ Analyst with experience in multiple domains: 1. HR 2. Analytics 3. Paybill 4. VCG 5. Front office 6. Finance Candidate should have 3+ years with experience as a tester for a web application, major application integration and/or major application product release. Experience with functional, integration, regression, ad-hoc, performance, smoke, automated and end-to-end testing. Strong knowledge of system testing best practices, methodologies and techniques. Practical knowledge in importing data for use in report software, spreadsheets, graphs, and flow charts. Proven data analysis, data verification, and problem-solving abilities. Should have experience with statistical reporting and analysis. Experience with the software development life cycle. Exposure to automated test frameworks and developing automated scripts. Exposure to AGILE. Experience with domains mentioned above Worked on Java, .Net, Webservices, Cloud. Shift: 01:00 PM to 10:00 PM IST Available to Join: Maximum 15 days and not beyond that Walk-in Date/ Time: 16th March - 17th March 2020, 2 PM onwards Interview Venue: Arctern - A Volt Information Sciences Company, Shreeji Asia, 4th Floor, Siddappa Layout, Bommanahalli, Bangalore - 560 068","location":"Bangalore","experience":"3 - 8 Years"},{"date":"16, 17 - Mar - 2020","skills":"Software Engineering, Technical Design, Project Implementation, Test Case Design","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Incedo Technology Solutions Limited, 248, Udyog Vihar Phase 4, Gurgaon","phone":"0124-4765354","profile":"Senior Software Engineer- RPA \nIncedo Technology Solutions Limited","description":"Person would be required to work with team of application developers and collaborate with a senior architect and solution designer to effectively deliver projects, enhancements, and applications. Develop end to end RPA solutions from requirements gathering to bot deployment focusing on scalability and extensibility using UI Path and .Net Work with the Product Owners, Business Analysts, RPA Architect, and operations teams including teams from Incedos clients for creating technical design documents and project implementation. Develop solutions following the best practices around coding, design, quality, and performance. Develop solutions considering functionality, data, security, integration, infrastructure, and performance and ensure maximum robot utilization. Agree and set automation SLA\\'s and standardize automation reporting process Work with testing teams and other users to assist in test design/ test cases creation and during SIT/UAT etc.. Interview Details- Walk-in Date-16th March - 17th March 2020 Timings - 4:00 pm to 7:00 pm Interview Venue: Incedo Technology Solutions Limited 248, Udyog Vihar Phase 4, Gurgaon Contact Person- Anjana Srivastava","location":"Noida","experience":"4 - 9 Years"},{"date":"17, 18, 19, 20, 21 - Mar - 2020","skills":"Android SDK, Java, Andriod, SQl, MySQL","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Unique Measurement Servicesm No. 43, 1st Cross Street, Nearby Milk Dairy Hegganahalli Bus Stop, Doddanna Industrial Estate, Near Peenya 2nd Stage, Hegganahalli, Bengaluru - 560 091.","phone":"994025035","profile":"Front Office/ Receptionist \nUnique Measurement Services","description":"Candidate should be Any Graduate with 0 to 1 year experience in Front Desk, Office Assistance, Front Office/ Reception Activities. Must have excellent communication skills. Job Responsibility- Great and Welcome Customers Answer all incoming calls and redirect them with right person Inward,Outward product,Payment & Cash collection in dailybasis Customer Feedback & Enquiry Incoming calls record. Daily maintain Attendance & Collecting courier Walk-in Date/ Time: 17th March - 21st March , 10 AM onwards Interview Venue: Unique Measurement Services No. 43, 1st Cross Street, Nearby Milk Dairy Hegganahalli Bus Stop, Doddanna Industrial Estate, Near Peenya 2nd Stage, Hegganahalli, Bengaluru, Karnataka - 560 091. Contact Person- SHARATHBABU Phone: 994025035","location":"Bangalore","experience":"0 - 1 Years"},{"date":"17, 18, 19, 20 - Mar - 2020","skills":"Utility, Customer Service, Email Support, Customer Support","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Capita India Private Limited, Magarpatta City, SEZ Building, B1 Tower Hadapsar, Pune","phone":"Not Provided","profile":"Back Office Executive \nCapita India Private Limited","description":"We are hiring for UK International Customer Service - Back Office Executive role in Capita. Mention below is the key skills. Any Graduate can apply. (BE & B. Tech Not Eligible) Must have excellent communications skills. Need to be ok with rotational shifts. Transport is provided (home pick-up and drop) Role & Responsibility: Comprehending and processing the contacts received Working on all the queues assigned by the manager Meeting productivity and quality Typing Speed - Is able to type with 30 wpm with 90% accuracy Logical Reasoning Test - Is able to use and apply logic and reasoning to tackle different queries Comprehension skills - Is able to understand the nature of query to take the appropriate action Writing skills (Grammar, spellings & Punctuation) - Is able to write without any grammatical errors and uses the correct spelling and appropriate punctuation marks. Basic computer knowledge & Microsoft word - Is able to use computers as per the requirements and is able to format using MS Word. Interested candidates can directly WALK-IN with their updated CV and one photo ID proof on the mention below given address from 17th March - 20th March 2020, 10 AM onwards Capita India Private Limited Magarpatta City, SEZ Building, B1 Tower Hadapsar, Pune Near Laxmi Lawns (Entry From Material Gate) Contact Person :-Nikita Mathur No Walk-In on Saturday & Sunday","location":"Pune","experience":"0 - 3 Years"},{"date":"18 - Mar - 2020","skills":"back office processing, business services, service quality, customer service","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"HCL Technologies Limited, 1st Floor Pioneer Square, Building, Sector 62, Near, Rapid Metro Station 55-56, Gurgaon.","phone":"9599555476","profile":"Backend Process Executive \nHCL Technologies Limited","description":"Career Opportunity in Insurance Industry for Non Technical Graduate fresher, with HCL Technologies Ltd - Business Services for the profile of Customer Service Executive (Back Office Process). 100 % Back Office Profile (No Calling). Both side Cabs, Free meal and Fixed weekend offs. Educational Requirement: BBA, BA, B Com, B.SC Graduates (Only 2016/2017/2018,2019 and 2020 Pass-outs are eligible for this opening) Note: Technical graduates / Regular MBA's are not eligible for this opening. Work Experience: Freshers / Maximum 6 months experience Shifts : 24*7 (Rotational) Salary: Upto 2.50 LPA Job Location: Gurgaon Roles and Responsibilities:- Manage and update Insurance Member and Plan data on multiple systems. Enter new member data into excel and enrollment forms. Processes customer requests in a timely and accurate manner. Communicates with customers through written correspondence. Using PC application and functions such as Excel and Word to update and load data sets. To answer queries coming from end user customers in a polite and professional manner. Skill Set Required:- Good typing speed (25 wpm with 80% Accuracy). Strong commitment to customer service and quality Excellent Keyboard Skills Demonstrates a strong customer service orientation. Takes responsibility to follow up with customers to ensure their needs and expectations are satisfied. Walk-in Date: 18th March 2020 Timings - 11 AM to 3 PM Interview Venue:- HCL Technologies Limited 1st Floor Pioneer Square, Building, Sector 62, Near, Rapid Metro Station 55-56, Gurgaon. Write Yogendra on the Top Left of your Resume Contact - Yogendra Singh Bisht ( 9599555476 ) Need to Carry: Updated CV, All education certificates (Original & Xerox copy) & Govt address / ID proof.","location":"Gurgaon","experience":"0 - 1 Years"},{"date":"17, 18, 19, 20 - Mar - 2020","skills":"HR Helpdesk/ Employee services, Email/ Chat/ Voice based support","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Wipro HR Services (India) Private Limited Ground Floor, Building 2, Candor Tech Space Tikri, Sector 48, Gurgaon, Haryana","phone":"Not Provided","profile":"Back Office Associate (HR Process) \nWipro HR Services (India) Private Limited","description":"Qualification: Any Graduate/ PG Shifts: 24*5 (Sat & Sun off) Both sides free transport (If falling under service zone) Candidate should have 1 year of relevant QA/ QC experience, Acting SME on floor support /Auditor- Transaction Monitoring + HR Helpdesk/ Employee Services, Email/ Chat/ Voice based support on HR extended processes Must have excellent communication skills (both written & verbal) Auditing and customer handling experience Logical thinking Interested? Directly walk-in from 16th - 20th March 2020 on the above mentioned address. Interview timings: 11 AM - 3 PM Wipro HR Services (India) Private Limited Ground Floor, Building 2, Candor Tech Space Tikri, Sector 48, Gurgaon, Haryana","location":"Gurgaon","experience":"2 - 6 Years"},{"date":"17 - Mar - 2020","skills":".Net (VB .Net and C#), ASP .Net, MVC , Java Script, Angular JS, HTML5, XML, Ajax","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Optum- A UnitedHealth Group Company, Tower-A, 5th floor, Building No. 6, Phase-3, Sector 24, Gurgaon - 122 001","phone":"Not Provided","profile":"Claims Associate (Backend Operations) \nOptum- A UnitedHealth Group Company","description":"Required Qualifications: Graduate from a recognized university Fresher or 1 year of experience in any back office operations Comfortable working in Night Shifts (5:45 PM to 3:15 AM and 8:30 PM to 6:00 AM) Must have an ability to multi-task, this includes ability to understand multiple products and multiple levels of benefits within each product. Ability to remain focused and productive each day though tasks may be repetitive. Ability to understand and apply plan concepts to include: - Deductible - Coinsurance - Co-pay - Out-of-pocket - State variations Proficiency in product lines applicable to processing unit Result-oriented and goal-driven Critical thinking abilities Good verbal and written communication skills Ability to accept constructive criticism with being coached and growing as a professional Analytical ability: Research skills combined with effective decision-making and superior interpersonal skills Ability to multitask Primary Responsibilities: Accurate processing and completion of medical claims Process claims that route out of automatic adjudication, within current turnaround standards Walk-in Interview on 17th March from 11 AM onwards Interview Venue: Optum- A UnitedHealth Group Company Tower-A, 5th floor, Building No. 6, Phase-3, Sector 24, Gurgaon - 122 001 Near DLF Phase 3 metro station","location":"Gurgaon","experience":"0 - 1 Years"},{"date":"16, 17, 18 - Mar - 2020","skills":"C#, .NET 4.5+ Core, ASP .NET MVC, MS SQL/ MySQL/ Oracle","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Cloudstrats Technologies Private Limited, AA-57 Kailas Vaibhav Complex, Hiranandani Link Road Vikhroli (West), Mumbai - 400 079","phone":"022-40251804","profile":"Junior .Net Developer \nCloudstrats Technologies Private Limited","description":"Person should have good experience on C#, .NET 4.5+ Core, ASP .NET MVC applications Must have proficient knowledge in MS SQL/ MySQL/ Oracle Willing to learn excel in new Cloud Native skills Has Delivered high-quality applications Must have excellent communication skills Walk-in Date/ Time: 16th March - 18th March , 11 AM onwards Interview Date: Cloudstrats Technologies Private Limited AA-57 Kailas Vaibhav Complex, Hiranandani Link Road Vikhroli (West), Mumbai - 400 079 [Near Nagbaba Temple] Email to hr@cloudstrats.com Contact - Nayana Rankhambe (022-40251804)","location":"Mumbai","experience":"4 - 9 Years"},{"date":"16, 17 - Mar - 2020","skills":"Php, JavaScript, HTML, XHTML, CSS, AJAX, SQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"MicroHost: Scalable Cloud Servers Provider, A-43, Sector 63 Rd, A Block, Sector 63, Noida, Uttar Pradesh - 201 301","phone":"9870442297","profile":"PHP/ Software Developer \nMicro Hosting Private Limited","description":"Candidate must have strong knowledge of JavaScript, HTML, XHTML, CSS, AJAX, SQL. Object-Oriented Programming experience is required Should have good experience in Core PHP & MySQL Build efficient, testable, and reusable PHP modules Should have good knowledge of web services Walk-in Date/ Time: 16th March - 17th March , 10 AM onwards Interview Venue: MicroHost: Scalable Cloud Servers Provider A-43, Sector 63 Rd, A Block, Sector 63, Noida, Uttar Pradesh - 201 301 Contact - Shilpa ( 9870442297 )","location":"Noida","experience":"2 - 4 Years"},{"date":"16, 17, 18 - Mar - 2020","skills":"Customer Service, Product Knowledge, Quality Focus, Problem Solving Skills","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Sutherland Global Services Private Limited, SHRIRAM THE GATEWAY, Block A1, ground floor,# 16, GST Road, Perungalathur, Chennai - 600 063","phone":"9384013068","profile":"Technical Support Associate \nSutherland Global Services Private Limited","description":"Skills and Qualifications: Customer Service, Product Knowledge, Quality Focus, Problem Solving, Market Knowledge, Documentation Skills, Listening, Phone Skills, Resolving Conflict, Analyzing Information , Multi-tasking Candidates should possess excellent communication (English/ Hindi) Job Responsibility- Attract potential customers by answering product and service questions; suggesting information about other products and services. Opens customer accounts by recording account information. Maintains customer records by updating account information. Resolves product or service problems by clarifying the customer's complaint; determining the cause of the problem; selecting and explaining the best solution to solve the problem; expediting correction or adjustment; following up to ensure resolution. Maintains financial accounts by processing customer adjustments. Recommend potential products or services to management by collecting customer information and analyzing customer needs. Prepare product or service reports by collecting and analyzing customer information. Contribute to team effort by accomplishing related results as needed. Walk-in Date : 16th to 18th March 2020 Time : 10.30 AM - 1.30 PM Walk in Details: Sutherland Global Services Private Limited SHRIRAM THE GATEWAY, Block A1, ground floor,# 16, GST Road, Perungalathur, Chennai - 600 063 HR Contact : Ms. Reshma HR Phone: 9384013068","location":"Chennai","experience":"0 - 4 Years"},{"date":"16, 17, 18, 19 - Mar - 2020","skills":"Technical Support, Customer Support, Email Process","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Alankit House 4E/2, Jhandewalan Extension New Delhi. Landmark - Near Post Office","phone":"011-42541144","profile":"Support Executive (E-mail Process) \nAlankit limited","description":"Candidate should be Minimum Graduate with good hands on experience in handling e-mails of our existing and new clients. Follow communication scripts when handling different topics. Identify customer's needs, clarify information and provide solutions. Record each concerns on CRM software, as per company's policies and procedures. Follow up with internal department for customer's complaints. Essential Requirements- Only candidates having E-mail handling experience can apply. Have a good positive attitude-should be committed to the work Should possess good written and problem-solving skills Typing speed of atleast 30 words/ minute BPO/ Call Center experience preferable Multi-tasking abilities Interested candidates can come directly for F2F Interview from 16th to 19th March 2020 at below mentioned address: Alankit House 4E/2, Jhandewalan Extension, New Delhi Landmark - Near Post Office, Nearest Metro Station - Jhandewalan Contact Details: Ratika Saxena Phone: 011-42541144/ 7290012324 Interview Timings : 10 AM - 1 PM","location":"Delhi","experience":"1 - 4 Years"},{"date":"16, 17, 18, 19, 20 - Mar - 2020","skills":"Technical Support, Customer Service, Non Voice/ Chat Process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Knoah Solutions Private Limited, 4th & 5th Floor, Maximus Towers 2A, Raheja Mindspace IT Park, Hitech City, Madhapur, Hyderabad- 500 081.","phone":"4044309780","profile":"Support Executive (Chat & Email Process) \nKnoah Solutions Private Limited","description":"Candidate should be Any Graduate with 0 to 3 years of experience in Technical Support, Customer Service, Non Voice/ Chat Process. Provide customer service for electronic products such as Automated Home Appliances & High-definition Consumer goods. Provide technical assistance through web-chat and email-based communication tools. Troubleshooting & resolving customer issues Walk-in Date/Time: 16th March - 20th March , 11 AM onwards Interview Venue: Knoah Solutions Private Limited 4th & 5th Floor, Maximus Towers 2A, Raheja Mindspace IT Park, Hitech City, Madhapur, Hyderabad- 500 081. Contact Person- Brij Phone: 4044309780","location":"Hyderabad","experience":"0 - 3 Years"},{"date":"16, 17 - Mar - 2020","skills":"Front office, Front Desk/ Receptionist Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Sarvagunaushdhi Private Limited, 13 th Floor, Pearl Best Heights-1, Netaji Subhash Place, Pitampura, New Delhi - 110 034","phone":"011-40395204","profile":"Front Office Executive \nSarvagunaushdhi Private Limited","description":"Candidate should have 2 to 5 year of prior experience in same domain Hands on experience air ticketing & hotel Booking Courier Management experience Hands of experience on Microsoft Outlook, can share the e-mails and calender Can be able to handle housekeeping staff and their leave records Pleasing and docile personality towards the work Can able to handle clients and admin role Looking for immediate joiner Walk-in Date/ Time: 16th March - 17th March 2020, 10 AM onwards Interview Venue: Sarvagunaushdhi Private Limited 13 th Floor, Pearl Best Heights-1, Netaji Subhash Place, Pitampura, New Delhi - 110 034 Contact Person- Seema Bhatia (011-40395204)","location":"Delhi","experience":"2 - 5 Years"},{"date":"16, 17, 18, 19, 20, 21 - Mar - 2020","skills":"Front Office/ Receptionist Activities, Security Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"AIG Hospital Beside Ramky Towers Gachibowli | Hyderabad Telangana - 500032","phone":"9100773181","profile":"Guest Relation Executive \nAsian Institute of Gastroenterology Pvt. Limited","description":"Education:- Any Graduate with good communication skills and presentability. Only FEMALE candidates need to apply Work Experience: 0 - 5 Years Job Responsibility- Greet and welcome guests as soon as they arrive at the office Direct visitors to the appropriate person Answer, screen and forward incoming phone calls Ensure reception area is tidy and presentable, with all necessary stationery and material Provide basic and accurate information in-person and via phone/email Maintain office security by following safety procedures and controlling access via the reception desk (monitor logbook etc) Order front office supplies and keep inventory of stock of stationary Perform other clerical receptionist duties such as filing, photocopying, transcribing and faxing Walk-in Date/ Time: 16th March - 30 April 2020, 10 AM onwards Interview Venue: AIG Hospital Beside Ramky Towers Gachibowli | Hyderabad Telangana - 500032 Contact Person- Madhu (9100773181)","location":"Hyderabad","experience":"0 - 5 Years"},{"date":"16, 17 - Mar - 2020","skills":"Staffing, Human Resource Management, Hiring/ Sourcing","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Survik Software Private Limited, 1st Floor, Tech Summit., Sr. No. 87, Plot No. 110, Near Ganraj Mangal Karyalaya, Veerbhadra Nagar, Baner, Pune - 411 045","phone":"8956975110","profile":"HR Management Trainee \nSurvik Software Private Limited","description":"Attract and hire candidates through various channels and ensure timely hiring of the candidate Develop a pool of qualified candidates in advance of need. Work with hiring managers to create job descriptions Screen applicants to evaluate if they meet the position requirements Potential employee sourcing through various Job Portals. Communicating employer information and benefits during screening process. Network through industry contacts, social media, and employees. Performing in-person and phone interviews with candidates Making recommendations to company hiring managers Performing reference and background checks Following up on the interview process status Maintaining relationships with both internal and external clients to ensure staffing goals are achieved. Accomplishes human resources and organization mission by completing related results as needed. During the probation period selected individuals will get the opportunity to undergo the training program. Walk-in Date/ Time: 16th March - 17th March , 10 AM onwards Interview Venue: Survik Software Private Limited 1st Floor, Tech Summit., Sr. No. 87, Plot No. 110, Near Ganraj Mangal Karyalaya, Veerbhadra Nagar, Baner, Pune - 411 045 Landmark: Opposite to Ever Smile Dental Clinic,","location":"Pune","experience":"0 - 1 Years"},{"date":"16 - Mar - 2020","skills":"HR/ Recritment, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Tech Mahindra Limited, (Gate 1), Takshasila, Survey No. 62/1 A, Qutubullapur Mandal, Bahadurpally Village, District Ranga Reddy, Hyderabad - 500 043","phone":"9515106455","profile":"HR Recruiter (Female) \nTech Mahindra Limited","description":"Tech Mahindra Limited is hiring candidates for the HR Recruiter profile. This is an Urgent Requirement, hence we require immediate joiners. Work Experience: 6 months to 2 years Location: Hyderabad (Bahadurpally) Candidate should have good communication skills Experience in working on Job Portals is mandatory. High level of interpersonal skills and integrity; solid team player. Creative, forward thinker should be alert and receptive. Walk-in Date: 16th March 2020 Interview Timings : 12:00 to 1:00 PM Interview Venue: Tech Mahindra Limited (Gate 1), Takshasila, Survey No. 62/1 A, Qutubullapur Mandal, Bahadurpally Village, District Ranga Reddy, Hyderabad - 500 043 Contact Person- Sunita ( 9515106455 ) Kindly bring a copy of your updated resume and Aadhaar card. For more information reach Sunita HR-9515106455","location":"Hyderabad","experience":"0 - 2 Years"},{"date":"16, 17, 18, 19, 20 - Mar - 2020","skills":"HTML, PHP, Core PHP, JavaScript and CSS Coding","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Dev Technosys Private Limited, 11, Lal Bahadur Nagar, Sector 9, Malviya Nagar, Jaipur, Rajasthan - 302 017","phone":"0141-4107667","profile":"PHP Developer - Cakephp/ Laravel \nDev Technosys Private Limited","description":"Skill Requirements:- 1. Good knowledge of HTML, PHP, Core PHP, JavaScript and CSS Coding. 2. Good understanding of OOPS Concepts. 3. Knowledge of databases and database concepts. 4. Should have Analytical and problem-solving skills. 5. Core PHP, MySql, Cake PHP, Codeginiter, Opencart, Magento (Optional) 6. Must be a team player, keen to learn, posses a good attitude and be self-discipline Job Responsibilities:- 1. Developing websites from Photoshop/ JPG designs 2. Developing websites using existing CMS solutions 3. Developing bespoke CMS solutions 4. Developing plug-ins/ add-ons in PHP for various CMS solutions 5 .Working knowledge of frameworks like CakePHP , MVC, any one framework 6. Ability to work on multiple projects at the same time and complete tasks in a timely manner Walk-in Date/ Time: 16th March - 31st March 2020, 11 AM onwards Interview Venue: Dev Technosys Private Limited 11, Lal Bahadur Nagar, Sector 9, Malviya Nagar, Jaipur, Rajasthan - 302 017 Contact - Pooja Gogna ( 0141-4107667 )","location":"Jaipur","experience":"1 - 2 Years"},{"date":"16, 17, 18, 19, 20, 21 - Mar - 2020","skills":"Core Php, MySQL, XML, HTML, HTML5, XHTML, CSS, JavaScript, Ajax, JQuery","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Extramarks Education India Pvt. Limited, D-180 , Sector 63 Noida - 201301.","phone":"Not Provided","profile":"PHP Developer \nExtramarks Education India Pvt. Limited","description":"Candidate must have strong knowledge in Core Php, MySQL Database. Analyse, Create and Normalize database independently. Strong in Smarty, Zendwith installation process. Strong in JavaScript, Ajax, JQuery. Knowledge of Apache Server and Linux. Knowledge of XML, HTML, HTML5, XHTML, CSS. Should be able to handle the project independently. Can understand and work on running projects. Can be able to handle multiple projects simultaneously. My SQL. Code Ignitor Walk-in Date/ Time: 16th March - 21st March , 10 AM onwards Interview Venue: Extramarks Education India Pvt. Limited D-180 , Sector 63 Noida - 201301. Contact Person- Mr. Sungkrityayan Khan","location":"Noida","experience":"1 - 4 Years"},{"date":"16, 17, 18, 19, 20 - Mar - 2020","skills":"PHP, HTML, CSS, Javascript, AJAX, MySQL, Mongo DB","qualification":"B.E./B.Tech, MCA/PGDCA","address":"A-105, Greenscape Technocity Shil Phata Mahape Road, Next to Country Inn & Suites Mahape, Navi Mumbai - 400 701","phone":"8657487488","profile":"PHP Developer \nApMoSys Technologies Private Limited","description":"Candidate must have proven software development experience in PHP Demonstrable knowledge of web technologies including HTML,CSS, Javascript, AJAX, etc Good knowledge of MySQL, Mongo DB The capacity to understand accessibility & Security Compliance proficiency with code tool Passion for best design and coding practices and a desire to develop new bold ideas. Strong problem-solving and analytical skills. Open to travel anywhere in Mumbai. immediate joiner required. Walk-in Date: 16th - 20th March 2020 Time : 10 :00 AM - 4 PM Interview Venue: ApMoSys Technologies Private Limited A-105, Greenscape Technocity Shil Phata Mahape Road Next to Country Inn & Suites Mahape Navi Mumbai - 400 701 Contact Person- Bhairavi ( 8657487488 ) Interested candidates can share their profile on hrd@apmosys.in","location":"Mumbai","experience":"3 - 5 Years"},{"date":"16, 17, 18, 19, 20 - Mar - 2020","skills":"Technical Support, Blended Process, Voice Voice Process, Network Support","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Tech Mahindra Limited, Tech Boulevard, Tower C, Sector-127, Noida - 201 304","phone":"9318358303","profile":"Technical/ Network Support Engineer \nCognizant Technologies Solutions Limited","description":"Tech Mahindra is hiring fresher's and experienced candidates for Technical/ Network Support for Tech Voice Process. Experience Range: Any experience eligible. Freshers can also apply Both side Transport facility available (Pick & Drop) 5 Days Working. Skills Required:- 1. Good communication skills. 2. Excellent logical reasoning 3. Candidate should be aware of good technical knowledge. 4. Troubleshooting of technical related issues and ensure to resolve the issues or queries over the call. 5. Candidate should be flexible to work in 24*7 environments, comfortable to work in night shifts. 6. Result awaited candidates can also apply. Walk-in Date: 16th - 20th March 2020 Timing: 11:30 AM to 4 PM Interview Venue: Tech Mahindra Limited Tech Boulevard, Tower C, Sector-127, Noida - 201 304 Contact Person: Keshav Rana Contact No. 9318358303 Documents Required- 1 .SSC (Mark sheet & Certificate) 2. HSC (Mark sheet & Certificate) 3. Graduation CMM or PC 4. Offer, Relieving Letter and last 3 months of Salary Slips(If any) 5. Pan Card 6. Aadhar Card (Mandatory)","location":"Noida","experience":"0 - 6 Years"},{"date":"16, 17 - Mar - 2020","skills":"Customer service, Back office processing, Business services","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Integreon Managed Solutions India Pvt. Limited, 4th Floor, Nesco IT park, Gate 3, Off Next to Hub Mall, Western Express Highway, Goregoan (East), Mumbai","phone":"Not Provided","profile":"Back Office Associate \nIntegreon Managed Solutions India Pvt. Limited","description":"Candidate should be Any Graduate with good communication skills Should be comfortable working in rotational shifts Should be able to join immediately Work Location: Goregoan (East), Mumbai Job Type: Full-time/ Permanent Role and Responsibilities: Maintain organizational and client confidentiality Produce client worthy documents using MS Office applications Adhere to style guide provided by client Ensure all work is completed as per instructions with the project modifying, revising and editing jobs Adhering to estimates and deadlines for completion of jobs Operate as per the defined workflow processes and Standard Operating Procedures Continue to develop speed and accuracy for producing documents Understand, use and contribute to best practices for production Ensure accurate record keeping and time tracking Follow proper document management systems Adaptable to changes in work-environment, following instructions for work request processing and day to day responsibilities Walk-in Date: 16th - 17th March 2020 Timing: 12 pm to 2 pm Interview Venue: Integreon Managed Solutions India Pvt. Limited 4th Floor, Nesco IT park, Gate 3, Off Next to Hub Mall, Western Express Highway, Goregoan (East), Mumbai Contact Person- Jesilda Fernandes","location":"Mumbai","experience":"0 - 5 Years"},{"date":"14 - Mar - 2020","skills":"HR/ Recruitment, Talent Acquisition, Sourcing, Screening, Validating, Scheduling","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Plot No: 446, S Chandra Reddy Towers, 100 Feet Road, Ayyappa Society, VIP Hills, Silicon Valley, Madhapur, Hyderabad, Telangana - 500 081","phone":"040 23112525","profile":"HR/ Recruitment Specialist \nMadhees Techno Consulting Private Limited","description":"Looking for HR/ Recruitment Specialist who are good with End to End recruitment like Sourcing, Screening, Validating, Scheduling, followup till resource joining. Must have excellent communication skills Qualification: Any Graduate/ Post Graduate (MBA-HR) Work Experience: 1 - 4 Years Job Location: Hyderabad Walk-in Date/ Time: 14th March 2020, 10 AM onwards Interview Venue: Plot No: 446, S Chandra Reddy Towers, 100 Feet Road, Ayyappa Society, VIP Hills, Silicon Valley, Madhapur, Hyderabad, Telangana - 500 081 Contact Number: 040 23112525 Contact - Kiran Srinivas","location":"Hyderabad","experience":"1 - 4 Years"},{"date":"13, 14 - Mar - 2020","skills":"Back Office, Data Entry, Customer Service","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"KMI Business Technologies Pvt. Limited, 1008, Dalamal House, Nariman Point, Mumbai - 400 021","phone":"022 22023021","profile":"Back Office/ Data Entry Assistant \nKMI Business Technologies Pvt. Limited","description":"Candidate should be Any Graduate with 5 - 8 years of experience in Back Office, Data Entry. Good written & verbal communication, customer service. Able to communicate complex issues with good presentation skills. Excellent problem solving skills. Self-motivated and adaptable, to be able to work with minimal supervision. Must have good interpersonal skills. Secretarial Responsibilities - Assisting the Director in his day to day work. Drafting letters & other correspondence. Handling day to day admin activities Preparation of contracts and agreements and filing the same. Handling International Calls, Clients Coordination and Team. Attending calls on various complaints, request and forwarding the same to the concerned departments. Ensure smooth operations at all times. Walk-in Date: 13th March - 14th March 2020 Interview timing: 10.30 am to 5:30 pm Interview Venue: KMI Business Technologies Pvt. Limited 1008, Dalamal House, Nariman Point, Mumbai - 400 021 Contact Person- Gita Shah Tel No. 022 22023021 E-mail ID- hrd@kmi.co.in","location":"Mumbai","experience":"5 - 8 Years"},{"date":"14 - Mar - 2020","skills":"C# .Net, Asp .Net, ADO.Net, JQuery/ Java Script, Sql Server, Ajax, XML, Json, Web Services, HTML, CSS","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"NetEdge Computing Solutions Pvt. Limited, NetEdge Tower C - 56/39, Sector - 62 Noida - 201 301.","phone":"78388-37993","profile":"Front Office Executive (Female Only) \nNetEdge Computing Solutions Pvt. Limited","description":"The candidate must have below mentioned skills: Ability to Communicate in English Pleasing Personality Good Presentation & Technical Writing Skills Excellent MS Office Skills (Word, Excel & PowerPoint) Ability to Manage a Team of Office Boys Prior Experience working with similar position Strong in Presentation & Documentation Should be Confident & Committed Eager to prove her capabilities / Impatient POSITION IS OPEN FOR FEMALES ONLY Walk-in Date/ Time: 14th March 2020, 11 AM onwards Interview Venue: NetEdge Computing Solutions Pvt. Limited NetEdge Tower C - 56/39, Sector - 62 Noida - 201 301. Contact Person- Neetu Minhas Phone No: 78388-37993","location":"Noida","experience":"1 - 2 Years"},{"date":"13, 14 - Mar - 2020","skills":"Office Administration, Facilities Management, Housekeeping","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Next Education India Private Limited, Sri Nilaya Cyber Spazio, 1st Floor, East Wing Road No. 2, Near Annapurna Studios, Banjara Hills, Hyderabad, Telangana - 500 034.","phone":"8179409689","profile":"Admin Executive/ Freshers \nNext Education India Private Limited","description":"We are looking for Admin Executive for a growing company for Management role, Person need to Supervise the employees for performing different tasks. Please go through the Job Responsibilities below carefully. Goods Dispatch, Invoice Preparation, dealing with Transport. Maintaining Sale & stock Statement Tracking Material Consumption Preparing Reports Only freshers required Walk-in Date/ Time: 12th March - 14th March 2020, 2 PM onwards Interview Venue: Next Education India Private Limited Sri Nilaya Cyber Spazio, 1st Floor, East Wing Road No. 2, Near Annapurna Studios, Banjara Hills, Hyderabad, Telangana - 500 034. Contact Person- Payal (8179409689)","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"17, 18 - Mar - 2020","skills":"ASP .NET, VB .Net","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"DOCS Solutions Private Limited, 1st Floor, Plot No. 6/19, Compound No. 82, (Near compound no 24) Marol Co-operative Industrial Estate, Near Marol Bhavan, M.V.Road, Andheri (E), Mumbai - 400059.","phone":"022-62315800","profile":"Trainee Software Developer \nEDOCS Solutions Private Limited","description":"Fresher with the required qualification BSC IT/ BCA/ MCA are most welcome 0 - 6 months of experience in Trainee Software will be added advantage. Freshers are most welcome. Knowledge of ASP .NET will be added advantage Knowledge and Experience regarding VB/.Net will be added advantage. There is a walk in drive on 17th & 18th March 2020 to as the address is mentioned below - Timing- 10.00 am to 5.00 pm EDOCS Solutions Private Limited 1st Floor, Plot No. 6/19, Compound NO.82, (Near compound no 24) Marol Co-operative Industrial Estate, Near Marol Bhavan, M.V.Road, Andheri (E), Mumbai - 400059. Landmark End of the road near Artch Sterling on Times square building lane.Near Shemaroo office Contact No - 022-62315800/ 62315898 Mobile - 9076372940 Kindly forward your resume on manager.hr@edatamails.com","location":"Mumbai","experience":"0 - 1 Years"},{"date":"13, 14 - Mar - 2020","skills":"Back Office Assistance, General Administration, Office Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Alankit House, 4E/2 Jhandewalan Extension, Near post office New Delhi -110 055. Nearest Metro Station - Jhandewalan","phone":"+917290067785","profile":"Back Office Assistant (Female) \nAlankit Limited","description":"We are hiring Personal / Executive Secretary to Senior profile at our corporate Office. Person must be having minimum 5 years of experience of working as secretary to senior level management preferably having international business operations dealings. Must possess excellent interpersonal skills for effective dealing with various internal and external stakeholders including senior management of the organization. Coordinate with our internal staff to ensure timely delivery of the assigned work. To ensure that the Day-to-Day Operations of the Office Run Effectively and Efficiently as arrange and confirm Appointments, Maintain Schedule and Calendars. Organize and coordinate Meetings, Conference. To attend board meetings and take minutes and distribute that points of all Department. Prepare MIS reports, collect and analyze information, prepare presentations. Be a self-starter who can anticipate needs and fulfill them in a proactive manner. Ability to communicate at all levels of the organization, driven motivated to continually learn. Must have excellent command over spoken and written English with good presentation skills. Must be able to correspondent independently Eligibility Criteria- Should be Above 30 years Presentable, Should be able to multi task. Filter emails, highlight urgent correspondence and print. Can communicate in English(excellent communication skills) Should be good in Office Management or Secretarial Practice. Smart, Proactive, Ready to face challenges Manage and maintain the Officer's diary and email account. Walk-in Drive/ Time: 12th March - 14th March 2020, 10 AM onwards Venue Details : Alankit House, 4E/2 Jhandewalan Extension, Near post office New Delhi -110 055. Nearest Metro Station - Jhandewalan Contact Person:- Mr. Prince Chadha Contact No. +917290067785 Email Id : Princec@alankit.com","location":"Delhi","experience":"5 - 9 Years"},{"date":"14 - Mar - 2020","skills":"Core Java, JPA and Hibernate, Java Spring Framework, Java Micro Services","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Nalashaa Solutions (India) Private Limited, # 73/ 37, 14th Cross, 9th Main, Sector 6, HSR Layout, Bangalore - 560 102.","phone":"Not Provided","profile":"Fullstack Java Developer \nNalashaa Solutions (India) Private Limited","description":"Candidate must have experience in Core Java, JPA and Hibernate, Java Spring Framework, Java Micro Services. Knowledge on Application Servers like wildly (JBOSS). Must have experience in building Restful web services, Web API, HTML, CSS3, JavaScript. Must have experience with PostgreSQL RDBMS & should be capable of writing queries, stored procedures, views, triggers. Strong verbal and written communication skills that enables them to understand, document and describe complex technical subjects. Good knowledge on Object Oriented Programming, Design Patterns, Shell script, Perl. Good to have knowledge on UNIX commands Roles & Responsibilities- Perform frequent peer reviews Participate actively in demos. Ready to work for late night if necessary. Share knowledge through collaboration, training, peer review, presentations. Participate daily scrum call. Sprint planning and Retro. Use GIT for version control, Jenkins for automatic build, Crucible code review. Walk-in Date/ Time: 14th March 2020, 10 AM onwards Interview Venue: Nalashaa Solutions (India) Private Limited # 73/ 37, 14th Cross, 9th Main, Sector 6, HSR Layout, Bangalore - 560 102. Contact Person- Ashwani Kumar","location":"Bangalore","experience":"4 - 8 Years"},{"date":"14 - Mar - 2020","skills":"Java, Spring, Hibernate","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Ionixx Technologies, No. L 25 (Second Floor), Dr. Vikram Sarabhai Instronics Estate, SRP Tools, Thiruvanmiyur, Chennai, Tamil Nadu - 600 041. Landmark: Near Velacherry Main Road SRP Tools Bus Stop","phone":"Not Provided","profile":"Java Developer \nIonixx Technologies Private Limited","description":"Candidate should be BE/ B.Tech or MCA with 3 to 7 years of proven working experience in Java, Spring, Hibernate. Must have excellent verbal & written communication skills Work location: Sirusari sipcot IT park Interview Location Velacherry, chennai Mode of Employment: Full time Permanent Walk-in Date: 14th March 2020 (Saturday) Interview Time: 9.00 to 1.00 PM Venue Details: Ionixx Technologies, No. L 25 (Second Floor), Dr. Vikram Sarabhai Instronics Estate, SRP Tools, Thiruvanmiyur, Chennai, Tamil Nadu - 600 041 Landmark: Near Velacherry Main Road SRP Tools Bus Stop Contact Person: Dinakaran (HR)","location":"Chennai","experience":"3 - 7 Years"},{"date":"12, 13 - Mar - 2020","skills":"Core Java SQLite Android SDK Eclipse/ Android Studio XML/ JSON/ REST/ SOAP","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Matrimony.Com Limited, Arihant e Park, Lattice Bridge Road, 2nd Floor, Baktavatsalm Nagar, Adyar, Chennai - 600 020.","phone":"Not Provided","profile":"Android Developer - Java \nMatrimony.Com Limited","description":"Candidate should have experience in Android SDK especially Apps Service Architecture, Design Apps for different versions of Android, different screen sizes and permission requirements. Must have developed minimum 3 to 5 applications in Android platform, Mobile user interface designing. Essential skill Core Java SQLite Android SDK Eclipse/ Android Studio XML/ JSON/ REST/ SOAP Back end computing must include Database Management, Security, Interaction with Hardware, and Memory allocation implementation. Hands-on knowledge of design principles of Android and iOS platforms. Ability to think Out of the box and constantly push the boundaries of app design Walk-in Date: 12th March - 13th March 2020 Timing - 10:00 AM to 4:00 PM Interview Venue: Matrimony.Com Limited Arihant e Park, Lattice Bridge Road, 2nd Floor, Baktavatsalm Nagar, Adyar, Chennai - 600 020. Contact Person- Ms. Gracy","location":"Chennai","experience":"4 - 5 Years"},{"date":"12, 13 - Mar - 2020","skills":"Core/ Advance Java, Seo, Php, Android","qualification":"B.E./B.Tech, MCA/PGDCA","address":"TechIt Group, Corporate Office-Building No. G 13, Basement Cabin B2 Noida. (Near Noida Sector 16 metro station Exit Gate no-3)","phone":"8448336083","profile":"Java Developer/ Freshers \nTechit Group","description":"Candidate should have excellent knowledge of Core/ Advance Java, Seo, Php, Android Qualification: BE/ B.Tech Freshers 2019-2020 batch (Fresher can apply) Must have good knowledge of Coding & Decoding Excellent communication skills Intern/ Freshers can also apply Candidates with 1+ year of experience can apply Salary- 25%hike Walk-in Date: 12th March - 13th March 2020 Interview Timing: 10 am to 1 pm Interview Venue: TechIt Group Corporate Office-Building No. G 13, Basement Cabin B2 Noida. (Near Noida Sector 16 metro station Exit Gate no-3) Note:-2 Min Walk in distance From Metro Station Contact Person: Miss. Nitika Sharma (Sr. Hr Manager) Phone No: 8448336083","location":"Noida","experience":"0 - 1 Years"},{"date":"13, 14 - Mar - 2020","skills":"Core Java, Advanced Java (JSP/ Servlets) Spring Framework","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Spoors Technology Solutions (India) Private Limited, 4th Floor, Sai Prithvi - Cyber Arcades, Above Bata Showroom, Near Indian Oil Petrol Bunk, Madhapur, Hyderabad.","phone":"Not Provided","profile":"Application Developer - Java/ Web \nSpoors Technology Solutions (India) Pvt. Limited","description":"Candidates must have excellent knowledge in CORE JAVA and ADVANCE JAVA (JSP/ Servlets) Spring Framework IDE. Service-Oriented Architecture/ Web Services - SOAP/ REST. Web Technologies like HTML, CSS Should be able to join with in 15-30 days. Walk-in Date/ Time: 13th March - 14th March 2020, 9 AM onwards Interview Venue: Spoors Technology Solutions (India) Private Limited, 4th Floor, Sai Prithvi - Cyber Arcades, Above Bata Showroom, Near Indian Oil Petrol Bunk, Madhapur, Hyderabad. Contact Person- Madhavi","location":"Hyderabad","experience":"2 - 4 Years"},{"date":"17, 18 - Mar - 2020","skills":"ASP .NET, VB .Net","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"DOCS Solutions Private Limited, 1st Floor, Plot No. 6/19, Compound No. 82, (Near compound no 24) Marol Co-operative Industrial Estate, Near Marol Bhavan, M.V.Road, Andheri (E), Mumbai - 400059.","phone":"022-62315800","profile":"Trainee Software Developer \nEDOCS Solutions Private Limited","description":"Fresher with the required qualification BSC IT/ BCA/ MCA are most welcome 0 - 6 months of experience in Trainee Software will be added advantage. Freshers are most welcome. Knowledge of ASP .NET will be added advantage Knowledge and Experience regarding VB/.Net will be added advantage. There is a walk in drive on 17th & 18th March 2020 to as the address is mentioned below - Timing- 10.00 am to 5.00 pm EDOCS Solutions Private Limited 1st Floor, Plot No. 6/19, Compound NO.82, (Near compound no 24) Marol Co-operative Industrial Estate, Near Marol Bhavan, M.V.Road, Andheri (E), Mumbai - 400059. Landmark End of the road near Artch Sterling on Times square building lane.Near Shemaroo office Contact No - 022-62315800/ 62315898 Mobile - 9076372940 Kindly forward your resume on manager.hr@edatamails.com","location":"Mumbai","experience":"0 - 1 Years"},{"date":"13, 14 - Mar - 2020","skills":"Back Office Assistance, General Administration, Office Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Alankit House, 4E/2 Jhandewalan Extension, Near post office New Delhi -110 055. Nearest Metro Station - Jhandewalan","phone":"+917290067785","profile":"Back Office Assistant (Female) \nAlankit Limited","description":"We are hiring Personal / Executive Secretary to Senior profile at our corporate Office. Person must be having minimum 5 years of experience of working as secretary to senior level management preferably having international business operations dealings. Must possess excellent interpersonal skills for effective dealing with various internal and external stakeholders including senior management of the organization. Coordinate with our internal staff to ensure timely delivery of the assigned work. To ensure that the Day-to-Day Operations of the Office Run Effectively and Efficiently as arrange and confirm Appointments, Maintain Schedule and Calendars. Organize and coordinate Meetings, Conference. To attend board meetings and take minutes and distribute that points of all Department. Prepare MIS reports, collect and analyze information, prepare presentations. Be a self-starter who can anticipate needs and fulfill them in a proactive manner. Ability to communicate at all levels of the organization, driven motivated to continually learn. Must have excellent command over spoken and written English with good presentation skills. Must be able to correspondent independently Eligibility Criteria- Should be Above 30 years Presentable, Should be able to multi task. Filter emails, highlight urgent correspondence and print. Can communicate in English(excellent communication skills) Should be good in Office Management or Secretarial Practice. Smart, Proactive, Ready to face challenges Manage and maintain the Officer's diary and email account. Walk-in Drive/ Time: 12th March - 14th March 2020, 10 AM onwards Venue Details : Alankit House, 4E/2 Jhandewalan Extension, Near post office New Delhi -110 055. Nearest Metro Station - Jhandewalan Contact Person:- Mr. Prince Chadha Contact No. +917290067785 Email Id : Princec@alankit.com","location":"Delhi","experience":"5 - 9 Years"},{"date":"14 - Mar - 2020","skills":"Core Java, JPA and Hibernate, Java Spring Framework, Java Micro Services","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Nalashaa Solutions (India) Private Limited, # 73/ 37, 14th Cross, 9th Main, Sector 6, HSR Layout, Bangalore - 560 102.","phone":"Not Provided","profile":"Fullstack Java Developer \nNalashaa Solutions (India) Private Limited","description":"Candidate must have experience in Core Java, JPA and Hibernate, Java Spring Framework, Java Micro Services. Knowledge on Application Servers like wildly (JBOSS). Must have experience in building Restful web services, Web API, HTML, CSS3, JavaScript. Must have experience with PostgreSQL RDBMS & should be capable of writing queries, stored procedures, views, triggers. Strong verbal and written communication skills that enables them to understand, document and describe complex technical subjects. Good knowledge on Object Oriented Programming, Design Patterns, Shell script, Perl. Good to have knowledge on UNIX commands Roles & Responsibilities- Perform frequent peer reviews Participate actively in demos. Ready to work for late night if necessary. Share knowledge through collaboration, training, peer review, presentations. Participate daily scrum call. Sprint planning and Retro. Use GIT for version control, Jenkins for automatic build, Crucible code review. Walk-in Date/ Time: 14th March 2020, 10 AM onwards Interview Venue: Nalashaa Solutions (India) Private Limited # 73/ 37, 14th Cross, 9th Main, Sector 6, HSR Layout, Bangalore - 560 102. Contact Person- Ashwani Kumar","location":"Bangalore","experience":"4 - 8 Years"},{"date":"14 - Mar - 2020","skills":"Java, Spring, Hibernate","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Ionixx Technologies, No. L 25 (Second Floor), Dr. Vikram Sarabhai Instronics Estate, SRP Tools, Thiruvanmiyur, Chennai, Tamil Nadu - 600 041. Landmark: Near Velacherry Main Road SRP Tools Bus Stop","phone":"Not Provided","profile":"Java Developer \nIonixx Technologies Private Limited","description":"Candidate should be BE/ B.Tech or MCA with 3 to 7 years of proven working experience in Java, Spring, Hibernate. Must have excellent verbal & written communication skills Work location: Sirusari sipcot IT park Interview Location Velacherry, chennai Mode of Employment: Full time Permanent Walk-in Date: 14th March 2020 (Saturday) Interview Time: 9.00 to 1.00 PM Venue Details: Ionixx Technologies, No. L 25 (Second Floor), Dr. Vikram Sarabhai Instronics Estate, SRP Tools, Thiruvanmiyur, Chennai, Tamil Nadu - 600 041 Landmark: Near Velacherry Main Road SRP Tools Bus Stop Contact Person: Dinakaran (HR)","location":"Chennai","experience":"3 - 7 Years"},{"date":"12, 13 - Mar - 2020","skills":"Core Java SQLite Android SDK Eclipse/ Android Studio XML/ JSON/ REST/ SOAP","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Matrimony.Com Limited, Arihant e Park, Lattice Bridge Road, 2nd Floor, Baktavatsalm Nagar, Adyar, Chennai - 600 020.","phone":"Not Provided","profile":"Android Developer - Java \nMatrimony.Com Limited","description":"Candidate should have experience in Android SDK especially Apps Service Architecture, Design Apps for different versions of Android, different screen sizes and permission requirements. Must have developed minimum 3 to 5 applications in Android platform, Mobile user interface designing. Essential skill Core Java SQLite Android SDK Eclipse/ Android Studio XML/ JSON/ REST/ SOAP Back end computing must include Database Management, Security, Interaction with Hardware, and Memory allocation implementation. Hands-on knowledge of design principles of Android and iOS platforms. Ability to think Out of the box and constantly push the boundaries of app design Walk-in Date: 12th March - 13th March 2020 Timing - 10:00 AM to 4:00 PM Interview Venue: Matrimony.Com Limited Arihant e Park, Lattice Bridge Road, 2nd Floor, Baktavatsalm Nagar, Adyar, Chennai - 600 020. Contact Person- Ms. Gracy","location":"Chennai","experience":"4 - 5 Years"},{"date":"12, 13 - Mar - 2020","skills":"Core/ Advance Java, Seo, Php, Android","qualification":"B.E./B.Tech, MCA/PGDCA","address":"TechIt Group, Corporate Office-Building No. G 13, Basement Cabin B2 Noida. (Near Noida Sector 16 metro station Exit Gate no-3)","phone":"8448336083","profile":"Java Developer/ Freshers \nTechit Group","description":"Candidate should have excellent knowledge of Core/ Advance Java, Seo, Php, Android Qualification: BE/ B.Tech Freshers 2019-2020 batch (Fresher can apply) Must have good knowledge of Coding & Decoding Excellent communication skills Intern/ Freshers can also apply Candidates with 1+ year of experience can apply Salary- 25%hike Walk-in Date: 12th March - 13th March 2020 Interview Timing: 10 am to 1 pm Interview Venue: TechIt Group Corporate Office-Building No. G 13, Basement Cabin B2 Noida. (Near Noida Sector 16 metro station Exit Gate no-3) Note:-2 Min Walk in distance From Metro Station Contact Person: Miss. Nitika Sharma (Sr. Hr Manager) Phone No: 8448336083","location":"Noida","experience":"0 - 1 Years"},{"date":"13, 14 - Mar - 2020","skills":"Core Java, Advanced Java (JSP/ Servlets) Spring Framework","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Spoors Technology Solutions (India) Private Limited, 4th Floor, Sai Prithvi - Cyber Arcades, Above Bata Showroom, Near Indian Oil Petrol Bunk, Madhapur, Hyderabad.","phone":"Not Provided","profile":"Application Developer - Java/ Web \nSpoors Technology Solutions (India) Pvt. Limited","description":"Candidates must have excellent knowledge in CORE JAVA and ADVANCE JAVA (JSP/ Servlets) Spring Framework IDE. Service-Oriented Architecture/ Web Services - SOAP/ REST. Web Technologies like HTML, CSS Should be able to join with in 15-30 days. Walk-in Date/ Time: 13th March - 14th March 2020, 9 AM onwards Interview Venue: Spoors Technology Solutions (India) Private Limited, 4th Floor, Sai Prithvi - Cyber Arcades, Above Bata Showroom, Near Indian Oil Petrol Bunk, Madhapur, Hyderabad. Contact Person- Madhavi","location":"Hyderabad","experience":"2 - 4 Years"},{"date":"17, 18 - Mar - 2020","skills":"ASP .NET, VB .Net","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"DOCS Solutions Private Limited, 1st Floor, Plot No. 6/19, Compound No. 82, (Near compound no 24) Marol Co-operative Industrial Estate, Near Marol Bhavan, M.V.Road, Andheri (E), Mumbai - 400059.","phone":"022-62315800","profile":"Trainee Software Developer \nEDOCS Solutions Private Limited","description":"Fresher with the required qualification BSC IT/ BCA/ MCA are most welcome 0 - 6 months of experience in Trainee Software will be added advantage. Freshers are most welcome. Knowledge of ASP .NET will be added advantage Knowledge and Experience regarding VB/.Net will be added advantage. There is a walk in drive on 17th & 18th March 2020 to as the address is mentioned below - Timing- 10.00 am to 5.00 pm EDOCS Solutions Private Limited 1st Floor, Plot No. 6/19, Compound NO.82, (Near compound no 24) Marol Co-operative Industrial Estate, Near Marol Bhavan, M.V.Road, Andheri (E), Mumbai - 400059. Landmark End of the road near Artch Sterling on Times square building lane.Near Shemaroo office Contact No - 022-62315800/ 62315898 Mobile - 9076372940 Kindly forward your resume on manager.hr@edatamails.com","location":"Mumbai","experience":"0 - 1 Years"},{"date":"13, 14 - Mar - 2020","skills":"Back Office Assistance, General Administration, Office Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Alankit House, 4E/2 Jhandewalan Extension, Near post office New Delhi -110 055. Nearest Metro Station - Jhandewalan","phone":"+917290067785","profile":"Back Office Assistant (Female) \nAlankit Limited","description":"We are hiring Personal / Executive Secretary to Senior profile at our corporate Office. Person must be having minimum 5 years of experience of working as secretary to senior level management preferably having international business operations dealings. Must possess excellent interpersonal skills for effective dealing with various internal and external stakeholders including senior management of the organization. Coordinate with our internal staff to ensure timely delivery of the assigned work. To ensure that the Day-to-Day Operations of the Office Run Effectively and Efficiently as arrange and confirm Appointments, Maintain Schedule and Calendars. Organize and coordinate Meetings, Conference. To attend board meetings and take minutes and distribute that points of all Department. Prepare MIS reports, collect and analyze information, prepare presentations. Be a self-starter who can anticipate needs and fulfill them in a proactive manner. Ability to communicate at all levels of the organization, driven motivated to continually learn. Must have excellent command over spoken and written English with good presentation skills. Must be able to correspondent independently Eligibility Criteria- Should be Above 30 years Presentable, Should be able to multi task. Filter emails, highlight urgent correspondence and print. Can communicate in English(excellent communication skills) Should be good in Office Management or Secretarial Practice. Smart, Proactive, Ready to face challenges Manage and maintain the Officer's diary and email account. Walk-in Drive/ Time: 12th March - 14th March 2020, 10 AM onwards Venue Details : Alankit House, 4E/2 Jhandewalan Extension, Near post office New Delhi -110 055. Nearest Metro Station - Jhandewalan Contact Person:- Mr. Prince Chadha Contact No. +917290067785 Email Id : Princec@alankit.com","location":"Delhi","experience":"5 - 9 Years"},{"date":"14 - Mar - 2020","skills":"Core Java, JPA and Hibernate, Java Spring Framework, Java Micro Services","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Nalashaa Solutions (India) Private Limited, # 73/ 37, 14th Cross, 9th Main, Sector 6, HSR Layout, Bangalore - 560 102.","phone":"Not Provided","profile":"Fullstack Java Developer \nNalashaa Solutions (India) Private Limited","description":"Candidate must have experience in Core Java, JPA and Hibernate, Java Spring Framework, Java Micro Services. Knowledge on Application Servers like wildly (JBOSS). Must have experience in building Restful web services, Web API, HTML, CSS3, JavaScript. Must have experience with PostgreSQL RDBMS & should be capable of writing queries, stored procedures, views, triggers. Strong verbal and written communication skills that enables them to understand, document and describe complex technical subjects. Good knowledge on Object Oriented Programming, Design Patterns, Shell script, Perl. Good to have knowledge on UNIX commands Roles & Responsibilities- Perform frequent peer reviews Participate actively in demos. Ready to work for late night if necessary. Share knowledge through collaboration, training, peer review, presentations. Participate daily scrum call. Sprint planning and Retro. Use GIT for version control, Jenkins for automatic build, Crucible code review. Walk-in Date/ Time: 14th March 2020, 10 AM onwards Interview Venue: Nalashaa Solutions (India) Private Limited # 73/ 37, 14th Cross, 9th Main, Sector 6, HSR Layout, Bangalore - 560 102. Contact Person- Ashwani Kumar","location":"Bangalore","experience":"4 - 8 Years"},{"date":"14 - Mar - 2020","skills":"Java, Spring, Hibernate","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Ionixx Technologies, No. L 25 (Second Floor), Dr. Vikram Sarabhai Instronics Estate, SRP Tools, Thiruvanmiyur, Chennai, Tamil Nadu - 600 041. Landmark: Near Velacherry Main Road SRP Tools Bus Stop","phone":"Not Provided","profile":"Java Developer \nIonixx Technologies Private Limited","description":"Candidate should be BE/ B.Tech or MCA with 3 to 7 years of proven working experience in Java, Spring, Hibernate. Must have excellent verbal & written communication skills Work location: Sirusari sipcot IT park Interview Location Velacherry, chennai Mode of Employment: Full time Permanent Walk-in Date: 14th March 2020 (Saturday) Interview Time: 9.00 to 1.00 PM Venue Details: Ionixx Technologies, No. L 25 (Second Floor), Dr. Vikram Sarabhai Instronics Estate, SRP Tools, Thiruvanmiyur, Chennai, Tamil Nadu - 600 041 Landmark: Near Velacherry Main Road SRP Tools Bus Stop Contact Person: Dinakaran (HR)","location":"Chennai","experience":"3 - 7 Years"},{"date":"12, 13 - Mar - 2020","skills":"Core Java SQLite Android SDK Eclipse/ Android Studio XML/ JSON/ REST/ SOAP","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Matrimony.Com Limited, Arihant e Park, Lattice Bridge Road, 2nd Floor, Baktavatsalm Nagar, Adyar, Chennai - 600 020.","phone":"Not Provided","profile":"Android Developer - Java \nMatrimony.Com Limited","description":"Candidate should have experience in Android SDK especially Apps Service Architecture, Design Apps for different versions of Android, different screen sizes and permission requirements. Must have developed minimum 3 to 5 applications in Android platform, Mobile user interface designing. Essential skill Core Java SQLite Android SDK Eclipse/ Android Studio XML/ JSON/ REST/ SOAP Back end computing must include Database Management, Security, Interaction with Hardware, and Memory allocation implementation. Hands-on knowledge of design principles of Android and iOS platforms. Ability to think Out of the box and constantly push the boundaries of app design Walk-in Date: 12th March - 13th March 2020 Timing - 10:00 AM to 4:00 PM Interview Venue: Matrimony.Com Limited Arihant e Park, Lattice Bridge Road, 2nd Floor, Baktavatsalm Nagar, Adyar, Chennai - 600 020. Contact Person- Ms. Gracy","location":"Chennai","experience":"4 - 5 Years"},{"date":"12, 13 - Mar - 2020","skills":"Core/ Advance Java, Seo, Php, Android","qualification":"B.E./B.Tech, MCA/PGDCA","address":"TechIt Group, Corporate Office-Building No. G 13, Basement Cabin B2 Noida. (Near Noida Sector 16 metro station Exit Gate no-3)","phone":"8448336083","profile":"Java Developer/ Freshers \nTechit Group","description":"Candidate should have excellent knowledge of Core/ Advance Java, Seo, Php, Android Qualification: BE/ B.Tech Freshers 2019-2020 batch (Fresher can apply) Must have good knowledge of Coding & Decoding Excellent communication skills Intern/ Freshers can also apply Candidates with 1+ year of experience can apply Salary- 25%hike Walk-in Date: 12th March - 13th March 2020 Interview Timing: 10 am to 1 pm Interview Venue: TechIt Group Corporate Office-Building No. G 13, Basement Cabin B2 Noida. (Near Noida Sector 16 metro station Exit Gate no-3) Note:-2 Min Walk in distance From Metro Station Contact Person: Miss. Nitika Sharma (Sr. Hr Manager) Phone No: 8448336083","location":"Noida","experience":"0 - 1 Years"},{"date":"13, 14 - Mar - 2020","skills":"Core Java, Advanced Java (JSP/ Servlets) Spring Framework","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Spoors Technology Solutions (India) Private Limited, 4th Floor, Sai Prithvi - Cyber Arcades, Above Bata Showroom, Near Indian Oil Petrol Bunk, Madhapur, Hyderabad.","phone":"Not Provided","profile":"Application Developer - Java/ Web \nSpoors Technology Solutions (India) Pvt. Limited","description":"Candidates must have excellent knowledge in CORE JAVA and ADVANCE JAVA (JSP/ Servlets) Spring Framework IDE. Service-Oriented Architecture/ Web Services - SOAP/ REST. Web Technologies like HTML, CSS Should be able to join with in 15-30 days. Walk-in Date/ Time: 13th March - 14th March 2020, 9 AM onwards Interview Venue: Spoors Technology Solutions (India) Private Limited, 4th Floor, Sai Prithvi - Cyber Arcades, Above Bata Showroom, Near Indian Oil Petrol Bunk, Madhapur, Hyderabad. Contact Person- Madhavi","location":"Hyderabad","experience":"2 - 4 Years"},{"date":"17, 18 - Mar - 2020","skills":"ASP .NET, VB .Net","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"DOCS Solutions Private Limited, 1st Floor, Plot No. 6/19, Compound No. 82, (Near compound no 24) Marol Co-operative Industrial Estate, Near Marol Bhavan, M.V.Road, Andheri (E), Mumbai - 400059.","phone":"022-62315800","profile":"Trainee Software Developer \nEDOCS Solutions Private Limited","description":"Fresher with the required qualification BSC IT/ BCA/ MCA are most welcome 0 - 6 months of experience in Trainee Software will be added advantage. Freshers are most welcome. Knowledge of ASP .NET will be added advantage Knowledge and Experience regarding VB/.Net will be added advantage. There is a walk in drive on 17th & 18th March 2020 to as the address is mentioned below - Timing- 10.00 am to 5.00 pm EDOCS Solutions Private Limited 1st Floor, Plot No. 6/19, Compound NO.82, (Near compound no 24) Marol Co-operative Industrial Estate, Near Marol Bhavan, M.V.Road, Andheri (E), Mumbai - 400059. Landmark End of the road near Artch Sterling on Times square building lane.Near Shemaroo office Contact No - 022-62315800/ 62315898 Mobile - 9076372940 Kindly forward your resume on manager.hr@edatamails.com","location":"Mumbai","experience":"0 - 1 Years"},{"date":"13, 14 - Mar - 2020","skills":"Back Office Assistance, General Administration, Office Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Alankit House, 4E/2 Jhandewalan Extension, Near post office New Delhi -110 055. Nearest Metro Station - Jhandewalan","phone":"+917290067785","profile":"Back Office Assistant (Female) \nAlankit Limited","description":"We are hiring Personal / Executive Secretary to Senior profile at our corporate Office. Person must be having minimum 5 years of experience of working as secretary to senior level management preferably having international business operations dealings. Must possess excellent interpersonal skills for effective dealing with various internal and external stakeholders including senior management of the organization. Coordinate with our internal staff to ensure timely delivery of the assigned work. To ensure that the Day-to-Day Operations of the Office Run Effectively and Efficiently as arrange and confirm Appointments, Maintain Schedule and Calendars. Organize and coordinate Meetings, Conference. To attend board meetings and take minutes and distribute that points of all Department. Prepare MIS reports, collect and analyze information, prepare presentations. Be a self-starter who can anticipate needs and fulfill them in a proactive manner. Ability to communicate at all levels of the organization, driven motivated to continually learn. Must have excellent command over spoken and written English with good presentation skills. Must be able to correspondent independently Eligibility Criteria- Should be Above 30 years Presentable, Should be able to multi task. Filter emails, highlight urgent correspondence and print. Can communicate in English(excellent communication skills) Should be good in Office Management or Secretarial Practice. Smart, Proactive, Ready to face challenges Manage and maintain the Officer's diary and email account. Walk-in Drive/ Time: 12th March - 14th March 2020, 10 AM onwards Venue Details : Alankit House, 4E/2 Jhandewalan Extension, Near post office New Delhi -110 055. Nearest Metro Station - Jhandewalan Contact Person:- Mr. Prince Chadha Contact No. +917290067785 Email Id : Princec@alankit.com","location":"Delhi","experience":"5 - 9 Years"},{"date":"14 - Mar - 2020","skills":"Core Java, JPA and Hibernate, Java Spring Framework, Java Micro Services","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Nalashaa Solutions (India) Private Limited, # 73/ 37, 14th Cross, 9th Main, Sector 6, HSR Layout, Bangalore - 560 102.","phone":"Not Provided","profile":"Fullstack Java Developer \nNalashaa Solutions (India) Private Limited","description":"Candidate must have experience in Core Java, JPA and Hibernate, Java Spring Framework, Java Micro Services. Knowledge on Application Servers like wildly (JBOSS). Must have experience in building Restful web services, Web API, HTML, CSS3, JavaScript. Must have experience with PostgreSQL RDBMS & should be capable of writing queries, stored procedures, views, triggers. Strong verbal and written communication skills that enables them to understand, document and describe complex technical subjects. Good knowledge on Object Oriented Programming, Design Patterns, Shell script, Perl. Good to have knowledge on UNIX commands Roles & Responsibilities- Perform frequent peer reviews Participate actively in demos. Ready to work for late night if necessary. Share knowledge through collaboration, training, peer review, presentations. Participate daily scrum call. Sprint planning and Retro. Use GIT for version control, Jenkins for automatic build, Crucible code review. Walk-in Date/ Time: 14th March 2020, 10 AM onwards Interview Venue: Nalashaa Solutions (India) Private Limited # 73/ 37, 14th Cross, 9th Main, Sector 6, HSR Layout, Bangalore - 560 102. Contact Person- Ashwani Kumar","location":"Bangalore","experience":"4 - 8 Years"},{"date":"14 - Mar - 2020","skills":"Java, Spring, Hibernate","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Ionixx Technologies, No. L 25 (Second Floor), Dr. Vikram Sarabhai Instronics Estate, SRP Tools, Thiruvanmiyur, Chennai, Tamil Nadu - 600 041. Landmark: Near Velacherry Main Road SRP Tools Bus Stop","phone":"Not Provided","profile":"Java Developer \nIonixx Technologies Private Limited","description":"Candidate should be BE/ B.Tech or MCA with 3 to 7 years of proven working experience in Java, Spring, Hibernate. Must have excellent verbal & written communication skills Work location: Sirusari sipcot IT park Interview Location Velacherry, chennai Mode of Employment: Full time Permanent Walk-in Date: 14th March 2020 (Saturday) Interview Time: 9.00 to 1.00 PM Venue Details: Ionixx Technologies, No. L 25 (Second Floor), Dr. Vikram Sarabhai Instronics Estate, SRP Tools, Thiruvanmiyur, Chennai, Tamil Nadu - 600 041 Landmark: Near Velacherry Main Road SRP Tools Bus Stop Contact Person: Dinakaran (HR)","location":"Chennai","experience":"3 - 7 Years"},{"date":"12, 13 - Mar - 2020","skills":"Core Java SQLite Android SDK Eclipse/ Android Studio XML/ JSON/ REST/ SOAP","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Matrimony.Com Limited, Arihant e Park, Lattice Bridge Road, 2nd Floor, Baktavatsalm Nagar, Adyar, Chennai - 600 020.","phone":"Not Provided","profile":"Android Developer - Java \nMatrimony.Com Limited","description":"Candidate should have experience in Android SDK especially Apps Service Architecture, Design Apps for different versions of Android, different screen sizes and permission requirements. Must have developed minimum 3 to 5 applications in Android platform, Mobile user interface designing. Essential skill Core Java SQLite Android SDK Eclipse/ Android Studio XML/ JSON/ REST/ SOAP Back end computing must include Database Management, Security, Interaction with Hardware, and Memory allocation implementation. Hands-on knowledge of design principles of Android and iOS platforms. Ability to think Out of the box and constantly push the boundaries of app design Walk-in Date: 12th March - 13th March 2020 Timing - 10:00 AM to 4:00 PM Interview Venue: Matrimony.Com Limited Arihant e Park, Lattice Bridge Road, 2nd Floor, Baktavatsalm Nagar, Adyar, Chennai - 600 020. Contact Person- Ms. Gracy","location":"Chennai","experience":"4 - 5 Years"},{"date":"12, 13 - Mar - 2020","skills":"Core/ Advance Java, Seo, Php, Android","qualification":"B.E./B.Tech, MCA/PGDCA","address":"TechIt Group, Corporate Office-Building No. G 13, Basement Cabin B2 Noida. (Near Noida Sector 16 metro station Exit Gate no-3)","phone":"8448336083","profile":"Java Developer/ Freshers \nTechit Group","description":"Candidate should have excellent knowledge of Core/ Advance Java, Seo, Php, Android Qualification: BE/ B.Tech Freshers 2019-2020 batch (Fresher can apply) Must have good knowledge of Coding & Decoding Excellent communication skills Intern/ Freshers can also apply Candidates with 1+ year of experience can apply Salary- 25%hike Walk-in Date: 12th March - 13th March 2020 Interview Timing: 10 am to 1 pm Interview Venue: TechIt Group Corporate Office-Building No. G 13, Basement Cabin B2 Noida. (Near Noida Sector 16 metro station Exit Gate no-3) Note:-2 Min Walk in distance From Metro Station Contact Person: Miss. Nitika Sharma (Sr. Hr Manager) Phone No: 8448336083","location":"Noida","experience":"0 - 1 Years"},{"date":"13, 14 - Mar - 2020","skills":"Core Java, Advanced Java (JSP/ Servlets) Spring Framework","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Spoors Technology Solutions (India) Private Limited, 4th Floor, Sai Prithvi - Cyber Arcades, Above Bata Showroom, Near Indian Oil Petrol Bunk, Madhapur, Hyderabad.","phone":"Not Provided","profile":"Application Developer - Java/ Web \nSpoors Technology Solutions (India) Pvt. Limited","description":"Candidates must have excellent knowledge in CORE JAVA and ADVANCE JAVA (JSP/ Servlets) Spring Framework IDE. Service-Oriented Architecture/ Web Services - SOAP/ REST. Web Technologies like HTML, CSS Should be able to join with in 15-30 days. Walk-in Date/ Time: 13th March - 14th March 2020, 9 AM onwards Interview Venue: Spoors Technology Solutions (India) Private Limited, 4th Floor, Sai Prithvi - Cyber Arcades, Above Bata Showroom, Near Indian Oil Petrol Bunk, Madhapur, Hyderabad. Contact Person- Madhavi","location":"Hyderabad","experience":"2 - 4 Years"}]}