{"Walkins":[{"date":"28, 30, 31 - Dec - 2019","skills":"Back Office Assistance, General Administration","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Hollywood Optician Private Limited, 1302/ Cyber One, Greenscape Vashi, Navi Mumbai","phone":"Not Provided","profile":"Back Office Administrator \nHollywood Optician Private Limited","description":"Person should be Any Graduate with presentable personality & good communication skills. Must be able to manage all admin activity meeting arrangement staff ordination. Walk-in Date/ Time: 26th - 31st December , 12 PM onwards Interview Venue: Hollywood Optician Private Limited 1302/ Cyber One, Greenscape Vashi, Navi Mumbai Contact Person- Ayesha","location":"Mumbai","experience":"1 - 2 Years"},{"date":"30 - Dec - 2019","skills":"Front Desk, Sales Coordination, MIS Reporting, Back Office Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Mosil Lubricants Private Limited, A - 791 / 3, MIDC Industrial Area, Near JKT Enterprises, Kopar Khairane, Navi Mumbai, Maharashtra - 400 701","phone":"9820415518","profile":"Back Office Assistant \nMosil Lubricants Private Limited","description":"Candidate should be Any Graduate with 0 to 2 years of experience on Front Desk, Sales Coordination, MIS Reporting, Back Office Activities. Must have excellent communication skills Job Responsbility- Prepare MIS Reports Training and Support to Marketing Team Handling incoming local calls, Providing information and assistance to clients and customers Handle Admin Walk-in Date: 30 December 2019 Timing - 10 am to 12 am & 2 pm to 4pm Interview Venue: Mosil Lubricants Private Limited A - 791 / 3, MIDC Industrial Area, Near JKT Enterprises, Kopar Khairane, Navi Mumbai, Maharashtra - 400 701 Contact Person- Sheetal Jain Phone No. 9820415518","location":"Mumbai","experience":"0 - 2 Years"},{"date":"30, 31 - Dec - 2019","skills":"Office Assistance/ General Administration, Travel Arrangements, Front Office","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Oodles Technologies Private Limited, Unit No. 110, First Floor, Iris Tech Park, Sector 48, Sohna Road, Gurgaon","phone":"Not Provided","profile":"Front Office/ Admin Executive \nOodles Technologies Private Limited","description":"Canddiate should have proven experience as an office administrator, office assistant or relevant role. Must have good communication and interpersonal abilities. Familiarity with office management procedures and basic accounting principles. Good knowledge of MS Office and office management software (ERP etc.). Qualifications in secretarial studies will be an advantage. High school diploma; BSc/ BA in office administration or relevant field is preferred. Job Responsbility- Coordinate office activities and operations to secure efficiency and compliance to company policies. Supervise administrative staff and divide responsibilities to ensure performance. Manage agendas/ travel arrangements/ appointments etc. for the upper management Manage phone calls and correspondence (e-mail, letters, packages etc.). Support budgeting and bookkeeping procedures. Walk-in Date/ time: 30th - 31st December 2019, 12 PM onwards Interview Venue: Oodles Technologies Private Limited Unit No. 110, First Floor, Iris Tech Park, Sector 48, Sohna Road, Gurgaon Nearest Metro Station : Huda City Center Landmark : Near JMD Megapolis Contact Person- Vineeta","location":"Gurgaon","experience":"1 - 2 Years"},{"date":"2, 3, 4 - Jan - 2020","skills":"Tender Searching, Back Office, Data Entry","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Mahendra Realtors & Infrastructure Pvt. Limited, 603, 6th Floor, Quantum Tower, Ram Baug Lane, Near SBI, SV Road, Malad (West), Mumbai","phone":"9082850347","profile":"Tender/ Admin Assistant \nMahendra Realtors & Infrastructure Pvt. Limited","description":"Candidate should be Any Graduate with 1 to 2 years of experience Must have very Strong communication skill oral as well as written Computer literacy with Multi-tasking skills Job Responsbility- To Source Tenders from all available modes for Maharashtra, Goa, Gujarat, Karnataka & all MMR Region and taking approval for final participation within Given Time. Taking Approval from Management to Participate in Tenders before time Walk-in Date/ Time: 2nd - 4th January 2020, 11 AM onwards Interview Venue: Mahendra Realtors & Infrastructure Pvt. Limited 603, 6th Floor, Quantum Tower, Ram Baug Lane, Near SBI, SV Road, Malad (West), Mumbai Contact Person - HR (9082850347)","location":"Mumbai","experience":"1 - 2 Years"},{"date":"4 - Jan - 2020","skills":"Core Java, Scala, Hadoop, Apache, Spark, Unix, Cloud Technologies","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Bitwise Solutions Private Limited, Bitwise Terra Tower, Survey No 61/1/1, Baner Adjoining highway, Baner, Pune - 411 045.","phone":"Not Provided","profile":"Java Developer \nBitwise Solutions Private Limited","description":"Applicant must be extremely good in Core Java, Should have good logical/ analytical skills Must have good communication skills Desired Skills- Scala Hadoop Apache Spark Unix Cloud Technologies - AWS/ GCP/ Azure Job Responsibilities- Responsible for requirements understanding, analysis, coding, testing, maintenance/ enhancements activities. Able to independently develop and test complex applications. Walk-in Date/ Time: 4th January 2020, 9 AM onwards Interview Venue: Bitwise Solutions Private Limited Bitwise Terra Tower, Survey No 61/1/1, Baner Adjoining highway, Baner, Pune - 411 045. Contact Person- Pallavi Kale","location":"Pune","experience":"2 - 5 Years"},{"date":"30, 31 - Dec - 2019","skills":"Automation / Manual / Performance / Functional Testing","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"QualityKiosk Technologies Private Limited, A Wing - 419, Rupa Solitaire, Millennium Business Park, Mahape, Navi Mumbai - 400 709.","phone":"Not Provided","profile":"Trainee Testing Engineer \nQualityKiosk Technologies Pvt. Limited","description":"We have an urgent opportunity for Trainee Testing Engineer Web Monitoring in our organization for Mumbai Location. Eligibility Criteria: BE/ B.Tech/ MCA/ B.Sc/ Msc (IT, Computer Science, Electronics & Telecommunication) 2017 to 2019 Pass outs with 58% throughout all the education. Male candidates only. Desired Skills:- Good Communication Skills Good Analytical approach & Logical reasoning skills Candidates should be open for relocation to Navi Mumbai Candidates Interviewed in last 6 months please do not apply Immediate Joiners Candidates will get an opportunity to move into Automation / Manual / Performance / Functional Testing depending upon their performance post 1 year of completion in their current role Walk-in Date/ Time: 30th - 31st December 2019, 11 AM onwards Interview Venue: QualityKiosk Technologies Private Limited A Wing - 419, Rupa Solitaire, Millennium Business Park, Mahape, Navi Mumbai - 400 709. Lift Number 24 & 25 Contact Person- Abhivyakti Agnihotri","location":"Mumbai","experience":"0 - 1 Years"},{"date":"28 - Dec - 2019","skills":"PHP based MVC frameworks like CodeIgniter, Laravel, symphony, YII etc.","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Hetero Healthcare Limited, Sy. No.80-84, Melange Towers, 5th Floor, B Wing, Patrikanagar, Madhapur, Hyderabad - 500 081.","phone":"040 40473500","profile":"PHP/ Web Developer \nHetero Healthcare Limited","description":"Canddiate should have 2 to 5 years of experience in PHP and PHP based MVC frameworks like CodeIgniter, Laravel, symphony, YII etc. Proficient in MySQL, Database design, optimization and tuning in MySQL. Strong Knowledge of Linux required, for ex. working experience with LAMP stack setup, shell scripting etc. Expertise in versioning control, preferably GIT Knowledge on Angular JS, Angular Strong knowledge JQuery, Java Script, validations proficient in creating Microservices Basic Knowledge HTML 5, CSS3, SASS, LESS, Bootstrap Walk-in Date/ Time: 28 December 2019, 10 AM onwards Interview Venue: Hetero Healthcare Limited Sy. No.80-84, Melange Towers, 5th Floor, B Wing, Patrikanagar, Madhapur, Hyderabad - 500 081. Contact Person- Mr. Ravi Phone No. 040 40473500","location":"Hyderabad","experience":"2 - 5 Years"},{"date":"27, 28, 30, 31 - Dec - 2019","skills":"PHP, Codeigniter , Mysql, Javascript, HTML, html5","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Inovies Consulting Private Limited, Patrikanagar, Madhapur, Hyderabad","phone":"9908334546","profile":"PHP Developer/ Codeigniter \nInovies Consulting Private Limited","description":"Candidate must have strong knowledge of PHP, Codeigniter , Mysql, Javascript, HTML, html5. Work Experience: 3 - 5 Years Walk-in Date/ Time: 27 December - 5th January , 11 AM onwards Interview Venue: Inovies Consulting Private Limited, Patrikanagar, Madhapur, Hyderabad Contact Person- Nagendra Bommasani Phone No: 9908334546","location":"Delhi","experience":"3 - 5 Years"},{"date":"27, 28, 30, 31 - Dec - 2019","skills":"Advance PHP, Ajax, JQuery , Java script, CSS, HTML, Core PHP, API Integration","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Rounder labs Private Limited, H-11 Sector 63 Noida","phone":"9852376870","profile":"PHP Developer - Codeignitor \nRounder labs Private Limited","description":"Candidate must be expert in Advance PHP, Ajax, JQuery , Java script, CSS, HTML, Core PHP, API Integration. Should have experience in handling big database. Having knowledge of customized CRM. Should be capable to handle the project individually. Walk-in Date/ Time: 26th December - 10th January , 11 AM onwards Interview Venue: Rounder labs Private Limited H-11 Sector 63, Noida Contact Person- Saurabh Phone: 9852376870","location":"Noida","experience":"1 - 3 Years"},{"date":"27, 28 - Dec - 2019","skills":"Asp .Net, C# .Net, Ms - SQL Server, Ado .Net, Java Script","qualification":"B.E./B.Tech, MCA/PGDCA","address":"K. R. Mangalam World School (Head Office) T-119, AAm Bagh, Near Shamshee Talab, Andheria Mod, Mehrauli, New Delhi - 110030","phone":"844892360","profile":"ASP .Net Developer \nK. R. Mangalam Group","description":"Candidate must have minimum 2 years of experience as .Net Developer. Should have strong working experience in Asp .Net, C# .Net, Ms - SQL Server, Ado .Net, Java Script, JQuery, CSS, Bootstrap, HTML, MVC (optional). Design, develop and configure software systems. Walk-in Date: 26th - 28th December 2019 Time: 10 am to 3 pm (1-2 lunch time) Interview Venue: K. R. Mangalam World School (Head Office) T-119, AAm Bagh, Near Shamshee Talab, Andheria Mod, Mehrauli, New Delhi - 110030 Nearest Metro - Chhatarpur Contact Peson- Megha Tel: 844892360","location":"Delhi","experience":"2 - 5 Years"},{"date":"30, 31 - Dec - 2019","skills":"C#, ASP .Net, Sql Server and MVC","qualification":"B.E./B.Tech, MCA/PGDCA","address":"nThrive Global Sloutions Private Limited, (Formerly e4e Healthcare Business Services Pvt. Limited) 15th Floor, Tower C Unitech Cyber Park Sector 39, Gurugram, Haryana - 122 002.","phone":"Not Provided","profile":"Software Engineer (.Net) \nnThrive Global Solutions Pvt. Limited","description":"nThrive Global Solutions Pvt. Limited is looking for an experienced Software Engineers to work on existing/ new applications for the organization. Candidate must 1+ years of of hands-on experience with software applications development proficient in C#, ASP .Net, Sql Server and MVC with dot net experience Should have experience in SQL Database Strong knowledge Of OOP principle Must be familiar with agile SDLS. Walk-in Date/ Time: 30th - 31st December from 1 PM onwards Interview Venue: nThrive Global Sloutions Private Limited (Formerly e4e Healthcare Business Services Pvt. Limited) 15th Floor, Tower C Unitech Cyber Park Sector 39, Gurugram, Haryana - 122 002.","location":"Gurgaon","experience":"1 - 2 Years"},{"date":"4 - Jan - 2020","skills":"Web Technologies, C# .Net, ASP .Net .Net MVC, Web Services","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Trantor Software Private Limited, Plot G-9, Rajiv Gandhi Technology Park, Phase - I, Chandigarh - 160 101","phone":"01724033020","profile":".Net Developer \nTrantor Software Private Limited","description":"Person should have Experience with ASP .NET web-based applications (preferably some MVC) and web services using C# .NET. Must have good problem solving, debugging & troubleshooting skills. Understanding of Object-Oriented Design and design patterns Walk-in Date/ Time: 4th January 2020, 10 AM onwards Interview Venue: Trantor Software Private Limited Plot G-9, Rajiv Gandhi Technology Park, Phase - I, Chandigarh - 160 101 Contact Person- Vikas Pandita Phone: 01724033020","location":"Chandigarh","experience":"2 - 7 Years"},{"date":"4 - Jan - 2020","skills":"ASP .NET, SQL Server, Design Patterns, MVC","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Raytex IT Services, Spacion Towers 4th floor, Survey No. 85, Vittal Rao Nagar, Madhapur, Hyderabad, Telangana - 500 081.","phone":"7036178463","profile":".NET Developer \nRaytex IT Services","description":"Candidate should have Bachelor's degree in Computer Science or related field with minimum 2 to 4 years of proven experience developing web-based software development using .NET stack. Well versed with the ASP .NET, SQL Server and Design Patterns (e.g. Model-View-Controller (MVC)). Good exposure on ASP .NET web API's or experience working with RESTful API's. Must have strong exposure on C#. Key Responsibilities: Provide technical leadership and mentor/coach other engineers within the team Work closely with peers and technical lead to deliver scalable solutions Design and implement underlying data models for applications and services to be scalable and maintainable Provide operational support by fixing production issues Walk-in Date/ Time: 4th January 2020, 10 AM onwards Interview Venue: Raytex IT Services Spacion Towers 4th floor, Survey No. 85, Vittal Rao Nagar, Madhapur, Hyderabad, Telangana - 500 081. Contact Person- Mr. L K Sunil Kumar Phone No. 7036178463","location":"Hyderabad","experience":"2 - 4 Years"},{"date":"28 - Dec - 2019","skills":"ASP .NET/ C# .NET, SQL Server, AJAX","qualification":"B.E./B.Tech, MCA/PGDCA","address":"ProPhoenix Technologies Private Limited, Campus Tek Meadows, C Block First Floor, No: 51 Rajiv Gandhi Salai, Sholinganallur, Chennai - 119","phone":"9003999597","profile":".Net Developer/ Team Lead \nProPhoenix Technologies Private Limited","description":"We have excellent immediate openings for .Net Developers/ Senior Software Engineers/ Team Lead/ Tech Lead. Required skills: ASP .NET/ C# .NET, SQL Server, AJAX Excellent in Design, Programming, Analyzing, Debugging and implementing new features. Should be able to do peers code review Should have good knowledge of SDLC Process Must have good communication skills Job Location: Sholinganallur, Chennai. If interested, please directly Walk-in to the below mention address: Walkin Date: 28th Dec 2019 (Saturday) Time: 10:00 AM to 1:00 PM Interview Venue: ProPhoenix Technologies Private Limited, Campus Tek Meadows, C Block First Floor, No: 51 Rajiv Gandhi Salai, Sholinganallur, Chennai - 119 Land mark: Opposite to Accenture Bus Stop: Dollar Bus stop (next to Karapakkam) Contact Person- Divya Phone No. 9003999597","location":"Chennai","experience":"2 - 7 Years"},{"date":"28 - Dec - 2019","skills":"Technical Support, Semi Voice Process, Customer Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"DXC Technology India Private Limited, Maruti Concorde Business Park, Service Road, Konappana Agrahara, Electronics City, Bengaluru","phone":"Not Provided","profile":"Technical Support - Semi Voice \nDXC Technology India Private Limited","description":"Candidate should have Graduation with 10+2+3/ 4 preferably. Typically requires 0- 3 years general experience, or equivalent combination of experience and college level education. Knowledge and Skills: Excellent skills in both written and verbal communication. Experience in customer facing role either remote or face to face. Good knowledge with application support Excellent fluency in language to be supported. Accuracy in data entry with Problem solving skills. Experience in a phone based remote role, e- support, e-chat or similar. Familiarity with computer technology. Knowledgeable in call routing and case management processes as well as case logging systems and obligation systems . Understands internal processes and tools. Knowledge of Knowledge Management Systems and appropriate documentation to the system. Flexible to work in rotational shifts 24x7 Night Shift Allowance To & Fro Cab will be provided. Walk-in Date : 28th December' 2019 (Saturday) Time : 10:00 AM to 1:00 PM Interview Venue: DXC Technology India Private Limited, Maruti Concorde Business Park, Service Road, Konappana Agrahara, Electronics City, Bengaluru Landmark: Near Electronic Bus stand Contact Person - Naveen Kumar","location":"Bangalore","experience":"0 - 3 Years"},{"date":"27, 28, 30, 31 - Dec - 2019","skills":"Automation Testing, Selenium, C#, Java, SQL Database","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"AQM Technologies Private Limited, 4th Floor, A-Wing, Raheja Plaza, LBS Road, Ghatkopar (West)- 400 086.","phone":"Not Provided","profile":"Automation Testers (Freshers) \nAQM Technologies Private Limited","description":"Candidate must have strong development/ scripting skills in common languages like C# or Java or Selenium. Good Object Oriented Programming concepts and basic SQL Database query skills to create/ edit queries. Should have good communication skills Those who have completed their Automation Testing course can apply. Walk-in Date/ Time: 12th - 31st December , 10 AM onwards Interview Venue: AQM Technologies Private Limited 4th Floor, A-Wing, Raheja Plaza, LBS Road, Ghatkopar (West)- 400 086. Contact Person- Suruchi","location":"Mumbai","experience":"0 - 1 Years"},{"date":"4 - Jan - 2020","skills":"ASP .Net, C#, SQL Server, Javascript, jQuery, Reporting Services, Web Services, WCF, HTML etc.","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Radixweb, 30/ B, Adarsh Society, Near Kaashi Parekh Complex, Swastik Cross Road, C.G Road, Ahmedabad - 380 009.","phone":"26400685","profile":"ASP .NET Developers \nRadixWeb","description":"We are opening our doors for experienced Software Engineers for ASP.NET / Dot NET technologies to come and grow along with us. Candidate should be BE/ B.Tech/ ME/ M.Tech/ MSc/ MCA (IT/ CE) with 2 to 10 years of working experience in ASP .NET/ latest technologies of Dot NET Core/ C#/ MVC. Extensive Development Experience in Entity Framework/ Entity Framework Core and LINQ. Should be good in SQL Server Database for DDL and DML operations Should be good in restful API Development & high level database administration activities Knowledge of at least one client side framework (Angular / React / Vue) will be added advantage Must know standard software design pattern and principles Amazon (AWS) or Azure Cloud services knowledge will be added advantage Walk-in Date/ Time: 4th January 2019, 9 AM onwards Interview Venue: Radixweb, 30/ B, Adarsh Society, Near Kaashi Parekh Complex, Swastik Cross Road, C.G Road, Ahmedabad - 380 009. Contact Person- Krunal Trivedi","location":"Ahmedabad","experience":"2 - 10 Years"},{"date":"28 - Dec - 2019","skills":"Selenium, Webdriver, Test Planning, Automation Testing, Test Scripts, Functional Testing, Test Cases","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Vyom Labs Private Limited, Sunrise Business Park Near Cummins Campus, Balewadi City, Pune, Maharashtra - 411 045.","phone":"Not Provided","profile":"Selenium/ Testing Engineers \nVyom Labs Private Limited","description":"Candidates should have 2 to 7 years of experience in Automation testing with Selenium and Java (Test scripts and Test cases). Hands-on experience in developing automation scripts in Java using tools like Selenium WebDriver, etc. Experience in Java development (with scripting). Should have prior work experience in an agile development environment Must be ready for relocate according to projects. Job Responsibilities: Work closely with development and business teams in automating the functional testing using Selenium WebDriver automation framework. Participate in construction of master test plan and comprehensive test plans. Walk-in Date/ Time: 28th December 2019, 9 AM onwards Interview Venue: Vyom Labs Private Limited Sunrise Business Park Near Cummins Campus, Balewadi City, Pune, Maharashtra - 411 045. Contact Person- Sagar Malkar","location":"Pune","experience":"2 - 7 Years"},{"date":"2, 3, 6, 7, 8, 9, 10 - Jan - 2020","skills":"ASP .Net, C#, Ajax, MVC .Net framework 3.5 & above","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Jayam Solutions Private Limited, Plot # 277 ,Anjaneya Nagar Colony, Moosapet, Hyderabad TS","phone":"040-48526868","profile":".Net Developer/ Freshers \nJayam Solutions Private Limited","description":"Candidate should have good hands-on development experience in the following: ASP .Net, C#, Ajax, MVC .Net framework 3.5 & above IDE: Visual Studio MS SQL Server HTML 5, CSS 3, Angular Js, JQuery Only Male candidates need to apply Walk-in Date/ Time: 2nd - 10th January , 10 AM onwards Interview Venue: Jayam Solutions Private Limited Plot # 277 ,Anjaneya Nagar Colony, Moosapet, Hyderabad TS Land Mark : Near Shell International School Contact Person- Harishchandrababu M Contact : +91 9440806850, 040-48526868","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"27, 28, 30, 31 - Dec - 2019","skills":"Performance Testing, Appium, Selenium, QA/ Automation Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Veritech Infosystems Private Limited, 10th floor, RMZ Latitude Commercial Building, Bellary Roadd, Hebbal, Bengaluru - 560 024.","phone":"9148810443","profile":"QA/ Automation Tester \nVeritech Infosystems Private Limited","description":"Looking for QA Automation- Selenium (Lead Role & Senior Role), Appium and Performance Testing. Required to Troubleshoot & Isolate Problems Notice Period Immediate Joiner & 30 days Willing to work in Hebbal (Bangalore) Walk-in Date/ Time: 21st December - 25th January , 10 AM onwards Interview Venue: Veritech Infosystems Private Limited 10th floor, RMZ Latitude Commercial Building, Bellary Roadd, Hebbal, Bengaluru - 560 024. Contact Person- Tasleem Tel: 9148810443","location":"Noida","experience":"2 - 7 Years"},{"date":"27, 28, 30, 31 - Dec - 2019","skills":".Net, C#, MVC, Entity Framework, Agile, SQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Enel X Services India Private Limited, Unit Number A-G01, Marathon Chambers, A Wing, Marathon Futurex Compound, N M, NM Joshi Marg, Lower Parel East, Mumbai - 400 013.","phone":"022-40287450","profile":"Software Developer - .Net/ MVC \nEnel X Services India Private Limited","description":"Candidate should have Degree in Engineering or Computers with Minimum 1 years of experience in software engineering profession with demonstrated success designing and building high quality, commercial software applications using Microsoft .Net Should have good experience coding on Microsoft .Net, using C# and MS SQL Server database backend, following the MVC design pattern. Experience with ASP .NET Core & Entity Framework Core 2.0 and above will be preferred. Walk-in Date/ Time: 27 December - 3rd January , 10 AM onwards Interview Venue: Enel X Services India Private Limited, Unit Number A-G01, Marathon Chambers, A Wing, Marathon Futurex Compound, N M, NM Joshi Marg, Lower Parel East, Mumbai - 400 013. Contact Person- Swapna Thavi/ Himani Patil Phone No. 022-40287450","location":"Mumbai","experience":"1 - 3 Years"},{"date":"28, 30 - Dec - 2019","skills":"Core PHP, Magento, Wordpress & Shopify","qualification":"B.E./B.Tech, MCA/PGDCA","address":"SSL Technologies Private Limited, H 201, First Floor, Sector 63, Noida - 201 301.","phone":"8929405125","profile":"Core PHP Developer \nSSL Technologies Private Limited","description":"Candidate must have strong knowledge of Core PHP, Magento, Wordpress & Shopify. Good knowledge in MVC Frameworks and eCommerce Development. Website Development experience with technologies like Bootstrap, HTML, HTML5, CSS, CSS3, JavaScript & jQuery. Walk-in Date/ Time: 22nd December - 30 December , 11 AM onwards Interview Venue: SSL Technologies Private Limited H 201, First Floor, Sector 63, Noida - 201 301. Contact Person- Simran Kaur Phone No: 8929405125","location":"Noida","experience":"0 - 1 Years"},{"date":"27, 28 - Dec - 2019","skills":"ASP .NET MVC with C#, SQL Server, Angular JS, CSS, Bootstrap","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Ascent Consulting Services Pvt. Limited, Maruthi Chambers, Main Building, 3rd Floor, Survey No.17/4B, 9B, Hosur Rd, Roopena Agrahara, Bommanahalli, Bengaluru, Karnataka - 560 068","phone":"9972903853","profile":".NET Developers \nAscent Consulting Services Pvt. Limited","description":"We are hiring for the Dot net Developer at Ascent HR Consulting Private Limited Required Skills- ASP .NET MVC with C#, SQL Server Knowledge in angular JS, CSS, Bootstrap Domain training would be provided. Would either handle Support and development. Candidate should have strong working knowledge of MVC, C Sharp SQL Server, J Query. Responsible for development, maintenance and support. Should have worked on projects related to any web applications. If the projects are related to HR domain that is an added advantage. Knowledge in Angular JS is a plus point. Should be good in handling the team or leadership skills. Please walk in with your updated resume on 27th & 28th December 2019 at 10.00 AM to 4.00 PM Interview Venue: Ascent Consulting Services Pvt. Limited Maruthi Chambers, Main Building, 3rd Floor, Survey No.17/4B, 9B, Hosur Rd, Roopena Agrahara, Bommanahalli, Bengaluru, Karnataka - 560 068","location":"Bangalore","experience":"3 - 4 Years"},{"date":"28 - Dec - 2019","skills":"Technical Support, IT Helpdesk/ Service Desk, Customer Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Techbooks International Pvt. Limited, A-37 (Aptara), Sector-60, Noida","phone":"0120-41682424","profile":"Technical Support Analyst \nTechbooks International Pvt. Limited","description":"Candidates should be Any Graduate with excellent knowledge of Word. Must have strong communication skills. Interested candidates can directly come for the interview. Walk-in Date: 27th - 28th December 2019 Time: 9 AM to 4 PM Interview Venue: Techbooks International Pvt. Limited A-37 (Aptara), Sector-60, Noida Contact Person: Aishwarya Seth Kindly bring your updated resume at the time of interview.","location":"Noida, Aurangabad","experience":"0 - 3 Years"},{"date":"30, 31 - Dec - 2019","skills":"Technical Support, Network Support, Customer Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Porteck India Infoservices Private Limited, D - 179, Sector - 63 Noida","phone":"0120-4356400","profile":"Technical Support Executive \nPorteck India Infoservices Private Limited","description":"Candidate must have atleast 6 months of experience into Technical Support. Should have excellent communication skills in English language Must be willing to work in US shifts Immediate joiners preferred Job Responsibility- Research, diagnose, troubleshoot and identify solutions to resolve customer issues. Taking calls with printer, router and antivirus issues from the US customers. Walk-in Date/ Time: 30th - 31st December 2019, 11 AM onwards Interview Venue: Porteck India Infoservices Private Limited D - 179, Sector - 63 Noida Landmark: Near Extramarks Phone No. 0120-4356400/ 401","location":"Noida","experience":"0 - 2 Years"},{"date":"28, 30, 31 - Dec - 2019","skills":"HTML, CSS, PHP & MySQL, Object-oriented programming & MVC applications","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Pro-team Solutions Private Limited, # 530, Akshya towers 3rd floor, 5th cross, Next to HMT Ground Near R. T Nagar Police Station Road, Ganganagar, Bangalore - 560 032.","phone":"7999715729","profile":"Web/ Php Developer \nPro-team Solutions Private Limited","description":"Candidate must have excellent knowledge in HTML, CSS, PHP & MySQL Should be able to work on frameworks like Wordpress. Competent with PHP object-oriented programming & MVC applications. Competent in authoring JavaScript and using libraries such as jQuery Walk-in Date/ Time: 24th December - 5th January , 9 AM onwards Interview Venue: Pro-team Solutions Private Limited # 530, Akshya towers 3rd floor, 5th cross, Next to HMT Ground Near R. T Nagar Police Station Road, Ganganagar, Bangalore - 560 032. Contact Person- Neha Phone No. 7999715729","location":"Bangalore","experience":"1 - 5 Years"},{"date":"28, 30, 31 - Dec - 2019","skills":"PHP, HTML5, JavaScript, Ajax, JQuery and MySQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Council of Education & Development Programmes, 5th Floor, New English High School, Ram Maruti Road, Thane (West) - 400 602","phone":"Not Provided","profile":"PHP Developer \nCouncil of Education & Development Programmes","description":"Proficient in PHP, HTML5, JavaScript, Ajax & JQuery Excellent relational database skills with MySQL Experience with PHP MVC frameworks (Symfony, Laravel, CodeIgniter, Zend, etc.) Previous working experience as a PHP Developer for 4 years Knowledge of API's, such as twitter, Facebook, Google maps, Instagram etc Knowledge of payment gateway integration Candidates having relevant experience may walk in for an interview at our Thane office. Walk-in Date/ Time: 26 December - 5th January, 11 AM onwards Interview Venue: Council of Education & Development Programmes 5th Floor, New English High School, Ram Maruti Road, Thane (West) - 400 602 Tel: 9152013064 Please mail your cv at jobs@cedp-edu.com before coming for interview.","location":"Mumbai","experience":"4 - 5 Years"},{"date":"27, 28, 30, 31 - Dec - 2019","skills":"PHP, Wordpress, CMS, CSS, Html5, MySQL, Javascript","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Vlogic Info Private Limited, C-718, Siddhi Vinayak Tower B/h DCP Office, Near Katariya Show Room, Off Sarkhej Gandhinagar Hwy Makarba, AHMEDABAD, GUJARAT - 380 051","phone":"Not Provided","profile":"Wordpress/ Php Developer \nVlogic Info Private Limited","description":"We are looking for an energetic, aggressive and capable individual and hardworking team.Expertise in WordPress customization, theme an plugin development, knowledge of existing WordPress functions, hooks and API Integration Should be well versed Candidate should have Expert Knowledge of wordpress web development, theme and plugin customization, theme development and plugin development. Candidate should work with CSS, psd to html, java script and design customization. Walk-in Date/ Time: 27th - 31st December, 11 AM onwards Interview Venue: Vlogic Info Private Limited C-718, Siddhi Vinayak Tower B/h DCP Office, Near Katariya Show Room, Off Sarkhej Gandhinagar Hwy Makarba, AHMEDABAD, GUJARAT - 380 051 Contact Person- Paresh Mathukia","location":"Ahmedabad","experience":"1 - 5 Years"},{"date":"30 - Dec - 2019","skills":"technical helpdesk, technical support, service desk","qualification":"B.E./B.Tech, B.Sc, BCA/BCS","address":"Ibibo Group Private Limited, Ground Floor Tower B1,Golden Enclave, Corporate Block Old Airport Road, Bangalore -560 017","phone":"Not Mentioned","profile":"Technical Support Engineer (L1) \nIbibo Group Private Limited","description":"Education background: (BE / B.TECH/ BCA) Work Experience - Only Freshers SQL/ Oracle certified (optional) Primary Skills - SQL /Oracle Any other programming/scripting language like Java, .Net, Python, Javascript Desired Prior working experience in technical support or related functions. Understanding of SDLC Excellent interpersonal and communication skills, both (written and verbal communication). Good aptitude, Good in writing complex SQL queries. Basic knowledge of a programming language/scripting language. Knowledge of relevant software computer applications and equipment. Strong problem-solving skills Effective listening and client-facing skills Walk-in Date/ Time: 30th December 2019, 9 AM onwards Interview Venue: Ibibo Group Private Limited Ground Floor Tower B1,Golden Enclave, Corporate Block Old Airport Road, Bangalore -560 017 Contact Person - Rinku Jain","location":"Bangalore","experience":"0 - 1 Years"},{"date":"31 - Dec - 2019","skills":".Net 4.0/ 4.5,C#, MVC, WCF, SOA, SQL Server, Data Warehousing, HTML5, CSS3","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Veyron Technologies Private Limited, C-51, Suite no 406, Sector - 62, Noida","phone":"0120-4243760","profile":"ASP .Net Developer \nVeyron Technologies Private Limited","description":"Candidate must have strong experience/ skills on .Net 4.0/ 4.5,C#, MVC, WCF, SOA, SQL Server, Data Warehousing. Knowledge of HTML, CSS, Web Services, Javascript and Jquery Advanced C# skills Must have good analytical & problem-solving skills Should have good communication skills Walk-in Date : 31 December 2019 & 4, 11, 18 Jan 2020 Time : 12:30 PM - 6:00 PM Interview Venue : Veyron Technologies Private Limited C-51, Suite no 406, Sector - 62, Noida Contact Person- Priyanka Priya Phone: 0120-4243760","location":"Noida","experience":"0 - 4 Years"},{"date":"30 - Dec - 2019","skills":"Software Testing, Automation Testing, Test Case Execution, Quality Assurance","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Amazon Development Centre (India) Private Limited, Ground Floor, Infinity Tower, Tata Ramanujan IT City SEZ, Rajiv Gandhi Salai, Near Tidal Park, Old Mahabalipuram Road, Taramani, Chennai - 600 113.","phone":"Not Provided","profile":"QA/ Testing Engineer \nAmazon Development Centre (India) Pvt. Limited","description":"Amazon Development Centre (India) Pvt. Limited is hiring Software Testing (QAT) for Chennai location. Person should be BE Computer Science, B-Tech, Master of computer Applications (MCA), MSc Information Technology (IT) with relevant experience in Software testing with 2 to 3 years of industry experience. Well versed in SDLC and has hands on experience on STLC. Have fair scripting knowledge using Python and Java, able to own, execute and verify results of existing automated tests, manage and scale the lab infrastructure based on project needs. Basic understanding of the automation framework to initiate, manage and maintain automation runs as per defined schedule/ SLA. Walk-in Date : 30th December 2019 Time: 10:00 AM to 1.00 PM Interview Venue: Amazon Development Centre (India) Private Limited Ground Floor, Infinity Tower, Tata Ramanujan IT City SEZ, Rajiv Gandhi Salai, Near Tidal Park, Old Mahabalipuram Road, Taramani, Chennai - 600 113. Documents to Carry: 2 copies of Resume (Mandatory) Pan Card (Mandatory) Photo Copies Provisional Certificate and/or Degree Certificate (Mandatory) Photo Copies Upon arrival, please ask for Kalpana/ Piyush","location":"Chennai","experience":"2 - 3 Years"},{"date":"27, 28, 30, 31 - Dec - 2019","skills":"TESTING/ JAVA/ PHP Programming, SDLC, OOPS Concept","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Bravezone Softech Private Limited, B Wing, Office No. 4, Ground Floor, Parmar Trade Center, next to Income tax Office, Sadhuwaswani Chouk, Near Pune Station, Pune - 411 001","phone":"8669760222","profile":"Software Developer/ Tester \nBravezone Softech Private Limited","description":"Urgent hiring for Only Freshers for the position of Software Developer & Software Tester Strong knowledge of TESTING/ JAVA/ PHP Programming required. Should have knowledge of basic Programming languages like C, Java and any database Strong knowledge of OOPS Concept. Should have a fair knowledge of entire SDLC. Qualification: BE, ME, MCA, BCA, BSc Work Experience: Fresher Salary: 1.4 to 2.4 k Employment Type:Permanent Job, Joining : Immediate Your primary responsibility will be to design and develop these applications, and to coordinate with the rest of the team working on different layers of the infrastructure. Thus, a commitment to collaborative problem solving, sophisticated design, and product quality is essential. Direct Walk-in for the interview timing 10.00 Am to 2.30 PM Interview Location- Bravezone Softech Private Limited B Wing, Office No. 4, Ground Floor, Parmar Trade Center, next to Income tax Office, Sadhuwaswani Chouk, Near Pune Station, Pune - 411 001 Helplines: +91.8669760222","location":"Pune","experience":"0 - 1 Years"},{"date":"30, 31 - Dec - 2019","skills":"Technical Support, Software Support, SQL Query Networking Skills","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Eclinicalworks (India) Private Limited, Boomerang Building B wing 7 Floor Chandivali, Andheri (East) Mumbai","phone":"8879934573","profile":"Software Specialist (Technical Support) \nEclinicalworks (India) Private Limited","description":"Job Functions /Responsibilities: Providing software support for issues Ability to troubleshoot on analytics issues Ability to understand the problem and fix the issue, talk the customer through the problem and provide a satisfactory resolution Performing data validation to ensure accuracy and appropriateness of analytic models Good Judgment and a strong teamwork skills to work well with the team members and members of all other departments. Skills/ Abilities: SQL Query Networking Good Analytical skills Good written and verbal communication skills Educational Requirements: BE,BCA,Bsc Freshers can also apply Walk-in Date/ Time: 30 December - 10th January , 9 AM onwards Interview Venue: Eclinicalworks (India) Private Limited Boomerang Building B wing 7 Floor Chandivali, Andheri (East) Mumbai Contact Person - Asma Phone No. 8879934573","location":"Mumbai","experience":"0 - 4 Years"},{"date":"28 - Dec - 2019","skills":".Net, C#, VB. Net, Web Services, WSDLs/ SOAP/ REST and WCF services","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Ventura Securities Limited, 8th Floor, B Wing, I Think Techno Campus, Pokhran Road no.02,Off Eastern Express Highway, Thane (West), Mumbai - 400 607","phone":"022-66227246","profile":".Net Developer \nVentura Securities Limited","description":"Qualification: BSc/ BA in Computer Science, Engineering or a related field. Work Experience: 1 to 5 Years Candidate should have experience in developing database driven console based/ web based applications. . In case of web based applications knowledge of creation and integration of Web Services, WSDLs/ SOAP/ REST and WCF services. Also knowledge of HTML5, CSS3, LINQ, Ajax & Javascript. Knowledge of at least one of the .NET languages (e.g. C#, Visual Basic .NET) MS SQL (writing queries, procedures, triggers, indexes) and in database design Software design, OOP and n-tier application design Understanding of Agile methodologies Walk-in Date/ Time: 28th December 2019, 10 AM onwards Interview Venue: Ventura Securities Limited 8th Floor, B Wing, I Think Techno Campus, Pokhran Road no.02,Off Eastern Express Highway, Thane (West), Mumbai - 400 607. If you find this opening suitable then get back to us on pooja.patil@ventura1.com or call on 022-66227246","location":"Mumbai","experience":"1 - 5 Years"},{"date":"30 - Dec - 2019","skills":"Technical Support/ Network Support, Voice Process","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Tech Mahindra Limited, RMG Area, A-6, Sector-64, Noida - 201 301.","phone":"8178787422","profile":"Technical Support Associate \nTech Mahindra Limited","description":"Tech Mahindra Limited is hiring fresher's and experienced candidates for Technical/ Network Support for Tech Voice Process. Educational Qualification: Any Graduate Experience Range: 0 to 4 Years (Freshers can also apply) Skills Required:- Excellent verbal communication skills Excellent logical reasoning Handling Internet Troubleshooting Issues Basic Networking, LAN, WAN, Corporate enterprise domain infrastructure environment Candidate should be flexible to work in 24*7 environment, comfortable to work in night shifts Both side Transport facility available (Pick & Drop). 5 Days Working. Walk-in Date: 30th December, 2019 Timing: 11:00 AM to 4 PM Interview Venue: Tech Mahindra Limited, RMG Area, A-6, Sector-64, Noida - 201 301. Landmark: Nearby Noida Sector 62 Metro Station Contact Person: Tannu Yadav (8178787422)","location":"Noida","experience":"0 - 4 Years"},{"date":"26, 27, 28 - Dec - 2019","skills":"HR, Talent Acquisition, IT Recruitment, Technical Recruitment, IT Staffing","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Information Dynamics India Private Limited, 6th Floor, Elnet Software City, TS, OMR Service Road, 140, Old Mahabalipuram Road, Taramani, Chennai - 600 113.","phone":"044-46702255","profile":"IT Recruiter \nInformation Dynamics India Pvt. Limited","description":"Candidate should be Any Graduate/ MBA (HR) with 1 to 4 years of experience in HR, Talent Acquisition, IT Recruitment, Technical Recruitment, IT Staffing Handles end to end recruitment from finding the potential candidates to closing up the positions for particular requisitions. Sourcing profiles through different Strategies like Postings, Networking sites & Job Portals. Hiring through recruitment network and reference Conduct pre-screening interviews through phone and F2F interview. Organizing and coordinating the walk-In & Scheduled interviews with the requirement. Discussed and negotiated the salary propositions with candidates, delivering the employment offer to the candidate. Coordinating and taking care of on-boarding activities Walk-in Date/ Time: 26th - 28th December 2019, 10 AM onwards Interview Venue: Information Dynamics India Private Limited 6th Floor, Elnet Software City, TS, OMR Service Road, 140, Old Mahabalipuram Road, Taramani, Chennai - 600 113. Contact Person- Deepa Phone No. 044-46702255 If you are interested please share your resume to deepalakshmi.r@in.infodynamic.net","location":"Chennai","experience":"1 - 4 Years"},{"date":"4 - Jan - 2020","skills":"Java/ J2EE, Spring Core/ Boot/ MVC/ Transaction/ JMS/ etc","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Nisum Consulting Private Limited, 6th floor, A3 Building, E Space IT Park, Viman Nagar Pune - 411 014.","phone":"Not Provided","profile":"Java Full Stack Developer \nNisum Consulting Private Limited","description":"Candidate should have Bachelor's degree in Engineering or equivalent with minimum 7 years of hands on full cycle Web Development in J2EE/ UI/ Front end development experience to design and development of high-volume, high-performance, high-availability applications. Experience with Agile practices Must to have Skills: Strong with Spring Core/ Boot/ MVC/ Transaction/ JMS/ etc across various Spring versions, Experience with Java/ J2EE tech stack - capable to write Rest services and expose them securely, Experience designing and executing responsive web applications, Experience building Java web applications, JSP, Spring, XML, Xpath, JSON and with J2EE application Java 8 features Centric Interested Candidates can Walk-In to our office on Jan 4th ,2020. Address: Nisum Consulting Private Limited 6th floor, A3 Building, E Space IT Park, Viman Nagar Pune - 411 014","location":"Pune","experience":"7 - 10 Years"},{"date":"28 - Dec - 2019","skills":"Core JAVA, JPA, Hibernate, Spring and Spring boot, Spring framework","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Daffodil Software Private Limited, 9th Floor, Building B1, DLF Silokhera SEZ, Sector 30, Gurgaon - 122 001.","phone":"Not Provided","profile":"Core Java Developer \nDaffodil Software Private Limited","description":"Daffodil Software Private Limited is looking for Java Developer to expand and strengthen its exceptional team at one of the most prime office spaces at DLF SEZ, Gurgaon. Candidate must have experience in- Core JAVA, JPA, Hibernate, Must have a good command on Spring and Spring boot, Spring framework Must have good knowledge of programming languages Should be able to deliver in a fast paced - Agile environment Hands on experience in API development, Strong analytical skills. Strong logical reasoning and problem solving skills Excellent written and verbal communication skills. Kindly register on below given link: http://bit.ly/Javawalkdrive Walk-in Date/ Time: 28th December 2019, 9 AM onwards Interview Venue: Daffodil Software Private Limited 9th Floor, Building B1, DLF Silokhera SEZ, Sector 30, Gurgaon - 122 001. Nearest Landmark: Star Mall, NH 8, Gurgaon Nearest Metro Station: Huda City Center. Contact Person- Payal Singh","location":"Gurgaon","experience":"4 - 8 Years"},{"date":"27 - Dec - 2019","skills":"Linux, Java, J2EE, SQL, HTML, CSS, JavaScript and AngularJS","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Atria Convergence Technologies Pvt. Limited, ACT Fibernet,Golden Heights, 1st Floor, 59th C Cross, 4th M Block, Near Sujatha Theatre, Rajajinagar, Bengaluru - 560 010","phone":"Not Provided","profile":"Java Developers \nAtria Convergence Technologies Pvt. Limited","description":"We are looking for an Server Side Java developer responsible for the development and maintenance of applications. Your primary focus will be development of applications and their integration with other services along with constant eye of improvements through customer/ user feedback. Required Skills: 1+ years of development experience Proficient with Linux, Java, J2EE, SQL Familiarity with HTML, CSS, JavaScript and AngularJS Experience with frameworks such as spring, SpringBoot and Hibernate Experience with Eclipse IDE Familiarity with RESTful and SOAP APIs Knowledge of other web technologies and UI/ UX standards Knack for benchmarking and optimization Proficient understanding of code versioning tools {such as Git, Mercurial or SVN} Experience with Agile and Waterfall SDLC models Walk-in Date/ Time: 27 December 2019, 10 AM onwards Interview Venue: Atria Convergence Technologies Pvt. Limited ACT Fibernet,Golden Heights, 1st Floor, 59th C Cross, 4th M Block, Near Sujatha Theatre, Rajajinagar, Bengaluru - 560 010 Contact - HR Team","location":"Bangalore","experience":"1 - 3 Years"},{"date":"26, 27 - Nov - 2019","skills":"Core Java, Spring Mvc","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Mindgate Solutions Private Limited, 14th Floor, Damji Shamji Business Gallaeria, LBS Marg, Above D-Mart, Kanjur Marg West, Mumbai - 400 078.","phone":"9699625001","profile":"Java Developer \nMindgate Solutions Private Limited","description":"Urgently require Software developers with hand-on experience in Core Java. Candidate must have minimum 2 years experience Good verbal communication in English would be an advantage Immediate joiners within 7 days of the offer would get a joining bonus of 20k Domain: Payments Banking (UPI Payments) Company Type : Product based Clients : All Banks Pay Role : Permanent Payroll of Mindgate Solutions Pvt Ltd Location : KanjurMarg West, Mumbai (Permanent) Perks and Benefits Immediate joiners joining within 7 days of the offer would get 20k joining bonus Note - Only candidates from Mumbai may apply Walk-in Date/ Time: 26th - 27th December , 10 AM onwards Interview Venue: Mindgate Solutions Private Limited 14th Floor, Damji Shamji Business Gallaeria, LBS Marg, Above D-Mart, Kanjur Marg West, Mumbai - 400 078. Contact Person- Sharan Tel: 9699625001","location":"Mumbai","experience":"2 - 4 Years"},{"date":"26, 27, 28 - Dec - 2019","skills":"PHP, Linux, Java, J2EE, SQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"ACT Learning & Development Center Building, 8-2-610/A, Road No. 10, Gaffar Khan Colony, Banjara Hills, Hyderabad, Telangana - 500 034","phone":"Not Provided","profile":"Java Developers \nAtria Convergence Technologies Limited","description":"We are looking for a Server Side PHP and Java developer responsible for the development and maintenance of applications. Your primary focus will be development and maintenance of CMS, Web Application and their integration with other services along with constant eye of improvements through customer/user feedback. Educational Qualification: BE/ MSc (Computers/ IT) Experience: 1+ years of development experience Proficient with PHP, Linux, Java, J2EE, SQL Experience with frameworks such as CodeIgniter, SpringBoot and Hibernate Experience with Eclipse IDE Familiarity with RESTful and SOAP APIs Knowledge of other web technologies and UI/UX standards Knack for benchmarking and optimization Proficient understanding of code versioning tools {{such as Git, Mercurial or SVN}} Experience with Agile and Waterfall SDLC models Walk-in Date/ Time: 24th - 28th December from 9 AM onwards Interview Venue: ACT Learning & Development Center Building 8-2-610/A, Road No. 10, Gaffar Khan Colony, Banjara Hills, Hyderabad, Telangana - 500 034 Landmark: Near Care Hospital out patient center, Opposite to Rainbow Children's Hospital Corporate Office","location":"Hyderabad","experience":"1 - 3 Years"},{"date":"26, 27 - Dec - 2019","skills":"Core Java/ J2EE, Web Services (SOAP and REST)","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Prospecta Soft Private Limited, IRIS Tech Park, Unit No. 206, Second Floor, Block A, Sector 48, Gurugram, Haryana","phone":"0124-4497439","profile":"Senior Java Developer \nProspecta Soft Private Limited","description":"Candidate should have BE or MCA degree in Computer Science, Information Technology, or equivalent with 3 to 8 years or more experience in Software Development or other technology related field. Strong hands on experience in Core Java/ J2EE development. Exposing and consuming Web Services (SOAP and REST). Understanding and prior experience developing and designing client facing software systems. Proven analytical and problem-solving skills. Strong negotiation and influence skills. Ability to manage risk appropriately. Ability to thrive in a team-oriented, fast-paced environment. Excellent technical written and verbal communication skills. Walk-in Date/ Time: 26th & 27th December , 10 AM onwards Interview Venue: Prospecta Soft Private Limited IRIS Tech Park, Unit No. 206, Second Floor, Block A, Sector 48, Gurugram, Haryana Contact Person- Neema/ Shalini Phone No. 0124-4497439","location":"Gurgaon","experience":"3 - 8 Years"},{"date":"30 - Dec - 2019","skills":"Volume Hiring, Interviewing, Recruitment, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Williams Lea India Private Limited, Plot #1, Muthoot Technopolis Kakkanad, Cochin, Kerala, India","phone":"Not Provided","profile":"Talent Acquisition Executive \nWilliams Lea India Private Limited","description":"Designation : Talent Acquisition Specialist Job Location : Cochin Shift : General shift Skills Required: Minimum of 2 years experience in end to end recruitment Experience in volume hiring would be an added advantage Must have good communication skills Walk-in Interview on on 30th December 2019 from 10:00 am to 1:00 pm Venue Details: Williams Lea India Private Limited Plot #1, Muthoot Technopolis Kakkanad, Cochin, Kerala, India","location":"Cochin, Kochi","experience":"2 - 6 Years"},{"date":"26, 27 - Dec - 2019","skills":"Office/ Personal Assistance, Report Generation, General Administration","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Dynacons Systems & Solutions Limited, 76, Ratnajyot Industrial Estate, Irla Lane, Ambe Mata Chowk, Vile Parle (West), Mumbai - 400 056","phone":"8484033808","profile":"Back Office/ Admin Assistant \nDynacons Systems & Solutions Limited","description":"Education Requirement - Any Graduate, Work Experience: 0 - 2 Years Job Location - Andheri (East) Must have excellent communication skills Handling office tasks, such as filing, generating reports and presentations. Providing real-time scheduling support by booking appointments Walk-in Date/ Time: 24th - 27th December , 10 AM onwards Interview Venue: Dynacons Systems & Solutions Limited 76, Ratnajyot Industrial Estate, Irla Lane, Ambe Mata Chowk, Vile Parle (West), Mumbai - 400 056 Contact Person- Pooja Sharma Email- Pooja.sharma@dynacons.com","location":"Mumbai","experience":"0 - 2 Years"},{"date":"27 - Dec - 2019","skills":"HR Administration/ MIS Reporting/ Telecalling","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Axis Securities Limited, 2nd Floor, 3A Shakespear Sarani, Kolkata - 700 071.","phone":"Not Provided","profile":"MIS Executive / HR \nAxis Bank Limited","description":"We are conducting walk-in drive for HR Executive/ MIS Executive/ Telecaller (1 - 6 years experience) profile for Kolkata location on Renowned Partner Payroll Candidates should have good knowledge in Excel, Preparing reports and Dashboards using Excel formulae and Functions. Must have excellent communication & presentation skills. Ability to develop dashboards and reports based on requirements shared Prepare daily, weekly and monthly reports and dashboards Preparation of weekly review data Sales data Management, Analysis, presentation Administrative role in sales office Interested candidates kindly go through the JD mentioned above and walk-in with your updated resume as per the below mentioned schedule. Interview Date - 27th December 2019 Time - 10 AM - 2 PM Address: Axis Securities Limited 2nd Floor, 3A Shakespear Sarani, Kolkata - 700 071. Beside of Shakespear Sarani AC Market","location":"Kolkata","experience":"1 - 6 Years"},{"date":"4 - Jan - 2020","skills":"Core Java, Jsp, Servelets, Java, Spring, Hibernate","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Trantor Software Private Limited, 6th Floor, A Square, Plot No. 278, Udyog Vihar II Rd, Phase II, Sector 20, Gurugram, Haryana","phone":"0172-4033013","profile":"Java Developers \nTrantor Software Private Limited","description":"Walk in Drive for Java Developers on 4th January 2020 at Trantor Software Private Limited Required Skills: Coding experience in Java Skills Set : Jsp, Servelets, Java, Spring, Hibernate Must have worked on Core Java and Advanced Java Walk-in Date/ Time: 4th January 2020, 10 AM onwards Interview Venue: Trantor Software Private Limited 6th Floor, A Square, Plot No. 278, Udyog Vihar II Rd, Phase II, Sector 20, Gurugram, Haryana And, 18S G-9, Rajiv Gandhi Chandigarh Technology Park, Chandigarh, India Contact Person- Shradha Arora Contact No. 0172-4033013","location":"Chandigarh, Gurgaon","experience":"2 - 7 Years"},{"date":"26, 27, 30, 31 - Dec - 2019","skills":"Back Office Operations, Non Voice Process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Hinduja Global Solutions Limited, No. 115, Sri Chamundi Towers, C-2 Building, Hosur Main Road, Garvebhavi Palya, Opp: Sai Baba Temple, Bangalore - 560 068.","phone":"Not Provided","profile":"Back Office Executive \nHinduja Global Solutions Limited","description":"Any Graduate-Fresher or Experienced (NO - BE, B.Tech, Post Graduates) Willing to work in rotational shifts 2 Way cab facility provided 5 Days working, 2 Days Off Desired Skills/ Abilities: Good communication skills Good Analytical Skills Basic computer knowledge Walk-in Date: 26th - 31st December 2019 Time Slot: (10 am - 2 pm/ Monday-Friday) Walk in location: Hinduja Global Solutions Limited No. 115, Sri Chamundi Towers, C-2 Building, Hosur Main Road, Garvebhavi Palya, Opp: Sai Baba Temple, Bangalore - 560068. Contact HR person: Pooja-7829533724","location":"Noida","experience":"0 - 1 Years"},{"date":"3, 4 - Jan - 2020","skills":"Android SDK, Rest, Web Services, Android Studio, RSS, MySQL, Oracle","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Concourse Solutions Private Limited, 502, Suratwala Mark Plazzo, Wakad - Hinjewadi Road, Hinjewadi Pune - 411 057.","phone":"9766916660","profile":"Android Developer \nConcourse Solutions Private Limited","description":"Educational Qualification: Any Graduate Experience: 2-4 years experience in Android development Job Location: Pune Candidate should have good & hands on experience on Android SDK, Rest, Web Services, Android Studio, RSS, GIT, OOPs, Core Java, Retrofit, JSON, Kotlin, Eclise, MySQL, Oracle Scheduled Walk-in is on 3rd & 4th Jan 2020 Timings: 12:00 PM to 5:00 PM Interview Venue: Concourse Solutions Private Limited 502, Suratwala Mark Plazzo, Wakad - Hinjewadi Road, Hinjewadi Pune - 411 057. Contact Person- Pramod Wankhede Tel Number: 9766916660 If you are interested in the above positions, please share your updated profile with the below information to pramod@concoursesols.com Total Experience: Relevant Experience: Current CTC: Expected CTC: Notice Period:","location":"Hyderabad","experience":"2 - 4 Years"},{"date":"28 - Dec - 2019","skills":"Core Java , J2EE that includes JSP, Servlets, and EJB","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Sys Arc Infomatix Private Limited, No. 1, Defence Officer's Colony, Opposite New Military Hospital, Nandambakkam, Chennai - 600032.","phone":"044-43542969","profile":"Software Engineer (Java) \nSysArc Infomatix Private Limited","description":"Education: BE/ B Tech OR any Masters in Computers. Work Experience: 2 to 4 Years Job Location: Chennai. Mandatory Skill Sets: Proficient in understanding the requirements and converting them into systematic solutions Min 2 years of hands-on experience in Core Java , J2EE that includes JSP, Servlets, and EJB Must have worked in at least one project using Java and J2EE that includes JSP, Servlets, and EJB Knowledge/ experience in Spring boot, Hibernate, Angular 2 or above Must have 2 years of experience in writing database queries - SQL Should have min 1 year of experience in Webservices (SOAP, REST) Walk-in Date: 28th December 2019 Interview Time : 10:00 AM - 2:00 PM Interview Venue: Sys Arc Infomatix Private Limited No. 1, Defence Officer's Colony, Opposite New Military Hospital, Nandambakkam, Chennai - 600032. Contact Person- Angel A Phone No: 044-43542969","location":"Chennai","experience":"2 - 4 Years"},{"date":"23, 24 - Dec - 2019","skills":"Back Office Processing, Business Services, Claim Caculation, Insurance Operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"AXA Business Services Private Limited, 2nd Floor, MFAR Building, Manyata Tech Park, Green Heart, Phase IV, Rachenahalli, Nagavara, Bangalore - 560 045.","phone":"Not Provided","profile":"Back Office (Non-Voice Process) \nAXA Business Services Pvt. Limited","description":"AXA Business Services Pvt. Limited, is hiring for Non-voice Process insurance domain-Bangalore Experience/ Skills required: Fresher or experienced professionals with up to 2 years of experience into Non voice. Excellent in conversational and comprehension skills Non technical Graduates. Flexible to work with night shift. Work Location: MFAR Manyata Tech Park, Bangalore. Interested candidates can walk in with their updated resumes to the below mentioned address- AXA Business Services Private Limited 2nd Floor, MFAR Building, Manyata Tech Park, Green Heart, Phase IV, Rachenahalli, Nagavara, Bangalore - 560 045. Date: 23rd to 24th December 2019 Time: 11 am- 1 pm Contact Person: Najeeb/ Sushmitha/ Akansha","location":"Bangalore","experience":"0 - 2 Years"},{"date":"23, 24 - Dec - 2019","skills":"Back office Operations, Customer Service, Front Office","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"VFS Global Services Private Limited, Srida Anushka Pride, 3rd Floor Road No. 12, Banjarahills, Hyderabad.","phone":"8688671162","profile":"Backoffice Operations Officer \nVFS Global Services Private Limited","description":"Candidate should be Any Graduate/ Fresher with good communication skills Day shift working. No Night Shifts Saturday & Sunday Weekly offs Job Responsibility- Document scrutiny and collection of applications for visa processing. Handle customer/ applicant queries personally or via email, telephone. Handle cash and bank related transactions if assigned and ensure 100% accuracy. Record & maintain all application data. Ensure accurate & timely data entry into the system with zero errors. Ensure all administration and logistics of passport delivery to consulate/ applicant/ logistic company etc. Maintain compliance to the standard operating procedures, manuals etc. without deviation in process. Walk-in Date/ Time: 23rd - 24th December , 11 AM onwards Interview Venue: VFS Global Services Private Limited Srida Anushka Pride, 3rd Floor Road No. 12, Banjarahills, Hyderabad. Contact Person - Bhavana Phone: 8688671162","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"23, 24 - Dec - 2019","skills":"Back End Operations, Non Voice Process, Recruitment","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"SLK Global Solutions Private Limited, 6th Floor, Building No. 2, Commerce Zone IT Park, Yerwada, Pune","phone":"Not Provided","profile":"Backend Process Associate \nSLK Global Solutions Private Limited","description":"SLK Global Solutions Private Limited is hiring for freshers for International Process for Non Voice/ Backend Process. Qualification: Any Undergraduate/ Graduate (No - BE/ BCA/ B.Sc/ MBA) Work Experience: Fresher Job Location:-Pune Role: Permanent Shifts: Night shifts (24*7) Travel: 1 way cab drop is available as per transport boundary (Free for Female candidates) Skill Set: Must have good English communication skills Must be open to work in rotational shifts Should have good typing skills No regional language Walk-in Date: 23rd - 24th December 2019 Time: 12.00 PM to 3:00 PM Interview Venue: SLK Global Solutions Private Limited, 6th Floor, Building No. 2, Commerce Zone IT Park, Yerwada, Pune Note: The applicant must have a valid PAN and Aadhar card","location":"Pune","experience":"0 - 1 Years"},{"date":"23, 24 - Dec - 2019","skills":"Back Office Operations, Non Voice Process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"HCL Technologies Limited, A-22, Sector 60, Noida (Near Noida sector 59 Metro Station)","phone":"7330395349","profile":"Backend Process Executive \nHCL Technologies Limited","description":"HCL BSERV is hiring for a banking process for entry level positions for Noida location. Qualification: B.Com Graduates (Basic banking knowledge required) Work Experience: *Fresher Shifts:- UK Shifts Salary:- Upto 1.8 LPA 5 Days Working(Fixed Saturday & Sunday off) Required Skill Set:- Basic knowledge of Banking. Must have exposure to MS Office (Word, Excel etc.) Verbal & Written communication/ Language skills. Must have good analytical and interpretation skills Typing speed - 25 wpm with 85% accuracy. Should have familiarity with Windows Operating System and desktop system. Should have keen eye for details. Walk-in Date: 23rd to 24th December 2019 Time - 1:00 pm to 4:00 pm Interview Venue- HCL Technologies Limited A-22, Sector 60, Noida (Near Noida sector 59 Metro Station) Contact Person - Jyoti Gupta Kindly Carry: 1) A copy of your updated resume 2) A govt. address/ Id proof 3) A print out of this email","location":"Noida","experience":"0 - 1 Years"},{"date":"23, 24 - Dec - 2019","skills":"Software Testing, Test Engineering, Automation Testing, Manual Testing, Selenium, Test Scripts","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Baysquare Technology Private Limited, 401, 4th Floor, Sigma Building, Hiranandani, Powai, Mumbai - 400 076.","phone":"022 61533105","profile":"Automation Test Engineer \nBaysquare Technology Private Limited","description":"Candidate should be BE, B.Tech, MCA (IT Graduate) with 3+ years of extensive testing experience with skill to review the design and maintenance of automation test cases. Should have knowledge of all types of testing - integration testing, system testing, functional testing, UI testing, load testing, performance testing. Selenium , JIRA, Bugzilla, Basic SQL Queries, Agile Job Responsibilities: Manual Testing - Writing System Test Cases, Execute System Test Cases. Automation Testing - Writing Test Scripts that would run during Automation testing Prepare Bug Report. Good understanding of automation framework. Understands application requirements, write and maintain test cases according to functional and technical design specifications. Looking for immediate joiners Candidates with more than 45 days of notice period please do not apply. Walk-in Date/ Time: 23 December - 24 December , 11 AM onwards Interview Venue: Baysquare Technology Private Limited 401, 4th Floor, Sigma Building, Hiranandani, Powai, Mumbai - 400 076. Contact Person - Divya Interested candidates kindly share your resume at shetty.divya@baysquare.com or can directly call at 022 61533105","location":"Mumbai","experience":"3 - 5 Years"},{"date":"21, 23, 24, 26, 27, 28 - Dec - 2019","skills":"Software Testing, Automation Tools, Performance Testing, Usability Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Rentokil PCI, Narayni Ambabai Temple Compound, Aarey Road Junction, Goregaon West, Mumbai - 400 104","phone":"022-40865747","profile":"Software Tester \nPCI Pest Control Private Limited","description":"The person will be responsible for to find bugs and issues within a product before it gets deployed to everyday users. He should be capable of designing test suites and should have the ability to understand usability issues. The person should have sound knowledge of software test design and test execution methodologies. Core Competencies, Knowledge, Skills & Abilities: Good understanding of the software development process Strong analytical and problem-solving abilities Attention to detail Able to use own initiative Must be able to continuously learn new skills to keep abreast of industry trends The ability to work under pressure and to tight deadlines Walk-in Date/ Time: 20th December - 28 December , 10 AM onwards Interview Venue: Rentokil PCI Narayni Ambabai Temple Compound, Aarey Road Junction, Goregaon West, Mumbai - 400 104 Contact - Pratik Pandya ( 02240865747 )","location":"Mumbai","experience":"0 - 2 Years"},{"date":"21 - Dec - 2019","skills":"Web Services - REST/ SOAP, Struts, Spring, SQL, Script, Oracle/ SQL Server","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"FIS Global Business Solutions India Pvt. Limited, 2nd floor, Wrap Tower, SJR iPark, Whitefield, Bangalore","phone":"Not Provided","profile":"Java Professionals \nFIS Global Business Solutions India Pvt. Limited","description":"Candidate should have sound exposure in Web Services - REST/ SOAP, Server-side programming. Good hands of working experience in API development and Spring Integration. Hand on experience with Struts, Spring, SQL, Script, Oracle/SQL Server database experience is needed. Banking domain exposure is preferable Knowledge of end-to-end SDLC, i.e., waterfall, iterative and other modern approaches to software development. If you have experience in above mentioned technical skills, interested candidates can attend F2F interview as per below details: Interview Date: 21st December' 2019 (Saturday) Interview Time: 9:30 AM - 2 PM Interview Venue: FIS Global Business Solutions India Pvt. Limited 2nd floor, Wrap Tower, SJR iPark, Whitefield, Bangalore. Landmark: Opposite to Sai Baba Hospital/ Inorbit Mall Contact Person - Saroj","location":"Bangalore","experience":"2 - 7 Years"},{"date":"21 - Dec - 2019","skills":"Core Java, J2EE framework like Spring Boot, Spring MVC, MySQL/ PostgreSQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Oodles Technologies Private Limited, Unit No. 951, 9th Floor, Tower B1 Spaze I-tech Park, Sector 49, Gurugram, Haryana","phone":"Not Provided","profile":"Core Java Developer \nOodles Technologies Private Limited","description":"Candidate should have strong experience in Core Java. Hands-on development in a J2EE framework like Spring Boot, Spring MVC. Good knowledge of Relational Databases like MySQL, PostgreSQL, MS SQL Server with complex SQL Queries, Stored Procedure, Triggers. Candidate must have knowledge of ORM like Hibernate Must have good working knowledge of Data Structure Unit testing experience using Junit, Spock Knowledge of versioning tools like GIT, SVN Knowledge of build tools like Maven, Gradle, Ant Walk-in Date/ Time: 21st December 2019, 10 AM onwards Interview Venue: Oodles Technologies Private Limited Unit No. 951, 9th Floor, Tower B1 Spaze I-tech Park, Sector 49, Gurugram, Haryana Landmark: Near to Omaxe City Centre Nearest Metro : Huda City Centre Contact Person - Vineeta","location":"Gurgaon","experience":"1 - 4 Years"},{"date":"21 - Dec - 2019","skills":"Java, J2EE, Spring, Hibernate","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Cognizant Technology Solutions, 2nd Floor, Right Wing, KNC Office, Varalakshmi Tech Park, Kandhanchavadi, OMR, Chennai.","phone":"Not Provided","profile":"Java Developers \nCognizant Technology Solutions India Limited","description":"Candidate must have hands-on experience Java/ J2EE Application development/ support Projects. Should have good technical problem solving skills. Exposure to the below skill combination is mandatory to have: Combo 1: Java, Spring, Hibernate (Recent hands on experience with Spring/ Hibernate is mandatory). Candidate with hands on experience on above skills will be eligible to apply for this position For all the above roles the candidate should possess a BE/ B. Tech/ B. Sc/ BCA/ MCA/ M. Tech/ M. Sc with consistent above 50% is Mandatory Job Responsibilities- Responsible for delivery of assigned module/ components/ phases of a project Responsible for Status reporting Responsible for estimation, planning and execution with specific focus on requirement analysis and design Responsible for Knowledge transfer and arriving at SLAs for steady state Notice Period: 90 Days (Candidates between Immediate to 30 days are most preferred) Walk-in Date/ Time: 21st December 2019, 9 AM onwards Venue Details- Cognizant Technology Solutions 2nd Floor, Right Wing, KNC Office, Varalakshmi Tech Park, Kandhanchavadi, OMR, Chennai. Opp to Hi STYLE building/ Behind Apollo Lifeline hospital Contact Person- Manoj","location":"Chennai","experience":"3 - 8 Years"},{"date":"21 - Dec - 2019","skills":"Java, J2EE, Spring","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"HCL Chennai, Sholinganallur, SPOC: Ahmed_s@hcl.com","phone":"Not Provided","profile":"Java/ Full Stack Developer \nHCL Technologies Limited","description":"We are looking for a Java resource who is strong in Java, J2EE & Web services for a Senior Developer position at Chennai Location. Work Experience: 3 to 12 Years Should have good experience in Java, J2EE, Spring Must have Good Communication skills and Attitude Kindly revert us with your updated CV if you're Interested with the following details to ahmed_s@hcl.com Name: Contact No: Email ID: Highest Qualification: Current Company: Contract or Permanent: If Contract Please do mention Payroll company name: Total years of Experience: Relevant years of Experience in Java, J2EE: Relevant years of Experience in Spring MVC / Spring boot: Relevant Years of Experience in React JS: Relevant Years of experience in SOAP/ Rest: Current CTC: Expected CTC: Notice period: Current Location: Availability for 21st Dec'19 Weekend Drive @ Sholingallur, Chennai: Please feel free to contact us if you have any doubt about the requirement.","location":"Chennai","experience":"3 - 12 Years"},{"date":"21 - Dec - 2019","skills":"Java/ J2EE, Server Side Scripting, HTML5, JS MVC framework","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Sapiens Technologies (India) Private Limited, 8th Floor, Building No 11, Cessna Business Park Kadubeesanahalli, Bengaluru - 560 103.","phone":"080-49061357","profile":"Senior Java Developers \nSapiens Technologies (India) Pvt. Limited","description":"Candidate should be BE/ B.Tech or Equivalent with 5+years of experience in Java development. Should have experience working with relational database, such as MS-SQL and/or Oracle. Sound understanding of Object-Oriented principles. Must be experienced working with SPML, JavaScript, XML and JSON, Spring, Hibernate and web services architecture, such as SOAP and/or REST. Job Responsibilities- Designing, development of core components/services which are flexible, extensible, multi-tier, scalable, high performance and reliable applications of an advanced complex software system, called ALIS both in R&D and Delivery. Object Oriented Analysis, Design, development of software components and applications. Providing technical leadership and mentoring to junior developers. Walk-in Date/ Time: 21st December 2019, 9 AM onwards Interview Venue: Sapiens Technologies (India) Private Limited 8th Floor, Building No 11, Cessna Business Park Kadubeesanahalli, Bengaluru - 560 103. Contact Person - Abhinay S Phone: 080-49061357","location":"Bangalore","experience":"5 - 7 Years"},{"date":"21, 22, 23 - Dec - 2019","skills":"Technical Support, Desktop Suppot. IT Help Desk","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Prayosha Food Services Private Limited, Unit 81, Titanium, Corporate Road Prahladnagar, Ahmedabad - 380 015.","phone":"8155009175","profile":"Technical Support Engineer \nPrayosha Food Services Private Limited","description":"Candidate should have proven work experience as a Technical Support Engineer, Desktop Support Engineer, IT Help Desk Technician or similar role. Hands-on experience with Windows/ Linux/ Mac OS environments. Good understanding of computer systems, mobile devices and other tech products. Ability to diagnose and troubleshoot basic technical issues Familiarity with remote desktop applications. Excellent problem-solving and communication skills Ability to provide step-by-step technical help, both written and verbal Additional certification in Microsoft, Linux, Cisco or similar technologies is a plus. Job Responsibilities: Research and identify solutions to software and hardware issues. Diagnose and troubleshoot technical issues, including account setup and network configuration. Ask customers targeted questions to quickly understand the root of the problem Talk clients through a series of actions, either via phone, email or chat, until they've solved a technical issue. Ensure all issues are properly logged. Walk-in Date/ Time: 21st - 23rd December 2019, 11 AM onwards Interview Venue: Prayosha Food Services Private Limited Unit 81, Titanium, Corporate Road Prahladnagar, Ahmedabad - 380 015. Contact Person - Aarfa Neha Phone No. 8155009175","location":"Ahmedabad","experience":"1 - 6 Years"},{"date":"23, 24, 25, 26, 27 - Dec - 2019","skills":"Technical Support, IT Helpdesk, Customer Support","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Microland Limited, RMZ Ecospace, 1B, 2nd floor Outer Ring Road, Bellandur, Bengaluru, Karnataka - 560 103.","phone":"Not Provided","profile":"Technical Support Representative \nMicroland Limited","description":"Candidate should be Any Graduate with excellent communication skills. Knowledge of relevant software computer applications and equipment; Knowledge of customer service principles and practices; Effective listening skills; Willingness to co-operate with others and work to the greater good; Multi-tasking capabilities; Competencies: Exemplary Attendance and Punctuality Maintains effectiveness when experiencing major changes in personal work tasks or work environment; Adjusts effectively to work within new work structures, processes, requirements, or cultures. Focuses and guides self and team members in accomplishing work objectives. Interacts with others in a way that gives them confidence in one's intentions and those of the organization. Walk-in Date/ Time: 23 December - 27 December , 12 PM onwards Interview Venue: Microland Limited, RMZ Ecospace, 1B, 2nd floor Outer Ring Road, Bellandur, Bengaluru, Karnataka - 560 103. Contact Person - Sridhar RS Interested Candidates mail your Cv to rasmineep@microland.com","location":"Bangalore","experience":"1 - 4 Years"},{"date":"21, 23, 24, 25, 26, 27, 28, 30, 31 - Dec - 2019","skills":"Asp .Net, SQL Server","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Pamac Finserve Private Limited, C-19, Shriram Industrial Estate, Opposite Wadala Udyog Bhavan, Dadar (East), Mumbai","phone":"Not Provided","profile":".Net Developers \nPamac Finserve Private Limited","description":"Educational Qualification: BE/ BSc/ MSc/ MCA/ BCA/ B-Tech Experience Required: For back fill at least 2 year experience Must have excellent communication skills Specific Skill set Required- Asp .Net, SQL Server Walk-in Date/ Time: 19th December - 31st December , 10 AM onwards Interview Venue: Pamac Finserve Private Limited, C-19, Shriram Industrial Estate, Opposite Wadala Udyog Bhavan, Dadar (East), Mumbai","location":"Mumbai","experience":"0 - 2 Years"},{"date":"21 - Dec - 2019","skills":"Service desk, Technical Support, Global voice Process, Customer Service","qualification":"B.Sc, BCA/BCS, B.E./B.Tech, Diploma","address":"HCL Technologies Limited, Sector 126, Tower 1, Entry Gate 1, Noida","phone":"Not Provided","profile":"Technical Support/ Service Desk (L1) \nHCL Technologies Limited","description":"Candidate should have 1 to 3 years of experience in Service desk, Technical Support, Global voice customer service. Must have good problem solving skills involving hardware, involving hardware, software, and networks. Must have excellent communication skills Education Requirement: Bachelors/ Masters/ Equivalent Total: 3-4 years of University education post High school (B.Sc. or Diploma) Job Responsibilities:- Provide hardware/ software/ network problem diagnosis/ resolution via telephone/ email/ chat for customers end users Route problems to internal 2nd and 3rd level IT support staff. Coordinate and manage relationships with vendors and support staff that provide hardware/ software/ network problem resolution. Administer and provide User account provisioning. Walk-in Date/ Time 21st December 2019, 10 AM onwards Interview Venue: HCL Technologies Limited Sector 126, Tower 1, Entry Gate 1, Noida","location":"Noida","experience":"1 - 3 Years"},{"date":"21 - Dec - 2019","skills":"JavaScript/ CSS3/ HTML5/ Angular Java, SQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"GlobalLogic India Limited, ASF Insignia SEZ Private Limited Tower D, Grand Canyon Building, 15th Floor, Faridabad Road, Gwal Pahari, Gurgaon - 122003","phone":"98111 70057","profile":"Java Developers \nGlobalLogic India Limited","description":"Work Experience : 4-8 Years Job Location : Gurgaon Interview Mode : Face2Face Notice Period Max 30 DAYS Mandatory Skills- JavaScript/ CSS3/ HTML5/ Angular Java, SQL (2 years) Experience with CI/CD tools such as Maven, Jenkins, Docker, Kubernetes, ELK Stack Experience with RESTful API design and development Desired Skills- SAFE Agile trained T-SQL, PL/SQL SOLR MS Azure Cloud Experience Knowledge of UML Python experience Walk-in Date/ Time: 21st December 2019, 9 AM onwards Interview Venue: GlobalLogic India Limited ASF Insignia SEZ Private Limited Tower D, Grand Canyon Building, 15th Floor, Faridabad Road, Gwal Pahari, Gurgaon - 122003 Contact Person- Rajat Arora","location":"Gurgaon","experience":"4 - 8 Years"},{"date":"21 - Dec - 2019","skills":"HR Administration, Recruitment, Office Administration","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"IndusInd Bank Limited, GN Chetty Road, T. Nagar, Chennai - 17 (Landmark - Opposite AGS Cinemas T Nagar)","phone":"Not Provided","profile":"HR Associate \nIndusInd Bank Limited","description":"Candidate should be Any Graduate/ Post Graduate with 0 - 1 year of experience in HR Administration, Recruitment, Office Administration. Must have excellent communication skills. Should be willing to work on a contractual basis for 11 months (Contract can be renewed basis performance) Good Excel knowledge Age below 30 Male candidates ONLY Job Responsibilities: Handling Pre and Post Joining formalties Handling recruitment for Chennai Addressing employee queries Walk-in Date/ Time: 21st December 2019, 10 AM onwards Interview Venue: IndusInd Bank Limited, GN Chetty Road, T. Nagar, Chennai - 17 (Landmark - Opposite AGS Cinemas T Nagar) Contact Person - Sherin Toohey","location":"Chennai","experience":"0 - 1 Years"},{"date":"28, 29 - Dec - 2019","skills":"Technical Support, IT Helpdesk/ Service Desk, Product Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"KIO IT Solutions Private Limited, RAM SVR, 3RD FLOOR, SECTOR 1, MADHAPUR, HUDA TECHNO ENCLAVE, HI-TECH CITY, HYDERABAD - 500 081","phone":"040-48555009","profile":"Technical Support Engineer \nKIO IT Solutions Private Limited","description":"Candidate should be Any Graduate with basic knowledge of Unix commands Should have good knowledge of C and Java programming language. Must have excellent English language skills. Hard working and team player Willing to help clients with a smile. Job Responsibility- Configuring product according to client specifications. Conducting product training session for clients. Handling client queries through calls and emails. Walk-in Date/ Time: 28 - 29 December 2019, 10 AM onwards Interview Venue: KIO IT Solutions Private Limited RAM SVR, 3RD FLOOR, SECTOR 1, MADHAPUR, HUDA TECHNO ENCLAVE, HI-TECH CITY, HYDERABAD - 500 081 (LANDMARK: RENT A DESK - HITECH CITY)","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"20, 21, 23, 24 - Dec - 2019","skills":".Net & Node JS","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"MAINTEC Technologies Private Limited, 3M-215 Building, East of NGEF, Outer Ring Road, Kasturi Nagar, Bangalore - 560 043.","phone":"080-42718000","profile":".Net/ Node JS Developer (Freshers) \nMaintec Technologies Private Limited","description":"We have huge opening for Dot Net & Node JS Developer Skills for our client in Bangalore location. Eligibility Criteria: Degree: BE, B.Tech, ME, M.Tech (EEE, ECE, CSE, IT), BCA, MCA, BSC (CSE) Year of Pass out: 2018 & 2019 Only Percentage: 60% throughout, in academics, Admirable English communication skills Immediate joiners preferred. Interview Type: Face 2 Face Please walk-in to our office for a F2F interview on Monday to Friday between 10:30 AM to 5:00 PM along with your resume. Walk-in Date/ Time: 20th - 24th December 2019, 10 AM onwards Interview Venue: MAINTEC Technologies Private Limited 3M-215 Building, East of NGEF, Outer Ring Road, Kasturi Nagar, Bangalore - 560 043. Contact Person- Anusha K Land Line: 080-42718000","location":"Bangalore","experience":"0 - 1 Years"},{"date":"23, 24, 25, 26, 27 - Dec - 2019","skills":".Net, (SQL, Angular, AngularJS, Node.JS, Java Script, Jquery)","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Infosense Global Private Limited, A-103, Info Tower-3, Infocity, Gandhinagar - 382 009, Gujarat.","phone":"9687644166","profile":".Net Trainee Developer \nInfosense Global Private Limited","description":"Walk In Drive for SQL Developer trainee and Front End (.NET ) Developer trainee. Candidate must have excellent knolwdge of .Net, (SQL, Angular, AngularJS, Node.JS, Java Script, Jquery) Freshers and Interns can Walk-in directly from 23rd - 27th December (Monday to Friday) between 4:00 pm to 6:00 pm Interview Venue: Infosense Global Private Limited A-103, Info Tower-3, Infocity, Gandhinagar - 382 009, Gujarat. Contact Person- Bhumika Vaghela Phone: 9687644166","location":"Gandhinagar","experience":"0 - 1 Years"},{"date":"21, 23, 24, 26 - Dec - 2019","skills":"C#. Net, C, C++, Javascript, Jquery and Html","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Suvarna Technosoft Private Limited, Plot No. 8, Suvarna House, Opp. Chandana Brothers, Durga Nagar, Ameerpet, Hyderabad - 500 016.","phone":"9963426420","profile":".Net Developer \nSuvarna Technosoft Private Limited","description":"Candidate must have the working knowledge of C#. Net programming with the knowledge of C, C++, Javascript, Jquery and Html programming languages. Must be efficient with XML, HTML, CSS, TCP/ IP, Web Services, Windows C#. NET services, WCF, WPF & Crystal Reports Walk-in Date/ Time: 16th December - 26 December , 11 AM onwards Interview Venue: Suvarna Technosoft Private Limited Plot No. 8, Suvarna House, Opp. Chandana Brothers, Durga Nagar, Ameerpet, Hyderabad - 500 016. Contact Person - Bhupathi Srinivas/ K Laxmi Phone No. 9963426420","location":"Hyderabad","experience":"0 - 2 Years"},{"date":"21 - Dec - 2019","skills":".Net, ASP .Net, Software Engineering","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Concerto Software & Systems Private Limited, Building No. 305, 2nd Floor, A- Wing, Sector 2, Millennium Business Park, Mahape, Navi Mumbai - 400 710.","phone":"Not Provided","profile":"Trainee - .Net Developer \nConcerto Software Systems Pvt. Limited","description":"Candidate will be involved in Development, Implementation, Support Execution of the tasks related to support and development Must be clear with Basic Technology, concepts & Logic Skill Required: Should have analytical and programming logic skills Candidate must have good communications and interpersonal skills Should have positive & proactive attitude Walk-in Date: 21st December 2019 Time:- 9 AM to 11 AM. Interview Venue- Concerto Software & Systems Private Limited Building No. 305, 2nd Floor, A- Wing, Sector 2, Millennium Business Park, Mahape, Navi Mumbai - 400 710. Contact Person- Pranali Ghanekar Note: Candidate has to sign the service level agreement for specified tenure with the company (Mandatory) Please carry your Pan card or Adhar Card. Candidate appeared within last six months will not be eligible to reappear.","location":"Mumbai","experience":"0 - 1 Years"},{"date":"21 - Dec - 2019","skills":"Java, J2EE, Spring, Hibernate","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Cognizant Technology Solutions, Manyata Embassy Business Park, F3 Building, Ground Floor, Outer Ring Road, Near Nagawara, Rachenahalli village, Bangalore - 560 045.","phone":"Not Provided","profile":"Java Developers \nCognizant Technology Solutions India Limited","description":"Candidate must have hands-on experience Java/ J2EE Application development / support Projects. should have good technical problem solving skills. Exposure to the below skill combination is mandatory to have: Combo 1: Java, Spring, Hibernate (Recent hands on experience with Spring/ Hibernate is mandatory). Candidate with hands on experience on above skills will be eligible to apply for this position For all the above roles the candidate should possess a BE/ B. Tech/ B. Sc/ BCA/ MCA/ M. Tech/ M. Sc with consistent above 50% is Mandatory Job Responsibilities- Responsible for delivery of assigned module/ components /phases of a project Responsible for Status reporting Responsible for estimation, planning and execution with specific focus on requirement analysis and design Responsible for Knowledge transfer and arriving at SLAs for steady state Notice Period: 90 Days (Candidates between Immediate to 30 days are most preferred) Walk-in Date/ Time: 21st December 2019, 9 AM onwards Interview Venue: Cognizant Technology Solutions, Manyata Embassy Business Park, F3 Building, Ground Floor, Outer Ring Road, Near Nagawara, Rachenahalli village, Bangalore - 560 045. Contact Person - Arul","location":"Bangalore","experience":"3 - 8 Years"},{"date":"21 - Dec - 2019","skills":"ASP .Net , C# MVC WCF WPF HTML, CSS, Java Script, Ajax, SQL Server/ MySQL/ Oracle","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Vyom Labs Private Limited, 1st Floor, Murkute Complex, Opposite to Veritas Near Hotel Mahabaleshwar, Baner Road, Pune - 411 045","phone":"Not Provided","profile":".NET Developers \nVyom Labs Private Limited","description":"Eligibility Criteria : Graduates 2017 or before pass outs/ Post Graduates: 2019 or before pass outs Work Experience Required : 0-2 Years Job Location : Pune Any work or project related experience on ASP .Net , C# MVC WCF WPF HTML, CSS, Java Script, Ajax Database: SQL Server/ MySQL/ Oracle Ability to work independently without any supervision Open to learn new technology and grasp it quickly Good communication skill, verbal as well as written. Procedure for Interview : 1. MCQ test on .NET and English (30-45 minutes) 2. Introduction to Profile, Projects and Technology 3. Technical and HR discussion 4. Assignment : to be submitted within 2 days Walk-in/ Full day Workshop date : 21st December 2019 Walk-in time : 9:30 to 10:30 AM Address : Vyom Labs Private Limited 1st Floor, Murkute Complex, Opposite to Veritas Near Hotel Mahabaleshwar, Baner Road, Pune - 411 045 Selected candidates should be willing to work in shifts and ready to travel anywhere according to projects","location":"Pune","experience":"0 - 2 Years"},{"date":"20, 21 - Dec - 2019","skills":"HR/ Administration","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Pioneer Design & Engineering Pvt. Limited, VBR enclave, Beside TipsyTopsy Bakery, Westernhills, kukatpally Hyderabad - 500 072.","phone":"9032511007","profile":"Trainee HR Executive \nPioneer Design & Engineering Pvt. Limited","description":"Looking for FEMALE Trainee HR Executive for our Hyderabad Location. Education: Any Degree Good Communication with Interpersonal Skill Selected candidates will be undergoing training for a period of 3/6 months. Please walkin immdeliately : Walk-in Date/ Time: 19th - 21st December , 10 AM onwards Interview Venue: Pioneer Design & Engineering Pvt. Limited VBR enclave, Beside TipsyTopsy Bakery, Westernhills, Kukatpally Hyderabad- 500 072. Contact Person- Pavani (9032511007)","location":"Hyderabad","experience":"0 - 2 Years"},{"date":"20, 23, 24, 25, 26, 27 - Dec - 2019","skills":"Back Office Processing, Non Voice","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Mphasis Limited, Eon Cluster C: Wing 2, Ground Floor, Kharadi Infrastructure Pvt. Limited: SEZ, Plot No. 1, Survey 77, MIDC, Kharadi, Pune - 411 014.","phone":"Not Provided","profile":"Back Office Associate \nMphasis Limited","description":"Mphasis Limited is hiring Freshers for Back Office Process Associate at Pune location Candidate should be a B.Com/ M.Com/ MBA Finance/ PGDBM Require people with banking and finance knowledge Should be ok with 24*7 shift / US Shift Rotational week off Interested candidate can walk in for the interview from 20th to 27th December 2019 on the below mentioned address- Mphasis Limited Eon Cluster C: Wing 2, Ground Floor, Kharadi Infrastructure Pvt. Limited: SEZ, Plot No. 1, Survey 77, MIDC, Kharadi, Pune - 411 014. Contact Person : Matin Shaikh Timings : 11.00am to 4.00pm","location":"Pune","experience":"0 - 1 Years"},{"date":"20, 21, 23, 24, 25, 26, 27 - Dec - 2019","skills":"Back End Operations, Non Voice Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"3i Infotech Limited, Akruti Trade Centr 3rd Floor Bhim Nagar Gautam Nagar Andheri MIDC, Mumbai.","phone":"Not Provided","profile":"Back Office Executive \n3i Infotech Limited","description":"Walk in interview for Back Office Executive in Andheri office for Fixed Night shift & Part time Any Graduate with good communication skills can apply Should have Minimum Typing Speed of 25 WPM Will be work in Night Shifts Interested candidate can walk in on below venue for the interview Date: 19th - 27th December 2019 Interview Timings 11 am to 1.PM Interview Venue: 3i Infotech Limited Akruti Trade Centr 3rd Floor Bhim Nagar Gautam Nagar Andheri MIDC, Mumbai. Contact Person- Ankit Mota/ Manoj Mandavagane","location":"Mumbai","experience":"1 - 4 Years"},{"date":"21 - Dec - 2019","skills":"PHP Frameworks, Javascript, Wordpress & Drupal","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Netedge Computing Solutions Pvt. Limited, C-56/39 NetEdge Tower, Sector-62, Noida - 201 301.","phone":"882622715","profile":"Senior Wordpress/ Php Developer \nNetedge Computing Solutions Pvt. Limited","description":"The person must have : Experience in Development using PHP Frameworks, Javascript, Wordpress & Drupal He/She must be able to Independently Develop Websites & Web Applications He/She must have orientation towards quality & customer satisfaction The Person Will be Responsible for: 1. Development of Websites in Wordpress 2. Development of Wordpress Plugins 3. Coding of Applications & Modules in PHP 4. Good communication skills 5. Strong analytical skills Walk-in Date/ Time: 21st December 2019, 9 AM onwards Interview Venue: Netedge Computing Solutions Pvt. Limited C-56/39 NetEdge Tower, Sector-62, Noida - 201 301. Contact Person- Shweta Singh Phone No. 882622715","location":"Noida","experience":"3 - 4 Years"},{"date":"21 - Dec - 2019","skills":"PHP, Microservices Architecture, PostgreSQL, MySQL or MS SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"DBXento Systems Private Limited, Fourth Floor, Tower 9, SEZ, Magarpatta City, Pune - 411 013.","phone":"Not Provided","profile":"PHP Developers \nDBXento Systems Private Limited","description":"Qualifications: Bachelors degree in Computer Science or a related field. 1 - 6 years of experience with web application development Good to Have: Experience in front end development Knowledge of Microservices Architecture. Understanding of 12 factor Apps. Understanding of Service Oriented Architectures and RESTful Web Service best practices. Well versed with cloud computing concepts. Experience of unit testing Walk-in Date: 21st December 2019 Timings: 9 AM to 2 PM Interview Venue: DBXento Systems Private Limited Fourth Floor, Tower 9, SEZ, Magarpatta City, Pune - 411 013.","location":"Pune","experience":"1 - 6 Years"},{"date":"21, 23 - Dec - 2019","skills":"PHP, Web frameworks, Codeigniter, CMS technologies like Word press, Drupal","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Sandip University (For Carrot Technologies), 1st floor, Manisha Pride, Jawaharlal Nehru Road, Mulund (West), Mumbai - 400 080.","phone":"022-66048501","profile":"PHP Codeigniter Developer \nCarrot Technologies Private Limited","description":"Candidate should have minimum 2 years of working experience with PHP web frameworks Strong knowledge of Codeigniter Web Framework Must be proficient in core PHP framework Open source CMS technologies like Word press, Drupal would be added advantage Walk-in Date/Time: 19th - 23 December 2019, 11 AM onwards Interview Venue: Sandip University (For Carrot Technologies) 1st floor, Manisha Pride, Jawaharlal Nehru Road, Mulund (West), Mumbai - 400 080. Contact Person- Archana Pagare","location":"Mumbai","experience":"2 - 8 Years"},{"date":"21, 23, 24 - Dec - 2019","skills":"Core PHP, MVC, CMS, MySQL, Java Script, JQuery, HTML, CSS","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Cue Blocks Technologies Pvt. Limited, SCO 822, Second Floor, NAC, Manimajra, Chandigarh","phone":"09876008994","profile":"Core PHP Developer \nCue Blocks Technologies Pvt. Limited","description":"We are in search of highly motivated and passionate individuals with strong PHP coding experience who has good knowledge of Core PHP, MVC, CMS, MySQL, Java Script, JQuery, HTML, CSS. Must have very good knowledge of database technologies and SQL optimization. Walk-in Date/ Time: 21st - 24th December , 11 AM onwards Interview Venue: Cue Blocks Technologies Pvt. Limited SCO 822, Second Floor, NAC, Manimajra, Chandigarh Landmark: Above Liberty Showroom Contact - Pooja Rathore Tel: 09876008994","location":"Chandigarh","experience":"1 - 3 Years"},{"date":"20, 23, 24, 25, 26, 27, 30, 31 - Dec - 2019","skills":"Data Validation, Back Office Processing, Non Voice Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Atidiv India Private Limited, Unit 9 & 10, First Floor, Wing B, Business at Mantri, Nagar Road, Pune - 410 014.","phone":"2067486141","profile":"Back Office Process (Male) \nAtidiv India Private Limited","description":"Qualification: Graduates in Any Stream Work Experience: 0-3 Years Freshers can also apply. Must have Basic Communication skills (Spoken and Written English) Should be good in Basic research, Data Validation, Internet savvy and Content Analysis. Work experience into Back-office will be an advantage. Willing to work for US/ UK shifts. Salary : No bar for right candidate. Attractive monthly incentive structure and Annual Bonus. Walk-in Date: 19th December - 3rd January Time: 11 am onwards (Mon - Friday) Interview Venue: Atidiv India Private Limited Unit 9 & 10, First Floor, Wing B, Business at Mantri, Nagar Road, Pune - 410 014, Maharashtra. Contact Details: 2067486141","location":"Pune","experience":"0 - 3 Years"},{"date":"21, 23, 24 - Dec - 2019","skills":"PHP, MySQL Database, MongoDB","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Aimil Limited, Naimex House, A-8, Mohan Cooperative Industrial Estate, Mathura Road, New Delhi - 110 044","phone":"011-61310202","profile":"MySQL (Php) Developer \nAimil Limited","description":"Candidate must have strong proficiency in MySQL database management Exposure in latest versions of MySQL Experience with replication configuration in MySQL Knowledge of de-facto standards and best practices in MySQL. Knowledge of MySQL features, such as its event schedule. Familiarity with other databases such as MongoDB, Proficient understanding of code versioning tools. Responsibility Import and Export data in database and query the db related things Walk-in Date/ Time: 19th December - 24 December , 9 AM onwards Interview Venue: Aimil Limited Naimex House, A-8, Mohan Cooperative Industrial Estate, Mathura Road, New Delhi - 110 044 Contact - HR (011-61310202)","location":"Delhi","experience":"1 - 3 Years"},{"date":"21 - Dec - 2019","skills":"Service desk (Voice Process), Technical support, Active directory, Voice Customer Service","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"HCL Technologies Limited, Plot No. 3, Surya Sapphire Hosur Road Near D-Mart, 1st Phase, Electronic City, Bangalore - 560 100","phone":"Not Provided","profile":"Technical Support/ Service Desk (L1) \nHCL Technologies Limited","description":"Candidate should be Any Graduate with 6 months to 3 years of experience in Service desk (Voice Process), Technical support, Active directory, Voice customer service. Must have good problem solving involving troubleshooting hardware, involving hardware, software, and networks issues. Technical Requirements: Phone support experience necessary(Voice Process) Technical Service desk or technical call center experience is necessary. Disciplined, systematic problem solving skills required. Hands-on work experience with the following: Windows Operating systems Walk -in Date: 21st December 2019 Time : 10:00 AM to 1.00 PM Interview Venue: HCL Technologies Limited Plot No. 3, Surya Sapphire Hosur Road Near D-Mart, 1st Phase, Electronic City, Bangalore - 560 100 Spoc : Shobhana","location":"Bangalore","experience":"1 - 3 Years"},{"date":"21 - Dec - 2019","skills":"Java, Hive, NoSQL, Cloudera, Couchdb, Hadoop, Big Data, MongoDB","qualification":"B.E./B.Tech","address":"Merilytics Intelytics Private Limited, 7 Floor, Gutenberg, Road Number 2, Sai Pruthvi Enclave, Kondapur, Hyderabad, Telangana - 500 084.","phone":"8106192426","profile":"Big Data/ Java Developer \nMerilytics Intelytics Private Limited","description":"Candidate should have 1 to 3 years of working experience in any one of the Big Data technologies and Hadoop distributions -Apache Project, Cloudera, MapR or HortonWorks. Development experience in Java, MapReduce2, Pig, Hive is a must . Should have development experience in any of the NoSQL databases - Hbase, Casssandra, CouchDB, MongoDB. Development experience in design, implementation and deployment of any ETL tool to load data into Hadoop/ NoSQL environment. Should have exposure to UNIX / Linux programming language. Should have good communication & interpersonal skills Note: The candidates who meet the eligibility criteria i.e. 60% through out the academics with B. Tech graduation can directly walk-in to our office for the interview process on December 21, 2019 along with your updated resume and ID proof. Walk-In Timings: 2 PM to 3 PM Interview Venue: Merilytics Intelytics Private Limited 7 Floor, Gutenberg, Road Number 2, Sai Pruthvi Enclave, Kondapur, Hyderabad, Telangana - 500 084. Contact Person- Sushmitha Pamreddy Phone: 8106192426 Interested candidates can send their updated resume to careers@merilytics.com","location":"Hyderabad","experience":"1 - 3 Years"},{"date":"18, 19, 20, 23, 24, 26, 27 - Dec - 2019","skills":"Front Office Administration, HR Support, Office Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Urja Money Private Limited, 147/148 CreditMate, Udyog Bhavan, Sonawala Lane, Goregaon (East), Mumbai","phone":"8369891181","profile":"Office Manager (Female Only) \nUrja Money Private Limited","description":"Work Experience Required: 6 months Age Criteria: less than 30 years Working Days: Mon to Friday Working Time: 10 to 7 Job Responsbility- Attending all the incoming calls at reception Maintain register of both inward and outward courier to logistic person. Connect guests with the right person and coordinate with them. Provide support to each department as per their requirement. Ensure reception area is tidy and presentable, with all necessary stationery and material Provide office support services to ensure efficiency. Coordinate the repair and maintenance of office supplies Assist HR in recruitment and other day to day admin related things Immediate Joiner is preferred Walk-in Date/ Time: 17th - 27 December 2019, 11 AM onwards (No interviews on Sat-Sun and Christmas day) Interview Venue: Urja Money Private Limited 147/148 CreditMate, Udyog Bhavan, Sonawala Lane, Goregaon (East), Mumbai Contact Person- Sana Sheikh Contact No: 8369891181","location":"Mumbai","experience":"1 - 7 Years"},{"date":"18, 19, 20 - Dec - 2019","skills":"HR/ Recruitment, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Sutherland Global Services Pvt. Limited, Gateway Office Parks, A1 Block, Ground Floor, Perungalathur, Chennai - 63.","phone":"7397647886","profile":"Talent Acquisition Specialist \nSutherland Global Services Pvt. Limited","description":"Educational Qualification: Preferably MBA in HR Work Experience: 0 to 3 Years Required Skills: Excellent oral and verbal communication skills Excellent analytical and problem solving skills Must be good in related domain Notice Period: Immediate Joiners. Working Days: 6 Days Shift : Day Shift Work Timings : 9 to 8 (Any 9 hours) Responsibilities include: Interacting with potential candidates on social media and professional networks (e.g. Naukri, Monster, LinkedIn, FB) Crafting and sending recruiting emails. Coordinating with hiring managers to determine position requirements. Identify qualified candidate profiles using various sourcing techniques (e.g. Boolean search) Develop talent pipelines for future hiring needs Ask for referrals from current employees and external networks Promote our employer brand online and offline Maintain candidate databases (e.g. via our Applicant Tracking System) Communicate with past applicants regarding new job opportunities Walk-in Date/ Time: 18th - 20th December , 11 AM onwards Interview Venue: Sutherland Global Services Pvt. Limited Gateway Office Parks, A1 Block, Ground Floor, Perungalathur, Chennai - 63. Contact HR - Rumal Sakthi M ( 7397647886 ) Documents to be carried: 3 copies of resume 1 passport size photo Govt. ID proof","location":"Chennai","experience":"0 - 3 Years"},{"date":"19 - Dec - 2019","skills":"General Administration, Front Office/ Receptionist Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Amadeus India Private Limited, Plot No.7, Local Shopping Centre, Pocket No. 6&7, Sector-C, Vasant Kunj New Delhi - 110 070","phone":"011-41336615","profile":"Front Office Executive (Female) \nResBird Technologies Private Limited","description":"Candidate should be Graduate in any stream with excellent communication and inter personal skills. Must have the ability to handle various stations and maintain a smooth coordination. Sound computer knowledge is required Experience on travel booking and visa documentation mandatory Handling the reception area, Handling visitors and call inflow. Coordinating with other departments as and when required. Basic Administration work. Handling the travel arrangements. Handling Transport / Catering Any other tasks and duties as may be required by time to time Walk-in Date/ Time: 19th December 2019, 10 AM onwards Interview Venue: Amadeus India Private Limited Plot No.7, Local Shopping Centre, Pocket No. 6&7, Sector-C, Vasant Kunj New Delhi - 110 070 Landmark: Opposite to DPS School, Beside Bird Automotive Contact Person - Deepa (011-41336615)","location":"Delhi","experience":"2 - 3 Years"},{"date":"18, 19, 20, 23, 24, 25 - Dec - 2019","skills":"Back End Operations, Non Voice Process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Hinduja Global Solutions Limited, No. 115, Sri Chamundi Towers, C-2 Building, Hosur Main Road, Garvebhavi Palya, Opp: Sai Baba temple, Bangalore - 560068","phone":"7829533724","profile":"Back Office Operations/ Trainee \nHinduja Global Solutions Limited","description":"Any Graduate-Fresher or Experienced (NO - BE, B.Tech, Post Graduates) Willing to work in rotational shifts 2 Way cab facility provided 5 Days working, 2 Days Off Desired Skills/ Abilities: Msut have good communication skills Good Analytical Skills Basic computer knowledge Walk-in Date: 18th - 25 December 2019 Time Slot: (10 am - 2 pm/ Mon-Fri) Interview Venue: Hinduja Global Solutions Limited No. 115, Sri Chamundi Towers, C-2 Building, Hosur Main Road, Garvebhavi Palya, Opp: Sai Baba temple, Bangalore - 560068 Contact HR Person: Pooja Phone: 7829533724","location":"Bangalore","experience":"0 - 1 Years"},{"date":"18, 19, 20 - Dec - 2019","skills":"HR Operations/ Recruitment, Employee Engagement, HR Administration","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Capita India Private Limited, Godrej IT Park, Gate No 2, Plant No. 6, LBS Marg, Opposite Vikhroli Bus Depot, Vikhroli (West), Mumbai - 400 079","phone":"Not Provided","profile":"HR Operations Executive \nCapita India Private Limited","description":"Capita India Private Limited, is hiring for UK HR Operations Executive Candidate must be Any Graduation with excellent communication skills Work Experience: 0 to 4 Years Freshers can apply. Shifts: 6.30 am to 3.30 pm 3.30 pm to 12.30 pm Walk-in Date/ Time: 18th - 20th December , 12 PM onwards Interview Venue: Capita India Private Limited Godrej IT Park, Gate No 2, Plant No. 6, LBS Marg, Opposite Vikhroli Bus Depot, Vikhroli (West), Mumbai - 400 079 Meet Sakshi Shukla/ Sabah Khan Contact - Sakshi","location":"Mumbai","experience":"0 - 4 Years"},{"date":"19, 20 - Dec - 2019","skills":"Back End Operations, Non Voice Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"EXL Services India Private Limited, EXL Service Tower 1, Cybercity Magarpatta City, Pune","phone":"Not Provided","profile":"Back Office Executive \nEXL Services India Private Limited","description":"Candidates should be Any Graduate with minimum 2 years of general insurance/ underwriting experience is mandatory. Must not have any gap in their profile in the last 2 years Should have excellent communication skills Should be OK with night / rotational shifts Walk-in Date: 19th - 20th December 2019 Time: 11:30 AM to 2:30 PM Interview Venue: EXL Services India Private Limited EXL Service Tower 1, Cybercity Magarpatta City, Pune. Note: Please carry your updated resume and Aadhar Card (original + 2 photocopy) along with 02 passport size photographs is mandatory to enter inside the premises.","location":"Pune","experience":"2 - 6 Years"},{"date":"17, 18, 19, 20 - Dec - 2019","skills":"Java, Core Java, Multi-Threading, Spring Framework, JSP, HTML, JQuery & Any Database","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"For More Information Call to 8095348111 OR E-Mail your Updated CV to babu.balaraman@adecco.com","phone":"8095348111","profile":"Core Java/ Fullstack Developer \nAdecco India Private Limited","description":"Educational Qualification: BE/ B.Tech/ M.Tech/ MCA Mandatory Skills: Java, JSP, HTML, JQuery & Any Database Work Experience: 2.5 to 7 Years 1) Core Java Developer Required Skills: Mandate Skills are Core Java, Multi-Threading & Spring Framework. Restful Web services is an added advantage. 2) Full Stack Developer Required Skills: Mandate skills are HTML, JSP and Java with any framework (Spring, Hibernate & Struts) CSS & Boot Strap is an added advantage. Candidate who are able to join within 30 Days need to apply F2F Interviews starts from Tuesday, Wednesday, Thursday & Friday For More Information Call to 8095348111 or E-Mail your updated CV to babu.balaraman@adecco.com with below mentioned details:- Total Experience: Relevant Experience: Current CTC: Expected CTC: Notice Period","location":"Bangalore","experience":"2 - 7 Years"},{"date":"16, 17, 18, 19, 20 - Dec - 2019","skills":"QA/ Software Testing, Shell, Python, VB Scripting, etc.","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Svaya Robotics, 2nd Floor, NSL Icon, Road No: 12, Banjara Hills, Hyderabad - 500 034.","phone":"7702700960","profile":"QA/ Testing Engineer \nZuti Engineering Solutions Pvt. Limited","description":"Applicant need to have solid experience in QA/ Software testing. Must have good experience in Scripting language like Shell, Python, VB Scripting, etc. In depth knowledge and experience in SDLC and Quality Assurance. Walk-in Date/ Time: 16th - 20th December 2019, 10 AM onwards Interview Venue: Svaya Robotics, 2nd Floor, NSL Icon, Road No: 12, Banjara Hills, Hyderabad - 500 034. Landmark: Opposite to ICICI Bank Contact Person : Bhargav Contact No: 7702700960","location":"Hyderabad","experience":"4 - 8 Years"},{"date":"18 - Dec - 2019","skills":"Software Testing, Functional Testing, Regression Testing, Automation Testing","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Indium Software (India) Limited, #64, Ganesh Chambers, Edams Road, Teynampet, Chennai.","phone":"044-66069102","profile":"Software Testing Engineer \nIndium Software (India) Limited","description":"Eligibility Criteria: BE/ B.Sc/ MCA (Only 2018 & 2019 Pass outs) Good knowledge in any Programming Language Mandatory 60% and above(overall Percentage) and No standing arrears Excellent Communication Skills Walkin Date 18th December 2019 (Wednesday) Time: 11 AM to 1 PM Interview Venue: Indium Software (India) Limited, #64, Ganesh Chambers, Edams Road, Teynampet, Chennai.","location":"Chennai","experience":"0 - 1 Years"},{"date":"19, 20 - Dec - 2019","skills":"Manual Testing, Test Scripts, Test Cases, Shell Scripting. Selenium, Protractor, JMeter","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Everi India Private Limited, Elnet Software City, 2nd floor, Rajiv Gandhi Salai, Taramani, Chennai - 600 113.","phone":"Not Provided","profile":"Software Testing Engineer \nEveri India Private Limited","description":"We are Looking for Test Engineers/ Senior Test Engineers with 1 to 6 years of experience for our Product development team. The associates are expected to have experience and knowledge on below mentioned skill sets. Manual Testing of Web / Enterprise Applications. Must posses strong hands on experience in manual testing and process. Should have strong Analytical and Logical abilities. Candidates with prior experience in BFSI / Payments domain preferred. Good to have Skills: Test Scripts, Test Cases, Shell Scripting. Selenium, Protractor, JMeter. Java, C#, JavaScript, Python, Shell Script. Test Scripts, Test Cases Visual Studio, TFS, Dev Express, Jenkins, SVN, Git SOAP UI/Fiddler SQL Server (SQL , PL/SQL) Walk-in Date/ Time: 19th - 20th December , 11 AM onwards Interview Venue: Everi India Private Limited Elnet Software City, 2nd floor, Rajiv Gandhi Salai, Taramani, Chennai - 600 113. Contact Person - Ilakya Rajan","location":"Chennai","experience":"1 - 6 Years"},{"date":"17, 18, 19, 20 - Dec - 2019","skills":"Automated testing, Selenium, Web Driver, Create Test Scenarios, Test Script, and Test Cases","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Techbooks International Pvt. Limited, Aptara, A-37, Sector - 60, NOIDA, Uttar Pradesh - 201 301.","phone":"0120-41682424","profile":"Software Testing Engineer \nTechbooks International Pvt. Limited","description":"Person should have 2 to 5 years testing experience for web based software products. Should have 1+ years of software testing experience in automated testing on Selenium Web Driver. Create test scenarios, test script, and test cases prior to feature delivery in order to support continuous delivery. Work on traceability matrix to trace requirements to estimate test case development and execution effort. Must have hands on experience in Web services. Preparation of test coverage, and regression analysis reports to support high quality delivery. Desired Skills- Strong knowledge of software QA methodologies and processes Excellent communication skills, good sense of teamwork Knowledge of MS Office (Word, Excel, PPT, Visio) Disciplined and self-motivated in delivering high-quality software. Walk-in Date/ Time: 16th - 20th December , 11 AM onwards Interview Venue: Techbooks International Pvt. Limited Aptara, A-37, Sector - 60, NOIDA, Uttar Pradesh - 201 301 Contact Person- Aishwarya Tel: 120-41682424","location":"Noida","experience":"2 - 5 Years"},{"date":"21 - Dec - 2019","skills":"Software Testing, SDLC, Write test Scripts & Execute, Testing Life cycle","qualification":"B.E./B.Tech, MCA/PGDCA","address":"ABM Knowledgeware Limited, ABM House, Plot No. 268, 7th Floor, Linking Road, Bandra (West), Mumbai","phone":"022-42909700","profile":"Manual Tester \nABM Knowledgeware Limited","description":"Candidate must have good hands on experience on Software Testing, SDLC, STLC. Should be able to write test scripts & execute and well versed with Testing Life cycle. Should be mature individual capable of handling multiple modules. Experience on Database testing & Backend testing will be preferred. Should have good communication skills. Mode of Interview : 1. Aptitude Test 2. Technical F2F 3. HR Discussion Walk-in Date: Saturday - 21st December, 2019 Time - 9.30 AM - 4.00 PM Interview Venue: ABM Knowledgeware Limited ABM House, Plot No. 268, 7th Floor, Linking Road, Bandra (West), Mumbai Landmark - Shopper Stop/ Hotel Persian Darabar Contact - Hetali Shah (42909700)","location":"Mumbai","experience":"3 - 6 Years"}]}