{"Walkins":[{"date":"2 - Aug - 2019","skills":"Automation framework, QA Testing, Selenium, Webdriver","qualification":"B.E./B.Tech","address":"SHL (India) Private Limited, 9th Floor, Building No. 10B, DLF Cyber City, Gurgaon - 122002","phone":"Not Provided","profile":"Automation Test Engineer \nSHL (India) Private Limited","description":"Education/ Experience- BE/ B. Tech in Computer Science, Information Technology or relevant professional experience 3-5 years of experience in an IT or Business environment testing highly scalable applications Excellent communications skills interacting with technical and business audiences Any testing certification is a plus. Technical Skills- Strong Java skills Strong experience with automation using Selenium Strong understanding of basic concepts to testing principles, all types of Black/Grey Box testing Knowledge of Test management tools JIRA, QC etc. Should be hands on with sql-database Experience in Performance testing and tools like JMETER is a plus. Experience in Agile development environment is a plus. Web Services Testing/ Backend Testing: SOAP UI, POSTMAN is a plus Walk-in Date/ Time: 2nd August from 10 AM onwards Interview Venue: SHL (India) Private Limited 9th Floor, Building No. 10B, DLF Cyber City, Gurgaon - 122002","location":"Gurgaon","experience":"3 - 5 Years"},{"date":"29, 30, 31 - Jul - 2019","skills":".Net, ASP .Net, C# .Net","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"ApMoSys Technologies Pvt. Limited, A-105, Greenscape Technocity Shil Phata Mahape Road Next to Country Inn & Suites Mahape, Navi Mumbai - 400 701","phone":"022-41222250","profile":"Java Developer - Fresher \nApMoSys Technologies Pvt. Limited","description":"Person must have good command over programming languages like C, C++, Core Java etc. Should have excellent skills in Java - Collections, Object Oriented Programming, JQuery. Certificate in Java is mandatory CDAC certified candidates will get an added advantage. Walk-in Date: 29th July - 16th August Timings: 11 AM To 4 PM Interview Venue: ApMoSys Technologies Pvt. Limited A-105, Greenscape Technocity Shil Phata Mahape Road Next to Country Inn & Suites Mahape, Navi Mumbai - 400 701","location":"Mumbai","experience":"0 - 2 Years"},{"date":"29, 30, 31 - Jul - 2019","skills":"C# .Net and Java/ Android Programming","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Elico Limited, B-90, C-56, A.P.I.E, Gate No. 6, Sanathnagar, Hyderabad - 18","phone":"040-44451244","profile":".Net Developers \nElico Healthcare Services Limited","description":"Qualification: B.Tech (ECE or C.Sc)/ MCA or Equivalent. Experience: 2.5 to 5 Years. Candidate should have at least 4 years of work experience in real time projects. At least 6 months of experience in the real time project with an external client. Should have knowledge about Project Management and Version control Software. Must have good communication skills. Required Skills: C# .Net and Java/ Android Programming. Must have a strong experience in at least one set of the above mentioned fields. Experience in Communication programming (Serial, Network Programming) Development of image processing Algorithms. Knowledge in Web Application Development. Knowledge in Cloud Computing is an advantage. Knowledge in AI and ML is an advantage. Interested candidates, please walk-in directly with your resume from 29th July - 3rd August at below mentioned address (Excluding Sunday) or send your updated resume to prasannam@elicohcs.com Elico Limited B-90, C-56, A.P.I.E, Gate No. 6, Sanathnagar, Hyderabad - 18 Land Mark: Near Bharathanagar MMTS & Metro Rlwy Stations Contact Person: Prasanna. Contact No: 040-44451244/ 8978447766","location":"Hyderabad","experience":"2 - 5 Years"},{"date":"28 - Jul - 2019","skills":"C# .NET, ASP .NET, MVC, WinForms, .Net Core, Entity Framework, SQL","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Decision Machines Private Limited, 508, Speciality Business Center, Balewadi, Pune","phone":"Not Provided","profile":"Software Engineer (.Net) \nDecision Machines Private Limited","description":"Qualification: BE/ B.Tech/ BCA/ MCA Work Experience: 1 to 2 Years Mandatory Skills: C# .NET, ASP .NET, MVC, WinForms Optional : .Net Core, Entity Framework, SQL Walk-in Date/ Time: 28th July 2019, 10 AM onwards Interview Venue: Decision Machines Private Limited 508, Speciality Business Center, Balewadi, Pune","location":"Pune","experience":"1 - 2 Years"},{"date":"26, 29, 30, 31 - Jul - 2019","skills":"ASP .NET, ASP .NET Web API, ASP .NET Web Forms, Angular, MS SQL","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Agdova Technologies Private Limited, E -59 & 60, Sector- 3, Office No- G 01, Ground Floor, Noida - 201 301","phone":"Not Provided","profile":".Net/ Full Stack Developer \nAgdova Technologies Private Limited","description":"We are looking for Angular/ .Net Full Stack Developer who can contribute to a fast-paced, high-energy team, supporting the systems and applications in development. As a software developer, your primary responsibilities will include execution of application development and technical support by following the software development lifecycle processes. This will include interacting with business liaisons, business users and different technology groups on an ongoing basis, developing technical design documents, coding, and unit testing. Skills Required: Experience Range should be 1 to 4 Years Must have sound knowledge in Angular 4/5/6 Dot NET framework versions: .NET 4.0 and above. Languages: C#, JavaScript, TSQL, HTML Web frameworks: ASP .NET, ASP .NET Web API, ASP.NET Web Forms, Angular. Database: MS SQL Interview Date: 26th to 31st July 2019 (Sat/ Sun Off) Time: 12:00 PM to 5:00 PM Interview Venue: Agdova Technologies Private Limited E -59 & 60, Sector- 3, Office No- G 01, Ground Floor, Noida - 201 301 Land mark: Behind Punjab National Bank Housing Finance Sector -3 Nearest Metro Station: Noida (Sector-16)","location":"Noida","experience":"1 - 4 Years"},{"date":"29, 30, 31 - Jul - 2019","skills":"Technical Support, Technical Sales, Blended Process","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Stellar Information Technology Pvt. Limited, D 16, Infocity II, Sector 33, Gurugram, Haryana - 122 001","phone":"Not Provided","profile":"Technical Support Associate \nStellar Information Technology Pvt. Limited","description":"Desired Qualification, Skills & Experience: Graduate, BCA or BSC (IT) Preferred Excellent command over English language (Oral & Written) Good writing skills. Good time management skills. Willingness to work in 24/5 Shift environment 1-3 years experience out of which minimum six months experience in International technical support process is needed Soft Skills & Communication Skills A candidate must have - Good communication skills with a clear diction Ability to construct simple and sensible sentences Ability to understand spoken American English Good problem solving skills Ability to approach problems logically Strong customer service focus Ability to work under pressure Job Responsibilities- Handle Inbound calls & Outbound calls Web Support > Chat and Emails Response in defined TAT Maintain Quality benchmark Generate product sales Generate business through upsell 5 days working / Saturday Sunday fixed off/ Blended process Candidates residing in Gurgaon or willing to relocate could apply for this opening 24*5 rotational shifts month wise (in bound calls environment) 3 shift timings : (5 AM-2 PM), (12 PM-9), PM), (8 PM-5AM) For Girls : Fixed Morning Shift 8:00 am- 05:00 PM Walk-in Date: 29th July - 1st August 2019 Time: 9:00 AM - 3:00 PM Venue Details: Stellar Information Technology Pvt. Ltd. D 16, Infocity II, Sector 33, Gurugram, Haryana - 122001 Contact Person : Dinesh (HR)","location":"Gurgaon","experience":"1 - 3 Years"},{"date":"31 - Jul - 2019","skills":"BigData, Hadoop, Java","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Banquet Hall, 23 Chefs Hotel, Manjeera Majestic Commercial, JNTU Road, KPHB Colony, Hyderabad","phone":"Not Provided","profile":"Software Testing Trainee \nQualiTlabs","description":"Required Qualification: B.Tech/ BE (CSE/ IT/ ECE) or MCA only Minimum 65% in academics (2018 & 2019 passed outs only) No pending backlogs Candidate should have very good programming skills (in Java, C# .NET or C) Knowledge in Selenium or Testing is not a requirement (just an added advantage) Must be interested to work on Software testing/ Test Automation Should have good communication skills Must be able to join immediately. JOB LOCATION: QualiTlabs, PSR Prime Tower, Gachibowli, Hyderabad. (Next to DLF IT Park Gate#1) Hiring Process: Written-test (Aptitude & Reasoning), Programming Test (must be able to write any program with your own logic), Face to Face interview Walk-in Date: Wednesday, July 31, 2019 Timing: From 9 am to 3 pm WALK-IN Location : Banquet Hall, 23 Chefs Hotel, Manjeera Majestic Commercial, JNTU Road, KPHB Colony, Hyderabad (Phone: 9701936364 this number works only on July 31, 2019) Note: Candidates who have undergone the hiring process with QualiTlabs in last 6 months are NOT eligible","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"29, 30 - Jul - 2019","skills":"Core JAVA, JavaScript, Spring Framework, HTML, MySQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Spoors Technology Solutions India Pvt. Limited, 4th Floor, Sai Prithvi - Cyber Arcades, Above Bata Showroom, Indian Oil Petrol Bunk, Madhapur, Hyderabad.","phone":"Not Provided","profile":"Java/ J2EE Developer \nSpoors Technology Solutions India Pvt. Limited","description":"Looking for recent pass-outs 2018,2019 for freshers, Exp candidate should have 2 to 4 years experience as a Java/ J2EE Developer Experience with Struts, Spring, Hibernate and Tomcat CSS, HTML, JavaScript, XML, JSON, AJAX and JSP Knowledge of Javascript and HTML is desirable. Must have database design and modelling skills (preferably in MySQL) Looking for Immediate joins only Walk-in Date/ Time: 29th - 30th July , 10 AM onwards Interview Venue: Spoors Technology Solutions India Pvt. Limited, 4th Floor, Sai Prithvi - Cyber Arcades, Above Bata Showroom, Indian Oil Petrol Bunk, Madhapur, Hyderabad.","location":"Hyderabad","experience":"0 - 4 Years"},{"date":"3 - Aug - 2019","skills":"Core Java Concepts, OOPS, J2EE, Multi threading & OOPS","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Please share your updated resume to register yourself for the recruitment Drive","phone":"Not Provided","profile":"Java Developers \neInfochips Limited","description":"Must have skills: Experience in Java 6 or above Good exposure in OOPS & J2EE Good Core Java Concepts, Multi threading, & OOPS Good understanding in design patterns Rich experience with web frameworks Spring3/4 or Springboot Good to have skills: Experience working with Microservices, AWS, Spring. Experience with NoSQL's Amazon DynamoDB Walk-in Drive on 3rd August , 10 AM onwards Please share your updated resume to avishek.mukherjee@einfochips.com to register yourself for the recruitment Drive on 3rd August 2019.","location":"Ahmedabad","experience":"2 - 5 Years"},{"date":"29, 30, 31 - Jul - 2019","skills":".Net, HTML, CSS, Bootstrap, Jquery, etc.","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"DEV Information Technology Private Limited, 14, Aaryans Corporate Park, Nr. Shilaj Railway Crossing, Thaltej - Shilaj Road, Thaltej, Ahmedabad - 380 059","phone":"Not Provided","profile":".Net Developer \nDEV Information Technology Pvt. Limited","description":"Person must be having good knowledge of basics of programming Should have basic HTML, CSS, Bootstrap, Jquery, etc. Basic knowledge of database and Query Writing Should have good analytical & logical skills Having good grasping power Positive Attitude. Work commitment. Walk-in Date/ Time: 29th July - 31st August , 9 AM onwards Interview Venue: DEV Information Technology Private Limited 14, Aaryans Corporate Park, Nr. Shilaj Railway Crossing, Thaltej - Shilaj Road, Thaltej, Ahmedabad - 380 059","location":"Ahmedabad","experience":"0 - 1 Years"},{"date":"29, 30 - Jul - 2019","skills":"System Administration, Technical Support, Network Support, Asset Management, Desktop Support","qualification":"B.E./B.Tech","address":"Inspirisys Solutions Limited, (Formerly Accel Frontline Limited) Dowlath Towers, Second floor, Taylors Road, Chetpet, Chennai, Tamil Nadu - 600 010","phone":"044-42255443","profile":"Trainee Support/ System Enigneer \nInspirisys Solutions Limited","description":"Walk-in Interview for the position of Technical Support Engineers (Male) Qualification: BE/ B.Tech (2017, 18 & 19 batch) Experience: Fresher/ 0 to 1 Years Job Location: Chennai Roles & Responsibilities: E-mail Configuration Installation & Troubleshooting: Antivirus, MS office, Mailing clients and other software Hardware, Desktop & Laptops Network Printer & Scanner Operating System - Windows Patch management for desktops, laptops Troubleshooting all network and application issues Immediate joiners preferred Candidates should be Interested to sign 3 year bond (Mandatory) Walk-in Date: 29th to 30th July 2019 Time: 10.00 AM to 4.00 PM Interview Venue: Inspirisys Solutions Limited (Formerly Accel Frontline Limited) Dowlath Towers, 2nd floor, Taylors Road, Chetpet, Chennai, Tamil Nadu - 600 010","location":"Chennai","experience":"0 - 1 Years"},{"date":"3 - Aug - 2019","skills":"Team Management Monthly Reports MS Outlook MIS Operations End User Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Cloudstrats Technologies Pvt. Limited, AA-57, Kailash Vaibhav Complex, Near Nagbaba Temple, Vikhroli (West) Mumbai","phone":"022-42151818","profile":"Desktop Support Engineer (L1/ L2) \nCloudstrats Technologies Pvt. Limited","description":"Candidate should have 1 to 3 years of experience and exposure on End user support and IT infra skills such as Desktop, Service Desk, Cloud etc. Installation or configuring desktops. Configuring Outlook/ Ms-outlook Preparation of Daily/ Weekly/ Monthly reports Handling team. Good communication skills required. Joining : Immediate Joiner Walk-in Date/ Time: 3rd August 2019, 12 PM onwards Interview Venue: Cloudstrats Technologies Pvt. Limited AA-57, Kailash Vaibhav Complex, Near Nagbaba Temple, Vikhroli (West) Mumbai Tel: 022-42151818, Ext : 3304 Mobile: 8291942825 Email : hr@cloudstrats.com","location":"Mumbai","experience":"1 - 3 Years"},{"date":"29 - Jul - 2019","skills":"Technical Support, Customer Support, Networking","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Quick Heal Technologies Limited, 2nd Floor Shree Ganesh Classic Plot No. 6, Sr.No 35/1+2 Near Navshya Ganpati Temple Anandwalli, Gangapur Road, Nashik - 13","phone":"9325789601","profile":"Technical Support Engineer \nQuick Heal Technologies Limited","description":"Candidates with experience in Customer support / Technical Support/ Any IT related Support or good technical knowledge can apply. Must be able to communicate fluently in mentioned languages. Positive attitude, Learning Skills, Sincere Channels: Voice, Chat & Email Process Shifts: Should be able to work under rotational shift 15/7 Languages: English/ Hindi Job Location: Nashik Walk-in Date/ Time: 29th July 2019, 10 AM onwards Interview Venue: Quick Heal Technologies Limited 2nd Floor Shree Ganesh Classic Plot No. 6, Sr.No 35/1+2 Near Navshya Ganpati Temple Anandwalli, Gangapur Road, Nashik - 13","location":"Nasik","experience":"0 - 1 Years"},{"date":"3 - Aug - 2019","skills":"Technical Support, IT Service Desk, Customer Cupport","qualification":"B.Sc, BCA/BCS, B.E./B.Tech, Diploma","address":"Hexaware Technologies Private Limited, EB1, 1st Floor, Plot No. H5 SIPCOT IT Park, Navallur Post, Siruseri, Chennai -603 103","phone":"Not Provided","profile":"Technical Support Engineer \nHexaware Technologies Pvt. Limited","description":"ANY DIPLOMA GRADUATES WITH GOOD COMMUNICATION CAN ATTEND THE INTERVIEW. GRADUATION IS NOT MANDATORY. CANDIDATES WITH BACKLOGS / ARREARS CAN ALSO ATTEND THE INTERVIEW. VERY SIMPLE ONE ROUND FACE TO FACE INTERVIEW PROCESS. Excellent verbal and written communication is must. Should have very good phone etiquette. Good customer handling skills and good attitude is must. Previous work experience in BPO , Voice Process, Non-Voice Process, Customer Support, Technical Support will be an added advantage. INTERESTED CANDIDATES CAN WALK-IN FOR THE INTERVIEW ON 3RD AUGUST 2019 @ 10:00 AM TO THE BELOW MENTIONED VENUE WITH YOUR UPDATED RESUME AND MEET YOUR CONTACT PERSON HR-DINESH. Hexaware Technologies Private Limited EB1, 1st Floor, Plot No. H5 SIPCOT IT Park, Navallur Post, Siruseri, Chennai -603 103","location":"Chennai","experience":"0 - 2 Years"},{"date":"29, 30 - Jul - 2019","skills":"International Voice Process, Customer Service","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Sitel India Private Limited, Boomerang, No 501, Wing A & B1, Chandivali, Andheri East, MUMBAI - 400 072","phone":"7303443025","profile":"Customer Support Executive \nSitel India Private Limited","description":"Sitel India Private Limited, is hiring for UK Inbound Customer Service Process. Job Requisites: Qualification HSC+ 6 months of experience Maximum Qualification Graduates Age: 19+ years to 39 years (Undergrads can be considered but should not be regular college students) Experience 0 to 2 year of experience in BPO/ Customer Service industry (Fresher will be preferred) Excellent communication skill with good hold on grammar Basic knowledge of computers Job Responsbility: Handling inbound calls Providing Customer support to UK Customers Other Benefits: Pick up & drop Facility will be provided.- 5-Days working (2 Rotational and Split offs) Willingness to work in Rotational Shifts Attractive incentives Walk-in Date/ Time: 29th - 30th July from 11 AM onwards Interview Venue: Sitel India Private Limited Boomerang, No 501, Wing A & B1, Chandivali, Andheri East, MUMBAI - 400 072 Contact Person:- HR RAMESH PAL: 7303443025","location":"Mumbai","experience":"0 - 2 Years"},{"date":"29, 30, 31 - Jul - 2019","skills":"C#/ VB .NET, Client-side Web Technologies, CSS, SQL Server","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Nittany Creative Solutions LLP, No 141, Prakash Towers, Second Floor, Rajiv Gandhi / OMR IT highway, Near IGP Bus Stop / Next to IGP Building, Chennai - 600 041","phone":"8552019000","profile":".Net Developer \nTcraft Technologies","description":"We are looking for ambitious .Net Developer to join our team. As a .NET Developer you will be involved in design, development, coding, customization, configuration, testing, and deployment in support of enterprise packaged solutions. Roles And Responsibilities: . Finding information about latest technologies that aid in the development of core web applications and enhance their features in the long run. . They have to also ensure the compatibility of their websites with newer software or operating system version. . Understanding the life cycle of software and determining any changes that may be needed as per the observations and feedback of software testing professionals. . Manage defect tracking system and resolve all issues and prepare update for systems. . Enhance existing systems by analyzing business objectives, preparing an action . Investigate and develop skills in new technologies Skills: SQL Server, CSS, C#/ VB .NET, Client-side Web Development Technologies, MVP, Unit Testing, MCSD Walkin Details Walk-ins: 26 July to 3 Aug 2019 (Timing- 10 am to 1pm) Venue Details- Tcraft Technologies 301, 3rd Floor, Pinnacle Pride S. No. 1544/45 A, Sadashiv Peth, Opposite Hotel Durvankur, Tilak Road, Pune - 411 030 Contact No.: 8552019000","location":"Pune","experience":"0 - 3 Years"},{"date":"29, 30, 31 - Jul - 2019","skills":"Technical Support, International Voice Process, Customer Service","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Tech Mahindra Limited, Survey No. 62/1 A, Takshashila Building, Gate No: 1, Qutubullapur Mandal, Bahadurpally, Hyderabad - 500 043.","phone":"7386174351","profile":"Technical Support - Voice Process \nTech Mahindra Limited","description":"Tech Mahindra Limited, is hiring for Technical Support Associates (International Voice Process) Required Qualification/ Experience: Undergraduate / Graduate / Post Graduate Minimum 6 months in technical support OR 1 year in customer support - Voice Experience from International BPO background is only considered Should have excellent communication skills (Oral & Verbal) Must be flexible working for Rotational shifts Candidate should be aware of basic technical knowledge in LAN, WAN and handling basic Internet issues. Troubleshooting of technical related issues and ensure to resolve the issues or queries over the call. Research, diagnose, troubleshoot and identify solutions to resolve customer issues. Transport facility available (Pick & Drop). Looking only for Immediate Joiners 5 days working. Core Competencies- Pleasant, professional and courteous personality. Excellent Problem Solving and Customer Service Skills Ability to think creatively and should have positive attitude. Strong analytical & Interpersonal skills Walk-in Date/ Time: 29th July - 3rd August , 12 AM onwards Interview Venue: Tech Mahindra Limited, Survey No. 62/1 A, Takshashila Building, Gate No: 1, Qutubullapur Mandal, Bahadurpally, Hyderabad - 500 043. Contact Person: M. SWATHI Tel- 7386174351","location":"Hyderabad","experience":"0 - 5 Years"},{"date":"29, 30, 31 - Jul - 2019","skills":"Patient Care, Patient Support, Front Office","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Max Healthcare Institute Limited, Gurgaon","phone":"8800674672","profile":"Patient Care Coordinator - Front Office \nMax Healthcare Institute Limited","description":"Urgently requirement of Patient Care Coordinator for Front Office Minimum Qualification - Graduation Walk-in Date/ Time: 29th July - 2nd August , 10 AM onwards Interview Venue: Max Healthcare Institute Limited Gurgaon Contact Person - Varun Kumar Tel:- 8800674672","location":"Gurgaon","experience":"0 - 4 Years"},{"date":"29, 30, 31 - Jul - 2019","skills":"Front Office/ Receptionist Activities, General Administration","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Lite Bite Foods Private Limited, Plot No 317, Udyog Vihar Phase IV, Gurgaon","phone":"Not Provided","profile":"Front Office Executive \nLite Bite Foods Private Limited","description":"Educational Qualification: Any Graduate Work Experience: 0 to 5 Years Job Location: Gurgaon Job Responsibility- Welcomes visitors by greeting them, in person or on the telephone; answering or referring inquiries. Directs visitors by maintaining employee and department directories; giving instructions. Maintains security by following procedures; monitoring logbook;. Walk-in Date/ Time: 29th July - 31st July , 11 AM onwards Interview Venue: Lite Bite Foods Private Limited Plot No 317, Udyog Vihar Phase IV, Gurugram","location":"Gurgaon","experience":"0 - 5 Years"},{"date":"1, 2, 3 - Aug - 2019","skills":"Front Office, Complaint Management, Customer Relationship, Customer Service Front, Front desk Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"TV Sundaram Iyengar & Sons Private Limited, No. 368-370, Mettupalayam Road Coimbatore - 641043. Landmark: Opp to Avinashilingam College","phone":"9840526992","profile":"Front Office Executive (Female) \nTV Sundaram Iyengar & Sons Private Limited","description":"Candidate should be Any Graduate with 1 to 3 years of experience in Front Office, Complaint Management, Customer Relationship, Customer Service Front, Front desk Activities. Must have excellent communication skills. Job Responsibilities- Greet and welcome guests as soon as they arrive at the office Direct visitors to the appropriate person and in office Answer, screen and forward incoming phone calls Incoming and outgoing log book maintenance Walk-in Date/ Time: 1st August - 3rd August , 10 AM onwards Interview Venue: TV Sundaram Iyengar & Sons Private Limited No. 368-370, Mettupalayam Road Coimbatore - 641043 Landmark: Opp to Avinashilingam College","location":"Coimbatore","experience":"1 - 3 Years"},{"date":"27 - Jul - 2019","skills":"Java, JDBC, Spring, Servlet and JSP, Tomcat, JBoss, J2EE, JSP/JSF","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Amiti Software Technologies Pvt. Limited, 68 4th Cross Panduranganagar, Opp Adigas/ HSBC, Bannerghatta Road, Bengaluru - 560 076","phone":"Not Provided","profile":"Java Developer (Fresher) \nAmiti Software Technologies Pvt. Limited","description":"Candidate must have strong Java programming skills Excellent knowledge building scalable web applications Good knowledge of Relational DB design and Object Oriented design. Proficient with JDBC, Spring, Servlet and JSP Excellent experience with Oracle RDBMS and SQL Queries Good experience with Tomcat, JBoss, J2EE, JSP/JSF Experience with Spring Framework, JMS, iBATIS, Hibernate Excellent Communication & interpersonal Skills; Team Player. Excellent benefits such as fully paid technical courses and certifications such as Java Certification. Walk-in Date: 27th July 2019 Time: 10 AM to 3 PM Interview Venue: Amiti Software Technologies Pvt. Limited 68 4th Cross Panduranganagar, Opp Adigas/ HSBC, Bannerghatta Road, Bengaluru, Karnataka - 560 076","location":"Bangalore","experience":"0 - 1 Years"},{"date":"29, 30, 31 - Jul - 2019","skills":"MS Office, Non Voice Process, Backend Operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Bamboo Movie International Private Limited, BMI, 2nd Floor, Prestige Point, No. 47 Haddows Road, Nungambakkam, Chennai - 600 006.","phone":"044-45554093","profile":"Office Assistant/ Secretary \nBamboo Movie International Private Limited","description":"Ideal candidate should have experience between 0 to 2 years. We are expecting candidate with Good Looking & Good Communication. General knowledge of computers Maintain the general filing system, file all correspondence and database maintenance. Looking for FEMALE CANDIDATES ONLY Walk-in Date/ Time: 29th July - 12th August , 11 AM onwards Interview Venue: Bamboo Movie International Private Limited BMI, 2nd Floor, Prestige Point, No. 47 Haddows Road, Nungambakkam, Chennai - 600 006. For further more details Contact: Priya(HR)@ 044-45554093","location":"Chennai","experience":"0 - 2 Years"},{"date":"29, 30, 31 - Jul - 2019","skills":"Front Office Receptionist, Activities Reception, Security Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Asian Institute of Gastroenterology Pvt. Limited, AIG Hospital Mind Space Road Gachibowli Hyderabad, Telangana - 500 032","phone":"9100223452","profile":"Guest Relation Executive \nAsian Institute of Gastroenterology Pvt. Limited","description":"Greet and welcome guests as soon as they arrive at the office Direct visitors to the appropriate person Answer, screen and forward incoming phone calls Ensure reception area is tidy and presentable, with all necessary stationery and material Provide basic and accurate information in-person and via phone/email Maintain office security by following safety procedures and controlling access via the reception desk (monitor logbook etc) Order front office supplies and keep inventory of stock of stationary Perform other clerical receptionist duties such as filing, photocopying, transcribing and faxing Walk-in Date/ Time: 29th July - 10th August , 11 AM onwards Interview Details: Asian Institute of Gastroenterology Pvt. Limited AIG Hospital Mind Space Road Gachibowli Hyderabad, Telangana - 500 032","location":"Hyderabad","experience":"0 - 5 Years"},{"date":"29, 30, 31 - Jul - 2019","skills":"Back Office Processing, Data Entry","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Vara United Private Limited, 1st Floor, Raghuleela Arcade, Vishwaroop Software Park (Above Audi Showroom), Sector 30A, Vashi, Navi Mumbai - 400 703","phone":"9075917122","profile":"Data Entry/ Process Executive \nVara United Private Limited","description":"We are having daily walk in interviews at our Vashi Office for Banking Back Office Process Executive. Candidate will be working here for Banking process under data trasaction department. Should have good typing speed and flexible to work in rotational shift. Preferably looking for Male candidates and who can work in night shift. Candidate should have completed 12th. Walk-in Date. Time: 29th July - 2nd August , 9 AM onwards Interview Venue: Vara United Private Limited 1st Floor, Raghuleela Arcade, Vishwaroop Software Park (Above Audi Showroom), Sector 30A, Vashi, Navi Mumbai - 400 703 Contact Person: Priyanka","location":"Mumbai","experience":"2 - 5 Years"},{"date":"27 - Jul - 2019","skills":"Core Java, Spring, Javascript, Spring Boot, Hibernate, Mongo/ Cassandra / NOSQL DB","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"STRAVISO India Private Limited, 6TH FLOOR, Windsor Commerce Building, Near Vadeshwar Hotel, 48 Baner Road, Pune - 411 045","phone":"020-48614595","profile":"Senior Java Developer \nStraviso India Private Limited","description":"Candidate should have overall 5 + years of development experience and a minimum of 3+ years experience as a JAVA developer building responsive websites and web applications. Jenkins build pipeline and dashboard (Setup and Config), Junit/ Mockito, Sonar Cube, Docker, PACT (Consumer contract builder) Development in Mongo/ Cassandra / NOSQL DB (with admin configuration familiarity), Spring Boot Must have an understanding of semantic, responsive, cross-browser markup. Experience with front-end web frameworks (Bootstrap, Foundation). Walk-in Date: 27th July 2019 Time: 11 am- 5 pm IST Venue: STRAVISO India Private Limited 6TH FLOOR, Windsor Commerce Building, Near Vadeshwar Hotel, 48 Baner Road, Pune - 411 045 Landmark : Above Giridhar Hotel, Opp Dominos Lane PH :7722075652/ 020-48614595 NOTE : Notice period less than 30 days can only apply","location":"Pune","experience":"4 - 9 Years"},{"date":"29, 30, 31 - Jul - 2019","skills":"Receptionist/ Front Office Activities, Front desk, Telecalling","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Trans Asia Integrate Services, 204, Abba Residency, Opp. Railway Station, Jogeshwari (West), Mumbai - 400 102.","phone":"8879400988","profile":"Receptionist - Front Desk Executive \nTrans Asia Integrate Services","description":"Candidate should be Any Graduate with1 to 5 years of experience in Front desk, Receptionist/ Front Office Activities, Telecalling. Must be Familiar with computer with Good Personality and Fluent in English Walk-in Date/ Time: 29th July - 31st July , 9 AM onwards Interview Venue: Trans Asia Integrate Services 204, Abba Residency, Opp. Railway Station, Jogeshwari (West), Mumbai - 400 102. Tel: 022 42088888","location":"Mumbai","experience":"1 - 5 Years"},{"date":"29, 30 - Jul - 2019","skills":"travel insurance statutory compliance ticket booking facility administration housekeepng hr administration","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Treeline Business Solutions - Alpha Centre, 3rd Floor, 150 & 151, North Usman Road, T. Nagar, Chennai 600 017. Landmark Opposite to Murugan idli Shop, Pantaloons shop (same building 3rd floor)","phone":"Not Provided","profile":"Admin Executive & HR Generalist \nTreeline Business Solutions","description":"Educational Qualification: Any Graduate Work Experience: 0 to 4 Years Age - <28 Years Should have good communication skills Looking for Chennai based experienced people. Job Responsibility: Handling activities like On boarding, Attendance Management, Exit Formalities, MIS, Statutory Compliance , Maintaining database, Employee Engagement, Handling Grievances, Payroll etc.. Openings : 2 (1 for Admin Executive & 1 for HR Generalist) If interested, Kindly send your profile to malini@axceltrees.com Or directly Walk-in in the below mentioned address. Treeline Business Solutions Alpha Centre, 3rd Floor, 150 & 151, North Usman Road, T. Nagar, Chennai - 600 017 Landmark Opposite to Murugan idli shop, Pantaloons shop (same building 3rd floor). Contact Person : Balasubramanian/ Malini Interview Date : 29th & 30th Jul 2019 Time - 10 AM - 6 PM. Mode of interview: F2F","location":"Chennai","experience":"0 - 4 Years"},{"date":"27 - Jul - 2019","skills":"Recruitment/ HR, Interviewing, Training, Quality Team Management","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Habsons Jobsup Limited, 3rd Floor 1/1A, Bharat Nager, NFC, New Delhi - 110 025","phone":"9319265566","profile":"Recruitment Executive/ Associate \nHabsons Jobsup Limited","description":"Candidate should be Graduate in any discipline with minimum 1-4 years of experience out of which 1 years should be in International recruitment Process/ Healthcare. Must have good command over written and spoken English with excellent communication skills. Rec. Healthcare-must Walk-in Date/ Time: 27th July , 9 AM onwards Interview Venue: Habsons Jobsup Limited 3rd Floor 1/1A, Bharat Nager, NFC, New Delhi - 110 025","location":"Delhi","experience":"1 - 5 Years"},{"date":"24, 25 - Jul - 2019","skills":"Back Office Activities, Excel, Data Entry","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Netscribes (India) Private Limited, 4th Floor, Saberwal House, 55B, Mirza Ghalib Street, Park Street, Kolkata - 700 016","phone":"8335089133","profile":"Back Office Executive \nNetscribes (India) Private Limited","description":"Candidate should be Any Graduate with decent communication skill in English both written and verbal and must have an eye for detail. Tech Savvy and affluent with MS Excel. Basic knowledge of E-commerce industry is preferred. Those awaiting final results can also apply Job Responsibilities: 1. To write features and attributes of product through extensive secondary research 2. To adhere the feature guidelines sent from client's end 3. Writing short product descriptions wherever necessary 4. To adhere daily target related to production and quality 5. To keep error benchmark at minimum as specified by the client 6. To participate in periodical trainings as and when conducted by mentors. Job Hours: 6 days working in a week and 9 hours for a shift including 1-hour break per shift. Salary: INR. 10,000/ month Walk-in Date/ Time: 24th July - 25th July , 2 PM onwards Interview Venue: Netscribes (India) Private Limited 4th Floor, Saberwal House, 55B, Mirza Ghalib Street, Park Street, Kolkata - 700 016","location":"Kolkata","experience":"0 - 1 Years"},{"date":"24, 25, 26, 27 - Jul - 2019","skills":"Hr Compliance, Vendor Management, HR Operations","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Amazon Development Centre (India) Pvt. Limited, Orion Building, Bagmane Constellation Business Park, Doddanekundi Circle, Outer Ring Road, Marathahalli Post, Bengaluru, Karnataka - 560 037","phone":"Not Provided","profile":"HRS Associate/ Fresher \nAmazon Development Centre (India) Pvt. Limited","description":"Candidate should have Any Bachelors degree. MBA is a plus Minimum of 1-2 years of experience in a similar profile is preferred MS Office knowledge and ability to use MS Excel for reporting Good attention to detail and the ability to prioritize in a fast-paced environment, Good analytical and critical thinking skills Must have good communication skills Flexible to work in night shifts and staggered week offs. Work experience - 0 to 1 years (Max). Job Responsbility- Customer service orientation with ability to serve multiple customers (candidates, hiring managers, recruiters, HR business partners) Ability to manage confidential and sensitive employee information and adhere to strict confidentiality standards Ability to work in team environment while also building and maintaining strong relationships Scheduling interviews and phone screens working directly with candidates , Recruiters/RC's and hiring managers Updating candidate records and job postings in recruiting systems and confirming new hires Providing follow-up correspondence to candidates Tracking recruiting activities and providing candidate status in a weekly report Assisting in the coordination of other recruiting activities as needed Walk-in Date: 24th - 27th July 2019 Time: 9.30 AM-12.00 PM STRICTLY Interview Venue: Amazon Development Centre (India) Pvt. Limited Orion Building, Bagmane Constellation Business Park, Doddanekundi Circle, Outer Ring Road, Marathahalli Post, Bengaluru, Karnataka - 560 037 Pancard and Passport Size Photograph is mandatory to attend interview. Kindly carry 3 copies of resume for the interview . Candidates who have interviewed for this role the last 6 months are not eligible for this role now.","location":"Bangalore","experience":"0 - 1 Years"},{"date":"24, 25 - Jul - 2019","skills":"Database Management, Employee Engagement, Sourcing, Bulk Hiring, Recruitment/ Onboarding","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"1mg Technologies Private Limited, 5th Floor Tower B Presidency Building Sector 14 Gurgaon","phone":"Not Provided","profile":"HR Recruiter (Contractual Role) \n1mg Technologies Private Limited","description":"Desired Skills and Experience: -Must have 1 year experience in bulk hiring & BPO hiring -Responsible for HR operation process including hiring,employee engagement, onboarding etc.. -Maintaining & managing database of Candidates. -Experience in Recruitment & sourcing of candidates. -Experience in job portal & leveraging a Referral network in a corporate environment. -Strong interpersonal and communication skills (both written and oral). Looking for Immediate joiners. Walk-in Date: 24th - 25th July 2019 Time : 11:00 AM -4 PM Interview Venue: 1mg Technologies Private Limited 5th Floor Tower B Presidency Building Sector 14 Gurgaon Nearest Landmark : Kalyani Hospital Nearest Metro station : MG Road","location":"Gurgaon","experience":"1 - 4 Years"},{"date":"24, 25, 26 - Jul - 2019","skills":"Banking Process, Back Office Processing, Data Entry","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Vara Infotech Private Limited, 1st Floor, Raghuleela Arcade, Vishwaroop Software Park (Above Audi Showroom), Sector 30A, Vashi, Navi Mumbai - 400 703","phone":"9075917122","profile":"Data Entry/ Process Executive \nVara Infotech Private Limited","description":"We are having daily walk-in interviews at our Vashi Office for Banking Back Office Process. Candidate will be working here for Banking process under data trasaction department. Should have good typing speed and flexible to work in rotational shift. Candidate should have completed 12th. Preferably looking for Male candidates and who can work in night shift. Walk-in Date/ Time: 24th - 26th July , 9 AM onwards Interview Address: Vara Infotech Private Limited 1st Floor, Raghuleela Arcade, Vishwaroop Software Park (Above Audi Showroom), Sector 30A, Vashi, Navi Mumbai - 400 703 Contact Person: Priyanka","location":"Mumbai","experience":"0 - 1 Years"},{"date":"24, 25, 26, 27, 29, 30, 31 - Jul - 2019","skills":"Android SDK, Mobile Development, XML/ JSON, Prototype, Third Party","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Option Matrix InfoTech Private Limited, 4 B UPTOWN Cyberabad Building, 100 Feet Road, Madhapur, Ayyappa Society, Hyderabad - 500 081","phone":"040-40020730","profile":"HR Executive (Female Only) \nOption Matrix InfoTech Private Limited","description":"Option Matrix InfoTech Private Limited is looking for HR Executive for recruitment. This position is reserved for female candidates only. Preference will be given to the candidates having experience. Freshers can also apply. Candidate must have excellent communication and interpersonal skills. Starting salary will be three lakhs twenty thousand per annum. Key Responsibilities: Recruitment Placing adverts in Job Portals Calling candidates and scheduling interviews Facilitating the candidates to go through the recruitment process smoothly Conducting the Interviews and coordinating with technical team and senior management. Attendance Management Leave Management Upon completion of one year will provide good growth path and will promote to involve in Core HR role / Admin activities also. Interested candidates can directly walk-in for interview at the mentioned address- Date: 24th - 31st July, 10 AM onwards Interview Venue: Option Matrix InfoTech Private Limited 4 B UPTOWN Cyberabad Building, 100 Feet Road, Madhapur, Ayyappa Society, Hyderabad - 500 081","location":"Hyderabad","experience":"0 - 3 Years"},{"date":"25 - Jul - 2019","skills":"Salary Administration, Statutory Compliance Compliance, Payroll Management","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Mtandt Group A-34/1, Site-4,Front of Magnum Paper Ventures, Industrial Area Sahibabad (Nearest Metro- Kaushami)","phone":"8700576669","profile":"Assistant Manager - HR \nMtandt Rentals Limited","description":"Educational Qualification: MBA (HR) Work Experience: 3 - 8 Years Duties & Responsibility: Statutory Compliances/ Legal Compliance Pay roll Management/ Wage & Salary Administration/ Compensation & Benefits. CLRA/ BOCW Employee Welfare/ Employee Grievances. General Administration & Operations Vendor Management/ Stakeholder management. Industrial Relations /Industrial Dispute/ Employee relations Perks and Benefits As per the industry norms- Not a constarint for a good candidate Walk-in Date/ Time: 25th July , 10 AM onwards Interview Venue: Mtandt Group A-34/1, Site-4,Front of Magnum Paper Ventures, Industrial Area Sahibabad (Nearest Metro- Kaushami) Contact person - Priti (8700576669) Interested candidates can share their profile & Confirmation @ careers@mtandt.com or hr@mtandt.com","location":"Ghaziabad","experience":"3 - 8 Years"},{"date":"25, 26 - Jul - 2019","skills":".Net, MVC, C#, SQL, Jquery","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"IKS Health (Inventurus Knowledge Solutions Private Limited) M/s. Serene Properties Pvt. Ltd. (SEZ) Unit No. 203, Building No. 5, 2nd Floor Mindspace (East) Airoli, Navi Mumbai - 400 708","phone":"040-23545853","profile":".Net Developers \nInventurus Knowledge Solutions Pvt. Limited","description":"Candidate should have Masters/ Bachelors/ Diploma in Computer Science with 1 to 3 years of experience in software development (.NET, MVC, JQuery, C# and OOPS). Atleast an years of hands-on application development experience using Microsoft Technologies. Exposure and experience in agile development preferred. US Healthcare knowledge and experience would be preferred. Key Responsibilities- Understand business requirements and translate them into technical requirements Maintenance and Troubleshooting of developed applications Coding and Development as per the requirements provided Unit testing of the application / tools / solutions and changes developed Interview Process- 1. Online technical test 2. Two level of technical discussion 3. Hiring manager discussion 4. HR Discussion Walk-in Date - 23rd to 26th July 2019 Timing- 11:00 AM to 6:00 PM Interview Venue: IKS Health (Inventurus Knowledge Solutions Private Limited) M/s. Serene Properties Pvt. Ltd. (SEZ) Unit No. 203, Building No. 5, 2nd Floor Mindspace (East) Airoli, Navi Mumbai - 400 708 Contact Person : Deepika P Documents to carry :- Updated resume with Original Govt ID","location":"Mumbai","experience":"1 - 3 Years"},{"date":"27 - Jul - 2019","skills":"C#, .Net SQL Windowns Applications Winforms","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Sheorey Digital Systems Limited, Software Lab & Technical Support Center, Anjaneya Techno Park, 1st Floor 147, HAL Airport Road, Kodihalli, Bengaluru - 560 017","phone":"Not Provided","profile":"Software Developers (C# .Net) \nSheorey Digital Systems Limited","description":"Qualification: BE/ B.Tech/ M.Tech/ MCA Work Experience: 3 to 5 Years Required Skills- C#, .Net SQL Windowns Applications Winforms Walk-in Date/ Time: 27th July 19 - 10:00 am to 1:00 pm Interview Venue: Sheorey Digital Systems Limited Software Lab & Technical Support Center, Anjaneya Techno Park, 1st Floor 147, HAL Airport Road, Kodihalli, Bengaluru - 560 017 Preferably immediate to 15 days notice period Please carry a copy of your resume, passport size photo & aadhar copy","location":"Bangalore","experience":"3 - 5 Years"},{"date":"25, 26 - Jul - 2019","skills":"C# VB .NET WPF JQuery ASP .Net MVC, Ajax WF, NHibernat,e Javascript","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Kellton Tech Solutions Limited, Plot No. 404-405, 4th & 6th Floor, Udyog Vihar, Phase III, Sector 19, Gurugram, Haryana - 122 016","phone":"Not Provided","profile":".Net Developer \nKellton Tech Solutions Limited","description":"Mandatory Skills - .Net And MVC Hands-on experience in developing enterprise web/SOA applications on Microsoft .NET platform using C#, VB .NET, ASP .NET, Team Foundation Server, SharePoint,Entity Framework. Knowledge and hands-on experience in one or more of these technologies - WCF, WF, WPF, WebAPI. In-depth understanding of SOA, Web services and XML. Responsible for Requirement Management, High Level and Low Level Design and Design documents using Use Cases and Visio Diagrams. Management of complete Life cycle of the project. Design of project and components. Primary Skills (Must have): Must have knowledge of web services implementation. Should have exposure to design patterns. Good verbal and written communication skills. HTML 4 knowledge is must. HTML 5 knowledge would be preferred. Must have good knowledge of javascript including Jquery framework. Must have good knowledge of entity framework/ nhibernate. Walk-in Date/ Time: 24th - 26th July 2019, 11 AM onwards Interview Venue: Kellton Tech Solutions Limited Plot No. 404-405, 4th & 6th Floor, Udyog Vihar, Phase III, Sector 19, Gurugram, Haryana - 122 016","location":"Gurgaon","experience":"3 - 7 Years"},{"date":"25, 26 - Jul - 2019","skills":"ASP .Net, C#, WCF, MVC, Angular JS and SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA","address":"EasyTrip Planners Private Limited, Plot No 223 - Patparganj Industrial Area, Near Anand Vihar Metro Station, Delhi - 110092","phone":"8470014530","profile":"Senior .Net Developer \nEasyTrip Planners Private Limited","description":"Work Experience: 2 to 5 Years Mandatory Skills: Asp .Net, C#, WCF, MVC and SQL Server, Angular JS Job Responsibilities: Participate in requirements analysis Collaborate with internal teams to produce software design and architecture Write clean, scalable code using .NET programming languages Test and deploy applications and systems Revise, update, refactor and debug code Improve existing software Develop documentation throughout the software development life cycle (SDLC) Serve as an expert on applications and provide technical support Walk-in Date/ Time: 25th July - 26th July from 11 AM onwards Interview Venue: EasyTrip Planners Private Limited Plot No 223 - Patparganj Industrial Area, Near Anand Vihar Metro Station, Delhi - 110092","location":"Delhi","experience":"2 - 5 Years"},{"date":"25, 26, 27 - Jul - 2019","skills":"ASP .Net 2008+, SSIS, MS SQL Queries","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Nucsoft Limited, 301/302, Wing A, Sagar Tech Plaza, Andheri Kurla Road, Saki Naka, Andheri (E), Mumbai - 400 072","phone":"Not Specified","profile":"ASP .Net Developer \nNucsoft Limited","description":"Person should have 2 to 4 years of experience in .Net Development Strong knowledge in ASP .Net 2008+ Basic understanding of SSIS Good hands on experience in MS SQL Queries Salary: Max up to 4.5 LPA Job Location : Malad, Mumbai Walk-in Date/ Time: 24th July - 27th July , 9 AM onwards Interview Venue: Nucsoft Limited, 301/302, Wing A, Sagar Tech Plaza, Andheri Kurla Road, Saki Naka, Andheri (East), Mumbai - 400 072 Landmark: Near Saki Naka Metro Station Please share below details on nazrana_alware@nucsoft.com Total Experience - Experience in ASP.NET - Experience in MS SQL- Notice Period - Reason for job change - Current location - Availability for f2f interview - Any offer in hand / pipeline","location":"Mumbai","experience":"2 - 4 Years"},{"date":"26 - Jul - 2019","skills":"ASP .NET 2.0 /3.5/4.0, C#, SQL Server 2005","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Changepond Technologies Private Limited, H-2 , SIPCOT IT PARK, OMR, Siruseri, Chennai - 603 103. Land Mark: Opposite to TCS 2nd Gate","phone":"Not Provided","profile":".Net Developer/ Freshers \nChangepond Technologies Private Limited","description":"This is a full-time position for working in exciting and international projects. We are looking for candidates who have trained in .NET domain, Knowledge in RPA is an added advantage. Eligibility Criteria: 2019 / 2018 / 2017 / 2016 passed out only. BE / B Tech / MCA with an Aggregate of min 60% throughout Academics is MANDATORY. Good command of written and spoken English. Required Skills: Strong in .NET Framework, Object oriented programming and database concepts Basic Knowledge in ASP .NET 2.0 /3.5/4.0, C#, SQL Server 2005 Basic knowledge in web applications, windows services and web services AJAX, JQuery would be an added advantage .NET Certification / Course is MANDATORY Walk-in Date/ Time: 26th July , 9 AM onwards Interview Venue: Changepond Technologies Private Limited H-2 , SIPCOT IT PARK, OMR, Siruseri, Chennai - 603 103. Land Mark: Opposite to TCS 2nd Gate","location":"Chennai","experience":"0 - 1 Years"},{"date":"27 - Jul - 2019","skills":"C# .Net, Asp .Net, SQL","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Aufait Technologies Private Limited, 28 Kormangala Industrial Layout, 3rd floor, 4th B Cross, 5th Block, Bangalore- 560 095","phone":"Not Provided","profile":".Net Trainee/ Developer \nAufait Technologies Private Limited","description":"We are pleased to inform you that we are conducting a walk-in for .Net Trainee/ Developer profile (freshers) interview on 27th July 2019, Saturday (10:00 AM-3:00 PM) (1-2 PM will be lunch break) Educational Qualification: B.Tech/BE, BCA, B.Sc, M.Sc, MCA (2019/ 2018 Passed outs) Must have good knowledge in C#, ASP .Net & SQL Should have good communication skills Candidates must have completed a training course/ Certification/ Internship on Dot net, C# & SQL which is mandatory or any academic project for a minimum duration of 6 months on the same skill. Walk-in Details: 27th July 2019, Saturday Time: 10:00 AM-3:00 PM Interview Mode: Written (Technical & Logical) Technology: Dot Net (Fresher) Interview Venue: Aufait Technologies Private Limited, 3rd floor, 28, 3rd floor,4th B Cross Road, Koramangala Industrial Layout, Koramangala, Bengaluru, Karnataka 560095, Landmark- Tillite Arabic Kitchen Things to carry: Updated resume.","location":"Bangalore","experience":"0 - 1 Years"},{"date":"27 - Jul - 2019","skills":"Technical Support, Sql Programming, MS Sql/ Oracle","qualification":"B.E./B.Tech, M.Tech","address":"FactSet Systems India Private Limited, 7th Floor, Block-4, DivyaSree NSL Infrastructure Pvt. Ltd., SEZ, Gachibowli, Hyderabad - 500 032.","phone":"Not Provided","profile":".Net/ Fullstack Developer \nFactSet Systems India Private Limited","description":"Candidate should be B.Tech or M.Tech in Computer Science or equivalent with 2 to 4 years of Software Engineering experience in building multi-tier applications or websites using C# 3.0 and later and how Design Patterns can be used C#, .NET MVC, Entity Framework, SQL Server (experience in creating Stored procedures and database schemas) and strong understanding of Object-oriented programing. JavaScript (no particular library but can learn libraries quickly. Preference goes to those who know Angular, view.js). IIS, TCP/IP, HTTP/HTTPS Transports. Understand the details of SOAP, Messaging, WCF, Web Services, RESTFUL API, Web Polling, and Web Sockets. Testing frameworks such as NUnit, xUnit, MSTest Proficient understanding of code versioning tools like Git and continuous integration tool like Jenkins. Sound knowledge of SOLID principals and design patterns is desirable. Ability to articulate and quickly adopt development best practices. Excellent organizational and communication skills. Willingness to work as a member of a team, including participating in peer code reviews and maintaining project and operational documentation. Walk-in Interview on 27th July from 9 AM onwards Interview Venue: FactSet Systems India Private Limited, 7th Floor, Block-4, DivyaSree NSL Infrastructure Pvt. Ltd., SEZ, Gachibowli, Hyderabad, Telangana - 500 032.","location":"Hyderabad","experience":"2 - 4 Years"},{"date":"26 - Jul - 2019","skills":"MS .NET, ASP, ASP .NET, C#, Java Script, JQuery, SQL Server","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Board Room, Vivanta Chennai, IT Expressway No. 309, Old Mahabalipuram Road, Shollinganur , Chennai - 600 119","phone":"044-66802500","profile":"Senior .Net Developer \nInfo-Tech Systems Integrators","description":"Candidate must possess at least a Bachelor's Degree, Post Graduate Diploma, Professional Degree, Computer Science/ Information Technology, Engineering (Computer/ Telecommunication), Science & Technology, Engineering (Electrical/ Electronic), Engineering (Others) or equivalent. At least 4 years of working experience in the related field is required for this position Expertise required in MS .NET, ASP, ASP .NET, C#, Java Script, JQuery Expertise in database related development (SPs, Views, Triggers etc.) of SQL Server 2008/2014/2016 Should have thorough knowledge of SQL querying techniques, performance tuning Experience in Web API, Multi-threaded/parallel programming, design patterns will be a plus Knowledge on Azure, Docker, Kubernetes, Jenkins is plus Should work as an individual contributor Excellent communication and written skills Working: 5 days a week from 9:00 am to 6:00 pm First month of Saturday from 9:00 am - 1:00 pm Walk-in Date/ Time: 26th July 2019, 9 AM onwards Interview Venue: Board Room , Vivanta Chennai, IT Expressway No. 309, Old Mahabalipuram Road, Shollinganur , Chennai - 600 119 Hotel Telephone 044-66802500","location":"Chennai","experience":"4 - 8 Years"},{"date":"24, 25, 26 - Jul - 2019","skills":"Manual Testing, Writing Test Cases and Test Scenarios","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Girmiti Software Private Limited, SLV Plaza, Ground Floor, Kundalahalli Gate, Marathalli Post, Bangalore - 560 037.","phone":"6362905880","profile":"QA Testing Engineer (Male) \nGirmiti Software Private Limited","description":"Qualification: MCA/ BE/ B.Tech Can apply (2012-2019 Pass outs) Required Skills: Knowledge on Manual Testing with Core Java/ Python Skills. Writing Test Cases and Test Scenarios. Automation Testing with Selenium will be an added advantage. Good in Communication and Presentation Skills. Perks and Benefits: Based on Percentage Criteria Ready to join immediately with all completed Certificates. Walk-in Date: 22nd - 26th July 2019 Time: 10:00 am to 11:00 am Interview Venue: Girmiti Software Private Limited SLV Plaza, Ground Floor, Kundalahalli Gate, Marathalli Post, Bangalore - 560 037.","location":"Bangalore","experience":"0 - 1 Years"},{"date":"22, 23, 24, 25 - Jul - 2019","skills":"Manual Testing, Requirement analysis, Test Design and Test Procedure creation","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Sandip University, st floor, Manisha Pride, Nehru Road Mulund (West), Mumbai","phone":"70309 42440","profile":"Manual Testing Engineer \nSandip University","description":"Sandip University is looking out for Manual Tester (Codeignitor) on urgently to based at Mulund location. Candidate should have 1 to 3 years experience in Manual Testing Role is to work on Manual Testing of a Education application - Requirement analysis, Test Design and Test Procedure creation, defect analysis, test execution. Responsibility includes :- Requirement analysis and Review Test design Scenarios and test cases Test Execution & result analysis Defect reporting and closure Status reporting Client communication Working Hours - 10:00 AM- 6:00 PM Week off - 1st & 3rd Sat along with all Sundays Interested candidates contact us on 70309 42440 OR send your resumes on hr@sandipuniversity.edu.in AND Walk-In from 22nd to 25th 2019 from 10 AM to 3 PM only at Mulund : HO Sandip University, st floor, Manisha Pride, Nehru Road Mulund (West), Mumbai","location":"Mumbai","experience":"1 - 3 Years"},{"date":"23, 24 - Jul - 2019","skills":"Game Testing, Identifying bugs, Follow-up of corrections","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Expleo India Infosystems Pvt. Limited, Hinjewadi Phase 3, Pune","phone":"Not Provided","profile":"Game Testing - Freshers \nExpleo India Infosystems Pvt. Limited","description":"Identifying the different bugs by following standard processes. Isolating bugs i.e. finding steps to reproduce for identified bugs. Compiling the bugs in a database or in given documents with a precise description of the encountered issues so they can be easily identified and reproduced. Respecting the planning and the deadlines. Follow-up of the versions from scratch to end of project. Assuring the quality of the games and achieving required standards. Identifying bugs. Communicating the differences to the concerned folks. Follow-up of corrections. Perks and Benefits Rs.10,000/- to Rs.12,000/- per month Walk-in Date/ Time: 23rd July - 24th July , 10 AM onwards Interview Venue: Expleo India Infosystems Pvt. Limited Hinjewadi Phase 3, Pune","location":"Pune","experience":"0 - 1 Years"},{"date":"23, 24, 25, 26 - Jul - 2019","skills":"Automation Testing, Selenium, VBScript, Python and / or JavaScript","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"TeamLease Services Pvt. Limited, # 58, 3rd,Floor Karishma Building Nungambakkam High Road, Chennai- 600 034 (Near Taj Hotel).","phone":"Not Provided","profile":"Automation Test Engineer \nTeamLease Services Pvt. Limited","description":"Desired Qualification: BE/ B. Tech / M.Sc in Computer Science/ IT or MCA Experience: 2 - 4 years of work experience in software test automation Job Location- Perungudi, Chennai Strong knowledge in test script development using UFT, Robot Framework or Selenium. Strong knowledge in VBScript, Python and / or JavaScript Must have strong analytical and debugging skills Good communication skills, proactive, self-reliant and team player Ability to effectively communicate and interact with various stakeholders of the project Mode of Employment - Contract (12 months) Salary: NEGO Callout for a technical written test + F2F interview eventually. Walk-in Date/ Time: 22nd - 26th July, 11 AM onwards Walk in Location: TeamLease Services Private Limited # 58, 3rd,Floor Karishma Building Nungambakkam High Road, Chennai- 600 034 (Near Taj Hotel). Contact Person : Nandhini","location":"Chennai","experience":"2 - 4 Years"},{"date":"24, 25 - Jul - 2019","skills":"General Administration, Front Office, HR Assistance","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Osprosys Software Private Limited, Sai Gandhi Square, Ground Floor, 002, Varthur Main Road, Ramagondanahalli, WhiteField Post, Bangalore - 560 066","phone":"080 40940409","profile":"Front Office Executive (Male) \nOsprosys Software Private Limited","description":"Osprosys Software Private Limited, is looking for Fresher Male Candidate for Front Desk, good communication, basic computer and mail knowledge, Regular working hours, should be able to travel minimum within the city once in a while. Must have good communication skills Walk-in Date: 24th & 25th July 2019 Timings - 10.30 am to 1.00 pm Interview Venue: Osprosys Software Private Limited Sai Gandhi Square, Ground Floor, 002, Varthur Main Road, Ramagondanahalli, WhiteField Post, Bangalore - 560 066 Landmark: Opposite To Sigma Tech Park, Contact Person - Hariprasad Phone- 080 40940409","location":"Bangalore","experience":"0 - 2 Years"},{"date":"27 - Jul - 2019","skills":"qa testing manual testing software testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Hurits Consulting Private Limited, No. 376/A, 1st Floor, Obeya Verve, Opposite to KLAY Play School, 5th Main, Near Rajesh Jewellery, Sector 6, HSR Layout, Bangalore - 560 02","phone":"9380322067","profile":"Manual Tester/ QA Engineer \nHurits Consulting Private Limited","description":"Candidate must have solid experience in Mobile Web/ both iOS and Android Testing. Should have experience in testing multi-tiered applications developed using Java/ J2EE related technologies. Ability to write, execute and analyse test results. Ability to write SQL queries is a must Prefer someone who can start immediately. Job Responsbility- Development and on-time execution of QA test plans within the context of Agile release cycles. Collaborate with the Product Management, QA and Development team members to identify and clearly understand business requirements and functional design Walk-in Date/ Time: 27th July 2019, 9 AM onwards\\ Interview Venue: Hurits Consulting Private Limited No. 376/A, 1st Floor, Obeya Verve, Opposite to KLAY Play School, 5th Main, Near Rajesh Jewellery, Sector 6, HSR Layout, Bangalore - 560 02","location":"Bangalore","experience":"3 - 6 Years"},{"date":"24, 25 - Jul - 2019","skills":"BPO Hiring, Sourcing, Induction, Employee Engagement, Bulk Hiring, Onboarding","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"1mg Technologies Private Limited, 5th Floor Tower B Presidency Building Sector 14, Gurgaon","phone":"Not Provided","profile":"HR Recruiter (Contractual Role) \n1mg Technologies Private Limited","description":"Desired Skills/ Experience: Person must have 1 year experience in bulk hiring & BPO hiring Responsible for HR operation process including hiring, employee engagement, onboarding etc.. Maintaining & managing database of Candidates. Experience in Recruitment & sourcing of candidates. Experience in job portal & leveraging a Referral network in a corporate environment. Strong interpersonal and communication skills (both written and oral) Looking for Immediate joiners. Walk-in Date: 24th - 25th July 2019 Time : 11:00 AM -4 PM Interview Venue: 1mg Technologies Private Limited 5th Floor Tower B Presidency Building Sector 14, Gurgaon Nearest Landmark : Kalyani Hospital Nearest Metro station : MG Road","location":"Gurgaon","experience":"1 - 4 Years"},{"date":"22 - Jul - 2019","skills":"service quality customer service orientation back office processing","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Tai Infotech Private Limited, Building No. 149 4th Floor Sector 44 Gurgaon. Next to Luminous Building, Near Punjab & Sindh Bank","phone":"Not Provided","profile":"Backend Process Executive \nHCL Technologies Limited","description":"Career Opportunity in Insurance Industry for Non Technical Graduate fresher, with HCL Technologies Ltd - Business Services for the profile of Customer Service Executive (Back Office Process). Educational Requirement: BBA, BA, B Com, B.SC Graduates (Only 2015/2016/2017/2018 Pass-outs are eligible for this opening). CS can also apply for the same. Work Experience: Freshers / Maximum 6 months experience Note: Technical graduates/ Regular MBA's are not eligible for this opening. Shifts : 24*7 (Rotational) Salary: Upto 2.50 LPA Job Location: Gurgaon Roles & Responsibilities:- Manage and update Insurance Member and Plan data on multiple systems. Enter new member data into excel and enrolment forms. Processes customer requests in a timely and accurate manner. Communicates with customers through written correspondence. Using PC application and functions such as Excel and Word to update and load data sets. To answer queries coming from end user customers in a polite and professional manner. Skill Set Required:- Good typing speed (25 wpm with 80% Accuracy). Strong commitment to customer service and quality Must have excellent keyboard skills Demonstrates a strong customer service orientation. Takes responsibility to follow up with customers to ensure their needs and expectations are satisfied. Please come down for a face to face Interview Please write HR Yogendra 9599555476 on the top of your resume for entry Walk-in Date: 22nd July-2019 (Monday) Timings:11 AM to 3 PM Interview Venue - Tai Infotech Private Limited Building No. 149 4th Floor Sector 44 Gurgaon Next to Luminous Building, Near Punjab & Sindh Bank Near to HUDA Metro, HR Yogendra Please Be in Formals For the interview. Need to Carry: Updated CV, All education certificates (Original & Xerox copy) & Govt address / ID Proof. Please Note: Don't carry laptop or any other storage device...! Feel free to refer your friends or colleagues for the openings.","location":"Gurgaon","experience":"0 - 1 Years"},{"date":"27 - Jul - 2019","skills":"Java JMS Hibernate IBATIS JBoss JSP Servlets Spring Framework JDBC","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Amiti Software Technologies Pvt. Limited, 68 4th Cross Panduranganagar, Opp Adigas/ HSBC, Bannerghatta Road, Bengaluru, Karnataka - 560 076","phone":"Not Provided","profile":"Java Developer (Fresher) \nAmiti Software Technologies Pvt. Limited","description":"Candidate must have strong Java programming skills Excellent knowledge building scalable web applications Good knowledge of Relational DB design and Object Oriented design. Proficient with JDBC, Spring, Servlet and JSP Excellent experience with Oracle RDBMS and SQL queries Good experience with Tomcat, JBoss, J2EE, JSP/JSF Experience with Spring Framework, JMS, iBATIS, Hibernate Excellent Communication & interpersonal Skills; Team Player. Excellent benefits such as fully paid technical courses and certifications such as Java Certification. Year of Passing: 2018 & 2019 Walk-in Date: 27th July 2019 Time : 10:00 am to 3:00 PM Interview Venue: Amiti Software Technologies Pvt. Limited 68 4th Cross Panduranganagar, Opp Adigas/ HSBC, Bannerghatta Road, Bengaluru, Karnataka - 560 076","location":"Bangalore","experience":"0 - 1 Years"},{"date":"22, 23, 24, 25 - Jul - 2019","skills":"Email Support, International Voice Process, Non Voice Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Mphasis Limited, Ground floor, Cluster C, EON IT Park, Kharadi, Pune","phone":"Not Provided","profile":"Email & Chat Process Executive \nMphasis Limited","description":"Mega walk-in drive for Email and Chat process in Mphasis on 22nd to 25th July 2019 Qualification: Any graduate except BE/ B.Tech/ BCA/ MCA Experience: Minimum 1 year of email and chat experience Job Location: Pune Required Skills: Typing speed of 30 WPM with 90% accuracy Descent communication skills Open to work in night shift Possess good analytical and comprehension skills Shift and weekly offs- 24X5 process Rotational shift 5 days working 2 days weekly off 9 hours login (with 1 hour break) Joining: Immediate Other Benefits- Pick up and drop facility Global standard work environment Proper desk job Performance linked incentives Walk-in date : 22nd to 25th July 2019 Time : 11 am to 2 pm Interview Venue: Mphasis Limited, Ground floor, Cluster C, EON IT Park, Kharadi, Pune Contact Person : HR Tausif","location":"Pune","experience":"1 - 6 Years"},{"date":"22, 23, 24, 25, 26 - Jul - 2019","skills":"Negotiation it recruitment workday data management Lateral Hiring data reporting","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Concentrix Daksh Services India Pvt. Limited, Tech Park One, Tower A, Ground Floor, Survey No- 191 A/2A/1/2, Off Airport Road, Yerwada, Pune - 411 006","phone":"Not Provided","profile":"Sr. HR Recruiter/ Analyst HR \nConcentrix Daksh Services India Pvt. Limited","description":"Experience in IT recruitment an added advantage, else strong ITES exp mandatory. Sourcing, conduct skill testing & interviews, creating daily pipeline thru driving referrals Achieve monthly joining targets and KRAs as set by Managers/ organization. Co-ordinate / liaison with placement consultants etc. Key Responsibilities: Contribute to creating an organizational image, which would help in attracting and recruiting the best talent Interface with HR and Operations teams Collaborate and work with multiple teams Ability to work well with various levels of the organization - leadership / management. MIS, data reporting, daily entry of candidates on tool and closure of end to end offer process on Recruitment tools Maintain and update trackers for ongoing programs & projects Experience in Recruitment tool like Workday an added advantage. Desired Skills: Good communication skills, Data management and detail oriented. Good knowledge of computers, Good knowledge of MS Office (Excel, Word, PowerPoint) Ability to multitask, handle stress and work with people at all levels Good team player and able to handle stakeholders and clients at all levels. Education:- Graduate in any discipline Experience: 2 to 3 years relevant experience Job Location: Pune, Maharashtra India Walk-in Date/ Time: 22nd July - 26th July , 11 AM onwards Interview Venue: Concentrix Daksh Services India Pvt. Limited Tech Park One, Tower A, Ground Floor, Survey No- 191 A/2A/1/2, Off Airport Road, Yerwada, Pune - 411 006","location":"Pune","experience":"2 - 3 Years"},{"date":"22, 23, 24 - Jul - 2019","skills":"Back Office Activities, Excel, Document Verification, Data Entry","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"EXL Services Private Limited, A-18, Sector-59, Noida","phone":"Not Provided","profile":"Back Office Associate \nEXL Services.com India Pvt. Limited","description":"Special Walk-in from 22nd -24th July 2019 for Computer Operator/ Data Entry Operator/ CCE/ Backend/ Back Office US Requirements- Candidates should atleast be a Graduate with good communication skills Should be Ok with night shifts Venue - EXL Services Private Limited A-18, Sector-59, Noida Interview Timings: 11 am to 3 pm Interested candidates can walk in at the above mentioned address along with the updated resume, 3 passport size photographs and original Aadhar card proof in which Date of Birth is correctly mentioned. In case ful Date of Birth is not mentioned on Adhar Card then carry any other id proof alongwith Aadhar Card Contact Person-Neda Sarfaraz Request you to kindly carry a copy of the printout of this mail. Perks and Benefits Incentives","location":"Noida","experience":"0 - 5 Years"},{"date":"22, 23, 24, 25, 26 - Jul - 2019","skills":"Unit Testing, MS SQL Server, Crystal Report, SQL Queries","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Cenduit India Services Private Limited, 33, 5th Floor, Ness Towers, 17th H Main Road, 6th Block, Koramangala, Bengaluru - 560 095","phone":"7982915549","profile":"Junior Software Engineer \nCenduit India Services Pvt. Limited","description":"Skills & Competencies:- Skills Required : SQL (2000 &2008) , crystal report and BOBJ Additional skills preferred: Basic Clinical Domain Knowledge, Knowledge on SQL SSIS Expected high level of professionalism in the work environment. Ability to learn the domain quickly. Ability to meet and adhere to timelines as planned for study Ability to multi-task and stay organized in a dynamic work environment. Keeps up to date with new developments to ensure knowledge of the industry/area of expertise is up to date. Sound interpersonal skills Demonstrates commitment and enthusiasm towards Cenduits goals and objectives Job Responsbility:- Responsible to understand and build study as per client requirements. Contribute to delivery of high-quality configured system or code Perform basic trouble shooting and problem solving within proprietary platforms Maintain compliance to training, documentation, policies and procedures Support study development and study change orders Responsible for required documentation as per the laid SOPs Walk-in Date: 22nd - 26th 2019 Timing :- 11 AM to 5 PM Interview Venue: Cenduit India Services Private Limited 33, 5th Floor, Ness Towers, 17th H Main Road, 6th Block, Koramangala, Bengaluru - 560 095 Note:- Candidates who have already appeared for the interview within 6 Months are not eligible.","location":"Bangalore","experience":"1 - 2 Years"},{"date":"22, 23, 24 - Jul - 2019","skills":"Core Java, Advance Java, Servlets, JSP, Java Script, HTML5, Hibernate, Webservices","qualification":"B.E./B.Tech, MCA/PGDCA","address":"MS Technology Private Limited, 2, Community Centre, IInd Floor, Basant Lok, Vasant Vihar, New Delhi - 110 057","phone":"Not Provided","profile":"Java Developers \nMS Technology Private Limited","description":"Candidate must have expertise in Core Java, Advance Java, Servlets, JSP, JavaScript. HTML5 Hibernate, Webservices, REST API, Apple IOS, Google Android, Angular5 or above. Have experience in IDE like Eclipse, NetBeans etc. Must have good exposure to object oriented design patterns. Should have good Database concepts. Walk-in Date/ Time: 22nd - 24th July , 10 AM onwards Interview Venue: MS Technology Private Limited 2, Community Centre, IInd Floor, Basant Lok, Vasant Vihar, New Delhi - 110 057","location":"Delhi","experience":"1 - 2 Years"},{"date":"27 - Jul - 2019","skills":"spring boot java Spring Mvc Migration core java microservices docker","qualification":"B.E./B.Tech, MCA/PGDCA","address":"FTD INDIA PRIVATE LIMITED, Block D Wing II, 5th Floor, Cyber Gateway Building, HitechCity, Madhapur, Hyderabad - 500 081","phone":"040-66030303","profile":"Java Developers \nFTD India Private Limited","description":"We are seeking passionate software application developers to work with our highly talented team of young dedicated professionals who aim to give our customers a memorable shopping experience. Education: BE/ B.Tech/ MCA with 70% throughout academics from premier institutions Experience Range: 1-5 Years Place of Work: Hyderabad Knowledge, Skills & Abilities: Expert level Java skills: Can write non trivial distributed applications using Java libraries. Excellent understanding of Generics, concurrency, streams, java collections Strong understanding of Microservices and Cloud Native Application architectures. Excellent in development and deployment of MicroServices by using Spring Boot, Spring Cloud and API gateway (Netflix Zuul). Strong Core Spring and the Spring ecosystem (Spring Boot, Spring Cloud, Spring Data, Spring Security) skills. Experience with Test Driven Development (TDD ) and testing tools such as Junit and Mockito. Strong demonstrated usage of CI/CD pipelines and tools such as Jenkins, Git, SonarCube etc. Strong DB experience in Relational DB's and at least one NOSQL db, like for example MongoDB. Experience with Docker containers on Google Cloud Platform, powered by Kubernetes. Date of Drive: July 27, 2019 (Saturday) Time: 9:00 AM to 2:00 PM Venue: FTD INDIA PRIVATE LIMITED Block D Wing II, 5th Floor, Cyber Gateway Building, HitechCity, Madhapur, Hyderabad - 500 081 Interview Process: Candidates who clear Code Assessment test will be processed for further technical discussions. Note: Candidate who attended our interview process in last 6 months is not eligible for this drive.","location":"Hyderabad","experience":"1 - 5 Years"},{"date":"22, 23, 24, 25, 26, 27 - Jul - 2019","skills":"Java, J2EE, EJB, JSP, Servlets, JMS, JMX, JDBC, XML, Struts, Hibernate, Spring and Hybris","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Manuh Solutions India Pvt. Limited, No. 58, Arihant Chambers, Seshadripuram Main Road, 1st R Block, Guttahalli, Bengaluru, Karnataka - 560 020","phone":"Not Provided","profile":"Java Developer \nManuh Solutions India Pvt. Limited","description":"Candidate should have at least 2 years of experience in application development (Java Web/ Enterprise). Must have good understanding of OO techniques Primary Skills: Java, J2EE, EJB, JSP, Servlets, JMS, JMX, JDBC, XML, Struts, Hibernate, Spring and Hybris [5.2.0.4], Groovy, Grails, Bootstrap, jQuery, Spring Boot, Webservices [SOAP/ REST], Microservices Operating Systems: Windows 9X/ 2000/ XP, UNIX and DOS Languages: C, C++, J2SE, J2EE, SQL, PL/ SQL Development Tools: Eclipse, TOAD, Intellij Scripts: Angular JS, JavaScript , HTML and UNIX Database Connectivity: JDBC, Hibernate Databases: Oracle 10g Configuration Tools: Visual Source Safe 6.0, SVN, Jenkins, GIT Domain Knowledge: Healthcare, E-commerce, Manufacturing Networking: Routers, Hubs Documentation: Microsoft Word, Excel, PowerPoint Configuration Management: Microsoft Visual Source Safe Walk-in Date/ Time: 22nd July - 27th July , 11 AM onwards Interview Venue: Manuh Solutions India Pvt. Limited No. 58, Arihant Chambers, Seshadripuram Main Road, 1st R Block, Guttahalli, Bengaluru, Karnataka - 560 020","location":"Bangalore","experience":"2 - 6 Years"},{"date":"22, 23, 24, 25, 26 - Jul - 2019","skills":"Core JAVA, Java Swing, JAVA J2EE,OOPS Concept, JSP, Servlets, JDBC, Hibernate","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Verifacts Services Private Limited, #4007, 1st and 2nd Floor, Hallmark Square, 100ft Road, Indiranagar, Bangalore - 560 038","phone":"080 6782 2222","profile":"Java Developers \nVerifacts Services Private Limited","description":"Verifacts Services Private Limited, is hiring Java Developers - Background Verification (Day Shift) at Bangalore location. Education Qualification: Any Graduate Work Experience: 1 - 3 Years Job Location: Bangalore Java Skills: Core JAVA, Java Swing, JAVA J2EE,OOPS Concept, JSP, Servlets, JDBC, Hibernate, Spring, Struts, Web Services API(SOAP/Rest), JSON, HTML, CSS, Jquery, JavaScript , XML, AJAX, MVC, Android Application Development. Database: SQL/ Postgres SQL/ Psql Web Server: TOMCAT IDE: Eclipse OS/ Platform: Windows & Red Hat Role & Responsibilities : Designs, develops, and implements web-based Java applications to support requirements. Follows approved life cycle methodologies, creates design documents, and performs program coding and testing. Resolves technical issues through debugging, research, and investigation. Requires a bachelor's degree in area of specialty(Computer Science & ENG.). Experience in development and debugging standalone/ web applications built using java. Interested candidates walk in on the below mentioned address Walk-in Date: 22nd - 26th July, 10 AM onwards Interview Venue: Verifacts Services Private Limited #4007, 1st and 2nd Floor, Hallmark Square, 100ft Road, Indiranagar, Bangalore - 560 038 Contact number : 91677 75350 / 80 6782 2222 (Kindly call between 10:00 AM to 06:00 PM)","location":"Bangalore","experience":"1 - 3 Years"},{"date":"22, 23, 24, 25, 26, 27, 29, 30, 31 - Jul - 2019","skills":"Incident Management, International Voice Process, IT Service Desk","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Xerox Business Services India Private Limited, First Floor, Tower A&B, Knowledge Boulevard, Plot 8A Sector 62, Noida - 201301","phone":"080-7135500","profile":"L1 Support/ Service Desk Analyst \nTech Mahindra Limited","description":"Qualification: Any Graduate/ Post Graduate Work Experience: 6 months to 3 years Person must have at least 1-2 years in IT Service Desk/ Tech Support/ ITES environment desirable or similar profile from an International voice process. Knowledge & Skills Fluent in English verbal and Nonverbal Excellent telephone skills Customer focused Ability to multi-task and prioritize workload Ability to adapt to continuously changing procedures and environment Team player with strong interpersonal skills Joining: Immediate (7 days 15 days). Location: Electronic City Phase 2 or ITPL Job Responsibilities- Basic knowledge on Service Desk with written and oral communication skills. No Certifications or in-depth Technical requirements are needed. Candidates should be having International customer handing exposure [Voice] Should possess basic knowledge on ITIL Framework and Incident Management experience. Walk-in Date/ Time: 22nd - 31st July , 11 AM onwards Interview Venue: Tech Mahindra Limited, ITC4, Abdul Kalam Building, Electronic City, Phase-2 Bengaluru - 560 100. Contact: 080-71355000 Extn: 858541","location":"Bangalore","experience":"1 - 3 Years"},{"date":"22, 23, 24, 25, 26, 27, 29, 30, 31 - Jul - 2019","skills":"Customer Service, Networking, MS Exchange, Technical Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"GP Strategies India Private Limited, No. 4/ 363 Kandanchavadi (Max Fashion Building) Old Mahabalipuram Road Chennai - 600 096.","phone":"044-66023000","profile":"Technical Support Engineer \nGP Strategies India Private Limited","description":"Essential Requirements- Experience working in an IT department Knowledge of the following tools: MS Windows 7 10 Active Directory MS Exchange Office 365 Highly organised with the ability to prioritise a variety of tasks/deliverables Microsoft Office experience in a working environment. Desire to offer outstanding customer service. Attention to detail. Excellent inter-personal skills. Essential Duties & Responsibilities: Acknowledge receipt of all user tickets within defined Service Level Agreements (SLAs). Maintain defined Key Performance Indicator (KPI) levels. Take phone calls from end users and 3rd parties. Log detailed descriptions of issues into the ServiceDesk ticket system. Take ownership of tickets and manage them through to closure. Walk-in Date/ Time: 22nd - 31st July , 9 AM onwards Interview Venue: GP Strategies India Private Limited No. 4/ 363 Kandanchavadi (Max Fashion Building) Old Mahabalipuram Road Chennai - 600 096.","location":"Chennai","experience":"0 - 5 Years"},{"date":"22, 23, 24, 25, 26 - Jul - 2019","skills":"Service Level Desktop Support Networking Windows Active Directory Technical Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Redcentric Solutions Private Limited, Manjeera Trinity Corporate, 6th Floor, JNTU Road, Beside Manjeera Mall, Kukatpally, Hyderabad","phone":"Not Provided","profile":"IT Engineer - Technical Support \nRedcentric Solutions Private Limited","description":"Candidate should have 2 to 4 years of experience of working for Voice based Technical support in an IT Service provider / outsourcing project environment. Must possess outstanding verbal and written communication skills. Ability to work under pressure and to Service Level Agreements in a fast-paced environment Adaptable to multitasking environment, process oriented. Commitment / flexibility (late night and weekend work is quite often required due to nature of the business). Strong Customer Service attitude; builds lasting client relationships, strives for efficiency and effectiveness Adaptable to fast paced environment and grasp concepts quickly. Knowledge / hands-on preferably for Desktop support, Windows Active Directory, Citrix, Network & hardware. Certification/ Trained on any of these - MCSA, MCSE or MCITP preferred. Walk-in Date/ Time: 22nd - 26th July , 3 PM onwards Interview Venue: Redcentric Solutions Private Limited Manjeera Trinity Corporate, 6th Floor, JNTU Road, Beside Manjeera Mall, Kukatpally, Hyderabad","location":"Hyderabad","experience":"2 - 4 Years"},{"date":"27 - Jul - 2019","skills":"Core Java, J2EE, Spring (MVC/ Cloud/ Boot), Hibernate, Angular","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Xpanxion International Private Limited, Sai Radhe Building behind Sheraton Grand Hotel 7, Railway Officers Colony, Pune - 411 001.(Behind Pune Railway Station)","phone":"Not Provided","profile":"Java Fullstack Developer \nXpanxion International Pvt. Limited","description":"We are conducting walk-in drive ie 27th July 2019 (Saturday) for Java Fullstack Developers position with us. Required Skills: 1. Core Java. J2EE 2. Spring (MVC/ Cloud/ Boot) 3. Hibernate 4. Angular 5. Any Build tools 6. Angular Interview Process: 1) Resume shortlisting 2) Technical Test 3) Technical Interviews Further process will communicated to you on the drive date. Time: 09:30 AM to 1:00 PM Contact Person: Shweta Patil Our Office is located at : Xpanxion International Private Limited Sai Radhe Building behind Sheraton Grand Hotel 7, Railway Officers Colony, Pune - 411 001. (Behind Pune Railway Station) Documents to Carry : Updated Resume P.S.: In case you have appeared for the interview in last 6 months please ignore this.","location":"Pune","experience":"2 - 7 Years"},{"date":"22 - Jul - 2019","skills":"HR Generalist Activities Attendance IR Issues Data Management Employee Relations Hr Compliance","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Flipkart Internet Private Limited, Tower B Embassy tech village Devarabisanahalli, Bengaluru","phone":"Not Provided","profile":"HR Generalist - Contract Basis \nFlipkart Internet Private Limited","description":"Walk-in drive for fresher candidates from MBA (HR)/ MSW specialization. Experience: 1 year or Freshers with keen learning ability, aspiration to HR generalist role & enthusiasm to work for e-commerce industry can also apply Job Responsbility: Solely Managing 1 or more Delivery hubs in Respective regions. HR Compliance - Includes monitoring bio-metric attendance, employee data management & compliance inputs Employee Engagements - Hands on experience preferred Employee Relations - Past ER/IR issues handled will aid in the role Recruitment - Specifically blue collared employees Industry: SCM / Logistics / E-tail preferred Functional Area: 1 or 1+ year of experience in recruitment / HR partnering / HR generalist Should have strong database. Considering work location & infra - Male candidates with MBA/MSW/ or Master program in HR are most preferred Job Location - Hyderabad-2, Visakhapatnam, Nellore & Vijayawada - 1 Chennai - 2, Goa-Verna-1 Sector - Logistics / Warehousing Role - Contract (3 months ) NTH - 25k to 35k","location":"Bangalore","experience":"0 - 2 Years"},{"date":"22, 23, 24, 25 - Jul - 2019","skills":"Technical Support, Desktop Support, Hardware Troubleshooting","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Micropoint Computers Private Limited, 17/18, Navketan Estate, Opposite ONIDA, Mahakali Caves Road, Andheri (East), Mumbai - 400 093","phone":"022-40956397","profile":"Desktop Support Engineer \nMicropoint Computers Pvt. Limited","description":"Micropoint Computers Pvt. Limited is having immediate opening for Desktop Support Engineer for its L&T Client. Work Experience : 0 - 5 Years Location - Mumbai, Navi Mumbai Salary - High in the industry Walk-in Date/ Time: 22nd July - 25th July , 10 AM onwards Interview Venue: Micropoint Computers Private Limited 17/18, Navketan Estate, Opposite ONIDA, Mahakali Caves Road, Andheri (East), Mumbai - 400 093 If interested, kindly mail your cv to bhumikampcl@gmail.com or call 022-40956397","location":"Chennai","experience":"1 - 3 Years"},{"date":"22, 23, 24, 25, 26 - Jul - 2019","skills":"Technical Support, Desktop Support, Hardware Troubleshooting","qualification":"B.Sc, BCA/BCS, B.E./B.Tech, Diploma","address":"MIOT INTERNATIONAL, No: 4/112, Mount Poonamallee Road, Manapakkam, Chennai - 89","phone":"044-22492288","profile":"Desktop Support Engineer \nMIOT Hospitals Private Limited","description":"Candidate must have pleasant personality with good communication skills. Willing to work in Shifts. Setup computers and install required softwares Test computers to ensure proper functioning of computer systems Handle daily technical support activities on desktop support Resolve & maintain computer peripheral devices like printers, scanner. Only Male Candidates need to apply Walk-in Date: 22nd - 26th July 2019 Timing - 10 AM to 12 PM Interview Venue: MIOT INTERNATIONAL No: 4/112, Mount Poonamallee Road, Manapakkam, Chennai - 89 Ph: 044-22492288, Extn: 4005 Land Mark: (Near to Chennai Trade Centre)","location":"Chennai","experience":"1 - 3 Years"},{"date":"22, 23, 24, 25, 26, 27 - Jul - 2019","skills":"PHP Code Ignitor, MySQL, JQuery, Javascript","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"RNFI Services Private Limited, Plot No. 30, 3rd Floor, Najafgarh Road Industrial Area, New Delhi - 110 015","phone":"011-49207777","profile":"PHP Developers \nRNFI Services Private Limited","description":"Candidate should have atleast 2 years of experience in PHP Code Ignitor, MySQL, JQuery, Javascript Must have strong knowledge of PHP Web frameworks Understanding the fully synchronous behavior of PHP Understanding of MVC Design Patterns Knowledge of object oriented PHP programming No Bar for the right candidate Walk-in Date/ Time: 22nd July - 27th July , 11 AM onwards Interview Venue: RNFI Services Private Limited Plot No. 30, 3rd Floor, Najafgarh Road Industrial Area, New Delhi - 110 015","location":"Delhi","experience":"2 - 5 Years"},{"date":"23 - Jul - 2019","skills":"Core Java, Advanced Java, JSP, MySQL & Oracle","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Bharti Airtel Limited, Plot No. 16, Udyog Vihar Phase IV, Sector 20, Gurugram, Haryana 122015.","phone":"Not Provided","profile":"Software Developer (Java) \nBharti Airtel Limited","description":"Educational Level: B.Tech/ B.E/ MCA Functional Competencies: Data Analytics Work Experience: 1 to 2 Years Required Skills: Hands on experience on Core Java, Advanced Java, JSP Good knowledge of MySQL & Oracle Certification would be an added advantage. Should have excellent communication skills PERSONAL CHARACTERISTICS & BEHAVIOURS Team player Result oriented Decisiveness Customer orientation Optimistic Walk-in Date/ Time: 23rd July from 10 AM onwards Interview Venue: Bharti Airtel Limited Plot No. 16, Udyog Vihar Phase IV, Sector 20, Gurugram, Haryana 122015. Contact person: Soumya (9205674115)","location":"Gurgaon","experience":"1 - 2 Years"},{"date":"22 - Jul - 2019","skills":"customer service, relationship management and support skills","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Cognizant Technology Solutions India Limited, Manyata Embassy Business Park, Mahogany (F2 Building), 2nd Floor, Hebbal Outer Ring Road, Rachenahalli, Bangalore - 560 045","phone":"Not Specified","profile":"Technical Support (Non Voice) \nCognizant Technology Solutions India Limited","description":"Work Experience / Skills Mobile Site Speed Specialist (M3S) This role is the one who makes the calls and assist clients to address website speed issues through implementation/consultation Education Requirements Bachelor's Degree in Science / Technology / Engineering / Mathematics / Computer Science / Computer Applications/ Information Technology Key Skills and Experience: Strong communication, customer service, relationship management and support skills Technologically savvy and show interest to grasp knowledge of various aspects of Web performance Engineering Capable enough to learn customer service software applications and process customer implementations that do not necessarily follow a standard template / process. Preferred Skills : Exposure or understanding of maintenance of websites with associated knowledge (HTML, JavaScript, PHP, ...) Exposure to WordPress / Magento / Joomla / Shopify or similar platforms (at least 1 platform) Walk-in Date/ Time: 22nd July 2019 from 10 AM onwards Interview Venue: Cognizant Technology Solutions India Limited Manyata Embassy Business Park, Mahogany (F2 Building), 2nd Floor, Hebbal Outer Ring Road, Rachenahalli, Bangalore - 560 045","location":"Bangalore","experience":"1 - 4 Years"},{"date":"22, 23, 24, 25, 26, 27, 29, 30, 31 - Jul - 2019","skills":"PHP, XML, CSS, Python, Java Script, Java, Server Handaling","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"iTstartn Technology, # 9 2nd Cross LR bande KB Sandra RT Nagar Near RK Palace Marraige Hall","phone":"Not Provided","profile":"Magento Developer - Php \niTstartn Technology","description":"Urgent requirement for Mmagento 2.3 x Developer Qualification: Any Graduate with good experience in Magento Developer Candidate should have goog experience in PHP, XML, CSS, Python, Java Script, Java, Server Handaling, Python, Magento API, MySQL and KVC etc. Walk-in Date/ Time: 19th July - 31st December , 10 AM onwards Interview Venue: iTstartn Technology # 9 2nd Cross LR bande KB Sandra RT Nagar Near RK Palace Marraige Hall","location":"Bangalore","experience":"1 - 3 Years"},{"date":"22, 23 - Jul - 2019","skills":"Core PHP & Wordpress","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Shriv ComMedia Solutions Pvt. Limited, D-100, Sector-63, Noida","phone":"Not Provided","profile":"Junior PHP Developer \nShriv ComMedia Solutions Pvt. Limited","description":"Candidate should have minimum 6 months experience in Core PHP & Wordpress. Must be will be working under the supervision of Senior PHP Developer. Immediate joiner from nearby location is preferred. Salary: Best in Industry Walk-in Date: 22nd - 23rd July , 11 AM onwards Interview Venue: Shriv ComMedia Solutions Pvt. Limited D-100, Sector-63, Noida","location":"Noida","experience":"1 - 2 Years"},{"date":"22 - Jul - 2019","skills":"C/ C++/ Java/ PHP/ Java Scripting","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Matrimony.Com Limited, Arihant ePark, Lattice Bridge Road, 2nd Floor, Baktavatsalm Nagar, Adyar, Chennai - 600 020","phone":"Not Provided","profile":"Software Developer (PHP) \nMatrimony.Com Limited","description":"Eligibility Criteria: 0 to 2 Years Experience in IOS/ PHP/ Node Js/ Angular Js. BE - (Comp Science / IT) & MCA. 70% Marks in 10th, 12th, UG & PG. All Academic Courses should be full time. All the academic courses should have been completed within the Stipulated duration of courses as specified by the respective board / University. Knowledge in anyone programming language. C/ C++/ Java/ PHP/ Java Scripting Selection Method: 1. Written - Aptitude & Programing test 2. Personal Interview 3. HR Interview Walk-in Date: 22nd July 2019 (Monday) Time: 10:30 AM to 04:00 PM Interview Venue: Matrimony.Com Limited Arihant ePark, Lattice Bridge Road, 2nd Floor, Baktavatsalm Nagar, Adyar, Chennai - 600 020 Landmark: Opposite to Adyar Anantha Bhavan Contact Person: Gracy L","location":"Chennai","experience":"0 - 2 Years"},{"date":"22, 23, 24 - Jul - 2019","skills":"PHP, Object Oriented Design, HTML, JavaScript, Jquery, JSON, CSS, AJAX","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Adcanopus Digital Media Private Limited, #555, Axis Pedegal, 1st Floor, J P Nagar, Bangalore","phone":"Not Provided","profile":"PHP Developer \nAdcanopus Digital Media Private Limited","description":"Candidate should have Bachelors degree and 2+ years of software development experience or equivalent, including Object Oriented design and PHP Development. Must have proficiency with front-end development and scripting including: HTML, JavaScript, Jquery, JSON, CSS, AJAX. Hands-on experience with web application architecture and relational database design Familiarity with the XAMP environment (Windows, Apache, MySQL, PHP) Experience building sites to function cross-platform and cross-browser Experience building database-driven applications and web sites Experience using PHP MVC frameworks required. Experience with Code Igniter is mandatory. Should have experience on Restful Api. Walk-in Date/ Time: 22nd July - 24th July , 10 AM onwards Interview Venue: Adcanopus Digital Media Private Limited #555, Axis Pedegal, 1st Floor, J P Nagar, Bangalore","location":"Bangalore","experience":"1 - 3 Years"},{"date":"27 - Jul - 2019","skills":"Java/ J2EE, Big Data, DevOps, Machine Learning","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"EPSoft Solutions Private Limited, Medha Hi-tech City, Kesarapalli, Gannavaram IT Park Road, Vijayawada, Andhra Pradesh - 521 102","phone":"Not Provided","profile":"Software Engineer (Java/ J2EE) \nEPSoft Solutions Private Limited","description":"There is a requirement for 15 candidates but the count can go to even 20 if we find the best and worthful candidates during the recruitment process. Looking for- Software Developers (Java/ J2EE, Big Data, DevOps, Machine Learning) Engineers (Network Engineer, IT Security Engineer) Analytics (Business Analyst, Data Analytics) Education: B.Tech (CSE/ IT/ ECE/ EEE), MBA, M.Sc 65% (NO BACKLOGS) Must have good Communications skills. Problem-Solving skills Team Player Leadership Skills Honesty Openness to Learning Candidate should be trained in this anyone of these technologies (Java/ J2EE, Big Data, DevOps, Machine Learning, Networking, IT Security) Walk-in Date/ Time: 27th July 2019, 9 AM onwards Interview Venue- EPSoft Solutions Private Limited Medha Hi-tech City, Kesarapalli, Gannavaram IT Park Road, Vijayawada, Andhra Pradesh - 521 102","location":"Vijayawada","experience":"0 - 2 Years"},{"date":"17, 18, 19, 20, 22, 23, 24 - Jul - 2019","skills":"Java/ J2ee, Core Java, Hibernate, Spring","qualification":"B.E./B.Tech, MCA/PGDCA","address":"iPRIMED Education Solutions Pvt. Limited, Megistic Terrace Building #62B, Phase 1 Electronic City, Bangalore. Opposite, Traffic Police Station","phone":"9902070375","profile":"Software Trainee (Java Fresher) \niPRIMED Education Solutions Pvt. Limited","description":"Quinnox is hiring Software Trainee (Java Fresher) Eligibility Criteria: B.E/ B.Tech/ MCA (CS/ IT/ IS) 60% aggregate (No year gap in between education) 2018 & 2019 Pass outs Only Job Location: Bangalore Salary: 3 - 3.40 LPA Immediate joiners Preferred Walk-in Date/ Time: 17th July - 24th July , 9 AM onwards Interview Venue: iPRIMED Education Solutions Pvt. Limited Megistic Terrace Building #62B, Phase 1 Electronic City, Bangalore Opposite, Traffic Police Station Contact Person : Umar A Ghaffer Tel: 9902070375 : Only Whtsapp","location":"Bangalore","experience":"0 - 1 Years"},{"date":"23, 24, 25, 26, 27, 29, 30, 31 - Jul - 2019","skills":"C /C++ /PHP, HTML, CSS and Java Scrip","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"OX Softwares Private Limited, Madura Garden, Devapragasam Trade Centre, No.15, Ground Floor, A Block, Poonamallee High Road, Maduravoyal, Chennai, Tamil Nadu - 600 095","phone":"8056293534","profile":"Magento/ PHP Developers \nOX Softwares Private Limited","description":"Candidate should be Any Graduate with Computer Science background (BE-CSE, ECE, B.Tech-IT, B.Sc, BCA, MCA, M.Sc, M.S, etc). Must have secured 60% of minimum marks in 10th, 12th and Degree (No standing arrears/ backlogs). Be strong in Quantitative Aptitude, Analytical and Logical Reasoning. Good listening and communication skills. Must be good team player and willing to learn. Required Experience, Skills: Knowledge in C /C++/ PHP Programming with good debugging skill is preferable. Knowledge in Linux/ Unix is a plus. Basic knowledge in RDBMS is a plus. Basic knowledge in HTML, CSS and Java Script is a plus. Responsibilities & Duties: Reports to Project Manager at project level. Responsible for the software development activities including develop, verify and manage the change requests for one component of a project solution. Responsible for the Design of the software architecture and interfaces for the component to meet functional and performances requirements. Responsible for testing software functional, design and quality requirements for the components. Assist Software Architects to maintain and improve in-house software modules and technical support. Walk-in Date/ Time: 23rd July - 6th August , 10 AM onwards Interview Venue: OX Softwares Private Limited Madura Garden, Devapragasam Trade Centre, No.15, Ground Floor, A Block, Poonamallee High Road, Maduravoyal, Chennai, Tamil Nadu - 600 095","location":"Chennai","experience":"0 - 2 Years"},{"date":"22 - Jul - 2019","skills":"ADO .NET, ASP .NET, C#, VB .NET (Windows/ Web Applications), SQL Server","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Exela Technologies (SourceHOV), 106, Annasalai, Guindy, Chennai - 32,","phone":"7550274743","profile":".NET Professionals \nSourcehov India Private Limited","description":"Qualification & Experience: # Any Graduate, Preferably BE (CSE), BTech (IT), MSC (IT) or MCA # Min of 2-7 Years of relevant experience in Software Development. Technical Skills: # Hands-on expertise in Programming Concepts. # Ability to think logically and solve basic problems. # Good coding techniques. # Proven experience in working on a large-scale Web/Data Applications. # Ability to work on multiple projects with strict deadlines. # Expertise in .NET Framework with any of the following: ADO .NET, ASP .NET, C#, VB .NET (Windows/ Web Applications) with strong exposure to SQL Server # Good experience in Front-End UI Design required. # Exposure in MVC Architecture an added advantage. # Domain knowledge in either Healthcare, F&A preferred Soft Skills: # Good communication & Inter-personal skills. # Strong in Numerical Ability & Logical Reasoning. # Go-Getter with positive attitude. Minimum Requirement to attend the Interview: # Excellent in Coding Skills and passionate towards writing Codes and Design. # Excellent in SQL / MySQL & MVC. # Good Understanding on Products and Product based company is an advantage. # A product Based / Healthcare / Financial background company is a plus. Walk-In Date: 22nd July 2019 Time: 10:00 AM Onwards Walk-In Venue: Exela Technologies (SourceHOV), 106, Annasalai, Guindy, Chennai - 32, Landmark: Near ABT Maruthi Showroom Contact Person : Sachin (HR) Note: - Kindly ignore the mail if you have already taken up the interview in the last 30 days.","location":"Chennai","experience":"2 - 7 Years"},{"date":"22, 23, 24, 25, 26 - Jul - 2019","skills":"Back Office Assistance, Customer Service","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Capita India Private Limited, Wing C Marisoft, Kalyani Nagar, Pune - 411 014","phone":"Not Provided","profile":"Customer Service - Insurance Back Office \nCapita India Private Limited","description":"We are hiring for UK International Customer Service - Insurance Back Office role in Capita. Mention below is the key skills. Any Graduate with excellent communications skills can apply.. Candidate need to be ok with UK shifts. Transport is provided (home pick-up and drop) Role & Responsibility: This is a back office customer service role which involves letter writing. The role requires an individual to comprehend and articulate a query or complaint raised by the customer and be able to provide an effective and accurate response to it. The individual is expected to take ownership and responsibility for personal performance targets. Role requires an individual to reflect on their performance and learn from their mistakes, seeing these as opportunities to improve on ones performance in the future. Interested candidates can directly WALK-IN with their updated CV and one photo ID proof on the mention below given address. Address:- Capita India Private Limited Wing C Marisoft, Kalyani Nagar, Pune - 411 014 Landmark - Opposite Gold Adlabs Contact Person :- Robinson/ Anushree Agrawal Walk-in Date: 22nd July to 26th July 2019 Starting Time: 9 AM","location":"Pune","experience":"0 - 3 Years"},{"date":"22, 23 - Jul - 2019","skills":"General Administration, Housekeeping Pest Control, Travel Desk, Amc, Front Office Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Kotak Mahindra Life Insurance Company Limited, #337, 1st floor, 27th Main Road, HSR Layout Sector 2, Bangalore - 560 102 Landmark: Opposite to KLM MALL","phone":"022-66057050","profile":"Administration Executive \nKotak Mahindra Life Insurance Co. Limited","description":"FMG Role: Managing Front Office/ Reception/ Housekeeping/ Security/ Courier services/ Vendors Maintaining Registers & Reports. Budgeting and working for cost reduction/saving. Printing & Purchase of Stationeries Repairs and upkeep of branch infrastructure (AC, DG , telephone lines), Engineering Services(AC, UPS Electricity etc). Arranging all the required items for routine operations. Managing On time Vendor Payment Process Ensuring AMC's and contract copies are maintained at branch. Travel & stay Co-ordination with Centralised Travel desk Space Management (Seat allotment & Storage) HR Support at Branch level: Coordinating for Ecode, offer letter, Arranging Aptitude test for the candidates Support for new joiner & employee exit formalities. Pest Control. (To ensure that the office hygiene maintain) Coordinate / Deal with the Building and office landlord for admin related activities Organizing and conducting security audit checks as well as formulating and implementing the emergency procedures & mock drills. Preferences -(Only Female Candidates can apply) Candidates with experience in the below profiles will not be suitable - (Tele calling or customer care profiles (Insurance, Credit card, Holiday Selling etc), Sales background, Account Assistant/Purchase Assistant, Secretaries/Receptionists, Telephone Operators and Admin profiles from educational institutions.) Candidates should be a Graduate with minimum 6 month work-experience. Age should not be more than 28 Knowledge of Admin role is a must Aware of Local language must Walk-in Date: 22nd - 23rd July 2019 Time : 10:30 AM - 3:00 PM Interview Venue: Kotak Mahindra Life Insurance Company Limited #337, 1st floor, 27th Main Road, HSR Layout Sector 2, Bangalore - 560 102 Landmark: Opposite to KLM MALL Contact Person: Priyanka Prakash Contact No. 022-66057050 Email ID - kli.jayshree-bhati@kotak.com","location":"Bangalore","experience":"0 - 1 Years"}]}