{"Walkins":[{"date":"12, 13, 14, 15, 16, 17, 18 - Apr - 2021","skills":"HR/ Recruitment, Talent Acquisition, Staffing","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Circle IT Solutions Private Limited, #501, Diamond Block, Lumbini Rockdale, Somajiguda, Hyderabad - 500 082.","phone":"9133366482","profile":" HR Recruiter & HR Staffing Analyst \nCircle IT Solutions Private Limited","description":"We are hiring HR Recruiter & HR Staffing Analyst (Junior level/ Mid-level/ Senior level) Educational Qualification: Any Graduate Work Experience: 1 to Years No freshers & No Remote Shift: Night Shift (6:30 PM IST to 3:30 AM IST Mon- Friday) Immediate Joinee Only need to apply Walk-in Date/ Time: 12th - 18th April 2021, 6.30 PM - 8.00 PM Venue Details- Circle IT Solutions Private Limited #501, Diamond Block, Lumbini Rockdale, Somajiguda, Hyderabad - 500 082. Contact - Mehaboob (9133366482) Please send your resumes to mehaboob@circleitsolutions.com Or call +91 9133366482  ","location":"Hyderabad","experience":"1-3Years"},{"date":"12, 13, 14, 15, 16, 17, 18 - Apr - 2021","skills":"US Staffing/ IT Recruitment","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Vegazva Engineering Private Limited, 411, Spaze I Tech Park, Tower A, Sector-49, Gurgaon - 122 018.","phone":"9354414708","profile":" US IT Recruiter (Fresher) \nVegazva Engineering Private Limited","description":"This is for those who are looking for a Great Opportunity to make a career in IT & Technology Recruitment/ HR ( US IT Recruiting) Looking for Graduated from 2018/ 2019/ 2020 Batches. MUST HAVE GREAT SPOKEN ENGLISH SKILLS Excellent Communication & Interpersonal skills Mandatory CAB FACILITIES WILL BE GIVEN TO EMPLOYEES LIVING IN GURGAON ONLY. Walk-in Date/ Time: 12th - 18th April 2021, 9.30 AM - 5.30 PM Venue Details- Vegazva Engineering Private Limited 411, Spaze I Tech Park, Tower A, Sector-49, Gurgaon - 122 018. Contact - Nitin Tyagi (9354414708)  ","location":"Gurgaon","experience":"0-1Years"},{"date":"12, 13, 14, 15, 16, 17, 18 - Apr - 2021","skills":"Data Entry, Back Office Operations, Banking Process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Cameo Corporate Services Limited, No.1, Subramanian Buliding, 5th Floor, Club House Road, Anna Salai, Chennai.","phone":"044-40020786","profile":" Data Entry Operators (Part Time) \nCameo Corporate Services Limited","description":"We have an Immediate Opening for Data Entry Operators for Banking Process at Chennai Location. Any Degree/ Diploma/ 10th/ 12th/ College Students Basic Typing Knowledge Male Candidate for Night Shift Work from Office, No Age Limits Job Responsibility: Bank Cheque Data Entry Typing speed and accuracy Flexible towards the working environment Adaptability towards the work culture Knowledge about banking industry Passion to achieve the Vision & Mission of company Office Days: Mon to Sat Sunday Holiday, 2nd and 4th Saturday Holiday Benefits for Employees: PF, ESIC, Bonus, Gratuity. Shift Timing: 9 PM to 1 AM (Night Shift Part Time) Working Hours: 4 Hours Walk-in Date/ Time: 12th - 18th April 2021, 10.00 AM - 3.00 PM Venue Details- Cameo Corporate Services Limited No.1, Subramanian Buliding, 5th Floor, Club House Road, Anna Salai, Chennai. Landmark:- Near Spencer Plaza, Opp. building to Senthur Hotel, Bank of Baroda Bank Contact - HR (044-40020786)  ","location":"Chennai","experience":"0-1Years"},{"date":"10 - Apr - 2021","skills":"MIS Preparation, Excel, MIS, VLOOKUP, MS Office","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Startek (Aegis Global Limited), Kudlu Gate, Bangalore - 560 068","phone":"7676470715","profile":" MIS Executive - Retail Operations \nAegis Customer Support Services Pvt. Limited","description":"Candidate should be Any Graduate with minimum 1 to 2 year of relevant experience Must have hands on experience working on Advance Excel & Google Sheets Hands on experience working on VBA Macros. Communication skills in English & Hindi are compulsory Complete Day shift Process. For those who are interested and eligible kindly walk-in for a F2F interview. Walk-in Date: 10th April 2021 Time: 10:30 AM- 5PM. Venue Details: Startek (Aegis Global Limited) Kudlu Gate, Bangalore - 560068 Contact Person: Likhith/ Sagar- 7676470715  ","location":"Bangalore","experience":"1-2Years"},{"date":"10 - Apr - 2021","skills":"HR/ Recruitment, Sourcing, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"HireWorks.in No. 3, Premalaya Building, 17th Street, Jai Nagar, Arumbakkam, Chennai - 600 106.","phone":"8248401569","profile":" HR Executive/ Recruiter \nSquare One Infosolutions Private Limited","description":"We Have huge Openings for HR Recruiter Only For Freshers Eligibility: Any Graduates can apply (2020 - 2021) MBA candidate would be preferable Candidates with Backlogs can also apply Complete Day Shift Salary : 12,000 CTC plus Incentives Job Responsibility- Sourcing candidates through Job portals, social platforms and other relevant resources End To End recruitment cycle Posting the job requirements on different portals Coordinating with the management on Profile feedbacks. Following up with the candidate till joining. Good communication skills. Should have a positive attitude and Analytical thinking Walk-in Date/ Time- 10th April 2021, 9.30 AM - 4.30 PM Venue Details HireWorks.in No. 3, Premalaya Building, 17th Street, Jai Nagar, Arumbakkam, Chennai - 600 106. Contact - Subash (8248401569)  ","location":"Chennai","experience":"0-1Years"},{"date":"10 - Apr - 2021","skills":"IT Recruitment, Sourcing, Relationship Management, Interviewing, Onboarding","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"HiringHut Solutions Private Limited, One Cowork, 2nd floor, Above KFC, Sony Signal, Koramangala, Bangalore - 34.","phone":"8951199357","profile":" IT Recruiter (Fresher) \nHiringHut Solutions Private Limited","description":"HiringHut Solutions Private Limited is looking for IT Recruiter-Fresher. Interested candidates can Walk-in to the mentioned address on the given date and time. Education: Any Bachelors Degree or MBA/ PGDM in HR Required Skills- Good command in verbal and written English communication skills Good Relationship Management skills with clients/ vendors Excellent analytical, presentation and interpersonal skills which includes email etiquettes Must have excellent Negotiation skills Roles & Responsibilities- Conversant with end-to-end recruitment process from sourcing to onboarding the candidates End to end recruitment; Includes, Sourcing the candidates from job portals, employee referrals, job postings in social media or job portals. And scheduling the candidates for interviews based on the panels availability and follow up for the feedback. Walk-in Date/ Time: 10th April 2021, 10.00 AM - 12.00 PM Venue Details- HiringHut Solutions Private Limited One Cowork, 2nd floor, Above KFC, Sony Signal, Koramangala, Bangalore - 34 Contact - Anju (8951199357)  ","location":"Bangalore","experience":"0-1Years"},{"date":"10 - Apr - 2021","skills":"IT Recruitment, Sourcing, Screening, Mass Mailing/ Job Posting","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"iSearch Consulting Services Pvt. Limited, Plot No. 26, 3rd Floor, 5th Main Road, Vijaya Nagar, Velachery, Chennai, Tamil Nadu - 600 042. Landmark - IDBI Bank Same Building - 3rd Floor","phone":"044-42122542","profile":" IT Recruiter/ HR Executive \niSearch Consulting Services Pvt. Limited","description":"Candidate must have strong Understanding of End to End Recruitment. Understanding of the Assessment of the Profile specific to the SDLC identifying the Candidates matching the Requirement fitment. Should be well versed with Mid Level - High Level Hiring. Good at sourcing and savy in Job Portals using the Features of the Same (Mass Mailing/ Job Posting) Should have excellent communication skills. Perks and Benefits - As Per Market Standards. Walk-in Date/ Time: 10th April 2021, 9.00 AM - 5.00 PM Venue Details- iSearch Consulting Services Pvt. Limited Plot No. 26, 3rd Floor, 5th Main Road, Vijaya Nagar, Velachery, Chennai, Tamil Nadu - 600 042. Landmark - IDBI Bank Same Building - 3rd Floor Contact No. 044-42122542  ","location":"Chennai","experience":"0-5Years"},{"date":"10 - Apr - 2021","skills":"Claims Processing, Health Claims, General Insurance Claims, Motor Claims","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Bajaj Capital Limited, Bajaj House, 5th FLoor, Building No. 97, Nehru Place, New Delhi","phone":"9717957906","profile":" Back Office/ Claims Executive \nBajaj Capital Limited","description":"Urgently looking for candidates with more than 6 months of experience in Claims (Motor Claims, Health Claims) Roles and Responsibilities- Complaints Handling from all sources with proper records & interim updates to clients till resolution simultaneously working on retention of clients within the set resolution TAT. Handling misappropriation cases ; highlighting to HR and take required course to take it resolution & maintain records. Providing assistance to Legal team for facilitating info as required in coordination with principal companies. Notify & Discuss all critical complaints with channel heads; Using complaint information to improve service and sales standards where appropriate. Ensuring all relevant records received including ISO certification. Accountable & Ensuring for Vigilant monitoring & resolution - e mails & calls received at Customer Care Contact email ids & direct connects (calls) maintaining a proper record. Facilitating required reports on set frequency and as & when required. Adherence to Internal Protocols, Processes & Hygiene. Working on assignments which may be allotted time to time Walk-in Date/ Time: 10th April 2021, 10.30 AM - 4.30 PM Venue Details- Bajaj Capital Limited, Bajaj House, 5th FLoor, Building No. 97, Nehru Place, New Delhi Contact - Anshuman (9717957906)  ","location":"Delhi","experience":"1-6Years"},{"date":"12, 13, 14, 15, 16 - Apr - 2021","skills":"C#, VB .Net, ASP .NET, HTML, AJAX, CSS, Web Services","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"CashLink Global Systems Private Limited, No. 5, Mezzanine Floor,Thapar House No. 37 (Old no., 43/44), Montieth Road, Chennai, Tamilnadu","phone":"Not Provided","profile":" .Net Developers \nCashLink Global Systems Private Limited","description":"Educational Qualification: BE/ B.Tech/ M.Tech or MCA Work Experience: Freshers/ 0 to 2 Years Location: Chennai (Egmore) Looking For Immediate Joinee (Male Freshers) Skills Required- Dotnet : C#, VB .Net Web Technology : ASP .NET, HTML, AJAX, CSS, Web Services Reporting Tools : Crystal Reports, SSRS Databases: SQL Server 2008 / 2012 / 2017, Oracle 11g Scripting, Markup Languages : JavaScript/ JQuery, XML, XAML Walk-in Date/ Time: 12th April - 16th April , 10.00 AM - 5.00 PM Venue Details- CashLink Global Systems Private Limited No. 5, Mezzanine Floor,Thapar House No. 37 (Old no., 43/44), Montieth Road, Chennai, Tamilnadu Contact - Sushma Yadav ( 8939875135 )  ","location":"Chennai","experience":"0-2Years"},{"date":"10 - Apr - 2021","skills":".Net, C# and/or ASP .NET, MVC, REST API, JSON, MS SQL/ SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Engro Technologies Private Limited, 4th Floor, Western Aqua Building, Opposite Tech Mahindra, Hitecth city, Hyderabad - 500 081","phone":"9121284559","profile":" .Net Developers \nEngro Technologies Private Limited","description":"Candidate must have strong working knowledge of .Net Proficient in {C# and/or ASP .NET}, with a good knowledge of their ecosystems Knowledge on Azure, MVC, REST API, JSON and knowledge on Hangfire and Autofac (optional) Knowledge on Redis and Solr HTML, CSS, JavaScript Strong understanding of object-oriented programming Skill for writing reusable libraries Experience with MS SQL/ SQL Server and MongoDB (optional) Experience with popular web application frameworks Familiarity with Windows Presentation Framework (optional) Knack for writing clean, readable, and easily maintainable code Understanding of fundamental design principles for building a scalable application Experience creating database schemas that represent and support business processes Basic understanding of Common Language Runtime (CLR), its limitations, weaknesses, and workarounds Experience implementing automated testing platforms and unit tests Knowledge on code versioning tools. Work Experience: 0 - 4 Years Notice period : Immediate - 15 days Walk-in Date/ Time: 10th April 2021, between 9.30 AM - 12.30 PM Venue Details- Engro Technologies Private Limited, 4th Floor, Western Aqua Building, Opposite Tech Mahindra, Hitecth city, Hyderabad - 500 081  ","location":"Hyderabad","experience":"0-4Years"},{"date":"8, 9, 10, 12, 13, 14, 15, 16 - Apr - 2021","skills":"Office Assistance, Front Desk, Office Administration, Front Office/ Receptionist Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"A-129/2, NIRANKARI COLONY, NEW DELHI, NORTH WEST DELHI, DELHI-110009","phone":"9311273580","profile":" Front Desk Executive (Female Only) \nCandid Optronix Private Limited","description":"We are looking for a pleasant Front Desk Executive to undertake all receptionist and clerical duties at the desk. You will be the face of the company for all visitors and will be responsible for the first impression we make. Roles and Responsibilities Greet and welcome guests as soon as they arrive at the office Answer, screen, forward and record incoming phone calls Ensure reception area is tidy and presentable, with all necessary stationery and material (e.g. pens, forms and brochures) Update calendars and schedule meetings Maintain the data on Excel of all the customers & visitors Kindly call in between 11:30 am to 4:30 pm for interview to be scheduled Contact Person: Ms. Anu (HR Head) Contact no- 9311273580 Please avoid calling on weekly off days  ","location":"Delhi","experience":"1-3Years"},{"date":"8, 9, 10, 11, 12, 13, 14, 15, 16, 17 - Apr - 2021","skills":"Software Testing, Black Box Testing, Integration Testing, Manual Testing, Regression Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Srammram Technologies & Resources (OPC) Pvt. Limited, # 12/12A, C2, Second floor, Srinithi Apartments, Kandigai Street, Korattur, Chennai - 600 076.","phone":"9094102725","profile":" Software Testing Engineer \nSrammram Technologies & Resources (OPC) Pvt. Limited","description":"Candidate must have strong knowledge with hands on experience in software testing. Fair knowledge on Performance testing, Jmeter, Page speed/ load testing tools, Online emulators/ simulators. Knowledge on mobile App testing. Should understand the business flow as instructed to them and verify that the projects abide to the requirements. Ability to think of all scenarios that real users of the applications will face. To be able to analyze requirements from users perspectives. To be proactive to communicate the issues and get them resolved. To develop test cases and prioritize testing activities. Should have good interpersonal skill and problem solving skills. Should have excellent communication skills Should be Independent, self-motivated and problem-solving skills Capable of managing multiple complex tasks. Walk-in Date/ Time: 8th April - 17th April 2021, 9.30 AM - 5.30 PM Venue Details- Srammram Technologies & Resources (OPC) Pvt. Limited # 12/12A, C2, Second floor, Srinithi Apartments, Kandigai Street, Korattur, Chennai - 600 076. Landmark: Korattur DRJ Hospital - WAter Canal Road - 4th Left -Kandigai Street Contact- Rameshkannan ( 9094102725 )  ","location":"Chennai","experience":"2-5Years"},{"date":"8 - Apr - 2021","skills":"Core Java, Multithreading, Arrays, Oops, Exceptions, Collections, Frameworks","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Sun Technology Integrators Pvt. Limited, No. 496, 5th Block,1st Stage, HBR Layout (a stop ahead from Nagawara towards to K. R. Puram) Bangalore - 560 043","phone":"8861722337","profile":" Trainee Java Developer \nSun Technology Integrators Private Limited","description":"We have openings for Trainee Java Developer position. Please share your updated CV to nandinis@suntechnologies.com and can attend the face to face interview on Thursday (8-4-2021) between 11:00 AM to 3:00 PM, if your candidature matches below the criteria's . Call letter is not mandatory. Carry your updated CV without fail. Please do not share your CV if you are out of Bangalore or unable to take up the interview or if your candidature does not suit's our requirement criteria's. Venue Details- Sun Technology Integrators Pvt. Limited No. 496, 5th Block,1st Stage, HBR Layout (a stop ahead from Nagawara towards to K. R. Puram) Bangalore - 560 043 Contact : Nandini S Tel: 8861722337 Qualification : BE/ B.Tech/ M.Tech/ ME/ M.Sc (ECE/ Telecommunications/ CSE/ ISE/ IT), MBA (IT) , MCA (2019 and 2020) Year of passing: 2019 and 2020 only. 60% or above marks only in Degree. We are not considering 10th or PUC marks. We will not consider Mechanical ,Electrical, Aeronautical and Civil branch and also who have done only Diploma freshers. 2016/ 2017/ 2018 passed out freshers are not allowed. Candidate should have knowledge in Core Java, Multithreading, Arrays, Oops, Exceptions, Collections, Frameworks, Data Structures, Design patterns etc. Java related course/ certification/ training/ internship is mandatory (who are already completed). We will not consider who are still undergoing/pursuing training. Must be able to join as soon as possible. Should have good communication skills Should be able to attend F2F interview. Male and Female candidates can attend the interview. Kindly ignore this mail who are already attended the interview with Sun Technologies for Java Developer position. If attended for other openings can attend on Thursday(8-4-2021) between 11:00AM to 3:00PM.We will not allow the candidates if they attend the interview second time for Java position. Please ensure to adhere to the below mentioned points considering the current pandemic: 1. Candidate with temp more than 99F or coughing will not be allowed. 2. Mask is mandatory throughout the exam. 3. Candidate should maintain social distancing throughout the interview process. 4. Candidate should not form groups out of office before or after the interview.  ","location":"Bangalore","experience":"0-1Years"},{"date":"7 - Apr - 2021","skills":"IT Recruitment, Sourcing, Screening, Shortlisting","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Aapro HR Solutions, 118A, Jaina Tower II, District Center, Janakpuri, New Delhi - 110 058","phone":"9310692491","profile":" HR Recruiter - IT \nAapro HR Solutions","description":"-Females preferred with at least Graduation -Must have prior experience of IT Recruitment -Must be aware of various IT Positions. -Must be from West Delhi, nearby to Janakpuri. -Freshers can also apply Job Responsibility- -Be responsible for handling full end-to-end recruitment process. -Understand JD of clients and draft it for the candidates, mass mail, post jobs, source, screen -Follow up with the prospective candidates from different job portals & social media. Walk-in Date/ Time: 7th April 2021, between 9.30 AM - 5.30 PM Venue Details- Aapro HR Solutions 118A, Jaina Tower II, District Center, Janakpuri, New Delhi - 110 058 Contact - Riya Mishra (9310692491) Email- riya@aapro.in  ","location":"Delhi","experience":"0-2Years"},{"date":"7 - Apr - 2021","skills":"Non Voice Process, Back Office Operations, Payments Posting","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Inventurus Knowledge Solutions Pvt. Limited, NSL Arena Tower-1, Habsiguda, Hyderabad, Telangana - 500 013.","phone":"8686273622","profile":" Non Voice Process - Backend Associate \nInventurus Knowledge Solutions Pvt. Limited","description":"Process Name: Revenue Cycle Management -PP (Payments Posting) Qualification: Any Graduate/ PG (Graduation certificate is mandatory) Salary: 1.90 Lakhs per annum Shifts: Dayshifts Walk-in Date/ Time: 7th April 2021, 9.30 AM - 1.00 PM Venue Details- Inventurus Knowledge Solutions Pvt. Limited NSL Arena Tower-1, Habsiguda, Hyderabad, Telangana - 500 013. Contact - Syed (8686273622) Basic requirements for the walk-in interview: Updated CV is mandatory. Please carry a copy of your Passing Certificate/ Degree Certificate/ All semester mark sheet hardcopies  ","location":"Hyderabad","experience":"0-1Years"},{"date":"7, 8 - Apr - 2021","skills":"Non Voice Process, Back Office Operations, Claims Process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Firstsource Solutions Limited, Floor 3, Tower 5A & B, Pritech II SEZ (Ecospace Park), Sarjapura Outer Ring Road, Varthur Hobli, Bangalore - 560 103","phone":"9080340763","profile":" Non Voice Process Associate (Fresher) \nFirstsource Solutions Limited","description":"A claims examiner needs to analyse multiple documents / contracts and decide to pay / deny the claim submitted by member or providers with respect to client specifications. The claims examiner should also route the claim to different department or provider / member for any missing information that required for claims adjudication. The claims needs to be completed adhering to required TAT and quality SLA. Minimum Eligibility: UG Graduation (Any discipline - 3 years) Exclude BE, B.Tech Required Key Skills: Good Communication Skills Listening & Comprehension Good typing knowledge/ Flexible to work any shifts and timings Walk-in Date/ Time: 7th, 8th April 2021, 10.30 AM - 1.30 PM Venue Details- Firstsource Solutions Limited Floor 3, Tower 5A & B, Pritech II SEZ (Ecospace Park), Sarjapura Outer Ring Road, Varthur Hobli, Bangalore - 560 103 Contact - Aarif HR ( 9080340763 ) Note: Bring your educational documents, Pan card, Aadhar card (both original and xerox)  ","location":"Bangalore","experience":"0-1Years"},{"date":"7 - Apr - 2021","skills":"Background Verification, Coordination, Documentation, HR Operations","qualification":"Diploma, B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Voltech HR Services Private Limited, No. 2/429, Voltech Eco Tower, Mount Poonamallee Road, Ayyappanthangal, Chennai, Tamil Nadu - 600 056","phone":"08939837005","profile":" Background Verification Executive \nVoltech HR Services Private Limited","description":"Looking for Fresher / Experienced candidates in BGV Process. Educational Qualification: Any Degree/ Diploma Work Experience: 1 to 3 Years BGV in education / employment department. Walk-in Date/ Time- 7th April 2021, 10.00 AM - 5.30 PM Venue Details: Voltech HR Services Private Limited No. 2/429, Voltech Eco Tower, Mount Poonamallee Road, Ayyappanthangal, Chennai, Tamil Nadu - 600 056. Email- careers@voltechgroup.com Contact - Praveen Kumar (08939837005)  ","location":"Chennai","experience":"1-3Years"},{"date":"5, 6, 7 - Apr - 2021","skills":"HR, Attendance, Recruitment, Manpower Handling, Contact Labour Management","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Sustainable Skill Capital Private Limited, Ion House, C-72 & 83, Devasandra Industrial Area ITI Ancilldry Industrial Estate, ITPL Whitefield Road Bengaluru - 560 048","phone":"9731284847","profile":" HR Executive \nSustainable Skill Capital Private Limited","description":"Candidate should have minimum 3 years of experience in relevant field Only Male Candidates need to apply Ready to Travel monthly 2 to 3 days Roles and Responsibilities- Attendance, Recruitment, Manpower Handling, Contact Labour Management, ESIC and UAN Generation, Statutory Compliance Perks and Benefits- PF, ESIC and Bonus Walk-in Date/ Time: 5th April - 7th April 2021, 9.30 AM - 5.30 PM Interview Venue- Sustainable Skill Capital Private Limited Ion House, C-72 & 83, Devasandra Industrial Area ITI Ancilldry Industrial Estate, ITPL Whitefield Road Bengaluru - 560 048 Mahadevpura Post - (First left from Phoenix mall market city) Contact - GOPAL (9731284847)  ","location":"Bangalore","experience":"3-8Years"},{"date":"6, 7 - Apr - 2021","skills":"Java & SQL","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Rootware Technologies, 917/ 918, Clover Hills Plaza, NIBM - Undri Road, Kondwa. Pune - 411 048","phone":"Not Provided","profile":" Software Engineer (Java/ SQL) Freshers \nRootware Technologies","description":"Walk-in Interview for Software Engineer/ IT Freshers at Rootware Technologies Educational Qualification: B.Sc/ BCA/ MCA/ B. Tech Experience: 6 Months to 2 years of experience preferred Must have good knowledge of Java & SQL Walk-in Date/ Time: 6th April - 7th April 2021, 10.00 AM - 3.00 PM Venue Details- Rootware Technologies, 917/ 918, Clover Hills Plaza, NIBM - Undri Road, Kondwa. Pune - 411 048, Maharashtra. Contact - Aarti  ","location":"Pune","experience":"0-2Years"},{"date":"5, 6, 7 - Apr - 2021","skills":"Backend Process, Investment Banking, Mutual Funds, Financial Services, Non Voice Process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"KFin Technologies Private Limited, Selenium Building, Tower-B, Plot No. 31 & 32, Financial District, Nanakramguda, Serilingampally, Hyderabad, Rangareddi, Telangana.","phone":"Not Provided","profile":" Backend Process Executive \nKFin Technologies Private Limited","description":"Urgent openings for Mutual Fund back-end operations. Looking for immediate joiners with below skill sets- Experience in Back-end Operations or transaction processing Good in MS-Excel (Vlook up, Pivot and other shortcut keys) Must have excellent communication skills Preferably from BFSI /Banking/ Investment banking/Equity/ Financial industry experience Willing to work from office and flexible for rotational shifts Job Location: Gachibowli (Nanakramguda) in Hyderabad Walk-in Date/ Time: 5th - 7th April 2021, 10.30 AM - 3.00 PM Venue Details- KFin Technologies Private Limited Selenium Building, Tower-B, Plot No. 31 & 32, Financial District, Nanakramguda, Serilingampally, Hyderabad, Rangareddi, Telangana. Contact Person- Sangeeta Mourya  ","location":"Hyderabad","experience":"1-3Years"},{"date":"5, 6, 7, 8, 9, 10 - Apr - 2021","skills":"HR/ Recruitment, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Volantis Technologies Private Limited, #940, 2nd Floor, NGR Arcade, 16th Main, BTM Layout \u0096 2nd Stage, Bangalore -560078","phone":"7483535774","profile":" Technical/ IT Recruiter \nVolantis Technologies Private Limited","description":"Candidate must have good exposure to Recruitment Process. Experience/ Knowledge in Recruitment Life Cycle from Sourcing to Selection. Sourcing profiles through Job Portals, Networking, Headhunting & Social Networking Sites. Should have Good Communication and Presentation Skills Must be target driven and must be able to thrive in a time pressured environment. Must possess strong presentation skills and be able to communicate professionally. Work Experience : Freshers/ 0 - 5 Years Location : Bangalore (BTM Layout) Industry : Recruitment/ Staffing If you are interested for the above role, share your profile with anwesha.p@volantis.com /deepak.b@volantis.com or drop in to our office to below address Walk-in Date/ Time: 5th to 11th April 2021, 9.00 AM - 6.00 PM Venue Details- Volantis Technologies Private Limited #940, 2nd Floor, NGR Arcade , 16th Main, BTM Layout \u0096 2nd Stage , Bangalore -560078 Landmark: Near Udupi Garden Signal Contact Person: Anwesha Padhy (7483535774)/ Deepak B (7899322225)  ","location":"Bangalore","experience":"0-5Years"},{"date":"5, 6, 7, 8, 9, 10, 12, 13 - Apr - 2021","skills":"MCV C# Jquery VB .Net Asp .Net","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Nimbus Adcom Private Limited, E-89, E Block, Sector 63, Noida, Uttar Pradesh - 201 301","phone":"9818567555","profile":" .Net Developer \nNimbus Adcom Private Limited","description":"Skills Required :- MCV C# Jquery VB .Net Asp .Net Work Experience :- 1 to 2 years Job Location :- Noida Sector-63 Walk-in Date/ Time: 5th April - 13th April , 11.00 AM - 4.00 PM Venue Details- Nimbus Adcom Private Limited E-89, E Block, Sector 63, Noida, Uttar Pradesh - 201 301. Contact - Sukhpreet Singh (9818567555) Share CV at sukhpreet@nimbushire.com  ","location":"Noida","experience":"1-2Years"},{"date":"3, 5, 6, 7, 8, 9 - Apr - 2021","skills":"Angular, Java Script, JQuery, HTML, CSS","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Suvarna Technosoft Private Limited, South India Shopping Mall Building, 7-1-617/A, 3rd floor, 305 Imperial Towers Ameerpet Road, Ameerpet Hyderabad, Telangana - 500 073.","phone":"8143943402","profile":" Angular Developer \nSuvarna Technosoft Private Limited","description":"Candidate should have good experience with Angular, Java Script, JQuery, HTML, CSS Must be a critical thinker and problem-solving skills. Should have good time-management skills. Great interpersonal and communication skills. Walk-in interview from 3rd April - 9th April 2021, between 10.30 AM - 5.30 PM Address- Suvarna Technosoft Private Limited South India Shopping Mall Building, 7-1-617/A, 3rd floor, 305 Imperial Towers Ameerpet Road, Ameerpet Hyderabad, Telangana - 500 073. Contact - Ganesh (8143943402)  ","location":"Hyderabad","experience":"0-1Years"},{"date":"2 - Apr - 2021","skills":"Non IT Recruitment, Lateral Hiring/ Volume Hiring/ Mass Hiring, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"1mg.Com, 5th Floor, Tower B, Presidency Building, Sector 14 Gurgaon. Near Kalyani Hospital","phone":"Not Provided","profile":" HR Recruiter - Non Technical \n1mg.Com","description":"Candidate should be Any Graduate/ Post Graduate (HR) with 1 to 6 years of experience in BPO Hiring, Non IT Recruitment, Lateral Hiring/ Volume Hiring/ Mass Hiring, Talent Acquisition, End to End Recruitment process. Must have excellent communication skills. Job Type: Contractual Role Work Location: Gurgaon Salary: ₹ 2,50,000 - 4,25,000 P.A. Walk-in Date : 2nd April, 2021 Time: 12:00 PM - 2:00 PM Venue Details: 1mg.Com 5th Floor, Tower B, Presidency Building, Sector 14 Gurgaon. Near Kalyani Hospital Nearest Metro : MG Road Contact Person : Harshita Pradhan/ Aashika Jain  ","location":"Gurgaon","experience":"1-6Years"},{"date":"2 - Apr - 2021","skills":"General Banking Operations, Branch Management, Customer Service","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"IndusInd Bank Limited, 2nd floor, Parkar House, Near Panchvati Circle, Law Garden Road, Ahmedabad - 380 007.","phone":"Not Provided","profile":" Deputy Branch Manager (Operations) \nIndusInd Bank Limited","description":"Candidate should have Graduation/ MBA (Preferred) with minimum of 4 to 6 years of experience in General Banking Operations, with reasonable exposure to Equation. Thorough understanding of Bank Operations, Regulatory Framework (KYC, AML etc). Good communication skills are required. Job Responsibility- Manage & Supervise operations in the Branch with the objective of delivering timely, efficient & productive processing service within the statutory, regulatory and operation norms of the Bank. Monitor and track daily responsibilities, oversee processing of transactions, manage ATMs/ Cash/ lockers, authorize and verify branch instructions, monitor adherence to processes, resolve escalated issues In Order To ensure timely and effective transaction execution. Operations and Systems Management Track market and regulatory changes, monitor and upgrade existing system, implement change, ensure systems back-up , align system with environment changes In Order To ensure continuity & adequacy of operations. Customer Service Set service standards, ensure redressal of customer grievances, monitor customer services by team, address escalated issues In Order To ensure smooth relationship with clients. People Management Coach, counsel, guide and motivate team members, set targets, monitor performance, define work processes and systems In Order To create a performing team and conducive work environment Walk-in Date/ Time: 2nd April 2021, 9.30 AM - 5.30 PM Venue Details- IndusInd Bank Limited, 2nd floor, Parkar House, Near Panchvati Circle, Law Garden Road, Ahmedabad - 380 007. Contact Person- Aditya Davda  ","location":"Ahmedabad","experience":"4-6Years"},{"date":"2, 3, 5, 6, 7, 8, 9, 10 - Apr - 2021","skills":"Java, Spring, Spring Boot, Hibernate, Relational Databases","qualification":"B.E./B.Tech","address":"Timing Technologies India Private Limited, 3rd Floor, Cyber View Tower, Hitech City, Madhapur, Hyderabad - 500 081.","phone":"8142222810","profile":" Java Developer \nTiming Technologies India Pvt. Limited","description":"Educational Qualifications: BE/ B.Tech Work Experience: 2 - 5 Years Job Location: Hyderabad Candidate must have strong experience in Java and related technologies framework like Spring, Spring Boot, Hibernate. Experience in Relational Databases, SQL technologies (MySQL/ MS SQL). Experience in Web Servers Apache Server, Application Server Apache Tomcat. Good understanding of design and development patterns and Object Oriented analysis. Hands-on experience in micro-services development with Spring-Boot Experience working with RESTful APIs etc. Test tools like JUnit. Job Responsibilities- Contribute to all phases of the development lifecycle Write well designed, testable, efficient code Ensure designs are in compliance with specifications Prepare and produce releases of software components Support continuous improvement by investigating alternatives and technologies and presenting these for architectural review. Walk-in Date/ Time: 1st - 10th April 2021, 10.30 AM - 3.30 PM Address- Timing Technologies India Private Limited, 3rd Floor, Cyber View Tower, Hitech City, Madhapur, Hyderabad - 500 081. Contact - Hema Naik (8142222810)  ","location":"Hyderabad","experience":"2-5Years"},{"date":"2 - Apr - 2021","skills":"Back Office/ Backend Operations, Transaction Processing, Non Voice Process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Virtual Walk-in Link- https://genpact.zoom.us/j/98891540028","phone":"Not Provided","profile":" Banking Transaction Executive \nGENPACT India Private Limited","description":"We are inviting applications for the role of Process Associate Non voice Process (Banking) Minimum Qualifications: Graduation Work Experience: Freshers Preferred requirement - Good communication and accounting skills Should be flexible with night shifts Walk-in Interview on 2nd April 2021 Timings: from 11.00 AM - 2.00 PM onwards Virtual Link- https://genpact.zoom.us/j/98891540028 Guidelines: Please make sure you have connected Audio and Video both Be on Mute while joining Keep your Updated Resume handy  ","location":"Hyderabad","experience":"0-1Years"},{"date":"10 - Apr - 2021","skills":"Microsoft .Net, C#/ VB .Net and ASP .Net","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Join from comfort of your home. Zoom ID - 956-748-03367","phone":"Not Provided","profile":" .Net Developer \nAptify Software Development - SIPL","description":"We are looking for talented .Net Developers to work within the Client Services on multiple product lines, ensuring that we deliver quality software that meets the business requirements of our organization and its customers. This position will be located in our Pune Office. Candidate should have Bachelors or Masters degree in Computer Science or relevant Engineering Degree with 1 to 3 years of experience or knowledge of Microsoft .NET Technologies using C#/ VB .Net and ASP .NET on Windows and Web Application Development. Must have thorough in SDLC, OOPS and OOAD principles. Experience/ Knowledge of new technologies like HTML5, JQuery/ JavaScript preferred. Should have good knowledge of Web API and Web Services. Solid Knowledge of RDBMS, preferably with Microsoft SQL 2008 onwards. Good to have knowledge of any JS framework Good & Effective Communication Skills. Client handling experience will be an added advantage. Ability to work well in a team and independently while tackling complex problems. Ability to learn and work with cutting edge technologies. Virtual Walk-in Drive - on 10th April 2021, between 10.00 AM - 2.00 PM Join from comfort of your home. Zoom ID - 956-748-03367  ","location":"Pune","experience":"1-3Years"},{"date":"1 - Apr - 2021","skills":"Branch Operations, Lead Generation, After Sales Service, Business Development","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"India Infoline Finance Limited, #21, First Floor, Near Old Police Station, Ramamurthy Nagar Main Road, Kodandarama Reddy Layout, Vijinapura, Bangalore - 560 016","phone":"8779256547","profile":" Branch Manager/ Gold Appraiser \nIndia Infoline Finance Limited","description":"Graduation is mandatory Fresher Graduates can also apply 1) Branch Manager Candidate should be able to manage the portfolio for Gold Loan/financial business of its branch. Able to handle all the branch level activities for ensuring business growth. Systematic planning abilities are required for smooth functioning of the branch & for developing cohesiveness within the company and co-workers. Coaching, mentoring and training employees and providing them with timely feedback on their performance Maintaining quality of the business by tracking & controlling the team Preparing reports related to branch functioning and its performance. Guiding and motivating subordinates in achieving their goals 2) Gold Appraiser To ensure 100% right valuation - capturing right cartage, proper stone deduction etc. Adhering to high ethical standards and comply with all the laid down processes / policies - KYC adherence, maintaining all important registers etc. To provide high quality customer service, prompt resolution of queries pre & post loan disbursal. Supporting branch staff in business development activities & helping to achieve branch targets. Interested candidates can directly visit at the below mentioned address Or share their resume at nineesh.n@iifl.com & gunavathi@iifl.com Walk-in Date: 1st April 2021 from 9.30 AM - 4.30 PM onwards Venue Details- India Infoline Finance Limited #21, First Floor, Near Old Police Station, Ramamurthy Nagar Main Road, Kodandarama Reddy Layout, Vijinapura, Bangalore - 560 016  ","location":"Bangalore","experience":"0-5Years"},{"date":"1 - Apr - 2021","skills":"Customer Support, International Voice Process, Customer Service","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Firstsource Solutions Limited, 3rd floor, Recruitment Center, 4th Campus 5A/B, Pritech II SEZ, RMZ Ecospace Internal Road, Adarsh Palm Retreat, Bellandur, Bengaluru, Karnataka - 560 103.","phone":"8348650044","profile":" Non Voice Process - Associates \nFirstsource Solutions Limited","description":"Firstsource Solutions Limited is hiring for the role of Customer Service Associate for an International Non Voice Process. Minimum Qualification- Any Non Technical Graduate Work Experience: 0 - 2 Years Job Location: Bangalore Walk-in Date/ Time: 1st April 2021, between 11.00 AM - 3.00 PM Venue Details- Firstsource Solutions Limited 3rd floor, Recruitment Center, 4th Campus 5A/B, Pritech II SEZ, RMZ Ecospace Internal Road, Adarsh Palm Retreat, Bellandur, Bengaluru, Karnataka - 560 103. Contact - Poushali (8348650044) Please write 'POUSHALI' on your resume and walk-in to office for your interview  ","location":"Bangalore","experience":"0-2Years"},{"date":"1 - Apr - 2021","skills":"Sales/ Business Development, Customer Relationship, Retail Sales, Automobile Sales","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Cars24 Services Private Limited, 3, Najafgarh Road, DLE Industrial Area, Kirti Nagar, New Delhi, Delhi - 110015","phone":"9311370849","profile":" Retail Associate \nCars24 Services Private Limited","description":"Candidate should be Any Graduate/ Post Graduate with 1 to 6 years of experience in Sales/ Business Development, Customer Relationship, Retail Sales, Automobile Sales, etc. Must have excellent communication skills. Job Responsibilities- 1) Ensuring that all customers receive excellent service through direct salesmanship and prompt and courteous service. 2) Assisting customers with questions & needs. 3) Cultivating successful relationships with retail customers. 4) Completing each transaction in a quick and efficient manner. 5) Handling all store operations 6) Identifying customer requirements and assisting customers with purchase decisions. 7) Assisting in physical inventory counts. 8) Making sure that customers paperwork is completed efficiently. 6 Days Working Perks and Benefits + Fixed Salary + Incentives Upto 10,000 Walk-in Date : 1st April 2021 (Thusrday) Time of reporting: 10:00 AM - 3:00 PM Venue Details: Cars24 Services Private Limited 3, Najafgarh Road, DLE Industrial Area, Kirti Nagar, New Delhi, Delhi - 110015 Map : https://goo.gl/maps/Z14kXgGnddwy1JA47 Contact Person:-Lovely Razak Contact no: 9311370849 Also, share your CV at: lovely.razak@cars24.com  ","location":"Delhi","experience":"1-6Years"},{"date":"1 - Apr - 2021","skills":"Customer Support, Voice Process, Online Lead Generation, Chat Process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Alt F4 Co Working, 4th Floor, JMD Empire Square Mall, MG Road, Opposite Sikanderpur Metro Station, Gurgaon","phone":"Not Provided","profile":" Voice/ Chat Process Associate \nLenskart Solutions Private Limited","description":"Lenskart Solutions Private Limited is Hiring Freshers and Experienced candidates for the below process: 1) Voice Process 2) Chat Process Key Requirements: Candidate must-Have Laptop/ Desktop and Wifi connection Should be comfortable to travel/ relocate to Gurgaon Must have good communication skills Job Responsibilities: Manage large amounts of customer queries and in a timely manner Follow communication scripts when handling different topics. Identify customer's needs, clarify information, research every issue, and provide solutions and/or alternatives. Build sustainable relationships and engage customers by taking the extra mile. Keep records of all conversations in our call center database in a comprehensible way. Meet personal/ team qualitative and quantitative targets Virtual Walk-in on 1st April 2021, between 11.00 AM - 11.30 AM Walk-in Venue: Zoom ID - 779 495 4869 Password - LEO02 Contact Person- Bhawna/ Gunjan  ","location":"Gurgaon","experience":"0-5Years"},{"date":"29 - Mar - 2021","skills":"HR/ Recruitment, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Voltech HR Services Private Limited, No. 2/429, Voltech Eco Tower, Mount Poonamallee Road, Ayyappanthangal, Chennai, Tamil Nadu - 600 056.","phone":"08939837005","profile":" HR Executive/ Recruiter \nVoltech HR Services Private Limited","description":"Need Fresher or Experienced Professionals for HR/ Recruitment Executive position. Candidate should be Any Post Graduate/ Preferably MBA (HR) IT or Non It recruitment experience is preferable Must have Good Communication skills Walk-in Date/ Time: 29th March 2021, 9.30 AM - 3.30 PM Venue Details: Voltech HR Services Private Limited No. 2/429, Voltech Eco Tower, Mount Poonamallee Road, Ayyappanthangal, Chennai, Tamil Nadu - 600 056. Email- careers@voltechgroup.com Contact - Praveen Kumar Srinivasan ( 08939837005 )  ","location":"Chennai","experience":"0-1Years"},{"date":"30 - Mar - 2021","skills":"Backend Operations, Claim Processing, Non Voice Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"CXC Infotech Private Limited, 4th Floor, H 70, Sector 63, Noida. Near Electronic City, Metro Station","phone":"Not Provided","profile":" Claim Processing Executive \nCXC Infotech Private Limited","description":"Urgent Requirement of Claim Associates with one of the largest US HEALTHCARE companies. Any Graduate/ Post Graduate with good English communication skills Good English typing speed > 30 Words per Minute Work Experience: 0 to 1 Years Location: Noida (Applicants from Noida/ Ghaziabad preferred) Day Shift. This is a NON VOICE PROCESS. Currently Working from Office only 5 Day Working. Walk-in Date/ Time: 30th March 2021, 9.30 AM - 3.30 PM Venue Details- CXC Infotech Private Limited, 4th Floor, H 70, Sector 63, Noida. Near Electronic City, Metro Station  ","location":"Noida","experience":"0-1Years"},{"date":"29, 30 - Mar - 2021","skills":"HR Administration/ HR Functions, Office Administration","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Galore Networks Private Limited, L1, RAM, Industrial Estate, Guindy, Chennai - 600 032.","phone":"9176609603","profile":" HR Generalist/ Executive \nGalore Networks Private Limited","description":"We have an excellent opportunity for the position of HR Generalist in our Company for that details are follows, Educational Qualification: MBA/ BBA, Work Experience: 1 - 3 years Male Candidates only Eligible. Salary: Attractive Salary + Other Benefits. Work Location: Chennai (Guindy). Job Responsibility: Candidate Need to handle end to end recruitment Document Maintaining. Need to have Good experience in Recruitment Good communication skills ( Both oral and written) Good Knowledge in MS Excel. Attendance Maintenance. On-Boarding PF & ESI Number Creation & Uploading Statutory compliance Walk-in Date/ Time: 29th - 30th March 2021, 11.30 AM - 2.00 PM Venue Details- Galore Networks Private Limited L1, RAM, Industrial Estate, Guindy, Chennai - 600 032. Contact Person- Udaya (9176609603)  ","location":"Chennai","experience":"1-3Years"},{"date":"29 - Mar - 2021","skills":"IT Recruitment, Sourcing, IT Staffing, Screening","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Chain-sys India Private Limited, No.85, Poniamman Nagar Ayanambakkam Chennai - 600 095.","phone":"Not Provided","profile":" HR/ Talent Acquisition Executive \nChain-Sys India Private Limited","description":"Educational Qualification: Any Graduate/ MBA HR Work Experience: 1 to 3 years Job Location: Chennai Candidate must have strong communication and negotiation skills. Design and update job descriptions in Job portals. Understand the requirement and client's need and shortlist the suitable Candidates based on technological skills. Working on different Job portal such as Naukri, Monster, LinkedIn etc. Coordinate with the candidates for the interviews timings and joining formalities. Should have good learning skills. Walk-in Date/ Time: 29th March 2021, 9.30 AM - 2.00 PM Venue Details- Chain-sys India Private Limited No.85, Poniamman Nagar Ayanambakkam Chennai - 600 095. Contact Person- Sathish  ","location":"Chennai","experience":"1-3Years"},{"date":"29 - Mar - 2021","skills":"Email Support, Blended Process, Customer Service, Problem Solving skills","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Tech Mahindra Limited, 2nd Floor Delta One Giga Space IT Park Internal Road Viman Nagar, Pune - 411014","phone":"9096561522","profile":" Email_ Support Executive \nTech Mahindra Limited","description":"Educational Qualification- Any Graduation Work Experience- Minimum 1year Age Criteria - 18 to 35 years Required Key skills- Proven customer support experience or experience as a client service representative Excellent English communications skills Ability to listen and active problem solving skills Good interpersonal skills Ability to handle pressure Responsibilities and Duties- The primary responsibilities of a Customer Service Representative would be: Handling customer queries. Have experience of emails or chats Identify and assess customers needs to achieve satisfaction Build sustainable relationships and trust with customer accounts through open and interactive communication Walk-in Date/ Time: 29th March 2021, 10.00 AM - 4.00 PM Venue Details- Tech Mahindra Limited 2nd Floor Delta One Giga Space IT Park Internal Road Viman Nagar Pune - 411014 Contact- Shabana - 9096561522 (Call/ WhatsApp) Nilesh -9893224757 (Call/ WhatsApp) Email ID- SM00719332@techmahindra.com  ","location":"Pune","experience":"1-6Years"}]}