{"Walkins":[{"date":"23, 24, 25 - Oct - 2019","skills":"Automation Testing, Test case writing, Test Execution and tools like Selenium","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Xybion (India) Private Limited, 117, Ratha Tek Towers, 1st Floor, OMR, Okkiyam Thoripakkam, Chennai - 600 097","phone":"Not Provided","profile":"Automation Tester \nXybion (India) Private Limited","description":"Candidate should be BE/ B.Tech or MCA with 2 to 5 years of experience in Automation Testing Having experience in test case writing, authoring, execution is preferred Good knowledge in tools like Selenium is preferred Only Immediate Joiner required Walk-in Date/ Time: 22nd October - 25 October , 12 PM onwards Interview Venue: Xybion (India) Private Limited 117, Ratha Tek Towers, 1st Floor, OMR, Okkiyam Thoripakkam, Chennai - 600 097 Contact Person- SUGANYA","location":"Chennai","experience":"2 - 5 Years"},{"date":"23, 24, 25 - Oct - 2019","skills":"Software Testing, Manual Testing, Test Plan Preparation, Test Scenarios, Regression Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Wipro Olympia Technology Park, Altius Block, Guindy, Chennai, Tamil Nadu - 600 032.","phone":"044-61454000","profile":"Manual Testing Engineer \nWipro HR Services (India) Private Limited","description":"Candidate should be BE/ B.Tech (CS, IT, ECE) or MCA with 4 to 6 years of work experience in Testing-Manual, SQL Query write ups-Multiple complex Joints creation. Should able to interpret Clients requirement and provide analysis & updates (configuration) in the system. Should have experience in benefits administration preferably in Health or Insurance sector. Experience in creating test plans, identifying test cases and perform test execution. Ability to understand and build logics in a coding language.. Experience in relational databases, ability to write SQL queries. Experience in MS Office tools specifically MS Excel. Experience with project-based work structures, project lifecycle models, etc. Experience in the development and implementation of software solutions. Ability to communicate ideas in both technical and user-friendly language. Ability to conduct research into application development issues and products. Ability to translate client requirements and/or legislation into system specifications. Experience working in a team-oriented, collaborative environment. Preferred Experience: Experience in US/ CAN Health benefits domain and benefits administration (Optional) Should possess good Testing Knowledge and SQL Queries Should able to communicate on Requirement Analysis in the project involved Knowledge of Software Development Life Cycle (SDLC) principles/ concepts. Experience working with mainframes sessions. Experience in VB Scripting in MS Excel. Experience in working in a client-vendor relationship. Must have Excellent Communication Skills Walk-in Date/ Time: 21st October - 25 October , 12 PM onwards Interview Venue: Wipro Olympia Technology Park, Altius Block, Guindy, Chennai, Tamil Nadu - 600 032. Contact Person - MONICA (044-61454000)","location":"Chennai","experience":"4 - 6 Years"},{"date":"23 - Oct - 2019","skills":"Manual Testing, Automation Testing, API testing, SQL Queries","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Prime Focus Technologies Limited, 5B, RMZ Eco World, Bellandur, Devarabeesanahalli, Bangalore","phone":"Not Specified","profile":"Software Testing - Trainee \nPrime Focus Technologies Limited","description":"Candidate must have good knowledge in Manual testing, Automation Testing & Open source test automation tool. Knowledge in open source web automation tools (selenium preferred) along with knowledge of commonly used Test Design patterns, externalizing configurations etc. Trained on Manual Testing, Automation Testing, API testing, SQL Queries and end to end testing. Ability to proactively identify, analyses and solve problems effectively Must have good problem solving techniques & Interpersonal skills. Key Responsibilities: Develop and apply testing processes for new and existing products to meet client needs Monitor debugging process results Reviewing quality specifications and technical design documents to provide timely and meaningful feedback Creating detailed, comprehensive and well-structured test plans and test cases Perform thorough regression testing when bugs are resolved Walk-in Date/ Time: 23 October 2019, 9 AM onwards Interview Venue: Prime Focus Technologies Limited 5B, RMZ Eco World, Bellandur, Devarabeesanahalli, Bangalore Contact Person- Sreehari RaghavanNair","location":"Bangalore","experience":"0 - 1 Years"},{"date":"23 - Oct - 2019","skills":"Manual testing, Test Methodology & well versed with STLC","qualification":"B.E./B.Tech, MCA/PGDCA","address":"VSERV Business Solutions Private Limited, 605-610, 6th floor, Bestech Business Tower, Sector 48, Sohna Road, Gurgaon.","phone":"0124-4967200","profile":"Manual Testing Engineer \nVSERV Business Solutions Private Limited","description":"Candidate must have at least 2 years of relevant experience in Manual testing. Firm Understanding of Test Methodology & well versed with STLC. Must have Firm Knowledge of complete testing life cycle -- like test specification preparation, test execution, test reporting, test-bed configuration, bug reporting, for multiple product releases. Conduct test design impact analysis for proposed changes or for problems in system. Review test plans submitted by support SQA Engineers for assigned projects Candidate should have hands on expertise on e-commerce domain. Candidate must have experience on Integration testing. Walk-in Date/ Time: 23 October 2019, 10 AM onwards Interview Venue: VSERV Business Solutions Private Limited, 605-610, 6th floor, Bestech Business Tower, Sector 48, Sohna Road, Gurgaon. Contact Person: Akhil Malhotra/ 9818920350 If interested, then kindly send your updated resume along with below information/ details on akhil.malhotra@intsof.com Current CTC Expected CTC Joining Time Availability for F2F Interview (Oct 22 & 23, between 9 AM 3 PM)","location":"Gurgaon","experience":"2 - 4 Years"},{"date":"21, 22, 23, 24, 25, 26 - Oct - 2019","skills":"Java EE (JSP, Servlets, JPA), J2EE, JVM internals, AJAX","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Marolix Technology Solutions Private Limited, 1st Floor, Three Cube Towers, Beside Watermark Building, Kondapur, Hyderabad","phone":"9154087468","profile":"Java/ Full Stack Developer \nMarolix Technology Solutions Private Limited","description":"Candidate should have 2 years' of experience in Java platform development. Practical demonstrated experience in design and development of applications with major web development frameworks, including Java EE (JSP, Servlets, JPA), J2EE, JVM internals, AJAX; must have experience designing and implementing with Struts or Spring or other MVC framework. Must have good hands on experience on Jasper reports development or Similar to Jasper Reports. Reasonably good at UI with fundamental exposure to the technologies like HTML5, JSP, Java Script, JQUERY, CSS, Bootstrap, etc. Should have hands on experience on advanced JS Frameworks like Angular 2, Must have strong web service integration skills (SOAP, WSDL protocols, REST, Axis, and UDDI). Walk-in Date/ Time: 16th October - 31st October , 9 AM onwards Interview Venue: Marolix Technology Solutions Private Limited 1st Floor, Three Cube Towers, Beside Watermark Building, Kondapur, Hyderabad Contact No. 9154087468","location":"Hyderabad","experience":"2 - 4 Years"},{"date":"22, 23, 24, 25 - Oct - 2019","skills":"Back Office, Data Entry Operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"3i Infotech Limited, Akruti Trade Centre, 3rd floor, Plot .10, Road No. 7, MIDC Marol, Bhim Nagar, Andheri (East), Mumbai - 400093","phone":"022 7126 9000","profile":"Back Office Executive \n3i Infotech Limited","description":"Walk In interview for banking back office In Andheri MIDC Minimum Education: HSC Pass/ Graduate Minimum Typing Speed 25 wpm Walk-in Date: 22nd - 25 October 2019 Interview Time 11 to 3 PM Interview Venue: 3i Infotech Limited Akruti Trade Centre, 3rd floor, Plot .10, Road No. 7, MIDC Marol, Bhim Nagar, Andheri (East), Mumbai - 400093 Contact Person - Ankit Mota Phone: 022 7126 9000","location":"Mumbai","experience":"1 - 4 Years"},{"date":"23 - Oct - 2019","skills":"Java, UI, PL/SQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Arrow Electronics (India) Private Limited, West Wing, 5th Floor, Shankara Narayana Building, No. 25, M.G. Road, Bangalore - 560 001.","phone":"080-41353774","profile":"Java/ UI Developer \nArrow Electronics (India) Private Limited","description":"Candidate must have 4 to 7 years of strong hands-on design/ development background as a Full Stack Developer (Java, UI, PL/SQL) Job Location: Bangalore Experience/ Skill Set: Strong skills to implement Core Java code with Java Collections Hands-on experience around n-tier Web architecture with JSP and Servlets Good in understanding basics of JavaScript for testing and troubleshooting Good understanding of web technologies like HTML, XML and CSS Experience on Unix/Linux platform, Oracle SQL & PL/SQL, Oracle as a DB is desired Experience / Exposure to Webservices is a plus Experience in Hibernate is a big plus Experience in Mobile App development is a plus Experience / Exposure to Middleware J2EE containers WebLogic / OC4J Experience / Exposure to Middleware technology like ESB-Enterprise Service Bus / SOA-Service Oriented Architecture is a big plus Experience / Exposure to Open Source tools like Solr Search Engine and KAFKA is a big plus Excellent analytical, written and verbal communication skills Roles & Responsibilities: Capable of translating requirements into design / development, with unit testing / bug fixing / tuning Provide estimate based on documentation available / discussions with relevant stakeholders and work towards the timeline Good soft skills to work as an individual and as a group with onsite counterparts is a must Walk-in interview on 23rd October 2019, Wednesday Timings: 10 am - 3:00 pm Interview Venue: Arrow Electronics (India) Private Limited West Wing, 5th Floor, Shankara Narayana Building, No. 25, M.G. Road, Bangalore - 560 001.","location":"Bangalore","experience":"4 - 7 Years"},{"date":"21, 22, 23, 24, 25, 26 - Oct - 2019","skills":"HTML, CSS, Javascript, Bootstrap, Ajax, Jquery Java, Php, Android and Software Testing","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Aapjimini Techsoft Private Limited, Plot No-235, Lane No-3, In front of Idea Office, Kanan Vihar Phase-2, Chandrasekhar Pur,patia, Bhubaneswar - 751 024","phone":"Not Provided","profile":"Java/ Php Developer/ Tester \nAapjimini Techsoft Private Limited","description":"Urgent Requirement of Software Developers and Testers with good communication skill and good knowledge in HTML, CSS, Javascript, Bootstrap, Ajax, Jquery, Java, Php, Android and Software Testing. Both Freshers and Experienced can apply. Walk-in Date/ Time: 19th October - 30 November, 11 AM onwards Interview Venue: Aapjimini Techsoft Private Limited Plot No-235, Lane No-3, In front of Idea Office, Kanan Vihar Phase-2, Chandrasekhar Pur,patia, Bhubaneswar - 751 024 Contact Person- Suresh Mahunta","location":"Bhubaneshwar","experience":"0 - 1 Years"},{"date":"23 - Oct - 2019","skills":"Java, J2EE, SQL/ MySQL, OOPS Concept","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Changepond Technologies Pvt. Limited, H-2 , SIPCOT IT PARK, OMR, Siruseri, Chennai - 603 103. Landmark: Opposite to TCS 2nd Gate","phone":"Not Provided","profile":"Java Developer/ Freshers \nChangepond Technologies Private Limited","description":"Hiring Programmer Analyst Trainee (20 nos) for Changepond Technologies Private Limited Educational Qualification: BE/ B. Tech/ MCA (2015, 2016, 2017, 2018 & 2019 Passouts only) Eligibility: Aggregate of 60% in 10th, 12th, UG & PG (if any) Candidate must have good communication skills Should have completed a course in Java from any training institute Java Certification is mandatory. Required Skills: Java, J2EE, SQL/ MySQL, OOPS Concept Interview Rounds: 1. Combined Apps (Java Technical & Logical reasoning), 2. Technical face to face 3. HR Interview. Walk-in Date & Time: 23rd October 2019 (Wednesday) from 09:00 AM till 12:00 PM Interview Venue: Changepond Technologies Pvt. Limited H-2 , SIPCOT IT PARK, OMR, Siruseri, Chennai - 603 103. Landmark: Opposite to TCS 2nd Gate","location":"Chennai","experience":"0 - 1 Years"},{"date":"21, 22, 23, 24, 25 - Oct - 2019","skills":"Java, Android SDK, Android basics like Manifest components, Recycler View","qualification":"B.E./B.Tech, MCA/PGDCA","address":"CROSSEDGE Technologies Private Limited, 14, Pammal Main Road, Opposite to IDBI Bank, Pamal, Chennai - 600 075","phone":"Not Provided","profile":"Android Developer/ Java \nCROSSEDGE Technologies Private Limited","description":"Candidate should have 2 to 5 years of experience in Java based Android (Native) development. Must have strong knowledge on Android SDK, Android basics like Manifest components, Recycler View, Card View, List View, Broadcast receiver, Location services, Full Activity lifecycle, Handling of Dialog/ Fragment dialog, Fragment lifecycle. Should be experienced in mobile app with Firebase, MySQL, NoSQL, Realm database. Experience in developing best practices, software principles and code design concepts Ensure the performance, quality, and responsiveness of applications Experience in developing and supporting rapid iterations of software in an agile context Help maintain code quality, organisation, and automation Skills Ability to understand business requirements and translate them into technical requirements Walk-in Date/ Time: 11th October - 25 October , 9 AM onwards Interview Venue: CROSSEDGE Technologies Private Limited 14, Pammal Main Road, Opposite to IDBI Bank, Pamal, Chennai - 600 075","location":"Chennai","experience":"2 - 5 Years"},{"date":"21, 22, 23, 24, 25 - Oct - 2019","skills":"PSD to Responsive HTML/ HTML 5, CSS3, Bootstrap, Jquery, Java Script, GT Metrix and/or web.Dev tool","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Sparx IT Solutions Private Limited, A-2, Sector-63, Noida - 201 301","phone":"0120-2735100","profile":"Front End/ Ui Developer \nSparx IT Solutions Private Limited","description":"Candidate must have excellent knowledge of PSD to Responsive HTML, HTML 5, CSS3, Bootstrap. Should have good working knowledge of Bootstrap 4, Jquery, Java Script. Should know GT Metrix and/or web Development tool Walk-in Date/ Time: 18th October - 25 October , 10 AM onwards Interview Veue: Sparx IT Solutions Private Limited A-2, Sector-63, Noida - 201 301 Contact Person- Mr. Rishabh Jain (0120-2735100)","location":"Noida","experience":"1 - 2 Years"},{"date":"21, 22, 23, 24, 25, 26 - Oct - 2019","skills":"US based Back Office process (B2B Campaign), Documents Processing","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Info-X Software Technology Pvt. Limited, 335 Udyog Vihar Phase 2 Gurugram - 122 016","phone":"9910768257","profile":"Back Office Executive \nInfo-X Software Technology Pvt. Limited","description":"Walk-in Interview from 21st October 2019 till 8th November 2019 Timings 4:000 PM to 6:00 PM Qualification: Graduates with streams like BA, B Com, B Sc Minimum experience 1 Year to 6 Years. Candidates with experience is Voice Campaigns/ Blended Process can also apply Should be good at Typing speed with Good Accuracy. (Typing speed of less than 25 wpm is not eligible) Job Responsibility: US based Back Office process (Business to Business Campaign) Processing of Documents for US based clients. Free Meal Kindly Walk-in for Interview from 21st October 2019 till 8th November 2019 (between 4:00 PM to 6:00 PM) at below mention address. (No Interviews on Saturday and Sunday) Info-X Software Technology Pvt. Limited 335 Udyog Vihar Phase 2, Gurugram - 122 016 Contact Person: Sanjay (9910768257) Email: pramod@infoxwebware.net","location":"Gurgaon","experience":"1 - 6 Years"},{"date":"21, 22, 23, 24, 25, 26 - Oct - 2019","skills":"Non-Voice /Back Office Process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Hinduja Global Solutions Limited, International InfoTech Park, Above Vashi Railway Station, Tower No. 1, 4th floor, Vashi Navi Mumbai -400 703.","phone":"Not Provided","profile":"Back Office Associate (Non Voice) \nHinduja Global Solutions Limited","description":"Eligibility Criteria: Candidate should be Graduate (Compulsory) Any Graduates can apply (Except B.E & B.Tech) Good Communication Skills in English, Hindi Job Responsibility- Non-Voice /Back Office Process 9 working hours inclusive of 1 hrs break. 5 working days and Saturday and Sunday off Needs to be in compliance with all the operational requirements and work as per the company's norms and policies. Transport Boundaries: Wadala Byculla Panvel Dombivli Flexible to work in Shifts (24*7 Shift) (Day and Night) Transport Provided. Walk-in Date/ Time: 21st October - 30 November, 2019 (10 AM onwards) Interview Venue:- Hinduja Global Solutions Limited International InfoTech Park, Above Vashi Railway Station, Tower No. 1, 4th floor, Vashi Navi Mumbai -400 703 Contact Person- Athar","location":"Mumbai","experience":"0 - 1 Years"},{"date":"22 - Oct - 2019","skills":"HR Operations, Exit Management, Benefits Administration, Data Management","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Bajaj Housing Finance Limited (BHFL), B2 Fifth Floor, Cerebrum IT Park, Kumar City, Kalyani Nagar, Pune","phone":"Not Provided","profile":"Officer - HR Operations \nBajaj Housing Finance Limited (BHFL)","description":"Requirements: Graduate/ MBA (HR) with good knowledge of Excel is mandatory Must have good communication skills Immediate joiner (in a weeks time) Type - 3rd Party Payroll Working Days - Mon to Sat Roles & Responsibilities- Internal Job Postings Background Verification (BGV) Pre & Post Joining On-boarding Employee Exit Management: Vendor Management & Employee Benefits Administration Employee File Digitization, Audit Data Management & Analytics and Audit Walk-in Date - 22nd October 2019 Time - 9 AM to 5 PM Only Interview Venue: Bajaj Housing Finance Limited (BHFL) B2 Fifth Floor, Cerebrum IT Park, Kumar City, Kalyani Nagar, Pune","location":"Pune","experience":"0 - 3 Years"},{"date":"21, 22 - Oct - 2019","skills":"Office Administration, Front Office/ Reception Activities, Interpersonal Skills","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"SMC Global Securities Limited, Poddar Court 18, Rabindra Sarani Gate No. 4 Floor 5 Kolkata -700 001","phone":"03366127113","profile":"Front Office Executive (Female) \nSMC Global Securities Limited","description":"Any Graduate with minimum 0- 3 years experience in Front Office Basic Computer Knowledge /Professional attitude and appearance Ability to be resourceful and proactive when issues arise Fluent in English communication Excellent organizational skills Must have pleasing personality Freshers With good Communication and interpersonal skills are welcome Only Female Candidate can apply Job Responsibility- Attending calls, Handling Reception Guest & Associate calls Attending the visitors and solving their queries Maintaining Courier, Material Register & Other Records Greeting & Assisting Visitors & Guests Monitor House-keeping Internal Cleanliness Assisting office administration in miscellaneous routine works Maintaining the attendance of Sub-staff in CRM Walk-in Date/ Time: 21st - 22nd October 2019 from 11 AM onwards Interview Venue: SMC Global Securities Limited Poddar Court 18, Rabindra Sarani Gate No. 4 Floor 5 Kolkata -700 001","location":"Kolkata","experience":"0 - 3 Years"},{"date":"21, 22, 23, 24, 25, 26 - Oct - 2019","skills":"front desk, front office coordination, cash handling","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Rainbow Hospital C -16 & 17, Vikrampuri Colony Secunderabad. Landmark: Near Bata Show Room","phone":"9000234491","profile":"Front Office Executive/ Coordinator \nRainbow Childrens Medicare Pvt. Limited","description":"Rotational Shift includes Night Shifts. Cash Handling. Handling the help desk Communicating with patient and the doctors Attending to patient queries/clarifications. Maintaining the patient inflow records doctor wise. Making sure all the consultant rooms maintained as per the doctor requirements. Updating the doctor timings on day to day basis. Maintaining the total OPD patient inflow count per doctor. Any other assignment proposed by Management from time to time. Walk-in Date: 21st - 31st October 2019 Time: 10 am to 4 pm Interview Venue: Rainbow Hospital C -16 & 17, Vikrampuri Colony Secunderabad Landmark: Near Bata Show Room Contact Person- Naveen Kumar H (9000234491)","location":"Hyderabad","experience":"0 - 5 Years"},{"date":"21, 22, 23, 24, 25 - Oct - 2019","skills":"Front desk, Front Office, Receptionist/ Front Office Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Mouser Electronics (India) Private Limited, No.9, 5th Floor, Esquire Centre, Mahatma Gandhi Road, Bangalore - 560 001.","phone":"7349371940","profile":"Front Office Executive \nMouser Electronics India Private Limited","description":"Bachelor Degree preferred and around 6 months to 1 year experience in an office administration role, or an equivalent combination of education and experience. SKILLS & CERTIFICATIONS: A proven successful track record in a previously held office administrative role. High level of interpersonal skills. Ability to work with minimum supervision and make sound independent judgements. Strong problem solving and organizational skills. Accurate, reliable, high level of confidentiality. Excellent written and verbal communication skills in local language, professional communication behaviour to internal and external contacts. Proficient working knowledge of all Microsoft Office applications and email. Strong analytical, organizational skills, and attention to detail. COMPETENCIES: Energy Multi-tasking Attention to Detail Customer Service Functional Acumen Teamwork Resilience Integrity Task Focus Acceptance of Diversity Walk-in Date: 21st - 25 October 2019 Time: 10:00 AM to 5:00 PM Interview Venue: Mouser Electronics (India) Private Limited No.9, 5th Floor, Esquire Centre, Mahatma Gandhi Road, Bangalore - 560 001. Mobile No. 7349371940 Contact - Abhilasha Kumari","location":"Bangalore","experience":"0 - 1 Years"},{"date":"22, 23, 24, 25 - Oct - 2019","skills":"Python, Test Engineering, Java, Python, Linux, Open Shift, Jenkins","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Agiliad Technologies Private Limited, Godrej Castlemaine, 1st & 8th floor, Next to Ruby Hall Clinic, 42 Sassoon Road, Pune - 411 001","phone":"020 6689 1207","profile":"Java Developer/ Python Experts \nAgiliad Technologies Private Limited","description":"Good hands on experience of Azure, AWS, Kubernetes, Openshift, Jenkins plugins usage. Must have good programming experience in Python Good hands on experience of application deployment of web server. Candidate should have good knowledge of Networking Good experience of manual flash based application testing and cli testing Devops and CI/ CD workflow understanding Walk-in Date/ Time: 22nd October - 25 October , 10 AM onwards Interview Venue: Agiliad Technologies Private Limited Godrej Castlemaine, 1st & 8th floor, Next to Ruby Hall Clinic, 42 Sassoon Road, Pune - 411 001 Phone No: 020 6689 1207 Contact - Abhishek Ranjan ( 66891207 )","location":"Pune","experience":"2 - 7 Years"},{"date":"19 - Oct - 2019","skills":"C#, .NET Framework 4.0/4.6, ASP .NET, and ADO .NET","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Sapiens Technologies (India) Private Limited, 8th Floor , Building No. 11, SEZ - Cessna Business Park. Kadubeesanahalli Village, Varthur Hobli, Outer Ring Road, Bangalore - 560 087.","phone":"Not Mentioned","profile":".Net/ Fullstack Developer \nSapiens Technologies (India) Pvt. Limited","description":"Candidate should have Bachelors degree in Computer Science, Management Information Systems, Information Technology, or equivalent work experience. Insurance industry experience and/or experience with ACORD standards are a major plus. Key Requirements: 4+ years of C#, .NET Framework ver. 4.0/4.6, ASP .NET, and ADO .NET development. 4+ years (current) working experience with web development with Microsoft Tools. 4+ years of object-oriented software development and design experience. 3+ years of experience working with JavaScript and JavaScript frameworks. Working knowledge of SOA and Web Services technologies Experience in full software development lifecycle using agile methodologies such as Scrum Have knowledge of how to document program design, coding, and maintenance. Have experience getting critical project to completion with high client satisfaction. Practical knowledge of one or more JavaScript frameworks and experience implementing JavaScript RIA applications is a plus. 3+ years of experience working with XML/XSLT.3+ years of experience developing with SQL Server 2+ years of experience writing Unit Tests using MS Test, nUnit or equivalent software. Experience with MVC, SOA, and OOP design patterns Microsoft .NET certifications are a plus Interview Date: 19th October (Saturday) Time: 9 am - 1 PM Venue Details: Sapiens Technologies (India) Private Limited 8th Floor , Building No. 11, SEZ - Cessna Business Park. Kadubeesanahalli Village, Varthur Hobli, Outer Ring Road, Bangalore - 560 087. Landmark: Next to Horizon Gate No. 2 Contact Person : Shalini","location":"Bangalore","experience":"4 - 8 Years"},{"date":"22 - Oct - 2019","skills":"Technical Support, IT Helpdesk/ Service Desk, Customer Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Neeyamo Enterprise Solutions Pvt. Limited, Level-1, IT-05 Blueridge SEZ, Hinjewadi Phase-1, PUNE - 411 057","phone":"Not Provided","profile":"Technical Support Associate \nNeeyamo Enterprise Solutions Pvt. Limited","description":"Eligibility Criteria: BE-IT, CS/ ENTC Strong analytical & problem solving skills No standing arrears Comfortable with a non-technical profile Comfortable with night shifts Can work under pressure Immediate Joining Job Responsibility: Responsible for integration and configuration of various tools and products developed in-house at Neeyamo Responsible for verifying & validating the Configuration book and Wage Matrix Responsible for configuring Payroll Engine Technical role demanding configuration, implementation and testing wherever required Expected to resolve client issues and consult wherever required Walk-in Date/ Time: 22nd October 2019, 11 AM onwards Interview Venue: Neeyamo Enterprise Solutions Pvt. Limited, Level-1, IT-05 Blueridge SEZ, Hinjewadi Phase-1, PUNE - 411 057 Contact Person- Prachi Mane","location":"Pune","experience":"0 - 2 Years"},{"date":"19 - Oct - 2019","skills":"Technical Support, Hardware Networking","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Vindhya E-infomedia Private Limited, No. 3, 4th Main, 2nd Cross, 4th Stage, Industrial Town, Rajaji Nagar, Bangalore - 560 044.","phone":"9535019153","profile":"Technical Support Engineer \nVindhya E-infomedia Private Limited","description":"Vindhya E-infomedia Private Limited, is hiring for Technical Support Engineer at Bangalore location. Qualification: BE/ BCA/ Any Graduate Language: English + Hindi Skills- Networking Hardware and Networking Software Walk-in Date/ Time: 18th - 19th October, 9 AM onwards Interview Venue: Vindhya E-infomedia Private Limited No. 3, 4th Main, 2nd Cross, 4th Stage, Industrial Town, Rajaji Nagar, Bangalore - 560 044. Landmark: Mandavi Motors Call HR : 9535019153 (Farha)","location":"Bangalore","experience":"1 - 2 Years"},{"date":"19, 21, 22, 23, 24, 25, 26 - Oct - 2019","skills":"Core Java, Java/ J2EE, SQL, JSP","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Mphasis Limited, 4th Floor, WTC-4, Bagamane World Technology Centre, KR Puram, Marathalli Outer Ring Road, Bangalore - 560 048","phone":"Not Provided","profile":"Technical Support Consultant \nMphasis Limited","description":"Candidate must be Graduate with good communication skills. Should be Flexible with Night Shifts. Work Experience: 0 to 5 Years Job Location: Bangalore Walk-in Date/ Time: 17th - 30th October 2019 from 11 AM onwards Interview Venue: Mphasis Limited 4th Floor, WTC-4, Bagamane World Technology Centre, KR Puram, Marathalli Outer Ring Road, Bangalore - 560048 Contact Person : Renita","location":"Bangalore","experience":"0 - 5 Years"},{"date":"19 - Oct - 2019","skills":"Desktop Support, Technical Support, Field Support, Network Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Cielo Systems (Sonyo Management Consultants family company) 105, Parvati Center for Corporate Solutions, Karachiwala Chambers MG Road, Pune - 411 001","phone":"7666108260","profile":"Desktop Support Engineer \nCMS IT Services Private Limited","description":"We are looking for candidates with 0 to 2 years of experience on problem/ Fault identifying, resolving of Desktop, Laptop, Bit locker, O365, Outlook, email configuration on mobile related issues. Aware from Service Desk Lifecycle. VC Setup knowledge preferable On call Support or Field Support to our customers at various locations. Graduation Mandatory Training will be provided Walk-in Interview on 19th October from 9 AM onwards Drive location: Cielo Systems (Sonyo Management Consultants family company) 105, Parvati Center for Corporate solutions Karachiwala Chambers MG Road, Pune - 411 001 Landmark: Above Karachi Sweets Opposite Mona Food house","location":"Pune","experience":"0 - 2 Years"},{"date":"19 - Oct - 2019","skills":"ASP .Net C#","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Cruxzen Technologies Private Limited, 5, Vijay Complex, S.No. 77/1/7, Near Sai Chowk, New Sangavi, Pune Maharashtra - 411 027","phone":"Not Provided","profile":"Software Developer (.Net) \nCruxzen Technologies Private Limited","description":"Looking for Fresh to experience dynamic candidates for software development Hands on MS SQL programming and XAMARIN must Should have C# .Net Certificate for fresher Design, Development of ASP .Net C# web application Mobile app programming. Walk-in Date/ Time: 18th - 19th October , 11 AM onwards Interview Venue: Cruxzen Technologies Private Limited 5, Vijay Complex, S.No. 77/1/7, Near Sai Chowk, New Sangavi, Pune, Maharashtra - 411 027","location":"Pune","experience":"0 - 3 Years"},{"date":"19 - Oct - 2019","skills":".Net, ASP .NET, MVC3, JavaScript, AJAX and CSS","qualification":"B.E./B.Tech, MCA/PGDCA","address":"VNS Makro Technologies Private Limited, Makro Towers Beside Beach House Restaurant, Near D-Mart, Kavuri Hills, Madhapur, Hyderabad, Telangana - 500 081","phone":"Not Provided","profile":".Net Developers \nVNS Makro Technologies Private Limited","description":"We are looking for 3 to 8 years experienced candidates with proficiency with Microsoft .NET 4.0+ development using C#. Good knowledge and experience with core Microsoft .Net technologies including: WCF and EF. Should have experience with web development technologies including ASP .NET, MVC3, JavaScript, AJAX and CSS. Nice to have experience from Product based companies. Walk-in Interviews on this Saturday, 19th October, 2019 from 11:00 AM to 5:00 PM Interview Venue: VNS Makro Technologies Private Limited Makro Towers Beside Beach House Restaurant, Near D-Mart, Kavuri Hills, Madhapur, Hyderabad, Telangana - 500 081 Contact Person- Rajesh Neelam","location":"Hyderabad","experience":"3 - 8 Years"},{"date":"19 - Oct - 2019","skills":"ADO .NET, C#, .NET framework 3.5 and SQL Server","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Legasis Services Private Limited, B-105, International Convention Centre, Senapati Bapat Road, Pune - 411 016","phone":"020 3029 4000","profile":"ASP .Net Developer \nLegasis Services Private Limited","description":"Qualification- BE/ B.Tech/ ME/ M.Tech/ MCA or Equivalent Work Experience- 1-4 years Job Location: Pune Hands on experience on ADO .NET, C#, .NET framework 3.5 and SQL Server Experience in Framework 4.5/ Bootstrap/ HTML 5/ JQuery/ LINQ to SQL Requirement gathering through client interaction Understanding of change request processes and other software development processes and preparing technical documentation Problem-solving and thinking laterally as part of a team, or individually, to meet the needs of the project Doing Manual unit Testing of the software developed Experience in Deployment and Build management Consulting clients/colleagues concerning the maintenance and performance of software applications and obtaining information, clarify details and implement information Job Responsibility- Designing Web pages in ASP .NET technology Coding in C# (Building the applications Business Logic and other related software code) Walk-in Date/ Time: 19th October 2019, 10 AM onwards Interview Venue: Legasis Services Private Limited B-105, International Convention Centre, Senapati Bapat Road, Pune - 411 016 Tel No: 020 3029 4000 Fax: +91 20 3022 1012 Contact - Renuka Bhanushali Documents to carry at the time of interview: 1. Updated Resume/CV 2. Passport Size Photograph","location":"Pune","experience":"1 - 4 Years"},{"date":"19 - Oct - 2019","skills":".NET, Visual Studio, C#, SQL (MS-SQL, MySQL) or NoSQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"OnProcess Technology India Private Limited, 12th Floor, Omega Building (North), Bengal Intelligent Park, Plot: A3, M2 & N2, Block EP & GP, Sector-5, Salt Lake, Kolkata-91 (Landmark: Opposite Pantaloons)","phone":"23575194","profile":".Net Developers \nOnProcess Technology India Pvt. Limited","description":"We are conducting Walk-In Drive for .NET Developer at OnProcess Technology for Kolkata location on Saturday 19th October 2019 between 11:00 am- 2:00 pm. please find below details: Skills Required:- 4+ years experience as a .NET Developer Strong software development skills using .NET, Visual Studio, C#, SQL (MS-SQL, MySQL) or NoSQL (MongoDB/ CosmoDB etc.). Practical experience building web applications and APIs Practical experience designing and developing rich application for the Web leveraging JavaScript, JQuery, Angular/ReactJS/Bootstrap Practical experience of unit testing, integration testing and performance testing CI/CD experience in Microsoft stack. Job Responsibility:- Design, build, test, and deploy Azure based software solutions that provide high availability, scaling and predictable support costs Work from home both independently and as part of project teams delivering mission critical applications Build proof of concepts using new technology as part of maintaining and evolving a best in class technology architecture Mentor junior members of the team though code reviews, design sessions and regular interactions. Walk-in Date/ Time: 19th October 2019, 11 AM onwards Interview Venue: OnProcess Technology India Private Limited 12th Floor, Omega Building (North), Bengal Intelligent Park, Plot: A3, M2 & N2, Block EP & GP, Sector-5, Salt Lake, Kolkata - 91 (Landmark: Opposite Pantaloons) Contact Person- Amit Mishra (23575194)","location":"Kolkata","experience":"4 - 9 Years"},{"date":"19, 21, 22, 23, 24, 25, 26 - Oct - 2019","skills":"Technical Support, IT Helpdesk, Service Desk, Application Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Gnana Software Consulting Private Limited, New No. 75 ,Old No. 3 A, 1st Floor, Dr. Giriyappa Road, T. Nagar , Chennai - 600 017.","phone":"9841580613","profile":"Technical Support Executive \nGnana Software Consulting Pvt. Limited","description":"Opening for technical support executive in our software division at Chennai Any graduate with very good English is must. 1 to 3 years experienced candidates are required. Minimum one year. Must have experience in a related field Candidates with good Attitude preferred. Experienced the salary will be offer between 25000 to 30000 Walk-in Date/ Time: 19th October - 26 October , 9 AM onwards Interview Venue: Gnana Software Consulting Private Limited, New No. 75 ,Old No. 3 A, 1st Floor, Dr. Giriyappa Road, T. Nagar , Chennai - 600 017. Behind GRT Grand Days Hotel & Convention Center Contact - Jaipal (9841580613) Interested candidate can send their updated resume to jaipal@gnanasoft.in","location":"Chennai","experience":"1 - 3 Years"},{"date":"21, 22, 23, 24, 25 - Oct - 2019","skills":"C#, Asp .Net MVC, WCF","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Genisys Information Systems India Pvt. Limited, Prestige Shantiniketan, Gate 2 Tower C, 11th floor, Whitefield, Bangalore - 560 048.","phone":"Not Provided","profile":".Net Developer \nGenisys Information Systems India Pvt. Limited","description":"Genisys Information Systems India Pvt. Limited, is having multiple positions for Dot Net Developers. Qualification: BE/ B.Tech/ MCA Experience: 2 to 7 Years Required Skills: C#, Asp .Net MVC, WCF Walk-in Date/ Time: 21st - 25 October 2019, 9 AM onwards Interview Venue: Genisys Information Systems India Pvt. Limited, Prestige Shantiniketan, Gate 2 Tower C, 11th floor, Whitefield, Bangalore - 560 048. Contact Person- Adapala Vinod","location":"Bangalore","experience":"2 - 7 Years"},{"date":"21, 22 - Oct - 2019","skills":"IT Helpdesk, Technical Support, Desktop Support, System Support","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Strateology (Colosseum Group) CDC Towers, Plot No. 10/8, Road - 5, Block B, IDA, Nacharam, Hyderabad - 500 076.","phone":"Not Provided","profile":"SQL/ .Net Developer \nSKILLIANTECH India Private Limited","description":"Candidate should have good working knowledge on Complex SQLs, Joins Knowledge of Schedule & monitoring SQL Agent Jobs Reports Performance tuning and database maintenance Debugging issues in Stored procedures Debugging Dotnet Code Location : Nacharam (Hyderabad) Shift: 6 pm - 2 am Transport facility available. Immediate joiners are preferred Walk-in Date/ Time: 21st - 22nd October 2019, 11 AM onwards Interview Venue: Strateology (Colosseum Group) CDC Towers, Plot No. 10/8, Road - 5, Block B, IDA, Nacharam, Hyderabad - 500 076. Contact Person- Ravikanth Adgal Please feel free to reach out to me on 8099622979/ ravikanth@skillrecruit.com for any queries.","location":"Hyderabad","experience":"4 - 5 Years"},{"date":"21, 22, 23, 24, 25, 26 - Oct - 2019","skills":"IT Recruitment, Screening, Induction, Selection, Hiring, Mass Mailing","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Saysoft Tech Services Private Limited, #38, First Floor, 12th Main, 27th Cross, 4th Block, Jayanagar, Bangalore - 560 011","phone":"6362692317","profile":"IT Recruiter/ HR Executive \nSaysoft Tech Services Private Limited","description":"Candidate should be Graduate/ MBA HR with 0 to 2 years of experience on IT Recruitment, Screening, Induction, Selection, Hiring, Mass Mailing. Key Responsibilities- Working closely with the Team Lead on requirements. Direct phone sourcing, Vendor network, Referrals, and Expanded Internet sourcing. Involved in preliminary screening, sorting and short listing of resumes from our database and other job portal. Walk-in Date/ Time: 21st October - 26 October , 11 AM onwards Interview Venue: Saysoft Tech Services Private Limited #38, First Floor, 12th Main, 27th Cross, 4th Block, Jayanagar, Bangalore - 560 011 Landmark : Near to old Sub registrar office Jayanagar 4th Block Near by or Adjoint Oppposite to Vakula Restaurant. Contact Person- Sudhakar DS ( 6362692317 )","location":"Bangalore","experience":"0 - 2 Years"},{"date":"22 - Oct - 2019","skills":"C#, ASP .NET, MVC frameworks, Java Script, Angular JS,Web Services, WCF, Web API","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Freyr Software Services Private Limited, Level 4, Building No. H-08 Phoenix SEZ (Avance Campus) Back side of Cyber Gateway, HITEC City 2, Gachibowli Hyderabad - 500 081","phone":"040 4848 0999","profile":".Net Developer \nFreyr Software Services Pvt. Limited","description":"Any Graduate/ Post Graduate with 1 to 5 years of experience in ADO .NET ENTITY FRAMEWORK, C#, ANGULAR JS, HTML5, JAVA SCRIPT, ASP .NET MVC, C#, CSS 3, SQL SERVER * Strong knowledge of C#, ASP .NET, MVC frameworks * Strong knowledge of Java script, Angular JS * Strong knowledge in developing Webservices, WCF, Web API * Strong understanding of object-oriented programming Skill for writing reusable libraries * Familiar with various design and architectural patterns * Familiarity with Microsoft SQL Server * Understanding of fundamental design principles for building a scalable application * Experience in working with ADO.NET, Entity framework * Proficient understanding of code versioning tools like TFS, SVN * Experience in working with Kendo UI framework. Interested Candidates Can Directly Walk-in with their Latest CV to the above-mentioned Venue. Walk-in Date/ Time: 22nd October 2019, 10 AM onwards Interview Venue: Freyr Software Services Private Limited Level 4, Building No. H-08 Phoenix SEZ (Avance Campus) Back side of Cyber Gateway, HITEC City 2, Gachibowli Hyderabad - 500 081 Landmark: Formula 1 hotel, beside Dell Phone No: 040 4848 0999 Contact Person- Radhika Note: Please carry the Copy of the above email for the interview process","location":"Hyderabad","experience":"1 - 5 Years"},{"date":"21, 22, 23, 24, 25 - Oct - 2019","skills":"C# .Net, SQL Development","qualification":"B.E./B.Tech, MCA/PGDCA","address":"ParadigmIT Group, eCentric Solutions Private Limited, Purva Summit bldg. SMARTWORKS, 6th Floor White Field, Hitech City, Madhapur, Hyderabad - 500 081","phone":"Not Mentioned","profile":"Software Developer (.Net/ SQL) \nParadigmIT Group (eCentric Solutions Pvt. Limited)","description":"Educational Qualification: BE/ B.Tech/ MCA Work Experience level:- 2 to 6 Years Job Location:- Hyderabad Must have 2+ years of experience in required Technologies. Should have excellent communication skills Working Hours: 1.00 PM to 10.00 PM Own Transportation Walk-in Date/ Time: 21st - 25 October 2019, 11 AM onwards Interview Location: ParadigmIT Group, eCentric Solutions Private Limited, Purva Summit bldg. SMARTWORKS, 6th Floor White Field, Hitech City, Madhapur, Hyderabad - 500 081 Contact Person- Ramakrishna","location":"Hyderabad","experience":"2 - 6 Years"},{"date":"19 - Oct - 2019","skills":"C#, MVC, Javascript/ Jquery, SQL Server, Asp .Net","qualification":"B.E./B.Tech, MCA/PGDCA","address":"PreludeSys India Limited, Old No. D-12, New No. 3/A3, 1st Cross Street, Siruseri SIPCOT IT Park, Chennai - 603 103.","phone":"Not Provided","profile":".Net Developer \nPreludeSys India Limited","description":"Technical Skills Required: C#, MVC, Javascript/ Jquery, SQL Server, Asp .Net Should have good communication skills. Work Experience : 1 to 3.5 Years Job Responsibility: Develop UI screens using Asp .Net using C# Develop SQL Query to retrieve data based on requirement Develop backend services which will be consumed by different clients. Develop client side validation using Javascript, jQuery Walk-in Date: 19th October 2019 Time: 10.30 AM to 3.00 PM Interview Venue: PreludeSys India Limited Old No. D-12, New No. 3/A3, 1st Cross Street, Siruseri SIPCOT IT Park, Chennai - 603 103. Contact Person - Vijay R (HR Team) Contact - Mr. Vijay R","location":"Chennai","experience":"1 - 3 Years"},{"date":"18, 19 - Oct - 2019","skills":"Front desk, Front Office, Receptionist/ Front Office Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"ValueDrive Technologies Private Limited, Spinny, 8th floor, 801-806, Vipul Square, Sushant Lok - 1, Gurugram, Haryana - 122 002.","phone":"Not Specified","profile":"Front Desk Executive \nValueDrive Technologies Private Limited","description":"Candidate should be Any Graduate wit h 1 to 3 years of experience in Front desk, Front Office, Receptionist/ Front Office Activities. Must have excellent communication skills Job Responsibilities- Front face of the organisation at hub office - Customers' point of contact & will attend the customer and get his/her basic profile updated in the system - Allocates RMs basis the visit count and basic profile mentioned by the customer. Walk-in Date/ Time: 18th October - 19th October , 11 AM onwards Interview Venue: ValueDrive Technologies Private Limited Spinny, 8th floor, 801-806, Vipul Square, Sushant Lok - 1, Gurugram, Haryana - 122 002. Contact Person- Pragya","location":"Gurgaon","experience":"1 - 3 Years"},{"date":"18, 19, 21, 22, 23, 24 - Oct - 2019","skills":"HR Administration, Interviewing, Talent Acquisition, Screening, Recruitment Searching","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Continental Hospitals Private Limited, Plot No. 3, Rd Number 2, Financial District, Nanakramguda, Hyderabad - 500 035.","phone":"8466998053","profile":"Senior HR Executive \nContinental Hospitals Private Limited","description":"An MBA / MSW with min 5 Years of experience in Healthcare (Candidates from Healthcare would be preferred) Should have extensively handled the Talent Acquisition Portfolio (Nursing, Paramedical & Clinical) and generalist HR Functions viz., On-boarding, Induction and Department Orientations Exposure towards Manpower Planning & Budgeting MIS / Dashboards / HR Analytics Performance Management System Employee Engagement Should be conversant in English, Hindi & Telugu. Walk-in Date/ Time: 18th October - 24 October , 10 AM onwards Interview Venue: Continental Hospitals Private Limited Plot No. 3, Rd Number 2, Financial District, Nanakramguda, Hyderabad - 500 035. Contact - Swati ( 8466998053 )","location":"Hyderabad","experience":"3 - 5 Years"},{"date":"18, 19, 21, 22, 23, 24, 25, 26 - Oct - 2019","skills":"HR/ Recritment, Talent Management, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Tech Mahindra Business Services Limited, Commerzone, Building No. 3, Recruitment Desk, 1st floor, Samrat Ashoka, Path, Close to YERWADA JAIL, Off Airport Road, Yerwada, PUNE, Maharashtra - 411 006","phone":"Not Mentioned","profile":"HR Executive \nTech Mahindra Business Services Limited","description":"Candidate should be Graduates having minimum 6 Months of recruitment experience into a BPO sector. Should have great interpersonal skills and ability to perform under pressure Must have excellent communication skills. FRESHERS CAN ALSO APPLY!! Additional Benefits:- Performance based incentives Free Home Pick & Drop transport facility will be provided subject to the transport boundaries. 6 working days in a week. Job location: Yerwada, Pune Walk-in Date/ Time: 16th - 26 October 2019, 12 PM onwards Interview Venue: Tech Mahindra Business Services Limited Commerzone, Building No. 3, Recruitment Desk, 1st floor, Samrat Ashoka, Path, Close to YERWADA JAIL, Off Airport Road, Yerwada, PUNE, Maharashtra - 411 006 Contact Person- Sohan Juneja","location":"Pune","experience":"0 - 1 Years"},{"date":"18, 19, 21, 22, 23 - Oct - 2019","skills":"HR Administration/ HR Functions, Office Administration","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"MRF LIMITED, C/o. Sodexo Technical Services India Pvt. Limited Naranamagalam Village Alathur Thaluk Perambalur - 621 109","phone":"Not Provided","profile":"HR & Admin Executive \nSodexo Technical Services India Pvt. Limited","description":"Candidate should have minimum 2 years into Statutory Compliance, Generalist Activities, Attendance Input Submission, Grievances Handling, HR Audits, Attrition Control, Employee Retention and Relations etc. Salary Offered : Upto 2.4 LPA CTC (20,000 CTC per month) Interested candidates can contact the below mentioned person to attend the Personal Interview and share your updated resume to gopalakrishnan.s@sodexo.com Walk-in Date/ Time: 18th October - 23 October , 11 AM onwards MRF LIMITED C/o. Sodexo Technical Services India Pvt. Limited Naranamagalam Village Alathur Thaluk Perambalur - 621 109","location":"Trichy","experience":"2 - 7 Years"},{"date":"18, 19 - Oct - 2019","skills":"Advance Java, Servlets, JSP, JavaScript. HTML5, Hibernate, Web Services","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Bisleri International Private Limited, Bisleri Sales Office 5TH Floor, City Centre, 79/2, Hebbal Service Road, Hebbal, Bangalore - 560024","phone":"Not Provided","profile":"HR Recruiter \nBisleri International Private Limited","description":"Sourcing candidates CV from different web portals (i.e.Naukri, Monster etc) Screening & short-listing candidates profile as per the requirements of Departments. Referring Internal Database, Employee referrals etc. Conducting telephonic interview and co-ordinating for further rounds with concern department. Interacting with candidate, understand their competencies, skill sets & sharing the JD. Providing complete, accurate, and inspiring information to candidates about the company and positions. Arranging for personal interview on short listing, having good co-ordination with the department arranging end to end recruitment. Performing detailed reference checking and/or reference analysis on selected candidates and reviews results with clients. Maintaining daily/ weekly/monthly reports such as interview status reports, closure reports & feedback reports. Walk-in Date/ Time: 17th October - 19th October , 10 AM onwards Interview Venue: Bisleri International Private Limited Bisleri Sales Office 5TH Floor, City Centre, 79/2, Hebbal Service Road, Hebbal, Bangalore - 560024 Land Mark: Opposite to Hebbal BMTC Bus Depot, To Meet - Sandeep MM","location":"Bangalore","experience":"1 - 3 Years"},{"date":"18 - Oct - 2019","skills":"Software Testing, Manual Testing/ Automation testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Sarla Advantech Private Limited, 1019, 10th Floor, Rupa Solitaire Sector 1, Millenium Business Park, Navi Mumbai, Maharashtra - 400 710","phone":"Not Provided","profile":"Software Tester \nSarla Advantech Private Limited","description":"Candidate should have minimum 2 years of experience in Manual + Automation testing, Programming. Hands on experience on Automation testing tools with experience in creating and maintaining frameworks. Basic knowledge of C# or other programming language. Knowledge of Object Oriented Programming is reequired Candidate who can join immediately will be preferred Walk in Date: 18th October 2019 Time: 3:00 P.M to 4:00 P.M Interview Venue: Sarla Advantech Private Limited 1019, 10th Floor, Rupa Solitaire Sector 1, Millenium Business Park, Navi Mumbai, Maharashtra - 400 710. NOTE- You are requested to take a central Lift of the complex to reach our office Reception","location":"Mumbai","experience":"2 - 4 Years"},{"date":"19 - Oct - 2019","skills":"Manual Testing, Test Case Design, Test Planning, Test Case Execution, Defect Reporting","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"QualityKiosk Technologies Private Limited, A Wing - 419, Rupa Solitaire, Millennium Business Park, Mahape, Navi Mumbai - 400 709","phone":"Not Provided","profile":"Manual Tester/ Fresher \nQualityKiosk Technologies Private Limited","description":"Mandatory : BE/ B.Tech/ MCA/ Msc/ Bsc/ BCA with Throughout academics 60% ONLY CAN APPLY. Candidates from western line and in central till Thane only (Eg no kalyan no dombivali). Should have completed or pursuing course in Manual Testing & Flexible to travel anywhere in Mumbai Job Location: Base Location Navi Mumbai (Client location can be anywhere in central or western or harbour line or Onsite or within India) B.E /B.Tech /MCA/ B.Sc/ BCA/ M.Sc/ M.Tech- Passing Year- 2017, 2018, 2019 Percentage Criteria-Mandatory Throughout academics 60% (SSC,HSC/ Diploma, Graduation) Java knowledge added advantage Desired Skills: Manual Testing Should be willing to work in Manual Testing Open to travel anywhere in Mumbai (Western, Central, Navi Mumbai) Educational gap should not be more than 1 year Should be OK for 2 years bond with the company. Candidates are requested to be prepared on manual testing before coming for the interview Good Communication Skills Good Analytical approach & Logical reasoning skills Interview Process will be as below: 1st Level - Written Test 2nd Level- 2 Technical round 3rd Level - HR discussion Interview Date: 19th October 2019(Saturday) Time: 11:00 A.M till 3:00 P.M Interview Venue: QualityKiosk Technologies Private Limited A Wing - 419, Rupa Solitaire, Millennium Business Park, Mahape, Navi Mumbai - 400 709 (Directions: next to Mastek, take a right from the main entrance) Lift Number 24 & 25 Contact Person- Ms. Mausimi Sardar","location":"Mumbai","experience":"0 - 1 Years"},{"date":"19 - Oct - 2019","skills":"Automation & Manual Testing, ERP Functional Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"3i Infotech Limited, 3rd Floor, Prince Infocity 2, Kandanchavadi, Chennai - 96","phone":"044-71622577","profile":"Manual Testing Engineer \n3i Infotech Limited","description":"Work Experience: 3- 7 Years Notice Period: 45 Days Max Salary: Indursty Standard Primary Skill Set : Manual Testing with ERP (Mandatory) Automation & Manual Testing or only Manual Testing ERP Functional Testing / Implementation experience Job Responsibility: 1. Customer Requirement analysis 2. Test environment preparation 3. Test case preparation 4. Test Execution 5. Release activity 6. Review & EOD update 7. Metrics collection 8. Walkthrough to Customer to get the acceptance 9. Process improvement 10. Automation Interview Date : 19th October ' 2019 (Saturday) Time : 10.30 AM to 4.00 PM Interview Venue: 3i Infotech Limited 3rd Floor, Prince Infocity 2, Kandanchavadi, Chennai - 96 Contact - Vivek - HR (044-71622577)","location":"Chennai","experience":"3 - 7 Years"},{"date":"18, 19 - Oct - 2019","skills":"Automation testing, Selenium, create test data for functional and non-functional testing.","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Infosys BPM Limited, #785, Ground Floor Axis Sai Jyoti 15th Cross 100 Feet Road Sarakki, 1st Phase J P Nagar, Bangalore. Landmark - Sindhuri Convention Hall.","phone":"Not Specified","profile":"Automation Test Engineer \nInfosys BPM Limited","description":"Infosys BPM Limited, is looking for Automation testing Engineer with Selenium only. Selenium with HP ALM/ Quality center is mandatory Job Responsibility- Update existing tests/ Create new tests in the automation test suite (using Selenium). Write test planning documentation from requirements specifications. Review all testing documents and other test-related documentation. Assist in implementation of the overall testing strategy. Ensure that quality standards are adhered to during the development of products. Add new tests and expand the automation test suite. Collect and create test data for functional and non-functional testing. Run functional and non-functional tests. Liaise with developers during the Software Development Life Cycle (SDLC). Provide estimates for test activities. Walk-in Date/ Time: 18th - 19th October , 10 AM onwards Interview Venue: Infosys BPM Limited #785, Ground Floor Axis Sai Jyoti 15th Cross 100 Feet Road Sarakki, 1st Phase J P Nagar, Bangalore. Landmark - Sindhuri Convention Hall.","location":"Bangalore","experience":"1 - 5 Years"},{"date":"19 - Oct - 2019","skills":"Software Testing, Test Automation (Any Tool)","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Zuci Software Solutions Private Limited, No. 11, Ground Floor, Rattha Tek Towers, OMR, Thoraipakkam, Chennai - 600 097.","phone":"Not Provided","profile":"Software Testing Engineer \nZuci Software Solutions Private Limited","description":"Educational Qualification: BE/ B.Tech/ MCA Required Experience: 1 - 3 Years Skills: Test Automation (Any Tool) Notice Period: 15 - 20 Day Walk-in Date/ Time: 19th October 2019, 10 AM onwards Interview Venue: Zuci Software Solutions Private Limited No. 11, Ground Floor, Rattha Tek Towers, OMR, Thoraipakkam, Chennai - 600 097. Landmark: Opposite to Hotel Sangeetha, OMR Contact Person- Punitha Nagarajan","location":"Chennai","experience":"1 - 3 Years"},{"date":"19 - Oct - 2019","skills":"Mainframe Testing, CICS, COBOL, JCL, DB2, Database testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Capgemini Technology Services India Limited, Plot No. 1, IT Park, 115/32 & 35 Nanakramguda, Gachibowli, Hyderabad - 500 032","phone":"Not Provided","profile":"Mainframe Test Analyst \nCapgemini Technology Services India Limited","description":"Candidate should have 2 to 6 years of experience in Mainframe Testing basically in CICS, COBOL, JCL, DB2 Database testing. Should have excellent analytical and problem solving skills. Excellent collaboration/ teamwork skills. Must have excellent oral and written communications skills Primary Skills: Mainframe Testing basically in CICS, COBOL, JCL, DB2 Interview Date: 19th October 2019 (Saturday) Timing: 9:00 AM to 3.00 PM Interview Venue: Capgemini Technology Services India Limited Plot No. 1, IT Park, 115/32 & 35 Nanakramguda, Gachibowli, Hyderabad - 500 032. Please carry a Government Approved Photo ID Original & 2 Passport size photograph, without these you will not be allowed to attend the interview.","location":"Hyderabad","experience":"2 - 6 Years"},{"date":"19 - Oct - 2019","skills":"DWH/ ETL testing, Databases like Oracle, SQL Server etc.","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Xavient Digital - Powered by TELUS International, Plot No. 54, Noida Special Economic Zone (N.S.E.Z) Phase II, Noida","phone":"Not Provided","profile":"QA/ Testing Engineer \nXavient Digital - Powered by TELUS International","description":"Xavient Digital - powered by TELUS International is organizing a Walk-In Drive on coming Saturday (19th October/ 2019) for DWH Testing Engineer. We invite applicants to come and participate in the event who feel are the best fit for below role Work Experience: 2 - 6 Years Joining Time: Immediate - 45 days Skills Required: Should have hands on experience with DWH/ ETL testing Strong holdover in various databases like Oracle, SQL Server etc Proficient with all the proof concepts for DWH like Fact table, dimension table Exposure on ETL Testing tools preferably on Informatica Identifying working of Joins, Sub queries, CTEs and complex query writing skills Execute experience in creating Stored Procedures, Functions, Tables, Cursors, Hash tables and handling large data types Walk-in Date: 19th October 2019 Timings: 9:30 AM to 2:00 PM. Interview Venue: Xavient Digital - Powered by TELUS International Plot No. 54, Noida Special Economic Zone (N.S.E.Z) Phase II, Noida. Note: Candidates who can join early will be preferred. Please carry a hard copy of your resume for the Interview","location":"Noida","experience":"2 - 6 Years"},{"date":"18 - Oct - 2019","skills":"Java, J2ee, Spring Security, Spring MVC, Spring Data and Spring Mobile, Spring Boot","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Tata Consultancy Services Limited, SP - S3 Tikona, Plot No. 2 & 3, MIDC-SEZ, Rajiv Gandhi Infotech Park, Hinjewadi Phase III, Pune - 411 057","phone":"8208652766","profile":"Java Developers \nTata Consultancy Services Limited","description":"Candidate should have 3 to 7 years experience with Spring Framework including Spring Security, Spring MVC, Spring Data and Spring Mobile, Spring Boot. Experience with Tomcat and web containers. Experience with IDE like Eclipse as well as version control tools like Git and Sourcetree Familiarity/ Experience with bash shell and app deployment to Linux servers - Application servers such as Websphere and Tomcat. Familiarity with Internet security and Single-Sign On technologies like JWT, SAML and OAuth Roles & Responsibilities: XML technologies including DTD/XSD, XPATH, and Object XML mapping. - Unit testing (Junit), Continuous integration, and Agile methodologies. Knowledge of and experience with working on common design patterns and industry standards. Strong communication, analysis, and problem solving skills. Experience in creation of design documents on the task assigned. Quick to learn, self-motivated, and enthusiastic. Work well within a team environment and with minimal supervision. Comfortable working with clearly defined project plans and contributing estimates to the planning process. Able to meet and deliver on deadlines and work well under pressure. Unix command line and basic scripting. Experience with version control systems, preferably SVN. Experience in MAVEN. Versed in different development methodologies (Iterative, Agile, Scrum etc.) Interview Date: 18th October 2019) Time: 10:00 am to 1:00 pm Venue: Tata Consultancy Services Limited SP - S3 Tikona, Plot No. 2 & 3, MIDC-SEZ, Rajiv Gandhi Infotech Park, Hinjewadi Phase III, Pune - 411 057 (Maharashtra, India) Mandatory Registration: EPCN number is mandatory for eligibility of the interview. Follow the below steps to register and mention the EPCN number on your resume. Step 1: Go to site https:// careers.tcs.com Step 2: Select India geography & next click on Experienced Professionals tab Step 3: Click on Login and go to link Register with us (For New Users) and create your profile by filling in the details. (Please select area of interest as BPO) Step 4: You will get the EPCN number & Password to your personal e-mail ID The direct link is : https://ibegin.tcs.com/iBegin/ register In case you have any issue creating the EPCN number, you can come for the interview and contact Vinayak on 8208652766 DOCUMENTS REQUIRED - Please carry resume and ID proof at the time of interview.","location":"Pune","experience":"3 - 7 Years"},{"date":"19 - Oct - 2019","skills":"Java, J2EE, JSP, Servlet, JavaScript, AJAX, Unix/ Linux Shell Scripting, SQL, DB2, XML, JSON, DHTML, CSS","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Whitefield, Bangalore. If, interested please mail your resume at richa@techstosuit.com","phone":"7838316003","profile":"Full Stack/ Java Developer \nTechs to Suit Inc","description":"Work Experience: 4 to 6 Years Requirement Name- Java Fullstack Notice 45 days max Interview: Face to Face 19th October Client- Capgemini Person must have at least 4+ years of hands-on web application development utilizing the J2EE Java framework and Angular 2/4/5/6, Should good knowledge/ experience of Java, J2EE, JSP, Servlet, JavaScript, AJAX, Unix/ Linux Shell Scripting, SQL, DB2, XML, JSON, DHTML, CSS. Websphere, RESTful WebServices, ExtJS 5.x, Angular2/4/5/6, Dojo Toolkit, jQuery If you are interested mail at richa@techstosuit.com Or contact on 7838316003","location":"Bangalore","experience":"4 - 6 Years"},{"date":"19 - Oct - 2019","skills":"Java, J2EE, Java Script, and SQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Hurits Consulting Private Limited, No. 376/A, 1st Floor, Obeya Verve. Opposite to KLAY Play School, 5th Main, Near Rajesh Jewellery, Sector 6, HSR Layout, Bangalore - 560 102","phone":"9380322067","profile":"Java/ Backend Developer \nHurits Consulting Private Limited","description":"Candidate should have 3 to 8 years of experience in Java, J2EE, Java Script, and SQL. Design and implement extremely high-volume, fault-tolerant, scalable web-based systems solutions. Work with system analysts, engineers, programmers and others to design the online Marketplace Walk-in Date/ Time: 19th October 2019, 9 AM onwards Interview Venue: Hurits Consulting Private Limited No. 376/A, 1st Floor, Obeya Verve, Opposite to KLAY Play School, 5th Main, Near Rajesh Jewellery, Sector 6, HSR Layout, Bangalore - 560 102 Contact - HR @ 9380322067","location":"Bangalore","experience":"3 - 8 Years"},{"date":"19 - Sept - 2019","skills":"Java, J2EE, Oops, Java Script","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"PreludeSys India Limited, Old No. D-12, New No. 3/A3, 1st Cross Street, Siruseri SIPCOT IT Park, Chennai - 603 103.","phone":"Not Provided","profile":"Java Developers \nPreludeSys India Limited","description":"Technical Skills Required: Java, J2EE, Oops, Java Script Candidate Should have good Communication skills. Work Experience : 1 to 3 years Job Responsibility:- Understanding system Architecture, Analytical Skills. Analyzing and understanding business requirement Casual analysis of issues/ problems Visualizing the big picture Ability to see problem from different perspectives Root cause analysis on issues and nail down the reason of issue Walk-in Date: 19th October 2019 Time - 10.30 AM to 4 PM Only Interview Venue: PreludeSys India Limited Old No. D-12, New No. 3/A3, 1st Cross Street, Siruseri SIPCOT IT Park, Chennai - 603 103. Contact Person - Vijay R (HR Team)","location":"Chennai","experience":"1 - 3 Years"},{"date":"16, 17, 18, 19 - Oct - 2019","skills":"Java, J2EE, SQL, HTML, CSS, JavaScript, AngularJS, Spring, SpringBoot and Hibernate","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Atria Convergence Technologies Private Limited, ACT Golden Heights, 1st Floor,59th C Cross, 4th M Block, Near Sujatha,Rajaji Nagar, Bengaluru - 560 010","phone":"9513206011","profile":"Java Developer \nAtria Convergence Technologies Pvt. Limited","description":"We are looking for an Server Side Java developer responsible for the development and maintenance of applications. Your primary focus will be development of applications and their integration with other services along with constant eye of improvements through customer/user feedback. Candidate should have 1+ years of development experience Proficient with Linux, Java, J2EE, SQL Familiarity with HTML, CSS, JavaScript and AngularJS Experience with frameworks such as Spring, SpringBoot and Hibernate Experience with Eclipse IDE Familiarity with RESTful and SOAP APIs Knowledge of other web technologies and UI/UX standards Knack for benchmarking and optimization Proficient understanding of code versioning tools (such as Git, Mercurial or SVN) Experience with Agile and Waterfall SDLC models Walk-in Date/ Time: 16th - 19th October, 10 AM onwards Interview Venue: Atria Convergence Technologies Private Limited ACT Golden Heights, 1st Floor,59th C Cross, 4th M Block, Near Sujatha,Rajaji Nagar, Bengaluru - 560 010 Contact Person- Ranjit Joshi (9513206011)","location":"Bangalore","experience":"1 - 3 Years"},{"date":"17, 18 - Oct - 2019","skills":"General Administration, Front Office Activities/ Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Kotak Mahindra Life Insurance Company Limited, Neelima Nirupama, 4th Floor, Plot No- 55, Old no -22A, Vijay Raghava Road, T Nagar, Near Andhra Club, Chennai - 600 017","phone":"Not Provided","profile":"Administration Executive \nKotak Mahindra Life Insurance Company Limited","description":"Candidate be a graduate with min 6 month work-experience. Age should not be more than 28 Knowledge of Admin role is a must Aware of Local language must Preferences -(Only Female Candidates can apply) Candidates with experience in the below profiles will not be suitable - (Tele calling or customer care profiles (Insurance, Credit card, Holiday Selling etc), Sales background, Account Assistant/Purchase Assistant, Secretaries/Receptionists, Telephone Operators and Admin profiles from educational institutions.) Walk-in Date: 17th - 18th October 2019 Interview Time : 11:00 AM - 3:00 PM Interview Address: Kotak Mahindra Life Insurance Company Limited Neelima Nirupama, 4th Floor, Plot No- 55, Old no -22A, Vijay Raghava Road, T Nagar, Near Andhra Club, Chennai - 600 017 Interviewer Details: Nandhini K Email ID - kli.jayshree-bhati@kotak.com Contact Number - 022-66057050","location":"Chennai","experience":"0 - 1 Years"},{"date":"18 - Oct - 2019","skills":"HR/ Recruitment, Talent Acquisition, Screening, etc","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"RR Donnelley India Outsource Pvt. Limited. 2nd Floor, Acropolis, Radhakrishnan Salai, Mylapore, Chennai","phone":"Not Provided","profile":"HR Executive/ Recruiter \nRR Donnelley India Outsource Pvt. Limited","description":"Essential Qualifications: Graduate in any discipline Work Experience: 2 to 4 year experience Experience in volume hiring from ITES background Should have handled the entire recruitment process. Walk-in Date: 18th October 2019 Time - 11 am to 1 pm Venue: RR Donnelley India Outsource Pvt. Limited 2nd Floor, Acropolis, Radhakrishnan Salai, Mylapore, Chennai Contact Person: Karthik","location":"Chennai","experience":"2 - 4 Years"},{"date":"16, 17, 18, 19 - Oct - 2019","skills":"HR/ Recritment, Talent Management, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"TELEPERFORMANCE INDIA 398, UDYOG VIHAR, PHASE -III, GURGAON, Haryana - 122 016","phone":"8008804661","profile":"HR Executive \nElico Healthcare Services Limited","description":"We have an urgent Requirement in Human Resources for both Healthcare and Manufacturing Departments. Designation: HR Executive Qualification: MBA (HR) Regular Experience: 1 to 2 Years Location : Hyderabad Exclusively looking for Male candidates and Immediate Joiners. Skill Set : Should be proactive Should have good communication skills. Should have good knowledge in Recruitment Process Experience in End to End Recruitment. Should have good knowledge on Job portals Conducting Mass Drives. Bulk Hiring Campus Drives Experience in Healthcare RCM and Manufacturing firm will be an added advantage to your profile. Walk-in Date: 16th - 19th October 2019 Timings : 10 AM to 5:30 PM Interview Venue: Elico Healthcare Services Limited C-56, A.P.I.E, Gate No. 6, Sanathnagar, Hyderabad - 18 Contact Person :Prasanna / Chaitanya Contact No: 8008804661/ 8978447766 Interested candidates, Please Walk In directly for the interview or forward your resume's to prasannam@elicohcs.com and chaitanyaka@elicohcs.com with the following details. EXP: CTC: ETC: NP: Reason for Job Change: *Please carry your Current Companies Offer Letter and Last 3 months Payslips with you while coming for the Interview","location":"Hyderabad","experience":"1 - 2 Years"},{"date":"19 - Oct - 2019","skills":"Core Java/ J2EE, JDBC, SQL and related tools","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"TurningPoint Software Solutions Private Limited, No.31, Ground Floor, TBR Tower, 1st Cross, New Mission Road J.C.Road, Bangalore - 560027","phone":"973933661","profile":"Java Developers \nTurningPoint Global Solutions Pvt. Limited","description":"Candidate should have Bachelors degree or its equivalent in computer science, information technology, engineering, or related technical field with 1.5 to 3 years of overall programming work experience, or any equivalent combination of education and experience. One year of Core Java/ J2EE experience at the minimum. Good understanding of JDBC, SQL and related tools. Good understanding of database design and structures. Ability to understand and construct complex database designs is required. Walk-in Date/ Time: 19th October 2019, 9 AM onwards Interview Venue: TurningPoint Software Solutions Private Limited No.31, Ground Floor, TBR Tower, 1st Cross, New Mission Road J.C.Road, Bangalore - 560027 Contact Person- Deepika M (973933661)","location":"Bangalore","experience":"1 - 3 Years"},{"date":"17, 18 - Oct - 2019","skills":"General Administration, Front Office Activities/ Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Kotak Mahindra Life Insurance Company Limited, #337, 1st floor, 27th Main Road, HSR layout Sector 2, Bangalore 560102, Karnataka","phone":"022-66057050","profile":"Administration Executive \nKotak Mahindra Life Insurance Company Limited","description":"Candidate be a graduate with min 6 month work-experience. Age should not be more than 28 Knowledge of Admin role is a must Aware of Local language must Preferences -(Only Female Candidates can apply) Candidates with experience in the below profiles will not be suitable - (Tele calling or customer care profiles (Insurance, Credit card, Holiday Selling etc), Sales background, Account Assistant/Purchase Assistant, Secretaries/Receptionists, Telephone Operators and Admin profiles from educational institutions.) Walk-in Date: 17th - 18th October 2019 Interview Time : 11:00 AM - 3:00 PM Interview Address: Kotak Mahindra Life Insurance Company Limited #337, 1st floor, 27th Main Road, HSR layout Sector 2, Bangalore 560102, Karnataka Interviewer Details: Priyanka Email ID - kli.jayshree-bhati@kotak.com Contact Number - 022-66057050","location":"Bangalore","experience":"0 - 1 Years"},{"date":"19 - Oct - 2019","skills":"Java, Spring, Hibernate, Web Services","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Trantor Software Private Limited, 18S G-9, Rajiv Gandhi Chd. Technology Park, Chandigarh","phone":"Not Provided","profile":"Java Developers \nTrantor Software Private Limited","description":"Work Experience: 3 to 5 Years Required Skills: Java, Spring, Hibernate, Web Services Good to Have: Liferay and Jenkins Walk-in Date/ Time: 19th October 2019, 10 AM onwards Interview Venue: Trantor Software Private Limited 18S G-9, Rajiv Gandhi Technology Park, Chandigarh","location":"Chandigarh","experience":"3 - 5 Years"},{"date":"16, 17, 18, 19, 21, 22, 23, 24, 25, 26 - Oct - 2019","skills":"Java EE (JSP, Servlets, JPA), J2EE, JVM internals, AJAX","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Marolix Technology Solutions Private Limited, 1st Floor, Three Cube Towers, Beside Watermark Building, Kondapur, Hyderabad","phone":"9154087468","profile":"Java/ Full Stack Developer \nMarolix Technology Solutions Pvt. Limited","description":"Candidate should have 2 years' experience in Java platform development. Must have practical demonstrated experience in design and development of applications with major web development frameworks, including Java EE (JSP, Servlets, JPA), J2EE, JVM internals, AJAX; Must have experience designing and implementing with Struts or Spring or other MVC framework. Hands on experience on Jasper reports development or Similar to Jasper Reports. Reasonably good at UI with fundamental exposure to the technologies like HTML5, JSP, Java Script, JQUERY, CSS, Bootstrap, etc. Must have hands on experience on advanced JS Frameworks like Angular 2. Strong web service integration skills (SOAP, WSDL protocols, REST, Axis, and UDDI) Walk-in Date/ Time: 16th - 31st October 2019, 9 AM onwards Interview Venue: Marolix Technology Solutions Private Limited 1st Floor, Three Cube Towers, Beside Watermark Building, Kondapur, Hyderabad Contact No. 9154087468","location":"Hyderabad","experience":"2 - 4 Years"},{"date":"14 - Oct - 2019","skills":"Technical Support, International Voice Process, Customer Service","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Tai Infotech Private Limited Building No. 149 4th floor Sector 44 Gurgaon. Next to Luminous Building Near Punjab and Sindh Bank Near to HUDA Metro Station","phone":"Not Provided","profile":"Backend Process Associate \nHCL Technologies Limited","description":"Educational Requirement: BBA, BA, B Com, B.SC Graduates (Only 2015/ 2016/ 2017/ 2018 Pass-outs are eligible for this opening). CS can also apply for the same. Work Experience: Freshers / Maximum 6 months experience Note: Technical graduates / Regular MBA's are not eligible for this opening. Shifts : 24*7 (Rotational) Salary: Upto 2.50 LPA Job Location: Gurgaon Skill Set Required:- Good typing speed (25 wpm with 80% Accuracy). Strong commitment to customer service and quality Excellent Keyboard Skills Demonstrates a strong customer service orientation. Takes responsibility to follow up with customers to ensure their needs and expectations are satisfied. Roles & Responsibilities:- Manage and update Insurance Member and Plan data on multiple systems. Enter new member data into excel and enrolment forms. Processes customer requests in a timely and accurate manner. Communicates with customers through written correspondence. Using PC application and functions such as Excel and Word to update and load data sets. To answer queries coming from end user customers in a polite and professional manner. Please Walk in for a face to face Interview Please write Yogendra BIsht on the top of your resume for entry. Interview Date: 14th- October-2019 (Monday) Timings - 11 AM TO 4 PM Interview Venue:- Tai Infotech Private Limited Building No. 149 4th floor Sector 44 Gurgaon Next to Luminous Building Near Punjab and Sindh Bank Near to HUDA Metro Station Please Be in Formals For the interview. Need to Carry: Updated CV, All education certificates (Original & Xerox copy) & Govt address / ID proof. Please Note: Don't carry laptop or any other storage device...!","location":"Noida","experience":"0 - 1 Years"},{"date":"14, 15, 16 - Oct - 2019","skills":"Customer Care, Chat Process, Customer Support","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"[24]7 Customer Private Limited, Ground Floor NSL Arena Town Centre, Behind Cricket Stadium, Ramanthapur Road, Uppal, Hyderabad - 500 039","phone":"Not Provided","profile":"Chat Process Executive (Non Voice) \n[24]7 Customer Private Limited","description":"Eligibility Criteria: Undergraduate/ Graduate & Postgraduate Freshers are eligible to apply. Skills Required: Good Verbal and Written Communication skills. Good logical reasoning & analytical skills. Able to interact with customers via chat, should be able to answer servicing questions. Able to work in rotational night shifts (US). Benefits: Free Transport facility both ways (Home Pick and Home Drop) Interview Rounds: Personal Introduction Round Online Test Operations Round Walk-in Date/ Time: 14th - 16th October 2019, 10 AM onwards Interview Venue: [24]7 Customer Private Limited Ground Floor NSL Arena Town Centre, Behind Cricket Stadium, Ramanthapur Road, Uppal, Hyderabad - 500 039 NOTE: Kindly Carry copy of your Resume and ID proof Xerox Copy. Mention 'Sneha 010' on the top of the resume.","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"14, 15, 16 - Oct - 2019","skills":"Recruitment team handling, Bulk hiring, End to end Recruitment, Employee Retention & Engagement","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Dealmoney Securities Private Limited, Plot No. 356/357, Wagle Industrial Estate, Road No. 26, Near Wagle Bus Depot, Thane (West) Maharashatra - 400 604","phone":"7678009271","profile":"Recruitment Manager \nDealmoney Securities Private Limited","description":"Candidate should have 3 to 5 years of experience in Recruitment team handling, Bulk hiring, End to end Recruitment, Employee Retention, Employee Engagement. Job Responsibility- Handling end to end recruitments, selection, induction & orientation programme and joining Handling employee relations and employee engagement activities. Handling Recruitment team Walk-in Date/ Time: 12th - 16th October , 12 PM onwards Interview Venue: Dealmoney Securities Private Limited Plot No. 356/357, Wagle Industrial Estate, Road No. 26, Near Wagle Bus Depot, Thane (West) Maharashatra - 400604","location":"Mumbai","experience":"3 - 5 Years"},{"date":"17, 18 - Oct - 2019","skills":"Front Office/ Receptionist Activities, Front Office Operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Ebenezer International School, Singena Agrahara Road, Via Huskur Road, A.P.M.C. Yard, Huskur P.O, Electronic City, Bengaluru, Karnataka - 560 099","phone":"9445455522","profile":"Front Office Executive \nJND Edu Management Services Pvt. Limited","description":"We are looking for a pleasant and friendly Front Desk Representative to join our team! As a Front Desk Representative, you will be responsible for receptionist and clerical duties at our office. Walk-in Date/ Time: 17th & 18th October , 8 AM onwards Interview Venue: Ebenezer International School Singena Agrahara Road, Via Huskur Road, A.P.M.C. Yard, Huskur P.O, Electronic City, Bengaluru, Karnataka - 560 099","location":"Bangalore","experience":"0 - 2 Years"},{"date":"18, 19 - Oct - 2019","skills":"Email Support, Customer Support, Hardware/ Networking, IT Helpdesk. Remote Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Arrow Electronics (India) Private Limited, 2nd Floor, Solitaire Building, Plot No. 1+2 S. No. 131/1+2, CTS No.1335, Above Reliance Digital, Aundh, Pune - 411 007.","phone":"Not Provided","profile":"IT Helpdesk/ Support Engineer \nArrow Electronics (India) Private Limited","description":"Candidate should be Any Graduate with good hands on experience in Active directory , windows support and office 365 support. Must have excellent communication skills. Ready to work in 24/7 shifts Had worked on Global IT voice support Preferred who can join immediately Only Male candidate are preferred Job Responsbility- Help desk analysts are on the frontline of customer support. They are focused on helping to resolve technical issues end users encounter, or connecting those users with more intensive IT support, when needed. Tier 3 analysts research and resolve the most complex issues that other help desk levels have been unable to fix. They also identify trends in issue reporting and come up with preventative solutions. Walk-in Date: 18th & 19th October 2019 Days: Friday and Saturday Time : 10 am to 4 pm Interview Venue: Arrow Electronics (India) Private Limited 2nd Floor, Solitaire Building, Plot No. 1+2 S. No. 131/1+2, CTS No.1335, Above Reliance Digital, Aundh, Pune - 411 007. Landmark: Opposite Reliance Footprint Contact Person : Shruthi","location":"Pune","experience":"3 - 7 Years"},{"date":"14, 15, 16 - Oct - 2019","skills":"Technical Support, Client Management, Customer Relationship, Life Cycle Execution, Project Management","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Techbooks International Private Limited, A-37, Sector - 60, NOIDA - 201 301","phone":"Not Provided","profile":"Tech Support Specialist (HTML/ XML) \nTechbooks International Private Limited","description":"Candidate should be Any Graduate with 2 to 6 years of experience in Technical Support, Client Management, Customer Relationship, Life Cycle Execution, Project Management. Should have excellent communication skills. Willing to work 24*7 Shift only apply. Job Responsbility- Managing the complete life cycle of the project starting from receiving the projects, sending them in a workable format to the composition team, monitoring the execution and ensuring that the end product is delivered in a timely manner with highest quality. Interacting with the Clients on a continuous basis regarding the specifications of the projects, handling their queries, keeping them updated about the status of the current projects through live chats, e-mails and phones. (Customer Relations) Walk-in Date: 14th - 16th October 2019 Time: 9 AM to 2 PM Interview Venue: Techbooks International Private Limited A-37, Sector - 60, NOIDA - 201 301","location":"Noida","experience":"2 - 6 Years"},{"date":"14, 15 - Oct - 2019","skills":"Technical Support, US Process, Customer Support/ Service, Networking","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Tech Mahindra Limited, RMG Area, Tech Boulevard, Sector-127, Noida - 201 304","phone":"8826741514","profile":"Technical Support (Semi-Networking) \nTech Mahindra Limited","description":"Tech Mahindra is hiring fresher's and experienced candidates for Technical/ Network Support for Tech Voice Process. Company: Tech Mahindra Job Type: Permanent Job Location: Sector-127, Noida Experience Range:Any experience eligible. Freshers can also apply Role: Technical/ Customer Support Associate Skills Required:- Excellent logical reasoning with good communication skills. Candidate should be aware of good technical knowledge. Troubleshooting of technical related issues and ensure to resolve the issues or queries over the call. Candidate should be flexible to work in 24*7 environments, comfortable to work in night shifts. Result awaited candidates can also apply. Both side Transport facility available (Pick & Drop). 5 Days Working. Walk-in Details : 14 & 15 October 2019 Timing: 11:00 AM- 4 PM Venue: Tech Mahindra Limited, RMG Area, Tech Boulevard, Sector-127, Noida - 201 304 Landmark: Tech Boulevard, Tower C For any Further Queries Call Japleen : 8826741514 Keshav : 7838941910 1. SSC (Mark sheet & Certificate) 2. HSC (Mark sheet & Certificate) 3. Graduation CMM or PC 4. Offer, Relieving Letter and last 3 months of Salary Slips(If any) 5. Pan Card 6. Aadhar Card (Mandatory)","location":"Noida","experience":"0 - 5 Years"},{"date":"14, 15, 16, 17, 18 - Oct - 2019","skills":"Customer Support, Social Media, Inbound/ Outbound Calling, Customer Service","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Unimoni Global Business Services Pvt. Limited, New Indian Express Building, Second Floor, Kaloor, Kochi - 682 017, Kerala","phone":"Not Provided","profile":"Customer Support Associate/ Trainee \nUnimoni Global Business Services Pvt. Limited","description":"Candidate should have 0 to 5 years of experience in Customer Support, Social Media, Inbound/ Outbound Calling, Customer Complaints, Customer Service Management. Should have good communication skills Roles & Responsibilities: Resolve product or service problems by clarifying the customer's complaint; determining the cause of the problem; selecting and explaining the best solution to solve the problem; Recommend potential products or services to management by collecting customer information and analyzing customer needs Prepare product or service reports by collecting and analyzing customer information Contribute to team effort by accomplishing related results as needed Walk-in Date/ Time: 14th October - 18th October , 10 AM onwards Interview Venue: Unimoni Global Business Services Pvt. Limited New Indian Express Building, Second Floor, Kaloor, Kochi - 682 017, Kerala","location":"Kochi","experience":"0 - 5 Years"},{"date":"14 - Oct - 2019","skills":"Technical Support, Installation, Configuration & Troubleshooting Skills","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Computer Generated Solutions (India) Private Limited, 4th Floor, Plot No. 5 & 6, Image Garden, Silicon Valley Road, Madhapur, Hyderabad - 500 081","phone":"7981111058","profile":"Technical Support Associate \nComputer Generated Solutions India (P) Ltd.","description":"Educational Qualification:-10+2/ Any Graduate Must have good communication in Hindi & English Immediate Joiners Required Job on boarding Date:- 16-10-2019 (Wednesday) Required good knowledge of OS (XP, Win 8, Win 10) & Standard Application - Installation, configuration & Troubleshooting. Good knowledge on hardware troubleshooting, installation, configuration. Good knowledge of desktop operating systems and Microsoft office products(MS office 2007, 2010, 2013). Knowledge of Installation and troubleshooting Network Printers, Scanners, Antivirus and VPN clients. And required basic knowledge in networking. Interview Date: 14th October 2019 Timings: 10 AM Onwards Interview Venue: Computer Generated Solutions (India) Private Limited 4th Floor, Plot No. 5 & 6, Image Garden, Silicon Valley Road, Madhapur, Hyderabad - 500 081 For further information call to 7981111058 (Vamsi)","location":"Hyderabad","experience":"0 - 5 Years"},{"date":"17 - Oct - 2019","skills":"C#, ASP .Net, ADO.Net, XML, SOA, Web Services, Ajax, JQuery, MVC & .NET frameworks","qualification":"B.E./B.Tech, MCA/PGDCA","address":"InterGlobe Technology Quotient Pvt. Limited, 6th Floor, Tower 6, Candor Tech Space Tikri, Sector 48, Gurgaon - 122 018 Haryana","phone":"0124-4284852","profile":".Net Developer \nInterGlobe Technology Quotient Pvt. Limited","description":"Candidate should be B.Tech/ MCA with strong experience of C#, ASP .Net, ADO.Net, XML, SOA, Web Services, Ajax, JQuery, MVC & .NET frameworks (4.0 and above). Experience in optimizing SQL scripts, stored procedures, SQL Reporting Services and SQL tools such as Profiler etc. Peer and pair with development teams as extreme programmers for code coverage, code reviews and unit testing. Strong debugging, problem resolution & application deployment skills. Interested candidates are invited for Walk-In Interview on Thursday 17th October between 10.30 am to 3 pm. Interview Venue: InterGlobe Technology Quotient Pvt. Limited 6th Floor, Tower 6, Candor Tech Space Tikri, Sector 48, Gurgaon - 122 018 Haryana Contact Person - Nikhhita/ Sabeera Tel: 0124-4284852","location":"Gurgaon","experience":"1 - 3 Years"},{"date":"14, 15 - Oct - 2019","skills":"Recruitment, HR, IT Recruitment, Hiring, Interviewing/ Recruitment, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Million Minds Management Services Limited, C 124, 2nd floor, Sector 2m Noida - 201 301. Nearest Metro Station 15","phone":"Not Provided","profile":"HR Executive/ Talent Acquisition \nMillion Minds Management Services Limited","description":"Candidate should have 6 month to 2 year experience in Recruitment, HR, IT Recruitment, Hiring, Interviewing/ Recruitment, Talent Acquisition. Expert in Naukri.com portal and other sources Job Responsibilities- Responsible for end to end hiring and bulk hiring Screen incoming resumes and application forms Arrange telephonic and face to face interview Screen incoming resumes and application forms Walk-in Date/ Time: 14th - 15th October 2019, 11 AM onwards Interview Venue: Million Minds Management Services Limited C 124, 2nd floor, Sector 2m Noida - 201 301 Nearest Metro Station 15 Interested candidate mail update CV on hr.ddugky@million-minds.com or call on 7217896036.","location":"Noida","experience":"0 - 2 Years"},{"date":"15, 16, 17, 18 - Oct - 2019","skills":".Net, C#, jQuery, ASP .Net, Javascript and MySQL","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Kotak Mahindra OM Life Insurance Limited, C-31, Community Centre, 1st and 2nd Floor, Near Janak Cinema, Janakpuri, New Delhi- 110058.","phone":"9582433492","profile":"Senior .Net Developer \nInficare Software Technologies Pvt. Limited","description":"Candidate should be BE/ B.Tech/ BCA/ MCA or MSc (Computers) with 3 to 8 years of experience in Software Development using .Net, C#, jQuery, ASP .Net, Javascript and MySQL Walk-in Date: 14th - 18th October 2019 Time - 11 am to 6 pm Interview Venue: Inficare Software Technologies Pvt. Limited 2nd floor, D-92 ,Sector 2 ,Noida (Near Noida Sector 16 Metro Station)","location":"Noida","experience":"3 - 8 Years"},{"date":"15 - Oct - 2019","skills":".Net, MVC ASP .NET C# 4.0, MS SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Aforeserve .com Limited, B-21, Sector - 8, Noida. Landmark: Near Swani Furniture.","phone":"7303898936","profile":"Software Developer (.Net) \nAforeserve .com Limited","description":"We have an urgent opening for 'Software Developer' Profile with our company Aforeserve.com Limited Educational Qualification: B.Tech/ B.E or MCA Work Experience: 2-5 Years Only for Male Candidates Must have proven experience as a .NET Developer or Application Developer Familiarity with the ASP .NET framework, SQL Server and design/architectural patterns (e.g. Model-View-Controller (MVC)) Knowledge of at least one of the .NET languages (e.g. C#, Visual Basic .NET) and HTML5/ CSS3 Familiarity with architecture styles/APIs (REST, RPC) Understanding of Agile methodologies Excellent troubleshooting and communication skills Must have ability to develop large scale web/ database applications Ability to communicate clearly with business users and project manager Ability to innovate and provide functional applications with intuitive interfaces Excellent knowledge of SQL Knowledge of Angular Js is plus point MVC ASP .NET C# 4.0, MS SQL Server 2005/2008 WCF Services Jquery / JavaScript Entity Framework Understanding of HTML, JS, and CSS Walk-in Date/ Time: 14th - 15th October 2019, 10 AM onwards Interview Venue: Aforeserve .com Limited B-21, Sector - 8, Noida. Landmark: Near Swani Furniture. Nearest Metro - Sector - 15 Noida Contacat Person: Gaurav singh Contact no. 7303898936","location":"Noida","experience":"2 - 5 Years"},{"date":"19 - Oct - 2019","skills":"C#, CSS, VB .NET, Javascript, ASP .Net, HTML, SQL Server","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Marketplace Technologies Private Limited, 3rd floor, B-wing, Aggarwal Trade Centre, Plot 62, Sector 11, Belapur CBD, Navi Mumbai - 400 614","phone":"022-61484241","profile":"ASP .Net Developer \nMarketplace Technologies Private Limited","description":"Marketplace Technologies Private Limited looking for .NET Developer Utilize established development tools guidelines and conventions including but not limited to ASP .NET, SQL Server, HTML, CSS, Java Script & C#/ VB .NET Prepare & maintain code for various Net applications Database dev. Walk-in Date/ Time: 19th October 2019, 10 AM onwards Interview Venue: Marketplace Technologies Private Limited 3rd floor, B-wing, Aggarwal Trade Centre, Plot 62, Sector 11, Belapur CBD, Navi Mumbai - 400 614 Tel. : +91-22-61484250/ 61484241","location":"Mumbai","experience":"2 - 5 Years"},{"date":"15, 16, 17, 18 - Oct - 2019","skills":"C#, MVC, .Net","qualification":"B.E./B.Tech, MCA/PGDCA","address":"AGS Transact Technologies Limited, AGS House, Plot No EL 82 & 83, TTC Industrial Estate, MIDC Electronic Zone, Navi Mumbai - 400 705.","phone":"Not Provided","profile":"Junior .Net Developer \nAGS Transact Technologies Limited","description":"AGS Transact Technologies Limited is hiring for .Net Developer in Ghansoli Work Experience required - 2 to 4 years Candidate should have good knowledge in C#, MVC, .Net CTC - till 4 lakhs Day shift Walk-in Date/ Time: 14th October - 18th October , 2 PM onwards Interview Venue: AGS Transact Technologies Limited AGS House, Plot No EL 82 & 83, TTC Industrial Estate, MIDC Electronic Zone, Navi Mumbai - 400 705. Contact Person : Rasika HR team","location":"Mumbai","experience":"2 - 4 Years"},{"date":"7, 8, 9, 10, 11, 14, 15 - Oct - 2019","skills":"TESTING/ JAVA/ PHP Programming, OOPS Concept","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"SECRET TECHNOLOGIES INDIA (VMS Group) Office No. 302, Amit Samruddhi, Opposite Balgandharva Rang Mandir, Behind Arrow Showroom, J. M. Road, Pune - 411 004","phone":"Not Provided","profile":"IT Freshers (Testing/ Java/ PHP) \nSecret Technologies India (VMS Group)","description":"Secret Technologies India (VMS Group) Private Limited is hiring IT Freshers (Testing/ Java/ PH Qualification:BE, ME, MCA, BCA, BSC, any graduate Joining: Immediate Strong knowledge of TESTING/ JAVA/ PHP programming required. Should have knowledge of basic Programming languages like C, Java and any database Strong knowledge of OOPS Concept. Required Experience, Required Skills: Should have knowledge of basic Programming languages like C, Java and any database Strong knowledge of OOPS Concept. Should have a fair knowledge of entire SDLC, STLC. Good analytical and problem solving ability. Detail orientated with excellent written and verbal communication skills. Direct Walk-in for the Interview on weekdays (Monday to Friday) Date - 1st to 15th October 2019 Timing 10.00 Am to 4 .30 PM Venue Details SECRET TECHNOLOGIES INDIA (VMS Group) Office No. 302, Amit Samruddhi, Opposite Balgandharva Rang Mandir, Behind Arrow Showroom, J. M. Road, Pune - 411 004 You will meet HR Pritee. & Mr. Rahul Sir (Director) The interview will last about 15 minutes and you'll have the chance to discuss the Software Developer and Software Testing, Industrial Technical or Non Technical Jobs position and learn more about our company","location":"Pune","experience":"0 - 1 Years"},{"date":"14, 15, 16, 17, 18 - Oct - 2019","skills":"Software Testing, Test Plan/ Cases & Bug Reports, Selenium WebDriver, Writing Test cases","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Knovos (India) Private Limited, A-501, APPL, IT-SEZ, K RAHEJA ROAD, KOBA, GANDHINAGAR - 382 009","phone":"Not Provided","profile":"QA/ Testing Engineer \nKnovos India Private Limited","description":"Candidate must have good knowledge of Stlc, Automation Test Life Cycle). Ability to learn new Software Using Manuals Within a Short Period of Time. Should have knowledge of Sql, MySql , TFS. Pressure handling, Team player, Go Getter, Self-starter. Excellent in client communication. Quality Checking & Delivery of Firms Products. Test Plan/ Cases & Bug Reports. Handling Elements in Selenium WebDriver. Writing Test cases using Element locators, WebDriver Methods, Python Programming. Walk-in Date/ Time: 14th - 18th October , 10 AM onwards Interview Venue: Knovos (India) Private Limited A-501, APPL, IT-SEZ, K RAHEJA ROAD, KOBA, GANDHINAGAR - 382 009","location":"Gandhinagar","experience":"1 - 5 Years"},{"date":"14, 15, 16, 17, 18 - Oct - 2019","skills":"Automation (Selenium), Core Java, Create Test Cases, OOPS Concept","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"GSR Business Services (Pvt.) Limited, 2nd Floor, West Wing, Khivraj Building, Above Maruti Suzuki Showroom, Perungudi, Chennai - 600 096.","phone":"8870476197","profile":"Automation Test Engineer \nGSR Business Services Private Limited","description":"Must have minimum 2+ years work experience in Automation (Selenium) Must have strong experience in Core Java Ability to create Test Cases Should be strong in OOPS Concept Core Java programming experience is an added advantage Should have done complete end to end testing & Debugging Walk-in Date: 14th - 18th October 2019 Timings - 10:00 AM to 4:00 PM Interview Venue: GSR Business Services (Pvt.) Limited 2nd Floor, West Wing, Khivraj Building, Above Maruti Suzuki Showroom, Perungudi, Chennai - 600 096. Near Perungudi Toll Plaza, OMR Road (Rajiv Gandhi Salai)","location":"Chennai","experience":"2 - 7 Years"},{"date":"19 - Oct - 2019","skills":"Liasion, Security, Vendor Development, Housekeeping, Facility Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Jones Lang LaSalle Property Consultants (India) Pvt. Limited, Level 6, Amar Avinash Corporate Plaza, Near Inox, Bund Garden Road, Pune - 411 001","phone":"Not Provided","profile":"Front Office Executive \nJones Lang LaSalle Property Consultants (India) Pvt. Limited","description":"Candidate should be Any Graduate with 3 to 6 years experience in Client Servicing, Front Office Operations, Time Office, Reception/ Guest Relations, Daily Operations, Workforce Planning, Site Inspection. Must have effective communication skills. Experience in Facility & Hotel Industry would be preferred. Duties and Responsibilities: Ensure giving a warm welcome to clients there by creating a delightful experience. Maintain effective communication and working relationships with all other departments (HK, Duty Engineer, Duty Manager, Builder, Wellness room, Time Office, Security, Reception). The GRE Should have up to date knowledge of the following Floor structure/Plan. Projects on each floor. Project Leads and SPOCS Site inspection Tool Be aware of floor capacity/Bay nos and floor strength. Ensure that no photography/Videography is done inside the premises without prior approval, share the photography form to employs and ensure the required process is followed. Conduct daily briefings with housekeeping and security team, ensure all staffs are aware of all important visits on the floor. Scope of work, amenities & services, policies & procedure along with in depth knowledge of all Accenture premises (Pan India) & local area. Ensure maintaining close communication with the client (Floor Leads/ Project Leads/ Industry Leads and CSO team. Ensure nominations for Floor wardens are taken and updated on regular basis. Check cleanliness of lobby, work caf/ Pantry/Meeting/ Tele Booth/ rooms/Design thinking areas/ Work Pods/Restricted Access Bays/Wash Room etc. Walk In Drive on 19th Oct 2019 from 10 am to 1 pm Interview Venue: Jones Lang LaSalle Property Consultants (India) Pvt. Limited Level 6, Amar Avinash Corporate Plaza, Near Inox, Bund Garden Road, Pune - 411 001","location":"Pune","experience":"3 - 6 Years"},{"date":"12 - Oct - 2019","skills":"General Administration, Back Office Activities, Customer Relationship","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"RNDMFG, No. 10/ 15, 3rd Floor, MMH Complex Natesan Street Above Hotel Kumara Bhavan, T. Nagar, Chennai, Tamil Nadu - 600 017","phone":"9962977000","profile":"Admin Executive \nRNDMFG","description":"Education: Higher Secondary (12th Pass)/ Graduates Key Skills- Good communication skills Job Type/ Experience: Full-time, Fresher, Walk-In Job Responsbility- Managing online enquires from customers Maintaining customer relationship with retail customers Maintaining digital presence and online sales Salary: INR 8,000.00 to 10,000.00 /Month Walk-in Date:12-10-2019 Timing :11 am to 2 pm Venue Details RNDMFG, No. 10/ 15, 3rd Floor, MMH Complex Natesan Street Above Hotel Kumara Bhavan, T. Nagar, Chennai, Tamil Nadu - 600 017 Contact: Lalitha -9962977000","location":"Chennai","experience":"2 - 5 Years"},{"date":"19 - Oct - 2019","skills":"PHP and Angular 2/4/5/6/7 & Bootstrap 3 / 4, Node JS","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Matrimony.com, Arihant E Park, 6th Floor, LB Road, Adyar, Landmark - Opp Adyar Ananda Bhavan, Chennai, Tamilnadu - 600020","phone":"Not Provided","profile":"PHP/ Angular Developer \nMatrimony.com Limited","description":"Walk In Interview for PHP/ Angular JS - Matrimony.com - 19th Oct - Coimbatore Location Candidate should have experience in working PHP and Angular 2/4/5/6/7 & Bootstrap 3/ 4 Node JS experience is an added advantage Very good knowledge of HTML and CSS Strong knowledge of JavaScript Experience with git Comfortable working across the full stack from development to deployment Knowledge of NPM Knowledge of gulp/grunt Knowledge of Agile React or any JS framework is an advantage Server-side knowledge is an advantage Interested candidates shall share with us your profile on or before 14th October 2019 to gracy.mary@matrimony.com We will reach out to suitable candidates only.","location":"Chennai, Coimbatore","experience":"3 - 5 Years"},{"date":"11, 12, 14, 15, 16, 17, 18, 19, 21, 22, 23, 24, 25 - Oct - 2019","skills":"Java based Android (Native), Android SDK, Recycler View, Card View, List View","qualification":"B.E./B.Tech, MCA/PGDCA","address":"CROSSEDGE Technologies Private Limited, 14, Pammal Main Road, Opposite to IDBI Bank, Pamal, Chennai - 600 075","phone":"Not Specified","profile":"Android Developer \nCROSSEDGE Technologies Pvt. Limited","description":"Candidate must have 2 to 5 years experience in Java based Android (Native) development. Must have strong knowledge on Android SDK, Android basics like Manifest components, Recycler View, Card View, List View, Broadcast receiver, Location services, Full Activity lifecycle, Handling of Dialog/Fragment dialog, Fragment lifecycle. Experience in developing best practices, software principles and code design concepts Ensure the performance, quality, and responsiveness of applications Experience in developing and supporting rapid iterations of software in an agile context Help maintain code quality, organisation, and automation Skills Walk-in Date/ Time: 11th - 25th October , 9 AM onwards Interview Venue: CROSSEDGE Technologies Private Limited 14, Pammal Main Road, Opposite to IDBI Bank, Pamal, Chennai - 600 075","location":"Chennai","experience":"2 - 5 Years"},{"date":"11, 12, 14, 15, 16, 17, 18, 19, 21, 22, 23, 24, 25 - Oct - 2019","skills":"PHP, Javascript, Ajax, jQuery, XML, XHTML, Web Services & RESTful APIs","qualification":"B.E./B.Tech, MCA/PGDCA","address":"CROSSEDGE Technologies Private Limited, 14, Pammal Main Road, Opposite to IDBI Bank, Pamal, Chennai - 600 075","phone":"Not Provided","profile":"PHP Developer \nCROSSEDGE Technologies Pvt. Limited","description":"Candidate must have strong knowledge of PHP, Javascript, Ajax, jQuery, XML, XHTML, third party web services & RESTful APIs. Should have knowledge in Payment Gatway. Knowledge in PHP 7 web frameworks such as CodeIgniter 3.1.1, Laravel, CakePHP will be added advantage Responsibilities and Duties: Participate in various phases of SDLC including design, coding, reviews, testing, and documentation. Design, develop, test, debug and maintain web application/REST web service-based solutions in PHP Participates in all phases of the software development life-cycle - requirements, architecture/design, implementation, testing, release, maintenance of our software applications. Walk-in Date/ Time: 11th - 25th October , 9 AM onwards Interview Venue: CROSSEDGE Technologies Private Limited 14, Pammal Main Road, Opposite to IDBI Bank, Pamal, Chennai - 600 075","location":"Chennai","experience":"2 - 5 Years"},{"date":"11, 12, 14, 15, 16, 17, 18, 19, 21, 22, 23, 24, 25 - Oct - 2019","skills":"Core PHP, HTML5, CSS3, Codeigniter, JQuery, and ReactJs","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Official Gates Technologies Pvt. Limited, 106, 1st Floor, D Block, 1st Main Road, Annanagar East, Chennai - 600 102","phone":"9841299222","profile":"PHP Developer \nOfficial Gates Technologies Pvt. Limited","description":"The candidate must be creative, problem-solver and willing to work with the team. Must have good understanding of front-end technologies including Core PHP, HTML5, CSS3, Codeigniter, JQuery, and ReactJs Walk-in Date/ Time: 11th October - 31st October , 11 AM onwards Interview Venue: Official Gates Technologies Pvt. Limited 106, 1st Floor, D Block, 1st Main Road, Annanagar East, Chennai - 600 102","location":"Chennai","experience":"0 - 5 Years"},{"date":"10, 11, 12 - Oct - 2019","skills":"Core PHP, HTML/ CSS/ Javascript/ Jquery & MySQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Aavaz Contact Center Solutions, 128 B, Second Floor, Shahpur Jat, New Delhi - 110 049. Landmark- Slice of Italy, Next to UCO Bank","phone":"8287854151","profile":"PHP Developer \nAavaz Contact Center Solutions","description":"Candidate should have good knowledge/ experience in Core PHP. Knowledge of Wordpress / Cake PHP is an advantage. Excellent knowledge of HTML/ CSS/ Javascript/ Jquery & MySQL Preference will be given for command over Database skills. Experience in PHP, CMS / Framework. Object oriented programming. Experience in moodle & magento will be a plus. Walk-in Date/ Time: 9th October - 12th October , 11 AM onwards Interview Venue: Aavaz Contact Center Solutions 128 B, Second Floor, Shahpur Jat, New Delhi - 110 049 Landmark- Slice of Italy, Next to UCO Bank Nearest Metro- Greenpark/ Hauzkhas/ Panchsheel Park","location":"Delhi","experience":"1 - 3 Years"},{"date":"10, 11, 12, 14, 15, 16, 17, 18, 19, 21 - Oct - 2019","skills":"PHP5, MySQL, Ajax, jQuery, Javascript, HTML5, CSS3, XML, Scripting and Database Administration","qualification":"B.E./B.Tech, MCA/PGDCA","address":"XS Infosol Private Limited, C-34 Sector-2 Noida, Near Nirula Hotel, Near Sector-15 Metro Station, Noida - 201 301","phone":"9953007925","profile":"PHP Developer \nXS Infosol Private Limited","description":"Candidate must have expertise in PHP Frameworks and good technology exposure of Codeigniter / Core Php. Excellent knowledge of PHP5, MySQL, Ajax, jQuery, Javascript, HTML5, CSS3, XML, Scripting and Database Administration Must have sound understanding of OOPs Strong Cross-Browser HTML5/ CSS3 Skills Walk-in Date/ Time: 10th - 21st October , 11 AM onwards Interview Venue: XS Infosol Private Limited C-34 Sector-2 Noida, Near Nirula Hotel, Near Sector-15 Metro Station, Noida - 201 301","location":"Noida","experience":"0 - 5 Years"},{"date":"9, 10, 11, 12 - Oct - 2019","skills":"C++ XML Web Technologies Data Structures MySQL PHP Perl","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Greet Technologies Private Limited, L327-328 6th Main, Service Road, 6th Sector, HSR Layout, Bangalore - 560 102. Landmark: Near Fitjee Pu College","phone":"Not Provided","profile":"PHP Developer \nGreet Technologies Private Limited","description":"Candidate should have deep knowledge and in using Perl for web development. Knowledge in working with regular expressions and complex data structures in Perl. Knowhow of processing XML in Perl Strong background in SQL Working experience with My-SQL Servers Walk-in Date/ Time: 9th October - 12th October , 10 AM onwards Interview Venue: Greet Technologies Private Limited L327-328 6th Main, Service Road, 6th Sector, HSR Layout, Bangalore - 560 102 Landmark: Near Fitjee Pu College","location":"Bangalore","experience":"0 - 1 Years"},{"date":"13 - Oct - 2019","skills":"Core PHP (OOPS), YII(Mandatory), Open Cart, SUIT CRM, MySQL","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"3i Infotech Limited, Prince infocity 2, 3rd Floor, Kandanchavadi, Chennai - 96","phone":"044-71622577","profile":"PHP Developer \n3i Infotech Limited","description":"Primary Skill Set: Core PHP (OOPS), YII (Mandatory), Open Cart, SUIT CRM, MySQL Added Advantage: ORACLE, Jquery, JAVA Script, HTML, CSS & Version Control Tool Work Experience: 3- 6 Years Notice Period: Immediate (15 Days Max) Salary: Industry Standard Interested candidates can walk-in to below mentioned address: Interview Date : 13th October 2019 (Sunday) Time : 10.30 AM to 12PM 3i Infotech Limited, Prince infocity 2, 3rd Floor, Kandanchavadi, Chennai - 96 Contact Person : Vivek","location":"Chennai","experience":"3 - 6 Years"},{"date":"11, 12, 13, 14, 15, 16 - Oct - 2019","skills":"Domestic Bpo, Back Office Operations","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Reliable Spaces Private Limited, No. 51, Rajiv Gandhi Salai (OMR), Rattha TEK MEADOWS, C Block, 1st floor, Sholinganallur, Chennai - 600 119","phone":"022 3375 0037","profile":"Banking Associate (Non-Voice Process) \nReliable Spaces Private Limited","description":"We have Immediate job openings for Banking Associate (Non-Voice Process) Key Requirements: 1. Should know English and Tamil. 2. Freshers 3. Any qualification is accepted. 4. Immediate joiners preferred. Job Responsibility: 1. The candidate will be involved in Banking Non-Voice process. 2. Complete Day Shift. 3. Attractive and Best in market Salary Packages. * Spot Offer on Selection. Walk-in Date/ Time: 11th - 16th October 2019, 10 AM onwards Interview Venue: Reliable Spaces Private Limited No. 51, Rajiv Gandhi Salai (OMR), Rattha TEK MEADOWS, C Block, 1st floor, Sholinganallur, Chennai - 600 119 Phone No. 022 3375 0037| Ext: 50037| Mob: 7904356739 Email: indra.kumar@reliablebss.com","location":"Chennai","experience":"0 - 1 Years"},{"date":"12 - Oct - 2019","skills":"PHP, Javascript, ReactJS or VueJS or AngularJS","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Netedge Computing Solutions Pvt. Limited, C-56/39 NetEdge Tower Sector-62, Noida - 201301","phone":"70427-94831","profile":"Software Engineer - PHP \nNetedge Computing Solutions Pvt. Limited","description":"The person must have : Experience in Development using PHP, Javascript, ReactJS or VueJS or AngularJS Experience in MySQL & other open source technologies. He/She must have orientation towards quality & customer satisfaction. The Person Will be Responsible for: Coding & development of programs / modules Timely delivery of programs & projects to customers Ability to work in a team environment Must meet tight deadlines & work on several projects simultaneously Walk-in Date/ Time: 12th October , 11 AM onwards Interview Venue: Netedge Computing Solutions Pvt. Limited C-56/39 NetEdge Tower Sector-62, Noida - 201301","location":"Noida","experience":"2 - 3 Years"},{"date":"14, 15, 16, 17, 18 - Oct - 2019","skills":"General Administration, Front Office/ Receptionist Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"GGS Information Services (India) Private Limited, Trifecta Adatto Techpark, No 66/2. 67/1, 10th Floor Whitefield Main Road, Garudacharpalya, Mahadevpura Post, Bangalore - 560 048","phone":"Not Mentioned","profile":"Front Office Executive (Male) \nGGS Information Services (India) Pvt. Limited","description":"Candidate should be Any Graduate with Basic Computer Knowledge Must have strong communication and people skills Good organizational and multi-tasking abilities Jobs Duties & Responsibilities Greeting and attending to inquires HR Activities Admin Activities Organise and maintain files and records; update when necessary Walk IN with your CV/ Resume between 10:30 AM to 5 PM (Monday to Friday) Interview Venue: GGS Information Services (India) Private Limited Trifecta Adatto Techpark, No 66/2. 67/1, 10th Floor Whitefield Main Road, Garudacharpalya, Mahadevpura Post, Bangalore - 560 048 Landmark: Next to Phoenix Mall (Near Decathlon)","location":"Bangalore","experience":"0 - 2 Years"},{"date":"14, 15, 16 - Oct - 2019","skills":"Core Java, Advance Java, Servlets, JSP, JavaScript, HTML5, Hibernate","qualification":"B.E./B.Tech, MCA/PGDCA","address":"MS Technology Private Limited, 2, Community Centre, IInd Floor, Basant Lok, Opposite Hero Corporate office, Vasant Vihar","phone":"Not Provided","profile":"Java Developer \nMS Technology Private Limited","description":"Candidate must have expertise in Core Java, Advance Java, Servlets, JSP, JavaScript, HTML5 Hibernate, Webservices, REST API,Apple IOS,Google Android, Angular5 or above Have experience in IDE like Eclipse, NetBeans etc. Good exposure to object oriented design patterns. Good Database concepts. Walk-in Date/ Time: 14th October - 16th October , 11 AM onwards Interview Venue: MS Technology Private Limited 2, Community Centre, IInd Floor, Basant Lok, Opposite Hero Corporate office, Vasant Vihar","location":"Delhi","experience":"1 - 2 Years"},{"date":"11, 12, 14, 15 - Oct - 2019","skills":"PHP, MVC Frameworks, Code igniter, Magento, Laravel Open cart or any CMS","qualification":"B.E./B.Tech, MCA/PGDCA","address":"RisingRoot Technologies Private Limited, #35, Fourth Floor, Narras House, Arunodaya Colony, Image Garden Road, Madhapur, Hi-tech City, Hyderabad","phone":"040-42305959","profile":"PHP Developers \nRisingRoot Technologies Pvt. Limited","description":"We are looking for a PHP Developer with a wide range of experience in web development. Hands-on experience in server-side web application logic and Third Party APIs/ CSS/ GitHub/ JQuery. Expertise in PHP, MVC Frameworks and good technology exposure of Code igniter, Magento, Laravel Open cart or any CMS. Candidate should have Bachelors Degree and/or 2+ years of software development experience or equivalent, including Object Oriented design and PHP Development. Roles & Responsibilities: Work with PHP and MySQL to design, develop and debug web applications Integrate back-end services with PHP/Javascript based front end needs. Work with the team to manage, optimize and customize multiple web applications. Create and maintain technical documentation. Walk-in Date/ Time: 10th - 15th October , 11 AM onwards Interview Venue: RisingRoot Technologies Private Limited #35, Fourth Floor, Narras House, Arunodaya Colony, Image Garden Road, Madhapur, Hi-tech City, Hyderabad Tel No: 040-4230 5959 Mob: 6300952607","location":"Hyderabad","experience":"2 - 5 Years"},{"date":"13 - Oct - 2019","skills":"Hospital Administration, Healthcare","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Popular Medicare Limited, DLW, Kakarmatta, Near Flyover Bridge Varanasi, Uttar Pradesh","phone":"Not Specified","profile":"Hospital Administrator \nPopular Medicare Limited","description":"Popular Medicare Limited is looking for MHA candidate for Varanasi & Mirzapur Location Job Responsibility- Organizing & overseeing health services & daily activities of hospital. Manage staff & budgets, communicate between departments & ensure adequate patient care amongst other duties. Walk-in Date/ Time: 13th October 2019, 10 AM onwards Interview Venue: Popular Medicare Limited DLW, Kakarmatta, Near Flyover Bridge Varanasi, Uttar Pradesh","location":"Varanasi","experience":"1 - 2 Years"},{"date":"12 - Oct - 2019","skills":"General Administration, Travel Arrangements, Office Management, Vendor Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Pacific BPO Private Limited, B-11, Sector -63, Noida. Landmark: Near Fortis Hospital","phone":"9540058222","profile":"Admin Executive (Male Only) \nPacific BPO Private Limited","description":"Candidate should be Any Graduate with excellent knowledge of MS Office Must have exemplary planning and time management skills Up-to-date with advancements in office gadgets and applications Ability to multitask and prioritize daily workload Vendor Management Rotational Shift Relevant Experience -2 years as an Admin Executive Job Responsibility- Act as the point of contact between the executives and internal/external clients Undertake the tasks of receiving calls, take messages and routing correspondence Handle requests and queries appropriately Make travel arrangements Monitor office supplies and research advantageous deals or suppliers Full comprehension of office management systems and procedures Walk-in Date/ Time: 12th October 2019, 1 PM onwards Interview Venue: Pacific BPO Private Limited B-11, Sector -63, Noida Landmark: Near Fortis Hospital","location":"Noida","experience":"2 - 3 Years"}]}