{"Walkins":[{"date":"11, 12, 13, 14, 15, 16, 18 - Jan - 2021","skills":".Net, ASP .Net, MVC, SQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Vaps Technosoft Private Limited, No. 58, Kamakshi Palya, Basaveshwaranagar, Bangalore - 560 079.","phone":"9110205013","profile":" .Net Developer/ Trainees \nVaps Technosoft Private Limited","description":"Internship for Dot Net Developers at Vaps Technosoft Private Limited Candidate must have undergone training from any certified training Institution Fresher only need to apply Location: Bengaluru (Basaveshwara Nagar) Walk-in Date/ Time: 11th January - 18th January 2021, 11.00 AM - 5.00 PM Venue Details- Vaps Technosoft Private Limited No. 58, Kamakshi Palya, Basaveshwaranagar, Bangalore - 560 079. Contact - Geetha (9110205013)  ","location":"Bangalore","experience":"0-1Years"},{"date":"12, 13, 14, 15 - Jan - 2021","skills":"HR Administration/ HR Functions, Office Administration","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Technospecs Technologies Pvt. Limited, C-133, Industrial Area, Phase 8, Mohali, Punjab","phone":"Not Provided","profile":" HR Executive \nTechnospecs Technologies Pvt. Limited","description":"Technospecs is seeking a fresher candidate with the following skills and capabilities to join us. Experience working on computer operating system running Windows 10. Knowledge of Excel, Word, PowerPoint with good writing speed and be able to setup documents, spreadsheets (including formulas, graphs etc.) and presentation. Excellent written English with ability to write an article on a chosen topic. Good confidence and be able to talk to the employees in one-to-one and in group. Be able to get trained on various HR related tools like HRMS, Bio-metric attendance, CCTV logs and others. Ability to pull the profiles from various job portals like Naukri, Monster, Indeed etc. for various technical positions Technospecs would open. Collect employee feedback and have fair understanding of various policies we have implemented or we might implement in future. Administering various online social networking and marketing portals we use like LinkedIn, Clutch etc. Work alongside the sales and business development person to lay out the roadmap and resource allocation for any upcoming project. Team roster setup and management for a 24x7 working environment. Following are some important points for the position we are offering. Candidates with no experience or with an internship in any IT company. Salary up-to 20k per month. Monday to Friday daytime shift (9am 5:30 pm) with a 30 mins break. Management of a team size of up-to 25 employees. Reporting to the HR head and companys CEO. Walk-in Date/ Time: 12th January - 15th January , 12.00 PM - 3.00 PM Venue Details- Technospecs Technologies Pvt. Limited C-133, Industrial Area, Phase 8, Mohali, Punjab Contact - Harjit Kaur  ","location":"Mohali","experience":"0-1Years"},{"date":"11, 12, 13, 14, 15 - Jan - 2021","skills":"HR, Recruitment, Sourcing Profiles/ Screening, Shortlisting","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"PGM Services, Unit No-135, DLF City Court, First Floor Sector 24, Near Sikanderpur Metro Station, Gurgaon","phone":"Not Provided","profile":" HR Recruiter \nPGM Services","description":"Candidate should have 0 to 3 years of experience in handling End to End Recruitment. Sourcing and conducting Telephonic & Face to Face Interview from Executive to Managerial Level through different portals like Naukri. Must have excellent communication skills. Walk-in Date/ Time: 11th January - 15th January , 10.00 AM - 5.00 PM Venue Details- PGM Services Unit No-135, DLF City Court, First Floor Sector 24, Near Sikanderpur Metro Station, Gurgaon Contact - Nishi Vashistha Share cv at aayushisingh.pgm@gmail.com  ","location":"Gurgaon","experience":"0-3Years"},{"date":"11, 12, 13, 14, 15 - Jan - 2021","skills":"Typesetting, Content Creation, Publishing, Proof Reading","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Techbooks International Private Limited, Aptara, A-37, Sector - 60, NOIDA, Uttar Pradesh - 201 301","phone":"Not Mentioned","profile":" QC/ Proof Reader \nTechbooks International Private Limited","description":"Techbooks International Private Limited, Aptara is currently hiring QC/ Proof Reader. Candidate should be Any Graduate with 3 to 8 years experience in QC/ Proof reading. Knowledge of Windows Operating systems and MS office (Windows 2000/XP/Vista/ 7/ windows 8). Should be willing to work in night shifts. Confident and self-motivated with positive attitude. Immediate joiners would be preferred. Walk-in Date/ Time: 11th - 15th January 2021, 9 AM onwards Venue Details- Techbooks International Private Limited Aptara, A-37, Sector - 60, NOIDA, Uttar Pradesh - 201 301 Contact - Prakash Singh  ","location":"Noida","experience":"3-8Years"},{"date":"11, 12, 13, 14, 15 - Jan - 2021","skills":"Cheque Data Entry, Banking Process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Cameo Corporate Services Limited, No. 1, Subramanian Buliding, 1st Floor, Club House Road, Anna Salai, Chennai.","phone":"Not Provided","profile":" Data Entry Operator - Only Male \nCameo Corporate Services Limited","description":"Immediate Opening for Data Entry Operator for Banking Process (Night Shift - Work from Office) - Only Male Candidates Preferred. Roles and Responsibilities- Cheque Data Entry Any Degree Fresher or Experienced (0-1 year) Office Timing = 8.30 PM to 5.30 AM Perks and Benefits Salary Based on Targets Achieve Salary Per Cheque = 0.19/- Paise 2000 cheques per day target 24 days working Sunday, 2nd and 4th Saturday Holiday Salary you can earn from 9000 to 15000 per month based on targets achieve as take home If any Error in Cheque Typing, Error Amount will be deducted based on error occured. Walk-in Date/ Time: 11th - 15th January 2021, 9.30 AM - 5.30 PM Venue Details- Cameo Corporate Services Limited No. 1, Subramanian Buliding, 1st Floor, Club House Road, Anna Salai, Chennai. Landmark:- Near Spencer Plaza, Opp. building to Senthur Hotel, Bank of Baroda Bank.  ","location":"Chennai","experience":"0-1Years"},{"date":"8 - Jan - 2021","skills":"Desktop Support, Technical Support, Customer Support","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Apple Authorised Service Provider - iCare, LG 16 Vasant Square Mall, Pocket 5, Sector B, Vasant Kunj, New Delhi - 110 070","phone":"Not Provided","profile":" Technical Support Consultant \nAmple Technologies Private Limited","description":"We have walk-in drive for Technical Support Consultant (Freshers/ Experienced) BE/ B-Tech Freshers are not eligible to apply for this job Job Responsibility: Customer service/ Front-end customer handling. Handling customer queries/ issues in the store related to (Mobile, Laptop & Desktop) Troubleshooting of technical related issues and ensure to resolve the issues/ queries Escalate problems when unable to resolve customer issues. Knowledge on computer hardware & software is added advantage. Excellent language fluency, excellent verbal & written communication skills. Should be able to handle customer queries and should aim at customer delight. Self driven & goal oriented and willing to work on Weekends Should be technically sound. Duration: Contract Basis Your consultation period is 1 year and and this period may be extended or pre-closed as per the business needs. If you are interested please attend the walk-in happening on 8th January 2021. Time - 11:00 am to 4:00 pm Venue Details- Apple Authorised Service Provider - iCare, LG 16 Vasant Square Mall, Pocket 5, Sector B, Vasant Kunj, New Delhi - 110 070 Contact Email- jiddu.manoharan@ample.co.in  ","location":"Delhi","experience":"0-3Years"},{"date":"8 - Jan - 2021","skills":"HR Operations, Interviewing, Talent Acquisition, Recruitment, HR Generalist","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"IIFL Finance Limited, IIFL House, Plot No. 98, Udyog Vihar, Phase IV, Near Maruti Gate no. 3, Gurgaon, Haryana - 122 015.","phone":"Not Provided","profile":" Project Trainee - HR \nIIFL Finance Limited","description":"Looking out for young, energetic fresher / a beginner who wants to build his/her career in HR & is thus looking for a platform to start with. Job Responsibility:- Identifying the potential candidates through various sources like job portals, employee referral, head hunting, reference generation, etc Analyze the CVs and shortlist the candidates based on the pre-set criteria Scheduling the interviews of candidates Co-coordinating with the shortlisted candidates for interview lineups with the business head. Conducting the interviews by different ways (Personal & Telephonic Interview). Taking follow up for salary negotiation and Processing the offer letter/ Offer details of the candidate as per the schedule Following up with the candidates till he/she comes on board Maintaining a systematic and comprehensive database of all candidates/ applicants Develop and maintain all recruitment related MIS on a regular basis. Resolving salary queries and explaining HR policies. Handle end to end recruitment along with day to day operational work. Job Type - Contractual Job (6 Months) Stipend - 15 k Job Location - Gurgaon Walk-in Date/ Time: 8th January 2021, 11.00 AM - 3.00 PM Venue Details- IIFL Finance Limited IIFL House, Plot No. 98, Udyog Vihar, Phase IV, Near Maruti Gate no. 3, Gurgaon, Haryana - 122 015. Contact - Mehak Ahluwalia  ","location":"Gurgaon","experience":"0-2Years"},{"date":"8 - Jan - 2021","skills":"Student Activities, Back Office Operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"PRIMUS Techsystems Private Limited, 5th Floor, B-Junction, Above Kotak Mahindra Bank, Behind Karve Statue, Kothrud, Pune - 411 029.","phone":"Not Provided","profile":" Back Office & Operations Executive \nPRIMUS Techsystems Private Limited","description":"Candidate should be Any Graduate with 0 to 3 years of experience in Back Office & Operations Work Must have Excellent Communication Skills Should have good grasping & learning skills Females Candidate would be preferred Walk-in Date/ Time: 8th January 2021, 12.00 PM - 6.00 PM Venue Details- PRIMUS Techsystems Private Limited 5th Floor, B-Junction, Above Kotak Mahindra Bank, Behind Karve Statue, Kothrud, Pune - 411 029. Contact - Anjali Supare  ","location":"Pune","experience":"0-3Years"},{"date":"8 - Jan - 2021","skills":"Payment posting, Charge entry, Radio diagnosis, Denial management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Global Healthcare Billing Partners, No 70, Ritherdon Rd, A Block, Vepery, Purasaiwakkam, Chennai - 600 007. Landmark- Near Nilgiris & Dina Lab","phone":"8939844747","profile":" Charge Entry Executive \nGlobal Healthcare Billing Partners Pvt. Limited","description":"Educational Qualification : Any Graduate Work Experience : 6 Months to 5 Years Job Location: Vepery, Chennai Essential Requirement- Associate should have worked for a minimum of 6 months in Charge entry & Demo. Walk-in Date/ Time: 8th January 2021, 11.00 AM - 4.00 PM Venue Details- Global Healthcare Billing Partners Pvt. Limited No 70, Ritherdon Rd, A Block, Vepery, Purasaiwakkam, Chennai - 600 007. Landmark- Near Nilgiris & Dina Lab Contact - Pooja HR (8939844747)  ","location":"Chennai","experience":"0-5Years"},{"date":"8 - Jan - 2021","skills":"Customer Relationship, Customer Handling, Inventory Management","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Valuedrive Technologies Private Limited, Spinny Car Hub - NSP, Delhi, 7th Floor, PP Trade Center, Netaji Subhash Place, Wazirpur, Delhi - 110 034.","phone":"7002632038","profile":" Relationship Manager \nValuedrive Technologies Private Limited","description":"Candidate should be Any Graduate with 1 to 4 years of relevant experience. Automobile (Car sales) experience is preferred. Designation - Relationship Manager Location- Gurgaon and NSP Experience in Car sales required. Job Description: \u0095 Handle sales at our retail hub. Front line selling- 4 wheeler only \u0095 Customer handling and negotiation \u0095 Pitching Products knowledge to customers. \u0095 Be customer champion by ensuring a superb experience with the company. \u0095 Meet and engage with customers, show them the cars, and conduct test drives. \u0095 Manage inventory at the hub. Benefits: Attractive Incentives Opportunity to grow and manage a hub of 100+ cars in the Assign Area. Enjoy working with young and similar minded people. Will be given a promising position in the Sales Department. Requirements and Responsibilities o Must have good analytical skills o Should be smart and quick to respond to customers o Liking cars a must. Must know driving. Walk-in Date/ Time: 8th January 2021, 10.00 AM - 1.30 PM Address- Valuedrive Technologies Private Limited Spinny Car Hub - NSP, Delhi, 7th Floor, PP Trade Center, Netaji Subhash Place, Wazirpur, Delhi - 110 034. Contact - Sushmita Kar (7002632038) If Interested please apply for the posting we will reach out to you shortly or share cv at sushmita.kar@spinny.com  ","location":"Delhi","experience":"1-4Years"},{"date":"8 - Jan - 2021","skills":"Banking Process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Teleperformance Private Limited, ASPEE House. Near SNDT College, Opposite Overseas Bank, Near Kotak Mahindra Bank, Marve Road, Near Orlem Church, Malad West, Mumbai.","phone":"8928013505","profile":" Banking Process Executive \nIntelenet Global Services Private Limited","description":"Intelenet Global Services Private Limited (Teleperformance) is having huge opening for Banking Process/ Voice and Non-Voice Process Minimum Qualification: HSC Fresher/ Experience any one can apply Candidate should be fluent in English and Hindi. Opening for linguistic also (Malayalam, Telugu, Tamil, Kannada). Rotational shift / rotational week off Work From office (Location Malad west) Salary upto - 20 ctc Walk-in Date/ Time: 8th January 2021, 2.00 PM - 5.30 PM Venue Details- Teleperformance Private Limited ASPEE House. Near SNDT College. Opp Overseas Bank, Near Kotak Mahindra Bank,. Marve Road, Near Orlem Church, Malad West, Mumbai. Interested can call or watsap - 8928013505 ( HR Preeti) you can email your Resume - 2019preetij@gmail.com  ","location":"Mumbai","experience":"0-5Years"},{"date":"4, 5, 6, 7, 8, 9 - Jan - 2021","skills":"Techincal Support, Desktop Support, Voice Process, Troubleshooting skills","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Not Provided","phone":"Not Provided","profile":" IT Support/ Service Desk Analyst \nInspiration Manpower Consultancy Pvt. Limited","description":"Candidate should be Any Graduate with 0 to 5 years of experience in IT Service Desk/ Active Directory/ IT Help desk/ Networking. Must have excellent communication skills. Job Responsibility- Installing/ Configuring computer hardware operating Systems/ Applications/ IT service desk Analyst/ Service desk Management/ Active Directory Monitoring and maintaining computer systems and networks Troubleshooting System/ Network problems and diagnosing/solving hardware or software faults Evaluating new Technology To Apply Call Hadiya- 9900073504/ 7259027295/ 7760984461/ 7624843555/ 7624842555  ","location":"Bangalore, Chennai, Kolkata","experience":"0-5Years"},{"date":"6, 7, 8, 9, 11, 12, 13, 14, 15, 16 - Jan - 2021","skills":"Core Java, JSP Servlet, Javascript, Jquery, Hibernate, Maven","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Appsource Services Private Limited, No. 12, Ramanuja Plaza 1st Floor Malleshwaram 5th Cross, Bangalore - 560 003.","phone":"9663863321","profile":" Core Java Developer \nAppsource Services Private Limited","description":"Candidates with below skills can apply : Java Dotnet Mobile Application (Android, iOS) Python Walk-in Date/ Time: 6th - 16th January 2021, 10 AM onwards Venue Details- Appsource Services Private Limited No. 12, Ramanuja Plaza 1st Floor Malleshwaram 5th Cross, Bangalore - 560 003. Contact Person- Shwetha (9663863321)  ","location":"Bangalore","experience":"0-4Years"},{"date":"12 - Jan - 2021","skills":"Core Java, Springs and Hibernate","qualification":"B.E./B.Tech, MCA/PGDCA","address":"C-Edge Technologies Limited, 2nd Floor, Nitco Business Park. Road No. 16U, Wagle Industrial Estate, Thane (West) - 400 604","phone":"9769682373","profile":" Java Developers \nC-Edge Technologies Limited","description":"Candidate should be BE/ B.Tech or MCA with 1 to 3 years of experience in Software Development using Core Java, Springs and Hibernate. Walk-in Interview on 12th January 2021, 11.00 AM - 5.00 PM Venue Details- C-Edge Technologies Limited 2nd Floor, Nitco Business Park . Road No.16U, Wagle Industrial Estate, Thane (West) - 400 604 Contact - Rakesh Uchil (9769682373)  ","location":"Mumbai","experience":"1-3Years"},{"date":"8 - Jan - 2021","skills":"Handling Customer Queries, Office Administration, Telecommunication","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Patliputra Builder Private Limited, INS 02, CHI - V, Greater Noida","phone":"9771417081","profile":" Female Office Administrator \nPatliputra Builder Private Limited","description":"Walk-In Interview for Admin Profile, Female candidates only. Candidate should be Any Graduate with 2 to 5 years of experience in Office Administration, Telecommunication and Handling Customer Queries. Must have excellent communication skills. Walk-in Date/ Time: 8th January 2021, 11.30 AM - 5.00 PM Venue Details- Patliputra Builder Private Limited INS 02, CHI - V, Greater Noida Contact Details: Ashish Kumar Singh 9771417081 hr@patliputrahotels.com  ","location":"Noida","experience":"2-5Years"},{"date":"7, 8 - Jan - 2021","skills":"General Administration, Front Office/ Receptionist Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Digital Track Solutions Private Limited, No: 543, I Floor, Accord Building, Anna Salai, Nandanam, Chennai - 600 035. Landmark: Opposite/ Near Audi Showroom","phone":"Not Provided","profile":" Front Office/ Admin Executive \nDigital Track Solutions Private Limited","description":"Person should be Any Graduate with 1 to 2 years of experience in General Administration, Front Office/ Receptionist Activities. Must have excellent communication skills. Required Female Candidate only Job Responsibility- Maintaining administration and operation records Answering all incoming calls and redirecting to the correct department Supervising the housekeeping department, preparing a list of stock Interested can walk-in for interview on 7th - 8th January , 9.30 AM - 3.30 PM Address- Digital Track Solutions Private Limited No: 543, I Floor, Accord Building, Anna Salai, Nandanam, Chennai - 600 035. Landmark: Opposite/ Near Audi Showroom  ","location":"Chennai","experience":"1-2Years"},{"date":"6 - Jan - 2021","skills":"IT Recruitment, Screening, Induction, Selection, Hiring, Mass Mailing","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Saiva System India Private Limited, 38K, A Block, Sector- 64 Noida. Nearest Metro Station: Noida Sector-59","phone":"Not Provided","profile":" HR Recruiter/ Executive (Fresher) \nSaiva System (India) Private Limited","description":"Candidates should have technical qualification (i.e B.Tech, M.Tech, BCA, MCA etc). Screening the resume as per the clients specification. Responsible for hiring IT skills, Need to achieve the targets assigned by the respective team leads. Job Responsibilities- Responsible for End to End Recruitment C2H and Permanent Hiring. Analyzing job specification. Provide daily/weekly reports to Team leads on a timely basis regarding status relating to all positions. Perks and benefits- Alternate Saturdays off office hours 9 am to 6 pm. Walk-in Date/ Time: 6th January 2021, 11.00 AM - 3.00 PM Venue Details- Saiva System India Private Limited 38K, A Block, Sector- 64 Noida Nearest Metro Station: Noida Sector-59 Contact person: Monika Contact No: 9667230694  ","location":"Noida","experience":"0-1Years"},{"date":"6 - Jan - 2021","skills":"IT Recruitment/ Sourcing, Hiring, Selection, End to End Recriitment Process","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"V-Soft Consulting Corporation Pvt. Limited, Incor 9, 3rd Floor, Kavuri Hills, Madhapur Hyderabad - 500 033","phone":"Not Provided","profile":" US IT Recruiter - Freshers \nV-Soft Consulting Corporation Pvt. Limited","description":"We do have the Immediate requirement for freshers for the 'US IT Recruiter' Position. Work Experience : 0 to 2 Years Job Location: Hyderabad Shift Timings: 07:30 PM to 04:30 AM (Night shift) Candidate should have very good communication skills Must be interested in working in night shifts Interested candidates can share their profiles with sravani@vsoftconsulting.com Walk-in Date/ Time: 6th January 2021, 11.00 AM - 4.00 PM Venue Details- V-Soft Consulting Corporation Pvt. Limited Incor 9, 3rd Floor, Kavuri Hills, Madhapur Hyderabad - 500 033. Contact Person- Sravani  ","location":"Hyderabad","experience":"0-3Years"},{"date":"6 - Jan - 2021","skills":"Customer Service, Sales/ Business Development (B2B)","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Madhukar Domestic Appliances Pvt. Limited, #94, 2nd Main Road, 8th Cross, near Vijaya Bank ATM, Chamrajpet, Bengaluru, Karnataka - 560 018.","phone":"8861007105","profile":" Sales & Service Executive \nStovekraft Private Limited","description":"Required Female Executives who are interested to pursue their career in Sales (B2B) Designation: Executive Sales Location: Regional Office, Chamrajpet Education: Any Graduates - Freshers, knowledge in computers Linguistic Skills: Kannada, English & Hindi CTC: 3 LPA + other benefits Walk-in Date/ Time: 6th January 2021, 9.30 AM - 5.00 PM Venue Details- Madhukar Domestic Appliances Pvt. Limited, #94, 2nd Main Road, 8th Cross, near Vijaya Bank ATM, Chamrajpet, Bengaluru, Karnataka - 560 018. Contact No. 8861007105 Note: Only Female candidates can apply.  ","location":"Bangalore","experience":"0-1Years"},{"date":"6 - Jan - 2021","skills":"Accounts Payable, Credit Control Operations, Forecasting, MS Excel (Vlook up)","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Zebronics India Private Limited, No. 118 Ponnamallee High Road, Vepery, Chennai - 600 084","phone":"Not Provided","profile":" Accounts Executive \nZebronics India Private Limited","description":"We are actively looking for Accounts Executive for Chennai Location Candidate must have basic knowledge in MS Excel (Vlook up) Education Qualification- B Com, M.com Freshers with internship(s) experience may also apply. Walk-in Date/ Time: 6th January 2021, 10 AM onwards Venue Details- Zebronics India Private Limited No. 118 Ponnamallee High Road, Vepery, Chennai - 600 084 Landmark: Opposite to Sudha Hotel. (view on Map) Contact - Khushbu mehta  ","location":"Chennai","experience":"1-2Years"},{"date":"5 - Jan - 2021","skills":"Cashier Activities, Branch Operations, Loan Operations, Retail Banking, Clearing Operations","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Jana Small Finance Bank Limited, 16/12, 3rd Floor, Arya Samaj Road, Karol Bagh, New Delhi - 110 005. Opposite : Satbhrawan Arya Girls Sr. Sec. School","phone":"Not Mentioned","profile":" Operations Assistant Cum Cashier \nJana Small Finance Bank Limited","description":"We are hiring for Operations Assistant cum Cashier (OAC) for our branches in Delhi/NCR Qualification: Graduation (Any Stream) Age Limit: 21 to 30 Years Immediate Joiners Should have good communication skills with similar cash handling experience Adept in use of MS Office - Excel, Word and PowerPoint Candidates who can join us within 15-20 days will be preferred Roles and Responsibilities: Accurate posting to CBS GL of all receipts and payments and ensure no open items Prompt and accurate submission of BEC return Safe custody of keys and security items in the vault and cabinets Safe keeping of Manual receipt books and recon. Ensure correct execution of loan documents, ensure correct & prompt disbursement and safe keeping of loan documents Maintain all the prescribed registers Maintain and safe custody of Jana Cards Knowledge of offerings and processes and being updated about changes from time to time Raising of help desk tickets as per requirements Walk-in Date/ Time: 5th January 2021, 9.30 AM - 5.30 PM Venue Details- Jana Small Finance Bank Limited 16/12, 3rd Floor, Arya Samaj Road, Karol Bagh, New Delhi - 110 005. Opposite : Satbhrawan Arya Girls Sr. Sec. School Contact - Uday Singh Please Note: Minimum one year of Banking operations experience is mandatory for this role, please ignore this mail if you don't have relevant experience of minimum one year or if you have already appeared for interview in last 3 months  ","location":"Delhi","experience":"1-3Years"},{"date":"5 - Jan - 2021","skills":"HR Processes, Grievance Handling, HRMS, Recruitment Training, Payroll Preparation","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Brickwork Ratings Private Limited, 3rd Floor, Raj Alkaa Park, 29/3 & 32/2, Bannerghatta Main Rd, Kalena Agrahara, Near Meenakshi Temple and Mall, Bengaluru, Karnataka - 560 076.","phone":"Not Provided","profile":" HR Executive/ - Male Only \nBrickwork Ratings Private Limited","description":"Male Candidates with Relevant experience and those willing to travel to Bannerghatta Road may Walk-in Education- Any Graduate with relevant experience; MBA in HR from a reputed college is preferred. Experience Required - 2 - 3 Years Proven work experience as a Recruiter is desirable and will be a plus Understanding the requirement, sourcing by using databases, social media and portals network sites, reference, headhunting, database, etc Prepare recruitment materials and post jobs to job portals, social media Screen candidates resume and job applications, conducting cold calls and initial telephonic interviews for information gathering Conduct tests to assess the competencies and skillsets of candidates Familiarity with HR databases & Process documentation Compile and update employee records (hard and soft copies) and update database Possesses a clear understanding of HR Processes Deal with employee requests regarding human resources issues, rules, and regulations Coordinate HR projects (meetings, training, surveys, etc) Prepare reports relating to HR activities like staffing, recruitment, training, grievances, performance evaluations, etc Issue offer letters Conduct onboarding formalities Conduct initial orientation, assist in documentation and on-boarding activities of new joiners Liaise with the other departments like Admin, IS, etc to ensure smooth joining Assist in payroll preparation by providing relevant data (absences, bonus, leaves, etc) Excellent communication and interpersonal skills High levels of integrity and accountability, responsibility, confidentiality, and commitment are the desired traits Commitment to results: Displays a sense of urgency. Focuses on specific goals. Follows through on commitments. Demonstrates a sense of personal accountability for achieving results. Walk-in Date/ Time: 5th January 2021, 10.30 AM - 5.00 PM Venue Details- Brickwork Ratings Private Limited 3rd Floor, Raj Alkaa Park, 29/3 & 32/2, Bannerghatta Main Rd, Kalena Agrahara, Near Meenakshi Temple and Mall, Bengaluru, Karnataka - 560 076. Attached herewith is the google map link https:goo.gl/maps/dgGHmJ51ecSCB8YH7  ","location":"Bangalore","experience":"2-3Years"},{"date":"5 - Jan - 2021","skills":"Backend, Security Operations","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Allied Digital Services Limited, Plot no.3, Shahâ's Building 2nd floor, Opp Laxmi Narayan Talkies Pune Satara Road, Mukundnagar, Swargate, Pune - 411 037","phone":"Not Provided","profile":" Security Operation Analyst/ Fresher \nAllied Digital Services Limited","description":"\u0095 Educational Qualification- Any Graduate \u0095 Job location- Commissioner of police office(Pune station, GPO) \u0095 Terms and conditions if you have any Compulsorily rotational shift. Roles and Responsibility: 1. To operate and monitor all systems, including CCTV, within the Control Centre in a professional and efficient manner. 2. To ensure integrity, accuracy and confidentiality of all information gained by compliance with quality standards. 3. To liaise with the Police, other agencies and members of staff to ensure the appropriate use of the system. 4. To include all evidential records and witness statements to a standard acceptable to the rules of evidence. 5. CCTV Data Management & Documentation- Monitoring and recording of observations with respect to security, safety of site, plant, people etc. Walk-in Date/ Time: 5th January 2021, 9:30 AM - 6:00 PM Venue Details- Allied Digital Services Limited Plot no.3, Shahâ's Building 2nd floor, Opp Laxmi Narayan Talkies Pune Satara Road, Mukundnagar, Swargate, Pune - 411 037  ","location":"Pune","experience":"0-1Years"},{"date":"5 - Jan - 2021","skills":"Core Java, J2ee, Jsp, Servlet, Spring/ Hibernate/ Struts, MySql, Tomcat.","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Ojas Softech Private Limited, Block A - 139, Sector - 63, Noida - 201 301","phone":"8447131703","profile":" Java Developers \nOjas Softech Private Limited","description":"Candidate should have good hands on experience on Java/ J2ee (Core Java, J2ee, Jsp, Servlet, Spring/ Hibernate/ Struts). Hands on Experience on Developing Java and web Application. Must have knowledge about the basic database development skills like MySql, Tomcat. Walk-in Date/ Time: 5th January 2021, 9.30 AM - 5.30 PM Venue Details- Ojas Softech Private Limited Block A - 139, Sector - 63, Noida - 201 301 Contact - Pooja Sinha (8447131703)  ","location":"Noida","experience":"2-4Years"},{"date":"5 - Jan - 2021","skills":"Home Loans, Mortgage Loans, Home Finance, Banking Products","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Jana Small Finance Bank Limited, P150, Block B, Lake Town, Opposite Lake Town Nursing Home. Landmark : Near Lake Town Clock Tower","phone":"Not Provided","profile":" Relationship Executive (Micro Housing Loan) \nJana Small Finance Bank Limited","description":"Walk in drive for Relationship Executive - Micro Housing Loan - WB (under Direct bank payroll) Location : Diamond Harbour, Thakurpukur, Amtala, Jadavpur, Berhampore and Siliguri. Candidate must have effective communication skills Process knowledge and domain knowledge Local candidate preferred Home Loan/ LAP background mandatory Direct Bank Payroll Age within 36 Years Not applicable for fresher Mortgage Loan background MUST 2 wheeler preferred Roles and Responsibilities- Identify prospective customers and execute the disbursement within the credit parameters and process of the organization Follow up with customer for payments in case of EMI dishonor Assist Cluster Head to achieve the set targets of LAP/Housing Loan Cross sell of insurance and other Banking Products to existing customers Sourcing/Disbursals of No. of files, Volume, Loans - Source good portfolio, assist in collection, cross sell bank products Distribution-Direct Business - maintain relationship with the customers by visiting them regularly EMI returns/Quality portfolio- Follow the laid down Process when acquiring customers Individual contributor role Interview Venue: Jana Small Finance Bank Limited, P150, Block B, Lake Town, Opposite Lake Town Nursing Home. Landmark : Near Lake Town Clock Tower For out station candidates pls write to Shraddha.Koirala@janabank.com  ","location":"Kolkata","experience":"1-6Years"},{"date":"5 - Jan - 2021","skills":"HR/ Recruitment, Grievance Handling, Payroll Administration, Employee Engagement, Joining formalities","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Soft Suave Technologies Private Limited, 100, Lake View Estate, 3rd floor, Kundrathur Main Road, M. S. Nagar, Next to Rajan Tiles Building, Porur, Chennai, Tamilnadu - 600 116.","phone":"Not Provided","profile":" Corporate HR Executive/ Freshers \nSoft Suave Technologies Private Limited","description":"What'll you do - HR Executive Conducting recruitment interviews and providing the necessary inputs during the hiring process Maintaining HR records, such as those related to compensation, Incentives, health and medical insurance Managing workplace safety issues Communicating and explaining the organization's HR policies to the employee Preparation of Payroll Conducting various games & celebration activities, engagement activities, employee recognition acts Conducting employee orientation and facilitating newcomers joining formalities Maintaining and regularly updating master database (personal file, personal database, etc.) of each employee in HR module of ERP software Resolving grievances or queries that any of the employees have. Why Soft Suave? We believe that work is one of the most important parts of our lives, & also we believe in a winning culture and great benefits: Competitive compensation Paid Training and exposure to all gamut of Human Resource activities with Client interactions Great multi-culture & team spirit Team outings (Sports leagues, Movie nights, Gym membership, Team Lunch, Employee awards etc.) Accommodating Leaves Promotion and Compensation based on individual's performance Walk-in Date/ Time: 5th January 2021, 10.30 AM - 2.30 PM Venue Details- Soft Suave Technologies Private Limited 100, Lake View Estate, 3rd floor, Kundrathur Main Road, M. S. Nagar, Next to Rajan Tiles Building, Porur, Chennai, Tamilnadu - 600 116. Contact Person- Keerthana  ","location":"Chennai","experience":"0-1Years"},{"date":"5 - Jan - 2021","skills":"HR/ Recruitment, Attendance, Housekeeping, Statutory Compliance, MIS Reporting","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"M/s GVPR Engineers Limited, Plot No 739-A, Road No-37, Jubilee Hills, Hyderabad - 500 033. Landmark: Near Daspalla Hotel, Behind IOCL Petrol Bunk","phone":"040 6658 6658","profile":" Senior Executive/ Asst. Manager - HR \nGVPR Engineers Limited","description":"Candidates must have strong experience in Water Pipeline or Roads Projects Roles and Responsibilities- Managing records upkeep and maintenance like Assets record, Office Agreement, Attendance and Courier. Processing, new Joinees formalities other Documentation, Record Keeping, Arrangements of Salary account of new employees in Bank, E-mail Id, Visiting Card, and introductory letter. Manage all document related to employee. Handling all data related to recruitment of employee in soft form as well as in files. Prepared All Statutory Compliance Regarding Labour License, BOCW Copy, WC Policy Responsible to filling responsibilities of employee of employment form and send to the Head office with all related attachments. Maintain attendance of all employee in Morning and night shift , maintain data in hard as well as in soft. Maintain all kinds of personal records i.e. qualification record, letter of appointment, record of probationary employee and confirmed employee. Arrange the accommodation to the employee according to space. Responsible to keep clean pantry, office area/rooms. Responsible to distribute the salary in cash. Make the attendance report and send it to Head office to release the salary of employees. Maintained Monthly Wages of Labor & Billing amount of Sub-Contractor send to the head Office. Handling for site Accounts Petty cash, Machinery Hiring Charges Bill, Sub Contractor Bills etc. Responsible for Vendors, House Keeping and other office equipment. Inviting quotations and making comparative statement on the basis of cost and quality. Most responsible to make the MIS Report and maintain data files and backup system for all reports. Walk-in Date/ Time: 5th January 2021, 10.00 AM - 2.00 PM Venue Details: M/s GVPR Engineers Limited Plot No 739-A, Road No-37, Jubilee Hills, Hyderabad - 500 033. Landmark: Near Daspalla Hotel, Behind IOCL Petrol Bunk Office No. 040 6658 6658 Contact - Kaleemuddin Required Documents while attending interview are as follows: Educational Certificates (SSC. Intermediate,Diploma & B.Tech) Offer & Appointment Order of Present employments Offer & Appointment order of Previous Employments Service Certificates / Relieving Letter from previous employments 3 Months Pay slips & Bank Statement of present Company PAN Card & Aadhaar Card One Passport Size Color Photograph  ","location":"Hyderabad","experience":"7-12Years"},{"date":"7 - Jan - 2021","skills":"C, C++ and JAVA","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"PEOL Technologies Private Limited, #306, 2nd Floor, HRBR Layout, Poonam Chambers, Hennur Main Road, 3Rd Block, Near Hennur Bus Depot, Bengaluru, Karnataka - 560 043.","phone":"Not Provided","profile":" Trainee Developers (C/ C++, Java) \nPEOL Technologies Private Limited","description":"Candidate must have strong coding skills in C, C++ and JAVA preferred Should have excellent knowledge in RDBMS and SQL. Must have excellent communication skills. Educational Qualification: BE/ B.Tech/ BCA/ MCA No year gaps during education Work Experience: Fresher Walk-in Date/ Time: 7th January 2021, 10.00 AM - 3.00 PM Venue Details- Peol Technologies Private Limited #306, 2nd Floor, HRBR Layout, Poonam Chambers, Hennur Main Road, 3Rd Block, Near Hennur Bus Depot, Bengaluru, Karnataka - 560 043.  ","location":"Bangalore","experience":"0-1Years"},{"date":"4 - Jan - 2021","skills":"Technical Support, Hardware Networking, Desktop Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Sysnet Global Technologies Pvt. Limited, 105/ 6/ 7, Damji Shamji Trade Centre, Near Railway Station, Vidyavihar (West), Mumbai \u0096 400 086.","phone":"9619605367","profile":" Desktop Support Engineer (L1) \nSysnet Global Technologies (P) Limited","description":"Candidate should be Any Graduate with good knowledge of desktop, Laptop Must have excellent communication skills Job Location- Andheri Walk-in Date/ Time: 4th January 2021, 9.30 AM - 5.30 PM Venue Details- Sysnet Global Technologies Pvt. Limited 105/ 6/ 7, Damji Shamji Trade Centre, Near Railway Station, Vidyavihar (West), Mumbai \u0096 400 086. Contact Person: Kirti Dulera (Regional HR Executive) Mob.: 9619605367  ","location":"Mumbai","experience":"0-1Years"},{"date":"4 - Jan - 2021","skills":"Technical Support, Desktop Support/ Printer/ Scanner support","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Savi Group, 135, 1st Floor, Udyog Vihar, Phase - 1, Gurugram - 122 016","phone":"0124-4103903/ 4","profile":" Desktop Support Engineer \nSAVI Group, Inc (SAVI)","description":"The candidate should have knowledge for below mentioned skills : MS server 2003/2008/2012/2016 Experience Desktop/ Printer/ Scanner support Experience Understanding of basic functionality of window based applications Microsoft Outlook/ Office Experience basic antivirus Knowledge Basic Networking Experience Work Experience: 2 to 4 years of experience Microsoft Certifications will be added advantage. 5 Days Working Free Meal Location : Gurugram Note : We are conducting walk-in interviews on 4th January 2021 (Monday) The candidate, coming for Walk-in, should follow the guidelines of Government to prevent the spread of COVID-19. Interested candidate can come directly for interview on below mentioned address : Venue : Savi Group, 135, 1st Floor, Udyog Vihar, Phase-1, Gurgaon - 122 016 Call us on 0124-4103903/ 04 or send your resume on 9999755083 or hr@billingsavi.com  ","location":"Gurgaon","experience":"2-4Years"},{"date":"4 - Jan - 2021","skills":"Customer Support, Networking, Desktop Support, Technical Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"No. 1, Yogiraj Apartment 45/B, Nutan Bharat Society, Alkapuri, Vadodara, Gujarat - 390 007","phone":"7878294001","profile":" Desktop Support Engineer \nRedington (INDIA) Limited","description":"Position: Desktop Support Engineer/ System Administrator/ Customer Support Engineer/ Technical Support Engineer Qualification: Any Graduate/ Post Graduate Work Experience: 1 to 4 Years Job Location: Baroda Required Skills: Knowledge of trouble shooting in desktop (Both Hardware & OS level) Knowledge of trouble shooting in Laptops (Both Hardware & OS level) Should have basic knowledge in Networking Salary: Negotiable Immediate joiners required Walk-in Date/ Time: 4th January , 9 AM onwards Venue Details- No. 1, Yogiraj Apartment 45/B, Nutan Bharat Society, Alkapuri, Vadodara, Gujarat - 390 007 Send your updated resumes to rohit.bind@ensureservices.in Or contact- Sushan Panchal/ Rohit Bind- 7878294001 /7397397288  ","location":"Baroda, Vadodara","experience":"1-4Years"},{"date":"3 - Jan - 2021","skills":"Bulk Drugs, Production Department, API Manufacturing","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Hetero Drugs Limited, Hetero Corporate, 7-2-A2, Industrial Estates, Sanathnagar, Hyderabad - 500 018.","phone":"Not Provided","profile":" Production Executive/ Freshers \nHetero Drugs Limited","description":"we are hiring young and talented candidates for Production department. Candidates who are aspiring a challenging career can explore the opportunities. We are looking for Degree (BSc, B.com, BA), candidates only Role/ Responsibility: To follow the cGmp, safety and adhere with company policy Performing the manufacturing operations according to the written procedures Follow the compliance stop and cGmp during batch production Maintenance the status aboard to know the current position of a batch equipment time to time Attending training programs as for the schedule provided Clean and wet section and clean rooms areas per the sanitation cleaning procedure Handovering the complete batch production Records, documents time to time after completion of activities Perks and Benefits : Night Shift Allowances 2000 Attendance Allowances 1000 Production Bonus 500 Yearly bonus Family insurance Medical insurance Performance Based Salary Increments Subsidized Canteen Walk-in Interview on 3rd January from 9.30 AM onwards Venue Details- Hetero Drugs Limited Hetero Corporate, 7-2-A2, Industrial Estates, Sanathnagar, Hyderabad - 500 018.  ","location":"Hyderabad","experience":"0-1Years"},{"date":"5 - Jan - 2021","skills":"Software Testing, Manual Testing, Test Engineering","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"AQM Technologies Private Limited, 4th Floor, A-Wing, Raheja Plaza, LBS Road Ghatkopar (West) Mumbai - 400 086","phone":"Not Provided","profile":" Software Tester/ Fresher \nAQM Technologies Private Limited","description":"We have an urgent requirement for Manual Testers (Freshers) who have completed their software testing course, Kindly go through the following details- Candidate should have in depth understanding of software testing. Should be able to prepare scenarios and derive test cases from the same. Should be proactive in test cases execution, defect discussion, defect logging, risk identification and mitigation. Hands on experience on Test Management (like Quality Center) and Defect Management tools like (JIRA, Bugzilla, etc.) Job Responsibilities- Conduct independent system testing for changes to the application. Design test cases including expected outputs from the Business Requirements and Functional to ensure maximum coverage, to emulate user interaction in the production environment. Execute the end-to-end test scenarios and validate results Report test results and ensure that bugs are properly identified, tracked, documented and fixed and help in UAT support to users Review and provide input on Business Requirement and Functional Specification documents Walk-in Date/ Time: 5th January 2021, 10 AM onwards Venue Details- AQM Technologies Private Limited 4th Floor, A-Wing, Raheja Plaza, LBS Road Ghatkopar (West) Mumbai - 400 086. Contact Person- Vinanti Desai  ","location":"Mumbai","experience":"0-1Years"},{"date":"5, 6, 7, 8, 9 - Jan - 2021","skills":"Software Testing, preparing test scenarios,","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Signals & Systems (India) Private Limited, 15 / D-19, 3rd Main Road, SIPCOT IT Park, Siruseri, Chennai - 603 103.","phone":"9360222758","profile":" Software Testing Engineer \nSignals & Systems (India) Private Limited","description":"We are looking for a results-driven Software Tester to be responsible for designing & running tests on software usability. Will conduct tests, analyse the results, & report observations to the design team. Excellent communication & critical thinking skills Job Responsibilities- Reviewing software requirements & preparing test scenarios, Analyzing test results on database impacts, errors or bugs, Preparing reports on software testing carried out & reporting to the design team. Perks and benefits- As per company norms Walk-in Date/ Time: 5th - 9th January 2021, 10.00 AM - 4.00 PM Venue Details- Signals & Systems (India) Private Limited 15 / D-19, 3rd Main Road, SIPCOT IT Park, Siruseri, Chennai - 603 103. Contact - Sundar Anand.D ( 9360222758 )  ","location":"Chennai","experience":"1-3Years"},{"date":"3 - Jan - 2021","skills":"Production Injectable, Sterile Manufacturing, Sterile Pharma, Packaging, Standard Operating Procedures","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"EUGIA Pharma Specialties Limited, Kolthur, Survey No 550, 551 & 552, Opposite to MN Park, Turkapally, Hyderabad.","phone":"Not Provided","profile":" Production Associate \nAurobindo Pharma Limited","description":"Candidate should have relevant experience in Production Injectable, Sterile Manufacturing, Sterile Pharma, Packaging, Standard Operating Procedures. Must have Regulatory Exposure Roles and Responsibilities- 1. Indenting of Raw materials, Primary packaging materials and Secondary packaging materials as per the production plan. 2. Maintaining minimum inventory of clean room consumables, items and spares of equipment's. 3. Taking approval/ Line clearance from the QA department before starting of each activity. 4. Intimation to Engineering department regarding calibration activities. 5. Ensure the activities being done as per the Standard Operating Procedures. 6. Ensure the cleaning of the area, items and equipment's as per the procedure. Desired Candidate Profile- Candidates Must have Regulatory Exposure Walk-in Date/ Time: 3rd January 2021, 9.30 AM - 1.00 PM Venue Details: EUGIA Pharma Specialties Limited, Kolthur, Survey No 550, 551 & 552, Opposite to MN Park, Turkapally, Hyderabad.  ","location":"Hyderabad","experience":"4-9Years"},{"date":"2 - Jan - 2021","skills":"IT Recruitment, Screening, Induction, Selection, Hiring, Mass Mailing","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"V-Soft Consulting Corporation Pvt. Limited, Incor9, 3rd Floor, Kavuri Hills, Madhapur Hyderabad - 500 033","phone":"Not Provided","profile":" US IT Recruiter \nV-Soft Consulting Corporation Pvt. Limited","description":"We do have the Immediate requirement for freshers for the 'US IT Recruiter' Position. Job Location: Hyderabad Work Experience : 0 to 2 years Candidate must have very good communication skills Should be interested in working in night shifts Shift Timings: 07:30 PM to 04:30 AM (Night shift) Walk-in Date/ Time: 2nd January 2021, 10.30 AM - 2.00 PM Venue Details- V-Soft Consulting Corporation Pvt. Limited Incor9, 3rd Floor, Kavuri Hills, Madhapur Hyderabad - 500 033. Contact Person- Sravani Interested candidates can share their profiles with sravani@vsoftconsulting.com  ","location":"Hyderabad","experience":"0-2Years"},{"date":"2 - Jan - 2021","skills":"Patient Care, Front office/ Receptionist Activities, Hospital Reception, Medical Billing","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Felix HealthCare Private Limited, Sector 137, Noida Expressway, Near India TV Sector 137 Metro Station","phone":"8929200723","profile":" Front Office Executive \nFelix HealthCare Private Limited","description":"Educational Qualification - Any Graduation Work Experience: 1 to 4 Years Location: Noida Sector-137 Job Responsibilities- Patient Care, Front office/ Receptionist Activities, Hospital Reception, Medical Billing Walk-in Date/ Time: 2nd January 2021, 10.00 AM - 4.00 PM Venue Details- Felix HealthCare Private Limited Sector 137, Noida Expressway, Near India TV Sector 137 Metro Station Interested Candidates are requested to contact Jyoti-8929200723 Or recruitment@felixhospital.com  ","location":"Noida","experience":"1-4Years"},{"date":"2 - Jan - 2021","skills":"IT Recruitment, Selection, Mass Mailing, Hiring/ Sourcing, Technical Recruitment","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Prodcon Tech Services Private Limited, 20/160, Anand Nagar, behind Vakola Police Station, Vakola Santacruz (East), Mumbai - 400 029.","phone":"8108074457","profile":" HR Executive/ IT Recruiter \nProdcon Tech Services Private Limited","description":"We are having Urgent opening in our organization - Prodcon for HR- IT Recruiter at Santacruz (E) Location. IT Recruiter (Least 6 months to 1.5 Years) Senior IT Recruiter (1.5+ to 4 Years) Freshers with good communication and conceptional recruitment process understanding can also apply for this position. Candidate should have good communication skills Must have good Inter-personal skills. Quick Learner & an effective Team Player Deadline driven professional Should have Good Problem solving skills. Thrives to work in an intensely competitive, fast paced, dynamic & pressurized environment. Walk-in Date/ Time: 2nd January 2021, 10.00 AM - 5.00 PM Venue Details- Prodcon Tech Services Private Limited 20/160, Anand Nagar, behind Vakola Police Station, Vakola Santacruz (East), Mumbai - 400 029. Contact - Yogesh Pednekar/ Raj Shelar (8108074457)  ","location":"Mumbai","experience":"0-5Years"},{"date":"2 - Jan - 2021","skills":"Denial Management, AR Callers, Charge Entry, Claim Processing, Rejections.","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"eMedicalPractice (Norm Software), Flat No. 1-2-68T070 Parklane, Opp Chenoy Trade Center Beside Brand Factory, above Canara Bank ATM, 2nd Floor Sec-bad - 500 003","phone":"040-4222-4061","profile":" Medical Billing Associate \neMedicalPractice (Norm Software)","description":"Opening for Graduate/ Freshers with good communication skills. Job Responsibilities- Denial Management, AR Callers, Charge Entry, Claim Processing, Rejections. Walk-in Date/ Time: 2nd January 2021, 9.30 AM - 5.30 PM Venue Details- eMedicalPractice (Norm Software) Flat No. 1-2-68T070 Parklane, Opp Chenoy Trade Center Beside Brand Factory, above Canara Bank ATM, 2nd Floor Sec-bad - 500 003 Office Phone: 040-4222-4061 Contact Person- Santhosh Bhave  ","location":"Hyderabad, Secunderabad","experience":"0-1Years"},{"date":"4, 5, 6, 7, 8 - Jan - 2021","skills":"Android SDK 2.2 to 4.4, Android NDK, Design Patterns, OOPs fundamentals, Java, Kotlin, JSON","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Infoneo Technologies Pvt. Limited, B-56, 3rd Floor, Sector 64, Noida","phone":"0120-4150552","profile":" Android Developer \nInfoneo Technologies Private Limited","description":"Candidate should have good experience in Rest, Google API, GPS & payment gateway integration, POS terminal, Android SDK 2.2 to 4.4, Android NDK. Knowledge of design patterns, OOPs fundamentals, Java, Kotlin, JSON, Android 5 & above, 3rd party libraries, OPENGL, XML, JSON, etc. Perks and Benefits- 5 Days Working Flexible Timing Direct Walk-in from Monday - Friday, between 11AM - 6PM Venue Details- Infoneo Technologies Private Limited, B-56, 3rd Floor, Sector 64, Noida Contact No: 0120-4150552  ","location":"Noida","experience":"2-7Years"},{"date":"2, 3, 4, 5, 6 - Jan - 2021","skills":"PHP web frameworks (Laravel, CodeIgniter or any other MVC framework)","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"360 Degree Info Private Limited, No. 82, Arcot Road, 2nd Floor, Kodambakkam, Chennai - 24.","phone":"8124877711","profile":" PHP Web Developer \n360 Degree Info Private Limited","description":"We urgently require PHP developers with real-time development experience. Developer can able to develop applications as a team member or individual. 90% of your work will be a supporting work, you need to customize applications based on client requirements, and you need to provide technical support like deployment and maintenance. Roles & Responsibilities: You need to customize applications like E-Commerce Applications, ERP Solutions, and POS Solutions which is developed in PHP Frameworks. Mandatory Requirements Proficient in the latest PHP versions and understanding the fully synchronous behavior of PHP. Strong knowledge of PHP web frameworks (Laravel, CodeIgniter or any other MVC framework). Strong knowledge in Web Services (Development & Integration) Working knowledge of any of the open source ecommerce frameworks (OpenCart, WooCommerce CS Cart etc.). Understanding of MVC design patterns. Working knowledge of front-end technologies JavaScript/JQuery, HTML5 and CSS3. Strong knowledge of Object Oriented Programming. Strong knowledge of the common PHP or web server exploits and their solutions. Understanding fundamental design principles behind a scalable application. Familiarity with limitations of PHP as a platform and its workarounds. Familiarity with MySQL database Strong knowledge in PHP application deployment at Local/ Web Servers Walk-in Date/ Time: 4th - 6th January 2021, between 9:30 AM - 6:00 PM Venue Details- 360 Degree Info Private Limited No. 82, Arcot Road, 2nd Floor, Kodambakkam, Chennai - 24. Contact - Syed (Hr Manager) Tel- 8124877711  ","location":"Chennai","experience":"1-5Years"},{"date":"2 - Jan - 2021","skills":".Net, C#, WinForm, WPF, OOPs Concept","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Electronica Mechatronic Systems (I) Pvt. Limited, Building 44, 2nd Floor, Electronic Co-Op Estate Limited Pune Satara Road, Pune - 411 009.","phone":"Not Provided","profile":" .Net/ WPF Developer \nElectronica Mechatronics (I) Pvt. Limited","description":"We are looking for fresher/ experienced candidate who is having knowledge/ experience in C#, WinForm, WPF, OOPs Concept. Must possess a strong passion to learn new technologies. Must have good analytical and problem solving skills. Builds desktop applications-follows coding standards and appropriate testing, Designing small to medium modules, coding and debugging applications, Front end graphical user interface design. Walk-in Date/ Time: 2nd January 2021, 9.30 AM - 1.00 PM Venue Details- Electronica Mechatronic Systems (I) Pvt. Limited Building 44, 2nd Floor, Electronic Co-Op Estate Limited Pune Satara Road, Pune - 411 009. Contact Person- Rasika Sapre  ","location":"Pune","experience":"0-3Years"},{"date":"1, 2, 4, 5, 6, 7 - Jan - 2021","skills":".Net, Web API, RDBMS MS SQL or ORACLE","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Cameo Corporate Service Limited, No.1, Subramanian Building, 5th Floor, Club House Road, Anna Salai, Chennai. Landmark:- Near Spencer Plaza,","phone":"044-40020786","profile":" .Net Programmer (Web API) \nCameo Corporate Services Limited","description":"Immediate Opening for Dot Net Programmer (with Web API knowledge) DOT NET programmer with experience needed at least 3 years Banking domain software development experience required Webapi development experience required RDBMS MS SQL or ORACLE Min 1 to 3 years of experience in Web Api developer Perks and Benefits Salary Package : Rs: 25000/- to 30000/- CTC Interested Candidates walk in below mentioned address:- Cameo Corporate Service Limited No.1, Subramanian Building, 5th Floor, Club House Road, Anna Salai, Chennai. Landmark:- Near Spencer Plaza, Opposite. building to Senthur Hotel, Bank of Baroda Bank. Contact Person : Mr. Sultan (HR)  ","location":"Chennai","experience":"3-5Years"},{"date":"4, 5, 6, 7 - Jan - 2021","skills":"Java Frameworks Spring, Hibernate, Web Services HTML, JQuery, JavaScript. SQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"PiLog India Private Limited, 3rd Floor MJR Magnifique, Rai Durg, X Roads, Nanakaramguda, Hyderabad, Telangana - 500 008.","phone":"6301760928","profile":" Java Developer \nPiLog India Private Limited","description":"Candidate should be BE/ B.Tech or MCA with 2 to 7 years of experience in Software Development using Experience on Java Frameworks Spring and Hibernate. Must have strong knowledge on Front end Web Services HTML, JQuery, JavaScript. Advance level. Should have experience & knowledge of Database SQL Language. Walk-in Date/ Time: 4th - 7th January 2021, 11.00 AM - 5.00 PM Venue Details- PiLog India Private Limited 3rd Floor MJR Magnifique, Rai Durg, X Roads, Nanakaramguda, Hyderabad, Telangana - 500 008. Contact - Saleem Khan ( 6301760928 )  ","location":"Hyderabad","experience":"2-7Years"},{"date":"1, 2, 4, 5, 6, 7 - Jan - 2021","skills":"Back Office Assistance, Customer handling, Logging, Verification, Inbound/ Out bound Calls","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Core Vision Solutions, 11B, Dalhouse, Lal Dighi, B.B.D. Bagh, Kolkata - 700 001.","phone":"8777070906","profile":" Back Office Executive \nCore Vision Solution","description":"Candidate should be Any Graduate/ HSC Passouts, Fresher, male & female both can apply. Age 21 to 27 Years Job Responsibilities- Customer handling, Logging, Checking, Verification, Receiving Phone calls Walk-in Date/ Time: 1st - 7th January 2021, 10.30 AM - 1.30 PM Venue Details- Core Vision Solutions 11B, Dalhouse, Lal Dighi, B.B.D. Bagh, Kolkata - 700 001. Contact - SONAKSHI ( 8777070906 )  ","location":"Kolkata","experience":"0-1Years"},{"date":"7 - Jan - 2021","skills":"Home Loans, Mortgage Loans, Personal Loans, Business Development","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Shubham Housing Development Finance Company Ltd. Shop No-12, 2nd Floor , Khara Number-120/121/22, B Sadan Tajpur Road B Sadan, Mathura Road, Badarpur, New Delhi","phone":"Not Provided","profile":" Relationship Officer/ Manager \nShubham Housing Development Finance Company Ltd.","description":"Shubham Housing Development Finance is conducting interviews on 7th Jan. Time :- 11:30 am to 3:00 pm. Please mention HR on top of your resume Minimum 6 months experience is required/ knowledge in Secured loan Mortgage/ Home loans/ LAP/ any financial product. Have incentives details of current or previous organisation. Job Details:- 1. Front-end interaction, field travel and Customer interface 2. Recommending apt home loan product /solution and showcasing benefits 3. Regular interaction with the customers through group meetings, site promotions, in office meetings and presentations 4. Attending to walk ins into branches & visiting clients at their place 5. Executing Branding / Marketing activities in the catchment area 6. Spearheading Documentation 7. Lead generation in the catchment areas 8. 0-12 MOB and even 13-24 MOB or more bounce cases collections with focus and efforts on 100% collections efficiency Walk-in Date/ Time: 7th January 2021, 10.00 AM - 2.30 PM Venue Details- Shubham Housing Development Finance Company Ltd. Shop No-12, 2nd Floor , Khara Number-120/121/22, B Sadan Tajpur Road B Sadan, Mathura Road, Badarpur, New Delhi Contact - Ajay, Prakash BM  ","location":"Delhi","experience":"1-6Years"},{"date":"1, 2, 4, 5, 6, 7 - Jan - 2021","skills":"Administrative Assistance, Office Management, Facility Management, Vendor Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Cameo Corporate Service Limited, No. 1, Subramanian Buliding, 5th Floor, Club House Road, Anna Salai, Chennai.","phone":"044-40020786","profile":" Admin Assistant/ Executive \nCameo Corporate Services Limited","description":"Candidate should have Any Degree with minimum 6 months to 2 Years of experience. Fresher can also apply, if interested to take up their career in admin activities. Age Limit : 21 to 30 Years (Male Candidate Preferred) Perks and Benefits Salary Budget: up to Rs.15000/- CTC + Travel Allowance Interested Candidates walk in below mentioned address:- Walk-in Date/ Time: 1st - 7th January 2021, 10.00 AM - 1.00 PM Venue Details- Cameo Corporate Service Limited No. 1, Subramanian Buliding, 5th Floor, Club House Road, Anna Salai, Chennai. Landmark:- Near Spencer Plaza, Opp. building to Senthur Hotel, Bank of Baroda Bank. Contact - Sultan ( 044-40020786 )  ","location":"Chennai","experience":"0-2Years"},{"date":"30 - Dec - 2020","skills":"Customer Service, Voice Process, Semi-Voice Process, Blended Process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Aliengena Captive Private Limited, 217 Janpath Society, Near Lokmanya Jogging Track, Lokmanya Nagar, Sadashiv Peth, Pune - 411 030.","phone":"7620605245","profile":" Customer Service (Voice Process) \nAliengena Captive Private Limited","description":"Candidate should be Any Graduate with excellent Communication skills Ability to work in a fast-paced, high-growth, team-oriented environment Should have Multi-tasking capabilities and organisational skills US Factoring Process B2B Blended Process, 5 days working & in rotational shifts Walk-in Date/ Time: 30 December 2020, 2.00 PM - 4.00 PM Venue Details- Aliengena Captive Private Limited 217 Janpath Society, Near Lokmanya Jogging Track, Lokmanya Nagar, Sadashiv Peth, Pune - 411 030. Contact - Rachna Kandalkar ( 7620605245 )  ","location":"Pune","experience":"0-2Years"},{"date":"30 - Dec - 2020","skills":"Back Office Operations, KYC, Claims Process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Shriram Life Insurance Company Limited, Plot No. 31 and 32,5th Floor, Ramky Selenium, Financial District, Gachibowli, Hyderabad Telangana","phone":"Not Provided","profile":" Back Office Operations Executive \nShriram Life Insurance Company Limited","description":"We at Shriram Life Insurance Company Limited have Walk-In for Back Office Operations Executive/ Fresher for operation department. Candidate should be Any Graduate with excellent communication skills This is for 6 months contract and according to performance hire permanent. If you are interested then please come for office. Walk-in Date/ Time: 30th December 2020, 10.00 AM - 3.00 PM Venue Details- Shriram Life Insurance Compnay Limited, Plot No. 31 and 32,5th Floor, Ramky Selenium, Financial District, Gachibowli, Hyderabad Telangana Contact Person- Pooja  ","location":"Hyderabad","experience":"0-1Years"},{"date":"30 - Dec - 2020","skills":"Lead Generation, Outbound Sales, Tele calling, Cold Calling, Customer Satisfaction","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Zoom ID - 6105943182 , Pass- D1X44J","phone":"Not Provided","profile":" Lead Generation Executive \nLenskart Solutions Private Limited","description":"Lenskart Solutions Private Limited, is Hiring for Lead Generation Executives for Delhi NCR, Meerut, Gurgaon, Faridabad, Noida Key Requirements: Any Graduate with good communication skills Excellent negotiation skills to close and generate lead. Must Have Laptop/ Desktop and Wifi Job Responsibilities: Greeting all the customers and guiding them about the Lenskart as a brand and its products. Contact and maintain cordial relationship with existing Lenskart customers Being dedicated to customer satisfaction and resolving any concerns that the customer has Generating leads from cold calling and other social media platforms to give details to field agents Walk-in Venue : Zoom ID - 6105943182 , Pass- D1X44J Date: 30th December 2020, Wednesday Time : 10:00AM to 10:15 AM  ","location":"Delhi, Noida, Gurgaon","experience":"0-5Years"},{"date":"30 - Dec - 2020","skills":"Agency Sales/ Agency Development/ Tied Channel Development/ Management","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Kotak Mahindra Life Insurance Company Limited, Ceebros Centre, 1st Floor, No. 45, Montieth Road, Egmore, Chennai, Tamil Nadu - 600 008.","phone":"9136475966","profile":" Agency Manager \nKotak Mahindra Life Insurance Company Limited","description":"The candidate must be a Graduate Must have minimum 2-3 years of sales experience Age (Max 40 years) Candidate should have worked in Chennai for more than 4 years Current location should be Chennai Recruit The person shall be responsible for Recruitment and Development of quality advisors and encourage them for long term career.by selling career opportunity to such prospective advisors Coach performance and daily activity of advisors. the morale to retain performing advisors & special attention to average performers & providing need based training. Sales Leader product as well as practical training to the advisors by accompanying them to client meetings and motivating them on the sales funnel and achieving revenue targets Interested candidates can directly walk-in on the below mentioned details or can reach us at 9136475966 for any further details Walk-in Date/ Time: 30th December 2020, 10.30 AM - 4.00 PM Venue Details- Kotak Mahindra Life Insurance Company Limited Ceebros Centre, 1st Floor, No. 45, Montieth Road, Egmore, Chennai, Tamil Nadu - 600 008. Contact - Balaji S (9136475966)  ","location":"Chennai","experience":"2-7Years"},{"date":"30 - Dec - 2020","skills":"Core Java, Advance Java, Servlets, JSP, JavaScript. HTML5, Hibernate, Web Services","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Black and White Business Solutions Pvt. Limited, 721, 2nd Floor, Chinmaya Mission Hospital Road, Binnamangala, Stage 1, Indiranagar, Bengaluru, Karnataka - 560 038.","phone":"Not Provided","profile":" HR Recruiter/ HR Analyst \nBlack and White Business Solutions Pvt. Limited","description":"Openings at Black and White Business Solution (Indiranagar), Preferably female candidates !! Educational Qualification: Any Graduate Experience - Minimum 1 to 3 years Shift : Day Shift We are looking for the best candidate who can show their skills in HR (ITES / BPO Recruitment) Best opportunity for fresher to upgrade your skills with the leading firm Sourcing candidates from various Job portals based on the company requirements. Screening the candidates resumes and contacting relevant candidates. Assess knowledge, skills, Excellent communication skill, aptitudes and experience of the applicant. Arranging interviews for selected candidates with the chosen company. Strong work ethic and sense of commitment. Excellent communication - oral and written. Self driven to achieve assigned targets. Ability to research, understand the business process Excellent learning skills, and maintaining good relationships with candidates. Positive attitude, and interpersonal skills along with excellent rapport building are the traits for the right candidate. End to end recruitment. & Computer skills (Word, Excel, Outlook, Internet etc) Addinal Info: We are hiring for TOP BPO in Bangalore for Domestic & international (Male & Females can apply for BPO) Candidates from Bangalore location can only apply Should be flexible with work from Office. Walk-in Date/ Time: 30th December 2020, 11.00 AM - 3.00 PM Venue Details- Black and White Business Solutions Pvt. Limited 721, 2nd Floor, Chinmaya Mission Hospital Road, Binnamangala, Stage 1, Indiranagar, Bengaluru, Karnataka - 560 038. Contact Person- Madhu  ","location":"Bangalore","experience":"0-3Years"},{"date":"30 - Dec - 2020","skills":"HR/ Recruitment, Screening, Sourcing, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Supro Info Solutions Private Limited, Top Floor, Sardar Patel Complex, Ambicka Nagar Society, Luhar Faliya, Nana Varachha, Surat, Gujarat - 395 006.","phone":"6352491012","profile":" HR Executive/ Recruiter \nSupro Info Solutions Private Limited","description":"We are looking for talents with the following specialty - Good communication and convincing skills - Any Graduate or 12 passes fresher - Recruiters with 6 months experience are highly preferred Job Responsibilities - Screening and Sourcing - Using various job posting sites - Explaining job role to job-seekers - Back-office work and back-office management - Managing database - Managing end to end recruitment - Active follow-up Walk-in Date/ Time: 30th December 2020, 10.00 AM - 3.30 PM Venue Details- Supro Info Solutions Private Limited Top Floor, Sardar Patel Complex, Ambicka Nagar Society, Luhar Faliya, Nana Varachha, Surat, Gujarat - 395 006. Contact Person- Shehbaz Shaikh ( 6352491012 )  ","location":"Surat","experience":"0-2Years"},{"date":"30 - Dec - 2020","skills":"Charge Posting, Payment/ Cash Posting, Charge Entry, Medical Billing","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"e-Care India Private Limited, 5th Floor Navis WSS Towers, 106 Harris Road, Chennai - 2. Land Mark : Casino Theater","phone":"Not Provided","profile":" Charge Entry/ Payment Posting Associate \ne-Care India Private Limited","description":"We are looking for resources in charge Entry/Payment posting from Medical Billing Industries 1. Payment Posting 2. Charge Entry Job Essentials : Payment Posting : Experience 1 to 3 Years Location : Chennai Skills Required : ERA ,EFT CHARGE ENTRY : Experience : 1 to 3 Years Location : Chennai Skills Required : Charge Entry Interested and Suitable candidates can Walk-In from 29-Dec-2020 to 30-Dec-2020 (Tuesday to Wednesday) from 11 am to 5 pm in the below mentioned venue details e-Care India Private Limited 5th Floor Navis WSS Towers, 106 Harris Road, Chennai - 2 Land Mark : Casino Theater  ","location":"Chennai","experience":"1-3Years"},{"date":"30 - Dec - 2020","skills":"Tele marketing, Customer Satisfaction, Customer Care","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Atria Convergence Technologies Limited, TVH Belicia Towers, Tower 1, 10th floor, Block No. 94, MRC Nagar Chennai, Tamil Nadu - 600 028.","phone":"Not Provided","profile":" Telecaller Executive \nAtria Convergence Technologies Limited","description":"Candidate should have minimum of 1 to 6 years of relevant work experience in English Voice process. Should have experience in Tele calling, Customer Care or taking calls - Outbound & Inbound. (Voice process). Experience handling MIS or strong experience with MS excel, MS word. Must possess excellent communication and interpersonal skills. Language preferred - English & Tamil (Hindi, Telugu or Kannada would be an additional advantage) Immediate Joiners or Max 15 days Notice period preferred Job Location : MRC Nagar Week Off : 6 days working & 1 day rotational week off/ Rotational Day shifts. Age : Below 33 Please make sure that you have all the documents in place and come to the interview with the below documents :- 2) Pan Card 3) Aadhar Card 4) Driving License 5) X Certificate 6) XII Certificate 7) Graduation Certificate UG/ PG/ Diploma/ ITI 8) Current company offer letter 9) Last 3 months payslip 10) Relieving letter (Applicable if relieved already) Interested candidate may walk in to the below mentioned venue for F2F interview Walk-in Date/ Time: 30th December 2020, 10.00 AM - 1.00 PM Venue Details- Atria Convergence Technologies Limited, TVH Belicia Towers, Tower 1, 10th floor, Block No. 94, MRC Nagar Chennai, Tamil Nadu - 600 028. Contact Person: Mary (HR)  ","location":"Chennai","experience":"1-6Years"},{"date":"28 - Dec - 2020","skills":"Front Office/ Receptionist Activities, Front Office Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Visionet Systems Private Limited, AMR Tech Park, Ground Floor, # 23 & 24, Hosur Main Road, Next to Oxford College of Engineering, Bengaluru - 560 068.","phone":"8707253872","profile":" Front Office Executive (Female) \nVisionet Systems Private Limited","description":"We at Visionet Systems Private Limited have opening for Front office Executive at Bangalore The candidate should have Excellent communication and Good Looking Should be comfortable to Work from office Looking for immediate Joiners. FEMALE candidates only required. Interested candidates can Walk in to our office directly Walk-in Date/ Time: 28th December 2020, 10.30 AM - 2.00 PM Venue Details- Visionet Systems Private Limited AMR Tech Park, Ground Floor, # 23 & 24, Hosur Main Road, Next to Oxford College of Engineering, Bengaluru - 560 068. Contact Person- Neelam ( 8707253872 )  ","location":"Bangalore","experience":"1-2Years"},{"date":"28 - Dec - 2020","skills":"Business Development, Channel Sales, Lead Generation, Cross Selling, Business Generation","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"IndusInd Bank Limited, 802-4, Platinum Techno Park, Plot No. 17 & 18, Sector - 30A, Vashi, Navi Mumbai - 400 703","phone":"022-41846669","profile":" Business Development Executive \nIndusInd Bank Limited","description":"We are looking forward to hire young, dynamic and agile Business Executive in Masjid and Borivali who comes with the conviction & ability to work in a fast pace environment with rewarding career opportunities. Minimum Experience: 0 to 5 Years Job Location: Borivali / Masjid Salary: INR Up to 3,00,000 P.A (Negotiable) Roles and Responsibilities- Channel Management: - Achieve new finance volume and other products target by managing various relationships assigned, including, authorized dealers of automobile manufacturers Business Target: - To achieve sales targets & achieve 100% productivity levels Customer Service: - To provide timely service to the customer, and ensure proper communication of terms of finance and generate leads Due Diligence: - Visiting customer and checking his credit worthiness, Disclosure of Complete customer details to credit, OSV of mandatory customer KYC documents Sourcing Business: - Identify and develop new relationships for generating business through dealers visit and channels on a regular basis & source a deal from channel/direct & cross selling of insurance & other products to the customer. Rate Negotiation: - To Maintain the Targeted WIRR Internal Interaction: - Regular training and updates to sales team and business partners with the aim of improving quality and TAT, resulting in higher volume and strong business relations with channel partners External Interaction: - Dealer, DSA, Customer, Value, RTO Agent Perks and Benefits- Petrol Conveyance Reimbursement Interview Date: 28th December, 2020 Time: 11:00 To 04:00 Venue Details: IndusInd Bank Limited, 802-4, Platinum Techno Park, Plot No. 17 & 18, Sector - 30A, Vashi, Navi Mumbai - 400 703 Contact Person: Shrikant Mob no. 022-41846669 Emil- maharashtra_hrbos@indusind.com  ","location":"Mumbai","experience":"0-5Years"},{"date":"28 - Dec - 2020","skills":"Lead Generation, Outbound Sales, Telecalling, Cold Calling, Customer Satisfaction","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Zoom ID - 6105943182 , Pass- D1X44J","phone":"Not Provided","profile":" Lead Generation Executive \nLenskart Solutions Private Limited","description":"Lenskart Solutions Private Limited is Hiring for Lead Generation Executives !! Responsibilities: Greeting all the customers and guiding them about the Lenskart as a brand and its products. Contact and maintain cordial relationship with existing Lenskart customers Being dedicated to customer satisfaction and resolving any concerns that the customer has Generating leads from cold calling and other social media platforms to give details to field agents Excellent negotiation skills to close and generate lead. Requirements : Must Have Laptop/ Desktop and Wifi Must have good communication skills Walkin Venue : Zoom ID - 6105943182 , Pass- D1X44J Date: 28th December 2020, Monday Time : 10:00 AM to 10:15 AM  ","location":"Delhi, Noida, Gurgaon","experience":"0-5Years"},{"date":"28 - Dec - 2020","skills":"Purchase Management, Home Care","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"HealthVista India Private Limited, 4th Floor, MCH No.:15-29-1000/H-C/16, Road No. 1, KPHB Colony, Kukatpally, Hyderabad - 500 072.","phone":"9121283154","profile":" Management Trainee \nHealthVista India Private Limited","description":"Freshers from BAMS, BHMS, BDS, B.Pharmacy/ M.Pharmacy, MHM, MHA. It is not limited to only these streams. If anyone interested in this profile can also apply. Job Responsibility- 1). To be a part of Management Project for a period of 03 months, starting from 1st January, 2021 to 31st March, 2021. 2). Visit hospitals in the city 3). Collect details of Total Beds in each hospital with Doctors practicing 4). Overall in-charges of the hospitals with specialty wise break up 5). Presence of ICU in hospitals, daily IPD discharges 6). Details of Purchase Manager, BME, & Potential for equipment rentals for patients, in house hospital rental usage 7). Potential for home care service etc. 8). Doctors practice timings and visit timings for Pharma companies 9). Collecting these details, preparing data in Ms-Excel and sharing it with the HOD. Perks and Benefits : Stipend + Travel allowance + Mobile allowance + Certificate Walk-in Date/ Time: 28th December 2020, 11.00 AM - 4.00 PM Venue Details- HealthVista India Private Limited 4th Floor, MCH No.:15-29-1000/H-C/16, Road No.1, KPHB Colony, Kukatpally, Hyderabad - 500 072. Contact - Kolluri Sreelatha ( 9121283154 ) Important note : Project starting date from 1st January, 2021 to 31st March, 2021 Candidates who are interested, please share your profile with 'kolluri.sreelatha@porteamedical.com' Or contact on : 9121283154  ","location":"Hyderabad","experience":"0-1Years"},{"date":"28 - Dec - 2020","skills":"B2B Sales, Insurance Sales","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Kotak Life Insurance Company Limited, 2nd Floor, 7, Community Center, Block A, New Friends Colony, New Delhi -110 065","phone":"Not Provided","profile":" B2B Sales Executive - Freshers \nKotak Life Insurance Company Limited","description":"Educational Qualification: Any Graduate/ MBA Experience: 0-3 years (Sales Experience preferred) Freshers can also apply Scored 60% or above in 10th, 12th, and Graduation Age :22-30 Years The candidate should be from Gurgaon with own two wheeler. Should have good communications & Convincing skills. The candidate should be fluent in Hindi and English Roles & Responsibilities: Manages channel partner business on daily basis by visiting points of sales within a defined territory and meeting all concerned personnel. Builds excellent relationship with all concerned personnel at point of sales and fulfill all service related requirements at the assigned Branches. Does personal and telephonic interaction with existing channel partner relationships for business mobilization and ensuring maximum conversion of loan borrowers for Credit Life cover. Does personal and telephonic interactions with borrowers as facilitation/ support to Branch personnel. Handles/ resolves queries from relationships efficiently on daily basis. Preparing/ collating weekly reports on the outcome of interactions with the relationships for submission to concerned personnel. Regular tracking/interaction with concerned personnel in the relationships for weekly or fortnightly MIS/details. Regular tracking of pending documents and ensuring complete conversion. Interaction/tracking of Medical cases with concerned personnel of KLI and relationships ensuring timely completion of MT and subsequent conversion. Walk-in Date/ Time: 28 December 2020, 3.00 PM - 5.00 PM Venue Details- Kotak Life Insurance Company Limited 2nd Floor, 7, Community Center, Block A, New Friends Colony, New Delhi -110 065 Contact Person- Darpan Pradhan  ","location":"Delhi","experience":"0-3Years"},{"date":"28 - Dec - 2020","skills":"Business Development, Channel Sales, Lead Generation, Cross Selling, Business Generation","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"IndusInd Bank Limited, 802-4, Platinum Techno Park, Plot No. 17 & 18, Sector - 30A, Vashi, Navi Mumbai - 400 703","phone":"022-41846669","profile":" Business Development Executive \nIndusInd Bank Limited","description":"We are looking forward to hire young, dynamic and agile Business Executive in Masjid and Borivali who comes with the conviction & ability to work in a fast pace environment with rewarding career opportunities. Minimum Experience: 0 to 5 Years Job Location: Borivali / Masjid Salary: INR Up to 3,00,000 P.A (Negotiable) Roles and Responsibilities- Channel Management: - Achieve new finance volume and other products target by managing various relationships assigned, including, authorized dealers of automobile manufacturers Business Target: - To achieve sales targets & achieve 100% productivity levels Customer Service: - To provide timely service to the customer, and ensure proper communication of terms of finance and generate leads Due Diligence: - Visiting customer and checking his credit worthiness, Disclosure of Complete customer details to credit, OSV of mandatory customer KYC documents Sourcing Business: - Identify and develop new relationships for generating business through dealers visit and channels on a regular basis & source a deal from channel/direct & cross selling of insurance & other products to the customer. Rate Negotiation: - To Maintain the Targeted WIRR Internal Interaction: - Regular training and updates to sales team and business partners with the aim of improving quality and TAT, resulting in higher volume and strong business relations with channel partners External Interaction: - Dealer, DSA, Customer, Value, RTO Agent Perks and Benefits- Petrol Conveyance Reimbursement Interview Date: 28th December, 2020 Time: 11:00 To 04:00 Venue Details: IndusInd Bank Limited, 802-4, Platinum Techno Park, Plot No. 17 & 18, Sector - 30A, Vashi, Navi Mumbai - 400 703 Contact Person: Shrikant Mob no. 022-41846669 Emil- maharashtra_hrbos@indusind.com  ","location":"Mumbai","experience":"0-5Years"},{"date":"28 - Dec - 2020","skills":"Lead Generation, Outbound Sales, Telecalling, Cold Calling, Customer Satisfaction","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Zoom ID - 6105943182 , Pass- D1X44J","phone":"Not Provided","profile":" Lead Generation Executive \nLenskart Solutions Private Limited","description":"Lenskart Solutions Private Limited is Hiring for Lead Generation Executives !! Responsibilities: Greeting all the customers and guiding them about the Lenskart as a brand and its products. Contact and maintain cordial relationship with existing Lenskart customers Being dedicated to customer satisfaction and resolving any concerns that the customer has Generating leads from cold calling and other social media platforms to give details to field agents Excellent negotiation skills to close and generate lead. Requirements : Must Have Laptop/ Desktop and Wifi Must have good communication skills Walkin Venue : Zoom ID - 6105943182 , Pass- D1X44J Date: 28th December 2020, Monday Time : 10:00 AM to 10:15 AM  ","location":"Delhi, Noida, Gurgaon","experience":"0-5Years"},{"date":"28 - Dec - 2020","skills":"Purchase Management, Home Care","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"HealthVista India Private Limited, 4th Floor, MCH No.:15-29-1000/H-C/16, Road No. 1, KPHB Colony, Kukatpally, Hyderabad - 500 072.","phone":"9121283154","profile":" Management Trainee \nHealthVista India Private Limited","description":"Freshers from BAMS, BHMS, BDS, B.Pharmacy/ M.Pharmacy, MHM, MHA. It is not limited to only these streams. If anyone interested in this profile can also apply. Job Responsibility- 1). To be a part of Management Project for a period of 03 months, starting from 1st January, 2021 to 31st March, 2021. 2). Visit hospitals in the city 3). Collect details of Total Beds in each hospital with Doctors practicing 4). Overall in-charges of the hospitals with specialty wise break up 5). Presence of ICU in hospitals, daily IPD discharges 6). Details of Purchase Manager, BME, & Potential for equipment rentals for patients, in house hospital rental usage 7). Potential for home care service etc. 8). Doctors practice timings and visit timings for Pharma companies 9). Collecting these details, preparing data in Ms-Excel and sharing it with the HOD. Perks and Benefits : Stipend + Travel allowance + Mobile allowance + Certificate Walk-in Date/ Time: 28th December 2020, 11.00 AM - 4.00 PM Venue Details- HealthVista India Private Limited 4th Floor, MCH No.:15-29-1000/H-C/16, Road No.1, KPHB Colony, Kukatpally, Hyderabad - 500 072. Contact - Kolluri Sreelatha ( 9121283154 ) Important note : Project starting date from 1st January, 2021 to 31st March, 2021 Candidates who are interested, please share your profile with 'kolluri.sreelatha@porteamedical.com' Or contact on : 9121283154  ","location":"Hyderabad","experience":"0-1Years"},{"date":"28 - Dec - 2020","skills":"B2B Sales, Insurance Sales","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Kotak Life Insurance Company Limited, 2nd Floor, 7, Community Center, Block A, New Friends Colony, New Delhi -110 065","phone":"Not Provided","profile":" B2B Sales Executive - Freshers \nKotak Life Insurance Company Limited","description":"Educational Qualification: Any Graduate/ MBA Experience: 0-3 years (Sales Experience preferred) Freshers can also apply Scored 60% or above in 10th, 12th, and Graduation Age :22-30 Years The candidate should be from Gurgaon with own two wheeler. Should have good communications & Convincing skills. The candidate should be fluent in Hindi and English Roles & Responsibilities: Manages channel partner business on daily basis by visiting points of sales within a defined territory and meeting all concerned personnel. Builds excellent relationship with all concerned personnel at point of sales and fulfill all service related requirements at the assigned Branches. Does personal and telephonic interaction with existing channel partner relationships for business mobilization and ensuring maximum conversion of loan borrowers for Credit Life cover. Does personal and telephonic interactions with borrowers as facilitation/ support to Branch personnel. Handles/ resolves queries from relationships efficiently on daily basis. Preparing/ collating weekly reports on the outcome of interactions with the relationships for submission to concerned personnel. Regular tracking/interaction with concerned personnel in the relationships for weekly or fortnightly MIS/details. Regular tracking of pending documents and ensuring complete conversion. Interaction/tracking of Medical cases with concerned personnel of KLI and relationships ensuring timely completion of MT and subsequent conversion. Walk-in Date/ Time: 28 December 2020, 3.00 PM - 5.00 PM Venue Details- Kotak Life Insurance Company Limited 2nd Floor, 7, Community Center, Block A, New Friends Colony, New Delhi -110 065 Contact Person- Darpan Pradhan  ","location":"Delhi","experience":"0-3Years"},{"date":"28 - Dec - 2020","skills":"Business Development, Channel Sales, Lead Generation, Cross Selling, Business Generation","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"IndusInd Bank Limited, 802-4, Platinum Techno Park, Plot No. 17 & 18, Sector - 30A, Vashi, Navi Mumbai - 400 703","phone":"022-41846669","profile":" Business Development Executive \nIndusInd Bank Limited","description":"We are looking forward to hire young, dynamic and agile Business Executive in Masjid and Borivali who comes with the conviction & ability to work in a fast pace environment with rewarding career opportunities. Minimum Experience: 0 to 5 Years Job Location: Borivali / Masjid Salary: INR Up to 3,00,000 P.A (Negotiable) Roles and Responsibilities- Channel Management: - Achieve new finance volume and other products target by managing various relationships assigned, including, authorized dealers of automobile manufacturers Business Target: - To achieve sales targets & achieve 100% productivity levels Customer Service: - To provide timely service to the customer, and ensure proper communication of terms of finance and generate leads Due Diligence: - Visiting customer and checking his credit worthiness, Disclosure of Complete customer details to credit, OSV of mandatory customer KYC documents Sourcing Business: - Identify and develop new relationships for generating business through dealers visit and channels on a regular basis & source a deal from channel/direct & cross selling of insurance & other products to the customer. Rate Negotiation: - To Maintain the Targeted WIRR Internal Interaction: - Regular training and updates to sales team and business partners with the aim of improving quality and TAT, resulting in higher volume and strong business relations with channel partners External Interaction: - Dealer, DSA, Customer, Value, RTO Agent Perks and Benefits- Petrol Conveyance Reimbursement Interview Date: 28th December, 2020 Time: 11:00 To 04:00 Venue Details: IndusInd Bank Limited, 802-4, Platinum Techno Park, Plot No. 17 & 18, Sector - 30A, Vashi, Navi Mumbai - 400 703 Contact Person: Shrikant Mob no. 022-41846669 Emil- maharashtra_hrbos@indusind.com  ","location":"Mumbai","experience":"0-5Years"},{"date":"28 - Dec - 2020","skills":"Lead Generation, Outbound Sales, Telecalling, Cold Calling, Customer Satisfaction","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Zoom ID - 6105943182 , Pass- D1X44J","phone":"Not Provided","profile":" Lead Generation Executive \nLenskart Solutions Private Limited","description":"Lenskart Solutions Private Limited is Hiring for Lead Generation Executives !! Responsibilities: Greeting all the customers and guiding them about the Lenskart as a brand and its products. Contact and maintain cordial relationship with existing Lenskart customers Being dedicated to customer satisfaction and resolving any concerns that the customer has Generating leads from cold calling and other social media platforms to give details to field agents Excellent negotiation skills to close and generate lead. Requirements : Must Have Laptop/ Desktop and Wifi Must have good communication skills Walkin Venue : Zoom ID - 6105943182 , Pass- D1X44J Date: 28th December 2020, Monday Time : 10:00 AM to 10:15 AM  ","location":"Delhi, Noida, Gurgaon","experience":"0-5Years"},{"date":"28 - Dec - 2020","skills":"Purchase Management, Home Care","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"HealthVista India Private Limited, 4th Floor, MCH No.:15-29-1000/H-C/16, Road No. 1, KPHB Colony, Kukatpally, Hyderabad - 500 072.","phone":"9121283154","profile":" Management Trainee \nHealthVista India Private Limited","description":"Freshers from BAMS, BHMS, BDS, B.Pharmacy/ M.Pharmacy, MHM, MHA. It is not limited to only these streams. If anyone interested in this profile can also apply. Job Responsibility- 1). To be a part of Management Project for a period of 03 months, starting from 1st January, 2021 to 31st March, 2021. 2). Visit hospitals in the city 3). Collect details of Total Beds in each hospital with Doctors practicing 4). Overall in-charges of the hospitals with specialty wise break up 5). Presence of ICU in hospitals, daily IPD discharges 6). Details of Purchase Manager, BME, & Potential for equipment rentals for patients, in house hospital rental usage 7). Potential for home care service etc. 8). Doctors practice timings and visit timings for Pharma companies 9). Collecting these details, preparing data in Ms-Excel and sharing it with the HOD. Perks and Benefits : Stipend + Travel allowance + Mobile allowance + Certificate Walk-in Date/ Time: 28th December 2020, 11.00 AM - 4.00 PM Venue Details- HealthVista India Private Limited 4th Floor, MCH No.:15-29-1000/H-C/16, Road No.1, KPHB Colony, Kukatpally, Hyderabad - 500 072. Contact - Kolluri Sreelatha ( 9121283154 ) Important note : Project starting date from 1st January, 2021 to 31st March, 2021 Candidates who are interested, please share your profile with 'kolluri.sreelatha@porteamedical.com' Or contact on : 9121283154  ","location":"Hyderabad","experience":"0-1Years"},{"date":"28 - Dec - 2020","skills":"B2B Sales, Insurance Sales","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Kotak Life Insurance Company Limited, 2nd Floor, 7, Community Center, Block A, New Friends Colony, New Delhi -110 065","phone":"Not Provided","profile":" B2B Sales Executive - Freshers \nKotak Life Insurance Company Limited","description":"Educational Qualification: Any Graduate/ MBA Experience: 0-3 years (Sales Experience preferred) Freshers can also apply Scored 60% or above in 10th, 12th, and Graduation Age :22-30 Years The candidate should be from Gurgaon with own two wheeler. Should have good communications & Convincing skills. The candidate should be fluent in Hindi and English Roles & Responsibilities: Manages channel partner business on daily basis by visiting points of sales within a defined territory and meeting all concerned personnel. Builds excellent relationship with all concerned personnel at point of sales and fulfill all service related requirements at the assigned Branches. Does personal and telephonic interaction with existing channel partner relationships for business mobilization and ensuring maximum conversion of loan borrowers for Credit Life cover. Does personal and telephonic interactions with borrowers as facilitation/ support to Branch personnel. Handles/ resolves queries from relationships efficiently on daily basis. Preparing/ collating weekly reports on the outcome of interactions with the relationships for submission to concerned personnel. Regular tracking/interaction with concerned personnel in the relationships for weekly or fortnightly MIS/details. Regular tracking of pending documents and ensuring complete conversion. Interaction/tracking of Medical cases with concerned personnel of KLI and relationships ensuring timely completion of MT and subsequent conversion. Walk-in Date/ Time: 28 December 2020, 3.00 PM - 5.00 PM Venue Details- Kotak Life Insurance Company Limited 2nd Floor, 7, Community Center, Block A, New Friends Colony, New Delhi -110 065 Contact Person- Darpan Pradhan  ","location":"Delhi","experience":"0-3Years"},{"date":"28 - Dec - 2020","skills":"Business Development, Channel Sales, Lead Generation, Cross Selling, Business Generation","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"IndusInd Bank Limited, 802-4, Platinum Techno Park, Plot No. 17 & 18, Sector - 30A, Vashi, Navi Mumbai - 400 703","phone":"022-41846669","profile":" Business Development Executive \nIndusInd Bank Limited","description":"We are looking forward to hire young, dynamic and agile Business Executive in Masjid and Borivali who comes with the conviction & ability to work in a fast pace environment with rewarding career opportunities. Minimum Experience: 0 to 5 Years Job Location: Borivali / Masjid Salary: INR Up to 3,00,000 P.A (Negotiable) Roles and Responsibilities- Channel Management: - Achieve new finance volume and other products target by managing various relationships assigned, including, authorized dealers of automobile manufacturers Business Target: - To achieve sales targets & achieve 100% productivity levels Customer Service: - To provide timely service to the customer, and ensure proper communication of terms of finance and generate leads Due Diligence: - Visiting customer and checking his credit worthiness, Disclosure of Complete customer details to credit, OSV of mandatory customer KYC documents Sourcing Business: - Identify and develop new relationships for generating business through dealers visit and channels on a regular basis & source a deal from channel/direct & cross selling of insurance & other products to the customer. Rate Negotiation: - To Maintain the Targeted WIRR Internal Interaction: - Regular training and updates to sales team and business partners with the aim of improving quality and TAT, resulting in higher volume and strong business relations with channel partners External Interaction: - Dealer, DSA, Customer, Value, RTO Agent Perks and Benefits- Petrol Conveyance Reimbursement Interview Date: 28th December, 2020 Time: 11:00 To 04:00 Venue Details: IndusInd Bank Limited, 802-4, Platinum Techno Park, Plot No. 17 & 18, Sector - 30A, Vashi, Navi Mumbai - 400 703 Contact Person: Shrikant Mob no. 022-41846669 Emil- maharashtra_hrbos@indusind.com  ","location":"Mumbai","experience":"0-5Years"},{"date":"28 - Dec - 2020","skills":"Lead Generation, Outbound Sales, Telecalling, Cold Calling, Customer Satisfaction","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Zoom ID - 6105943182 , Pass- D1X44J","phone":"Not Provided","profile":" Lead Generation Executive \nLenskart Solutions Private Limited","description":"Lenskart Solutions Private Limited is Hiring for Lead Generation Executives !! Responsibilities: Greeting all the customers and guiding them about the Lenskart as a brand and its products. Contact and maintain cordial relationship with existing Lenskart customers Being dedicated to customer satisfaction and resolving any concerns that the customer has Generating leads from cold calling and other social media platforms to give details to field agents Excellent negotiation skills to close and generate lead. Requirements : Must Have Laptop/ Desktop and Wifi Must have good communication skills Walkin Venue : Zoom ID - 6105943182 , Pass- D1X44J Date: 28th December 2020, Monday Time : 10:00 AM to 10:15 AM  ","location":"Delhi, Noida, Gurgaon","experience":"0-5Years"},{"date":"28 - Dec - 2020","skills":"Purchase Management, Home Care","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"HealthVista India Private Limited, 4th Floor, MCH No.:15-29-1000/H-C/16, Road No. 1, KPHB Colony, Kukatpally, Hyderabad - 500 072.","phone":"9121283154","profile":" Management Trainee \nHealthVista India Private Limited","description":"Freshers from BAMS, BHMS, BDS, B.Pharmacy/ M.Pharmacy, MHM, MHA. It is not limited to only these streams. If anyone interested in this profile can also apply. Job Responsibility- 1). To be a part of Management Project for a period of 03 months, starting from 1st January, 2021 to 31st March, 2021. 2). Visit hospitals in the city 3). Collect details of Total Beds in each hospital with Doctors practicing 4). Overall in-charges of the hospitals with specialty wise break up 5). Presence of ICU in hospitals, daily IPD discharges 6). Details of Purchase Manager, BME, & Potential for equipment rentals for patients, in house hospital rental usage 7). Potential for home care service etc. 8). Doctors practice timings and visit timings for Pharma companies 9). Collecting these details, preparing data in Ms-Excel and sharing it with the HOD. Perks and Benefits : Stipend + Travel allowance + Mobile allowance + Certificate Walk-in Date/ Time: 28th December 2020, 11.00 AM - 4.00 PM Venue Details- HealthVista India Private Limited 4th Floor, MCH No.:15-29-1000/H-C/16, Road No.1, KPHB Colony, Kukatpally, Hyderabad - 500 072. Contact - Kolluri Sreelatha ( 9121283154 ) Important note : Project starting date from 1st January, 2021 to 31st March, 2021 Candidates who are interested, please share your profile with 'kolluri.sreelatha@porteamedical.com' Or contact on : 9121283154  ","location":"Hyderabad","experience":"0-1Years"},{"date":"28 - Dec - 2020","skills":"B2B Sales, Insurance Sales","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Kotak Life Insurance Company Limited, 2nd Floor, 7, Community Center, Block A, New Friends Colony, New Delhi -110 065","phone":"Not Provided","profile":" B2B Sales Executive - Freshers \nKotak Life Insurance Company Limited","description":"Educational Qualification: Any Graduate/ MBA Experience: 0-3 years (Sales Experience preferred) Freshers can also apply Scored 60% or above in 10th, 12th, and Graduation Age :22-30 Years The candidate should be from Gurgaon with own two wheeler. Should have good communications & Convincing skills. The candidate should be fluent in Hindi and English Roles & Responsibilities: Manages channel partner business on daily basis by visiting points of sales within a defined territory and meeting all concerned personnel. Builds excellent relationship with all concerned personnel at point of sales and fulfill all service related requirements at the assigned Branches. Does personal and telephonic interaction with existing channel partner relationships for business mobilization and ensuring maximum conversion of loan borrowers for Credit Life cover. Does personal and telephonic interactions with borrowers as facilitation/ support to Branch personnel. Handles/ resolves queries from relationships efficiently on daily basis. Preparing/ collating weekly reports on the outcome of interactions with the relationships for submission to concerned personnel. Regular tracking/interaction with concerned personnel in the relationships for weekly or fortnightly MIS/details. Regular tracking of pending documents and ensuring complete conversion. Interaction/tracking of Medical cases with concerned personnel of KLI and relationships ensuring timely completion of MT and subsequent conversion. Walk-in Date/ Time: 28 December 2020, 3.00 PM - 5.00 PM Venue Details- Kotak Life Insurance Company Limited 2nd Floor, 7, Community Center, Block A, New Friends Colony, New Delhi -110 065 Contact Person- Darpan Pradhan  ","location":"Delhi","experience":"0-3Years"},{"date":"28 - Dec - 2020","skills":"Business Development, Channel Sales, Lead Generation, Cross Selling, Business Generation","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"IndusInd Bank Limited, 802-4, Platinum Techno Park, Plot No. 17 & 18, Sector - 30A, Vashi, Navi Mumbai - 400 703","phone":"022-41846669","profile":" Business Development Executive \nIndusInd Bank Limited","description":"We are looking forward to hire young, dynamic and agile Business Executive in Masjid and Borivali who comes with the conviction & ability to work in a fast pace environment with rewarding career opportunities. Minimum Experience: 0 to 5 Years Job Location: Borivali / Masjid Salary: INR Up to 3,00,000 P.A (Negotiable) Roles and Responsibilities- Channel Management: - Achieve new finance volume and other products target by managing various relationships assigned, including, authorized dealers of automobile manufacturers Business Target: - To achieve sales targets & achieve 100% productivity levels Customer Service: - To provide timely service to the customer, and ensure proper communication of terms of finance and generate leads Due Diligence: - Visiting customer and checking his credit worthiness, Disclosure of Complete customer details to credit, OSV of mandatory customer KYC documents Sourcing Business: - Identify and develop new relationships for generating business through dealers visit and channels on a regular basis & source a deal from channel/direct & cross selling of insurance & other products to the customer. Rate Negotiation: - To Maintain the Targeted WIRR Internal Interaction: - Regular training and updates to sales team and business partners with the aim of improving quality and TAT, resulting in higher volume and strong business relations with channel partners External Interaction: - Dealer, DSA, Customer, Value, RTO Agent Perks and Benefits- Petrol Conveyance Reimbursement Interview Date: 28th December, 2020 Time: 11:00 To 04:00 Venue Details: IndusInd Bank Limited, 802-4, Platinum Techno Park, Plot No. 17 & 18, Sector - 30A, Vashi, Navi Mumbai - 400 703 Contact Person: Shrikant Mob no. 022-41846669 Emil- maharashtra_hrbos@indusind.com  ","location":"Mumbai","experience":"0-5Years"},{"date":"28 - Dec - 2020","skills":"Lead Generation, Outbound Sales, Telecalling, Cold Calling, Customer Satisfaction","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Zoom ID - 6105943182 , Pass- D1X44J","phone":"Not Provided","profile":" Lead Generation Executive \nLenskart Solutions Private Limited","description":"Lenskart Solutions Private Limited is Hiring for Lead Generation Executives !! Responsibilities: Greeting all the customers and guiding them about the Lenskart as a brand and its products. Contact and maintain cordial relationship with existing Lenskart customers Being dedicated to customer satisfaction and resolving any concerns that the customer has Generating leads from cold calling and other social media platforms to give details to field agents Excellent negotiation skills to close and generate lead. Requirements : Must Have Laptop/ Desktop and Wifi Must have good communication skills Walkin Venue : Zoom ID - 6105943182 , Pass- D1X44J Date: 28th December 2020, Monday Time : 10:00 AM to 10:15 AM  ","location":"Delhi, Noida, Gurgaon","experience":"0-5Years"},{"date":"28 - Dec - 2020","skills":"Purchase Management, Home Care","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"HealthVista India Private Limited, 4th Floor, MCH No.:15-29-1000/H-C/16, Road No. 1, KPHB Colony, Kukatpally, Hyderabad - 500 072.","phone":"9121283154","profile":" Management Trainee \nHealthVista India Private Limited","description":"Freshers from BAMS, BHMS, BDS, B.Pharmacy/ M.Pharmacy, MHM, MHA. It is not limited to only these streams. If anyone interested in this profile can also apply. Job Responsibility- 1). To be a part of Management Project for a period of 03 months, starting from 1st January, 2021 to 31st March, 2021. 2). Visit hospitals in the city 3). Collect details of Total Beds in each hospital with Doctors practicing 4). Overall in-charges of the hospitals with specialty wise break up 5). Presence of ICU in hospitals, daily IPD discharges 6). Details of Purchase Manager, BME, & Potential for equipment rentals for patients, in house hospital rental usage 7). Potential for home care service etc. 8). Doctors practice timings and visit timings for Pharma companies 9). Collecting these details, preparing data in Ms-Excel and sharing it with the HOD. Perks and Benefits : Stipend + Travel allowance + Mobile allowance + Certificate Walk-in Date/ Time: 28th December 2020, 11.00 AM - 4.00 PM Venue Details- HealthVista India Private Limited 4th Floor, MCH No.:15-29-1000/H-C/16, Road No.1, KPHB Colony, Kukatpally, Hyderabad - 500 072. Contact - Kolluri Sreelatha ( 9121283154 ) Important note : Project starting date from 1st January, 2021 to 31st March, 2021 Candidates who are interested, please share your profile with 'kolluri.sreelatha@porteamedical.com' Or contact on : 9121283154  ","location":"Hyderabad","experience":"0-1Years"},{"date":"28 - Dec - 2020","skills":"B2B Sales, Insurance Sales","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Kotak Life Insurance Company Limited, 2nd Floor, 7, Community Center, Block A, New Friends Colony, New Delhi -110 065","phone":"Not Provided","profile":" B2B Sales Executive - Freshers \nKotak Life Insurance Company Limited","description":"Educational Qualification: Any Graduate/ MBA Experience: 0-3 years (Sales Experience preferred) Freshers can also apply Scored 60% or above in 10th, 12th, and Graduation Age :22-30 Years The candidate should be from Gurgaon with own two wheeler. Should have good communications & Convincing skills. The candidate should be fluent in Hindi and English Roles & Responsibilities: Manages channel partner business on daily basis by visiting points of sales within a defined territory and meeting all concerned personnel. Builds excellent relationship with all concerned personnel at point of sales and fulfill all service related requirements at the assigned Branches. Does personal and telephonic interaction with existing channel partner relationships for business mobilization and ensuring maximum conversion of loan borrowers for Credit Life cover. Does personal and telephonic interactions with borrowers as facilitation/ support to Branch personnel. Handles/ resolves queries from relationships efficiently on daily basis. Preparing/ collating weekly reports on the outcome of interactions with the relationships for submission to concerned personnel. Regular tracking/interaction with concerned personnel in the relationships for weekly or fortnightly MIS/details. Regular tracking of pending documents and ensuring complete conversion. Interaction/tracking of Medical cases with concerned personnel of KLI and relationships ensuring timely completion of MT and subsequent conversion. Walk-in Date/ Time: 28 December 2020, 3.00 PM - 5.00 PM Venue Details- Kotak Life Insurance Company Limited 2nd Floor, 7, Community Center, Block A, New Friends Colony, New Delhi -110 065 Contact Person- Darpan Pradhan  ","location":"Delhi","experience":"0-3Years"}]}