{"Walkins":[{"date":"2 - Mar - 2020","skills":"talent acquisition, recruitment, volume hiring, hr, sourcing","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Cholamandalam MS General Insurance, 4th Floor Parry House, Dare House Building, 2 NSC Bose Road, Parrys Corner, Chennai","phone":"Not Provided","profile":"HR Recruiter/ Senior Recruiter \nCholamandalam MS General Insurance","description":"Candidate who has experience in Bulk and Volume Hiring is preferred Desired candidate must have good experience in Banking / Insurance recruitment. Candidate from Consultancy background with sound sourcing knowledge can apply. Kindly walk-in to below Venue on 2nd March (Monday) Time : 10:30 am to 1 pm Interview Venue: Cholamandalam MS General Insurance, 4th Floor Parry House, Dare House Building, 2 NSC Bose Road, Parrys Corner, Chennai Landmark : Next to Police Station/ Opposite Burma Bazaar. Contact Person - Benjamin Note: Candidate who can join immediately can only walk-in for this position","location":"Chennai","experience":"2 - 5 Years"},{"date":"2, 3 - Mar - 2020","skills":"General Administration, Housekeeping Staff & Vendor Management.","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"ABM Knowledgeware Limited, ABM House, Plot No - 268, 7th Floor, Linking Road, Bandra West, Mumbai","phone":"022- 42909700","profile":"Administration Executive \nABM Knowledgeware Limited","description":"Candidate should have good experience in handling Voucher process, voucher checking etc. Experience in handling housekeeping staff & Vendor management. Experience in Stationary & Stock maintenance. Experience in Invoice, Billing & Travel Booking. Should have good communication skills. Walk-in Date: 2nd - 3rd March 2020 (Monday & Tuesday) Interview Time - 11.00 AM - 4.00 PM Interview Venue: ABM Knowledgeware Limited ABM House, Plot No - 268, 7th Floor, Linking Road, Bandra West, Mumbai Contact Person- Hetali Shah ( 42909700 )","location":"Mumbai","experience":"3 - 6 Years"},{"date":"3 - Mar - 2020","skills":"Technical Support, Service Desk, Customer Support","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Vijaya Diagnostic Centre Private Limited, Sangareddy, Hyderabad Telangana","phone":"9121000666","profile":"Front Office Executive \nVijaya Diagnostic Centre Private Limited","description":"Receiving patients and generation of requisition slip based on doctor's prescription, or test requisition form given by the customer/Patient. Collection of accurate cash, credit requisition from patients/ customers. Check patient readiness for requested tests Guide the patient about the tests and rooms / floors to approach for the same. In addition to receiving of patients, attending phone calls and answering queries of patients and other customers. Follow-up on report status Dispatch reports, after confirming right party Maintain cash hand-over register, cash & card transaction data and submit it to the branch manager daily Walk-in Date/ Time: 3rd March 2020, 10 AM onwards Interview Venue: Vijaya Diagnostic Centre Private Limited, Sangareddy, Hyderabad Telangana Contact Person - Krishna (9121000666)","location":"Hyderabad","experience":"0 - 3 Years"},{"date":"2, 3, 4, 5, 6, 7 - Mar - 2020","skills":"Front Office Assistance, Office Administration, Business Administration","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Sohung Infotech Private Limited, E-38, First Floor, Sector - 63, NOIDA, Uttar Pradesh - 201301","phone":"9911886563","profile":"Front Office Executive \nSohung Infotech Private Limited","description":"Candidate should be Any Graduate with Good Communications Skills Should be Presentable with good Computer proficiency Managing front desk All administrative works Job Responsibility- Incoming & Outgoing Calls. Provide proper information to the queries via phone/emails. Maintenance of important documents, files and records in an Organized manner. Responsible for helping the heads in the administration department. Admin Work. Walk-in Date/ Time: 2nd - 31st March 2020, 2 PM onwards Interview Venue: Sohung Infotech Private Limited E - 38, E Block, Sector 63 Noida - 201 301 Contact Person- Gagandeep Singh Phone No. 9911886563","location":"Noida","experience":"1 - 3 Years"},{"date":"2, 3 - Mar - 2020","skills":"General Administration, Handling Petty Cash, Vendor Payments, Housekeeping, Facility Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"HCL Technologies Limited, BSERV A-22, Sector -60, Noida. Nearest Metro Station- Noida, Sector-59.","phone":"9971154226","profile":"Collection Executive/ Collection Expert \nHCL Technologies Limited","description":"We are pleased to inform you about the opening in Noida with the No.1 employer in India, HCL Technologies for the profile of Collection Specialist/ Collection Expert for International Voice Process. Process: International Collection Process (3rd Party) Shift:- Australian Shifts (Early Morning Shifts) Unlimited Incentives Qualification Required:- Any UG/ Any graduates are welcome. Min. 6 months of exp. is required in 1st or 3rd party international collections process. 1st party or 3rd party International collection experience preferable. Skills Required:- 1st party or 3rd party collection experience required. Knowledge of Computer Peripherals/Operating System & MS-Excel. Persuasion and convincing skills. Excellent communication and presentation skills / customer interaction. Should be able to work and co-ordinate in a Team. Walk-in Date: 2nd & 3rd March 2020 Timings: 11.00 am to 4.00 pm Venue details : HCL Technologies Limited BSERV A-22, Sector -60, Noida. Nearest Metro Station- Noida, Sector-59. Contact Person- Vikas Kapoor ( 9971154226 ) Kindly mention, Vikas Kapoor as a source on top of your CV.","location":"Noida","experience":"1 - 5 Years"},{"date":"2 - Mar - 2020","skills":"Insurance Claims, Back Office, Claims Processing","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Go Airlines India Limited, Wadia International Centre, Worli 1st Floor, C-1, Pandurang Budhkar Marg, Lower Parel, Mumbai -25","phone":"Not Provided","profile":"Executive - Back Office \nGo Airlines (India) Limited","description":"Candidate must be Any Graduate with minimum 2 years of experience in insurance claims settlement role. MUST have good communication skills. Job Responsibility: 1. Processing of insurance claims 2. Preparing reports 3. Co-ordination with airport crew 4. Single point of contact for claims related query 5. Should have knowledge of basic excel Please Note : This position on third party payroll Walk-in Date: 2nd March 2020 Time: 2 PM to 2:30 PM only Interview Venue: Go Airlines India Limited, Wadia International Centre, Worli 1st Floor, C-1, Pandurang Budhkar Marg, Lower Parel, Mumbai -25","location":"Mumbai","experience":"2 - 3 Years"},{"date":"29 - Feb - 2020","skills":"Desktop Support, Remote Support, Technical Service Desk","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Prime Focus Technologies Limited, Unit 001 & 002, Campus 5B, Ground Floor, RMZ Ecoworld SEZ Unit, Behind EcoSpace, Near Honeywell Building, Outer Ring Road, Devarabeeesanahalli, Varthur Hobli, Bangalore - 560 103","phone":"Not Provided","profile":"Remote Desktop Support \nAnunta Technology Management Services Ltd.","description":"Candidate should be Any Graduate with 1 to 6 years of experience with excellent communication. Well experienced in remote infrastructure management with the help of remote management tools. Must be good in Hardware & Networking Concepts Desktop Operating system knowledge is required Microsoft standard office product knowledge Basic Network skill sets. Basic hardware troubleshooting. Night shifts and 6 days working Basic Knowledge of Virtualization Job Responsibility- Responsible for attending trouble tickets & issue calls from various customers with various help desk tools. Responsible for managing Installation, configuration, migration, of Infra Responsible for infrastructure monitoring services, routine and preventive maintenance, service restoration and provide assurance to customers. Walk-in Date/ Time: 29th February 2020, 10 AM onwards Interview Venue: Anunta Technology Management Services Limited 4th Floor, Block B, Futura Tech Park, 334, Old Mahabalipuram Road, Sholinganallur, Chennai - 600 119. Contact Person- Abiram","location":"Chennai","experience":"1 - 6 Years"},{"date":"2, 3 - Mar - 2020","skills":".NET, .NET Framework, ADO .NET, ASP .NET & MVC","qualification":"B.E./B.Tech, MCA/PGDCA","address":"101/A, 1st Floor, Plot #2, Above Karnataka Bank, Opp to, Image Gardens Road, HITEC City, Hyderabad - 500 081","phone":"Not Provided","profile":".NET Developer/ Freshers \nStemetric IT Solutions Private Limited","description":"Eligibility Criteria :U.G (2013,14,15,16,17,18) P.G (2013-2018) (2019 ARE NOT Allowed) Skills: DOT NET, .NET Framework, ADO .NET, ASP .NET & MVC Work Experience: 0 - 1 Years Job Location: Hyderabad Walk-in Date/ Time: 2nd March - 3rd March 2020, 10 AM onwards STEMETRIC IT SOLUTION (VELCRO TECHNOLOGIES PVT LTD.,) 101/A, 1st Floor, Plot #2, Above Karnataka Bank, Opp to, Image Gardens Road, HITEC City, Hyderabad - 500 081 Timings: 10 AM to 1 PM Contact Person- SAI SIRISHA HR","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"29 - Feb - 2020","skills":"Software Testing, Automation/ Manual Testing, Selenium","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Innominds Software SEZ India Private Limited, Building No. 2.3, 9th Floor, Waverock, Survey No.115, TSIIC IT / ITES SEZ, Nanakramguda Village, Serilingampally Mandal, Hyderabad - 500 008","phone":"Not Provided","profile":"Software Tester/ Freshers \nInnominds Software SEZ India Private Limited","description":"Walk-in Drive for Freshers Trained in Automation/ Manual, Selenium knowledge is a plus on Saturday, 29th February 2020. Eligibility Criteria- Qualification: B.E/ B.Tech/ MCA/ M.Tech (Any Stream) Percentage Criterion: 70% throughout academics Year of Graduation: 2018/ 2019 Primary Skills: Trained in Automation/ Manual, Selenium knowledge is a plus Work Location: Vizag Written test: Aptitude, Communication and Technical (Testing) Time: 09.30 AM Duration: 1 Hr. 45 min Interview Venue: Innominds Software SEZ India Private Limited. Building No. 2.3, 9th Floor, Waverock, Survey No.115, TSIIC IT / ITES SEZ, Nanakramguda Village, Serilingampally Mandal, Hyderabad - 500 008 Landmark lane opposite ICICI bank. Security Entry is from North gate of Waverock.","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"29 - Feb - 2020","skills":"Desktop Support L1, L2 and Service Desk","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"CMS IT Services Private Limited, 61 Radius Plot No. 61, Road no. 13, MIDC, Andheri (East), Mumbai - 400 093.","phone":"8668932980","profile":"Desktop Support Engineer \nCMS IT Services Private Limited","description":"Walk-In Alert for Desktop Support Engineer L1, L2 and Service Desk Qualification: Any Technical Graduate Work Experience - Fresher/ 0 to 2 Year Job Location: Mumbai Skills: Desktop Support L1, L2 and Service Desk Walk-in Date/ Time: 29th February 2020, 9 AM onwards Interview Venue: CMS IT Services Private Limited 61 Radius Plot No. 61, Road no. 13, MIDC, Andheri (East), Mumbai - 400 093. Contact Person-Abigail Mecwan Contact No. 8668932980","location":"Mumbai","experience":"0 - 2 Years"},{"date":"29 - Feb - 2020","skills":"Customer Support, Windows Os, Outlook Express, Hardware Troubleshooting, Lotus Notes","qualification":"B.Sc, BCA/BCS, B.E./B.Tech, Diploma","address":"Microchip Infotech Systems Private Limited, A-102 Basement, Amar Colony, Lajpat Nagar 4 New Delhi","phone":"9650514678","profile":"Technical Support Engineer \nMicroChip Infotech Systems Pvt. Limited","description":"Candidate should have Diploma in Engineering or Science Graduate/ BCA/B.Sc IT with good communication skills. Candidate must have good hands on experience in troubleshooting Desktop. Sound knowledge on Windows OS / Hardware Trouble Shooting, Mail MGMT/ MSOutlook/ LotusNotes/ OutLook Express Client Side Support & Field Job. Educational Qualification: Any Graduate Work Experience: 2 to 4 Years Job Location: Noida Walk-in Date/ Time: 29th February 2020, 9 AM onwards Interview Venue: Microchip Infotech Systems Private Limited, A-102 Basement, Amar Colony, Lajpat Nagar 4 New Delhi Contact - Amresh Kr SIngh ( 91-9650514678 )","location":"Delhi, Noida","experience":"2 - 4 Years"},{"date":"2, 3 - Mar - 2020","skills":"Java, J2EE, Spring, Structs, Hibernate, MySQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"VoiceGate Technologies (India) Private Limited, \u0091Navbahar\u0092, 10-3-299/2/B, Humayun Nagar, Hyderabad - 500 028.","phone":"9963674795","profile":"Java Developer \nVoiceGate Technologies (India) Private Limited","description":"Candidate must have excellent knowledge of Java, J2EE, Spring, Structs, Hibernate, MySQL. Should have experience working with servers like JBOSS, Tomcat on both Windows and Linux environment. Should have good knowledge of HTML, CSS, XML, XSLT, Web Services, AJAX, JQUERY, JSON etc. Well versed with Object Oriented Concepts. Walk-in Date/ Time: 2nd - 3rd March 2020, 3 PM onwards Interview Venue: VoiceGate Technologies (India) Private Limited \u0091Navbahar\u0092, 10-3-299/2/ B, Humayun Nagar, Hyderabad - 500 028. Landmark: Near NMDC, Masab Tank Lane beside Neerus Contact Person- Hymavathi (9963674795)","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"29 - Feb - 2020","skills":"Change Management, Exchange Server, VWindows, VMware Server, Incident Management","qualification":"B.E./B.Tech","address":"TATA Communications Limited (TCTS), Tower 4, 4th to 8th Floor Equinox Business Park, LBS Road, Kurla (West), Mumbai - 400 070.","phone":"Not Provided","profile":"Senior Engineer - System Support \nTATA Communications Limited (TCTS)","description":"Resource should be Graduate with 3 to 5 years of experience in infrastructure management. Must have an ability to work closely with domestic and international colleagues and teams. Demonstrated analysis, critical thinking, and problem-solving skills Key Competencies Requirement: Windows 2003/ 2008/ 2012 Server SQL 2005/ 2008/ 2012 Microsoft Exchange Server 2010/ 2013 Microsoft SharePoint Hyper-V & VMware Server Virtualization, ITIL conceptual understanding preferred (Alerting management, Incident management, Change management) Demonstrated documentation skills Walk-in Date/ Time: 29th February 2020, 9 AM onwards Interview Venue: TATA Communications Limited (TCTS) Tower 4, 4th to 8th Floor Equinox Business Park, LBS Road, Kurla (West), Mumbai - 400 070. Contact Person- Ragassiya Menon","location":"Mumbai","experience":"3 - 5 Years"},{"date":"28 - Feb - 2020","skills":"PHP, Javascript, JQuery, OOPS -AJAX, HTML5, CSS, Bootstrap","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Textronics Design Systems (I) Private Limited, Plot. No. EL-109, 2nd Floor, TTC Electronic Zone, MIDC Mahape, Navi Mumbai - 400 710.","phone":"9561076006","profile":"PHP Developer \nTextronics Design Systems (I) Private Limited","description":"Skills Required -PHP -Javascript -JQuery Strong Knowledge in -OOPS -AJAX, HTML5, CSS, Bootstrap -MSSQL /MySQL database -JSON / XML Service Integration -MVC Design patterns Proven Experience in: 1. Laravel 2. Codeigniter 3. Magento 4. Opencart Walk-in Date/ Time: 28 February 2020, 11 AM onwards Interview Venue: Textronics Design Systems (I) Private Limited Plot. No. EL-109, 2nd Floor, TTC Electronic Zone, MIDC Mahape, Navi Mumbai - 400 710. Email : info2@textronic.net Contact - Surbhi Gupta ( 9561076006 )","location":"Mumbai","experience":"0 - 3 Years"},{"date":"28 - Feb - 2020","skills":"PHP, HTML, CSS, Java Script","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Affinity Express India Private Limited, 5th Floor, wing-2, Cluster C, Eon IT Park, Kharadi, Pune - 411 014.","phone":"8007478779","profile":"Web/ Php Developer \nAffinity Express India Private Limited","description":"Looking for candidate with good hands on experience in WordPress, Photoshop, HTML and CSS Freshers with good knowledge in WordPress, Photoshop, HTML and CSS Competency Requirements: Experience in creating websites using any (CMS) Content Management System. Web programming using HTML and CSS (JavaScript, PHP and other languages is a plus) Adobe Photoshop and WordPress knowledge is a must. Web and graphic design skills and knowledge Responsibilities: Maintaining productivity and accuracy standards for the role and submit to Performance Improvement Plan (PIP) when necessary. Accepting tasks assigned by superiors with minimal handover. Walk-in Date: 28th February 2020 Timings: 10 AM to 2 PM Interview Venue: Affinity Express India Private Limited 5th Floor, wing-2, Cluster C, Eon IT Park, Kharadi, Pune - 411 014. Contact Person- Suvarna Contact - Suvarna Agrawal ( 8007478779 )","location":"Pune","experience":"0 - 2 Years"},{"date":"28, 29 - Feb - 2020","skills":"Java, PHP, or Python, JavaScript, Quirks, Workarounds, Web markup, HTML5 ,CSS3","qualification":"B.E./B.Tech, MCA/PGDCA","address":"BroAddCast Digital Marketing, Saboo Towers,4th floor, Besides Yashoda Hospital, Rajbhavan ,Somajiguda, Hyderabad.","phone":"9505562000","profile":"Web/ Php Developer \nBroAddCast Digital Marketing","description":"Looking for Web Developer with at least 2 to 3 years of relevant experience. Immediate joiners required Required Skills: Java, PHP, or Python, JavaScript, Quirks, Workarounds, Web markup, HTML5 ,CSS3, Web Application Development, Web Technologies, Web Designing, UI Development, Responsive Designs Walk-in Date/ Time: 28 February - 3rd March 2020, 10 AM onwards Interview Venue: BroAddCast Digital Marketing Saboo Towers,4th floor, Besides Yashoda Hospital, Rajbhavan ,Somajiguda, Hyderabad. Contact Person- Mr. Ravi Gadam Phone No. 9505562000","location":"Hyderabad","experience":"2 - 3 Years"},{"date":"29 - Feb - 2020","skills":"C# Web Technologies PHP .Net","qualification":"B.E./B.Tech, MCA/PGDCA","address":"HCL Technologies Limited, ELCOT - SEZ, Special Economic Zone, 602/3, 138, Sholinganallur Village, Round Building New Cafeteria Sholinganallur - Medavakkam High Road, Chennai - 600 119","phone":"Not Mentioned","profile":"Fullstack Developer (.Net, C#, PHP) \nHCL Technologies Limited","description":"We are hiring for Full stack Developer with (.Net, C# and PHP Scripting) Combination. Work Experience: 4 to 8 years Notice Period: Immediate to 30 days Walk-in Interview on 29th February from 9 AM onwards Interview Venue: HCL Technologies Limited ELCOT - SEZ, Special Economic Zone, 602/3, 138, Sholinganallur Village, Round Building New Cafeteria Sholinganallur - Medavakkam High Road, Chennai - 600 119","location":"Chennai","experience":"4 - 8 Years"},{"date":"28 - Feb - 2020","skills":"HR/ Recruitment, Talent Acquisition, Hiring","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Votary Softech Solutions Private Limited, Plot No: 76, Lumbini layout, Near Veeraj Suits (Kritunga-Newly opened), Gachibowli-I (V), Hyderabad, Telangana - 500 032.","phone":"8019150446","profile":"Recruitment - Talent Acquisition \nVotary Softech Solutions Pvt. Limited","description":"Looking for someone who had vast experience in end to end recruitment process like understanding the job requirement, sourcing, screening, interview scheduling, do follow up with the candidates, maintaining tracker record as per the job skill requirement. Should possess great exposure towards working with Niche IT Skill requirements. Should possess good communication skills and Good knowledge of working with job boards like Naukri, Monster, Linkedin , etc. Educational Qualification: MBA Experience: 6 months to 1.6 year experience Interested candidates directly walk in interview at given below venue, along with updated RESUME Date: 28th February 2020 (Friday) Time: 10:00 AM to 4:00 PM Venue Details: Votary Softech Solutions Private Limited Plot No: 76, Lumbini layout, Near Veeraj Suits (Kritunga-Newly opened), Gachibowli-I (V), Hyderabad, Telangana - 500 032. Contact Person: Monica Gundu (TAG) Phone No: 8019150446","location":"Hyderabad","experience":"0 - 2 Years"},{"date":"29 - Feb - 2020","skills":"C#, .NET Framework 4.0/4.5 Web Forms, ASP .Net, AJAX , CSS 2.0/3.0, JQuery, LINQ MVC","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Sahir Projects - Configurator Solutions, Shoppers Orbit, Office No. 212 - 213, 2nd Floor, C - Wing, Above Big Bazar, Vishrantwadi, Pune - 411 015.","phone":"Not Provided","profile":"Web/ .Net Developer \nSahir Projects - Configurator Solutions","description":"Work Experience: 0 to 3 Years Skills & Abilities: C#, .NET Framework 4.0/4.5 Web Forms, ASP .Net, AJAX , CSS 2.0/3.0, JQuery, LINQ MVC MS SQL SERVER & Other RDBMS Strong OOPS Concepts & SQL Strong problem solving & Analytical Skills Responsibilities: Coding & Unit Testing System Documentation Candidates with .Net & SQL Skills will be only entertained. Walk-in/ Date/ Time: 29th February 2020, 9 AM onwards Interview Venue: Sahir Projects - Configurator Solutions Shoppers Orbit, Office No. 212 - 213, 2nd Floor, C - Wing, Above Big Bazar, Vishrantwadi, Pune - 411 015.","location":"Pune","experience":"0 - 3 Years"},{"date":"28 - Feb - 2020","skills":"Back Office Operations, Non Voice Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"3i Infotech Limited, Tower # 3, 5th Floor, ICICI Bank Towers, Nanakramguda, Hyderabad - 500 032","phone":"Not Provided","profile":"Back Office Executive (Non-Voice) \n3i Infotech Limited","description":"Looking for Freshers with good communication skills in English & Telugu. Should be flexible for all 3 Shifts. Should have minimum 25 WPM Typing Speed. Data Entry Operator-DEO (Designation: Junior Associate) Qualification: Any Graduation(Mandatory) Only Males are preferred. Shifts: Rotational (Includes Night Shift): General Shift: 9:30 Am to 6:30 Pm Afternoon Shift: 12 Noon to 9 Pm Night Shift: 9 Pm to 6 Am Preferably Males Candidates. Should be in formals while attending interview. Original Certificates Required: 1. Academic Certificates( SSC , HSC/ PUC/ Diploma/ ITI, Degree) 2. Aadhar Card 3. Pan Card / Pan Card Acknowledgment copy 4. Current Address proof 5. Passport Size Photo( with White Background) Walk-in Date/ Time: 28 February 2020, 11 AM onwards Interview Venue: 3i Infotech Limited Tower # 3, 5th Floor, ICICI Bank Towers, Nanakramguda, Hyderabad - 500 032 Contact Person: Sireesha HR","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"28 - Feb - 2020","skills":"Resourcing, HR/ Recruiter, Talent Acquisition, Recruitment","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Amadeus (India) Private Limited, Plot No. 7, Sector C, Pocket No. 6&7, Local Shopping Center, Vasant Kunj, New Delhi - 110 070.","phone":"011 41336647","profile":"Senior HR Executive \nResBird Technologies Private Limited","description":"Candidate must have 3 to 7 years of proven work experience as an HR Recruiter Should have good experience with sourcing techniques Solid verbal and written communication skills Good MS Office ( Especially Excel ) Walk-in Date/ Time: 28th February 2020, 9 AM onwards Interview Venue: Amadeus (India) Private Limited Plot No. 7, Sector C, Pocket No. 6&7, Local Shopping Center, Vasant Kunj, New Delhi - 110 070. (Landmark near Mini Cooper Showroom, Opposite DPS School) Contact Person: Ms.Sneha Please ensure to arrange the following documents ( Mandatory) : Updated resume passport size photograph. 10th proof (Either Mark sheet or Certificate any one). Highest Education Proof (Either Mark sheet or Certificate or Degree- any one). Pan Card Copy. Adhaar Card. Passport copy and Voter ID-card. Last 3 months salary slip. Appointment Letter for the current company. Relieving letters of all earlier companies.","location":"Hyderabad","experience":"3 - 7 Years"},{"date":"28, 29 - Feb - 2020","skills":"PHP, HRMS, MySQL, Angular JS/ Angular 2+, Jquery, MVC frameworks","qualification":"B.E./B.Tech, MCA/PGDCA","address":"SCreatives Software Services Private Limited, Building No-9 (Orion Towers), Unit-5A, Mind Space, Cyberabad, Hyderabad, Telangana - 500 081.","phone":"9100083544","profile":"PHP/ Web Developer \nSCreatives Software Services Pvt. Limited","description":"Candidate should have good knowledge and Hands-on Coding Expert in PHP & HRMS Applications. Experience working as PHP with solid experience in building backend solution utilizing PHP technologies. Responsible for delivery of projects from conceptualization, visualization to technology mapping and final execution of projects. Responsible for Unit testing of self-written code and it's execution to ensure minimum bugs. Work Experience: 0 to 2 Year Key Skills: PHP, HRMS, MySQL, Angular JS/ Angular 2+, Jquery, MVC frameworks, CSS, Ajax, HTML Walk-in Date/ Time: 28 February - 2nd March 2020, 10 AM onwards Interview Venue: SCreatives Software Services Private Limited Building No-9 (Orion Towers), Unit-5A, Mind Space, Cyberabad, Hyderabad, Telangana - 500 081. Contact Person- Vamsi Krishna Phone No. 9100083544","location":"Hyderabad","experience":"0 - 2 Years"},{"date":"28 - Feb - 2020","skills":"HR Assistance, HR Operations, MIS Reporting, Background Verification","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Bright Lifecare Private Limited, 7th Floor Motorola Bldg, M.G Road Sector 14, GURGAON, Haryana - 122 001.","phone":"Not Provided","profile":"MIS Assistant/ HR Associate \nBright Lifecare Private Limited","description":"As Healthkart embarks on next phase of growth, we are looking for someone who will be handling HR Operations & MIS role. Candidate will be on third party payroll - Ikya 1. Assist with day to day operations of the HR Functions 2. Collate of Attendance input on monthly basis 3. Coordinate with Finance for vendor payments 4. Compile and update employee records in HRMS 5. Excellent in Excel formulas 6. Knowledge about Back ground verification process. 7. Follow up with Vendors and leads to get the compliance documents. 8. Knowledge about Basics of SAP. 9. Manage Vendor Payment : Ensuring vendor payments happen on time 10. Maintain HR MIS Walk-in Date/ Time: 28 February 2020, 12 PM onwards Interview Venue: Bright Lifecare Private Limited 7th Floor Motorola Bldg, M.G Road Sector 14, GURGAON, Haryana - 122 001. Contact Person- Rohini Agarwal","location":"Mumbai","experience":"1 - 3 Years"},{"date":"28, 29 - Feb - 2020","skills":"Java, Spring Framework, Restful, SOAP, JPA, Hibernate, JavaScript, JQuery, Bootstrap","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"InfoWeb IT Solutions India Private Limited, Beside Rolling Hills and Ramky Towers, Mindspace Road, P Janardhan Reddy Nagar, Gachibowli, Hyderabad - 500032.","phone":"9505053154","profile":"Senior Software Engineer \nInfoWeb IT Solutions India Private Limited","description":"Candidate should have 4 or more years of experience in JAVA Programming, UI development, JavaScript, JQuery, Bootstrap, HTML, JPA, Hibernate. Experience with Java web development with Spring and RESTful APIs, SOAP including exposure to Spring boot framework. Experience developing software that integrates with other software would be preferred Job Responsibility- Engage and work with other teams to accomplish enterprise initiatives and compliance activities Design, develop, configure, and test JAVA applications and support integrating backend solutions Work collaboratively on an Agile team to deliver solutions that meet all acceptance criteria Provide unit support on general questions, break/fix issues, and process enhancements Walk-in Date/ Time: 28th - 29th February 2020, 10 AM onwards Interview Venue: InfoWeb IT Solutions India Private Limited Beside Rolling Hills and Ramky Towers, Mindspace Road, P Janardhan Reddy Nagar, Gachibowli, Hyderabad - 500032. Contact Person- Bussa Sachin (9505053154)","location":"Hyderabad","experience":"4 - 9 Years"},{"date":"29 - Feb - 2020","skills":"Advanced Java, Spring, Hibernate, Angular/ ReactJS, SQL with Crystal Reports","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"ParadigmIT Group, Purva Summit Building, SMARTWORKS, 6th Floor White Field, Hitech City, Madhapur, Hyderabad - 500 081.","phone":"Not Provided","profile":"Software Developers (Java/ SQL) \nParadigmIT Group","description":"ParadigmIT Group is currently hiring for below mentioned requirements at Hyderabad location- 1. Java Developer (Advanced Java, Spring, Hibernate) 2. Java Script Developer (with Angular/ ReactJS) 3. T-SQL Developer 4. SQL Developer(Production Support with Analytical Skills) 5. SQL with Crystal Reports. Qualification: BE/ B.Tech/ BSc (Computers) Experience Level: 2 to 5 years Must have excellent communication skills Current & Preferred Location: Hyderabad only. Shift Timings: 01:00 pm to 10:00 pm Walk-in Date/ Time: 29th February - 1st March 2020, 11 AM onwards Interview Location: ParadigmIT Group, Purva Summit Building, SMARTWORKS, 6th Floor White Field, Hitech City, Madhapur, Hyderabad - 500 081. Contact Person- Praveena /Sravani Note: Immediate/ Short Notice Candidates are Preferred.","location":"Hyderabad","experience":"2 - 5 Years"},{"date":"28, 29 - Feb - 2020","skills":"Java, Android, Eclipse, Sqlite","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Spoors Technology Solutions India Pvt. Limited, 4th Floor, Sai Prithvi - Cyber Arcades, Above Bata Showroom, Indian Oil Petrol Bunk, Madhapur, Hyderabad.","phone":"Not Provided","profile":"Junior Android Developer \nSpoors Technology Solutions India Pvt. Limited","description":"Candidate should have 0 to 3 years of experience & good knowledge of Java, Android, Eclipse, Sqlite. Must have good Reasoning and Analytical skills. Should be a team player and mix with the team. Ready to work on mobile projects. Should be a quick learner. Walk-in Date/ Time: 28th - 29th February 2020, 10 AM onwards Interview Venue: Spoors Technology Solutions India Pvt. Limited 4th Floor, Sai Prithvi - Cyber Arcades, Above Bata Showroom, Indian Oil Petrol Bunk, Madhapur, Hyderabad. Contact Person- Sudeepthi","location":"Hyderabad","experience":"0 - 3 Years"},{"date":"29 - Feb - 2020","skills":"Angular/ Java/ DevOps/ Front end/ BI Analytics/ Data Science","qualification":"B.E./B.Tech","address":"Nihilent Limited, 4th Floor, D Block, Weikfield IT Park, Nagar Road, Pune - 411 014.","phone":"Not Provided","profile":"IT Freshers (Angular/ Java/ DevOps) \nNihilent Limited","description":"Looking for dynamic candidates with excellent communication skills and analytical abilities.Training or certification on Angular/ Java/ DevOps/ Front end/ BI Analytics/ Data Science or any other cutting edge technologies will be preferred. Candidates must be willing to undergo training and work on any technologies. Educational Qualification: BE/ B.Tech (CS/ IT/ E&C Only) Throughout Passing Percentage: 65% & above Passed out year: 2018 and 2019 Required Competencies: Ability to think conceptually, take initiative, and be a team-player The desire to constantly learn and grow Strong written and verbal communication skills Good communication skills and Interpersonal skills Excellent problem solving skills and solution oriented attitude Walk-in Date: 29th February 2020 Time -9:00 AM to 11:00 AM only Address- Nihilent Limited, 4th Floor, D Block, Weikfield IT Park, Nagar Road, Pune - 411 014. Contact Person- Subhash Wagh","location":"Pune","experience":"0 - 1 Years"},{"date":"29 - Feb - 2020","skills":"Java, J2ee, Spring, Spring Boot, Microservices, Multi-Threading. Hibernate, RestAPI, Webservices","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Techwave Consulting Inc., Level 4, Building No. H6 Phoenix Avance Business Hub, Hitech City, Behind Dell Campus, Hyderabad - 500 081","phone":"9154930572","profile":"Senior Java Developer \nTechwave Consulting India Private Limited","description":"Person must have expertise in Java, J2ee, Spring, Spring Boot. Microservices Arch. JMS (Active MQ or IBM MQ), Multi-Threading. Hibernate, RestAPI, Webservices (security). Strong in Core Java, Spring/ Hibernate, JMS, Multi-threading, Scheduling. Web Technologies (Servlet, JSP, REST Web Services) Should have good knowledge of analysing Java thread dumps and memory leaks. Experience in Unix/Linux. Cassandra, Postgres, Docker, Node JS, Scala/AKKA, JS frameworks s.a. Angular, React, Backbone Walk-in Date: 29th February 2020 (Saturday) Timing: 10:00 AM to 3:00 PM Interview Venue: Techwave Consulting Inc., Level 4, Building No. H6 Phoenix Avance Business Hub, Hitech City, Behind Dell Campus, Hyderabad - 500 081. Contact Person: VinayKumar S Interview Procedure: Round 1: Coding Test Round 2: Technical 1 Round 3: Technical 2 Round 4 : HR","location":"Hyderabad","experience":"3 - 8 Years"},{"date":"28 - Feb - 2020","skills":"Java, Python, SQL Queries, ETL Tool, Javascript, Data Modeling","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Vaco Binary Semantics, Plot No. 15, Sector 18, Electronic City, Gurgaon, Haryana","phone":"Not Provided","profile":"Software Engineers (Java, Python, SQL) \nVaco Binary Semantics Limited","description":"Vaco Binary Semantics is hiring for Software Engineer for Gurgaon location for its client Work Experience- 2- 5 Years Job Location- Gurgaon Client- Top most search engine Candidate should have Bachelor's/ Master degree in Computer Science, or equivalent practical experience having good academics. Experience with internet technologies and Unix/ Linux systems and scripting languages. Experience in working in cross-functional engineering roles with extensive use of SQL queries and data analysis. Experience with systems design and/or coding in a general purpose programming language. Preferred Qualifications: 2 to 4 years of experience specifically on complex ETL systems and data pipeline management. Ability to communicate effectively and influence stakeholders in internal Engineering teams, Product Development teams. Innovative and creative approach in solving complex and abstract problems. Interested candidate may directly come for face to face interview on 28th February, 2020 (between 11 am - 4 pm) at below mentioned address:- Interview Venue: Vaco Binary Semantics Plot No. 15, Sector 18, Electronic City, Gurgaon, Haryana - 122 015 Landmark - Aricent lane Nearest metro station- Sikanderpur Contact Person- Chetna Rai","location":"Gurgaon","experience":"2 - 5 Years"},{"date":"27 - Feb - 2020","skills":"Core Java, J2EE, Spring, Hibernate, Web Services","qualification":"B.E./B.Tech, MCA/PGDCA","address":"TEKsystems Global Services Private Limited, #801, 8B, 8th Floor, RMZ Ecoworld Campus, Outer Ring Road, Devarabeesanahalli, Bengaluru - 560 103.","phone":"8123195360","profile":"Java/ J2EE Developer \nTEKsystems Global Services Private Limited","description":"Walk-in Interview for Java Developer with total 3-6 years of experience. Candidate must have expertise in Core Java, J2EE, Spring, Hibernate, Webservices and related technologies. Expertise in Core design patterns, JEE design patterns & Integration Patterns. Oracle database skills (including Toad and SQL Developer) Unix/Linux commands Development, unit testing and adherence to coding best practices Looking for candidate, can join with 15-30 Days. Walk-in Date: 27th February 2020 Time - 2:00 PM - 5:00 PM Interview Venue: TEKsystems Global Services Private Limited #801, 8B, 8th Floor, RMZ Ecoworld Campus, Outer Ring Road, Devarabeesanahalli, Bengaluru - 560 103. Contact Person- Seenibabu Contact No- 8123195360","location":"Bangalore","experience":"3 - 6 Years"},{"date":"28 - Feb - 2020","skills":"Core Java, Springs, Hibernate, Webservices and Multi-threading","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Estel Technologies Private Limited, #126, Sector 44, Institutional Area Gurgaon, Haryana","phone":"0124-2578204","profile":"Senior Java Professionals \nEstel Technologies Private Limited","description":"Applicant should have 3 to 8 years of Core JAVA in an application development environment. Well versed in Core Java, which includes Springs, Hibernate, Webservices and Multi-threading. Must have knowledge of Java related technologies such as J2EE, Spring, JDBC, GWT, Multithreading Proficient in: SQL/ Database Concepts/ LINUX/ UNIX/ ORACLE Development, deployment and testing Agile Methodology Review currently running architecture Identify bottlenecks and loopholes for performance, memory management, code reusability, applications modules, etc. Propose industry best practices and upgraded architecture Ticket management experience: Jira Experience with source control systems such as Git, SVN, etc. Walk-in Date: 28th February 2020 Timing - 11:00 am to 4:00 pm Interview Venue: Estel Technologies Private Limited #126, Sector 44, Institutional Area Gurgaon, Haryana Contact Person- Nitanjali/ Saif Phone No. 0124-2578204","location":"Gurgaon","experience":"3 - 8 Years"},{"date":"28, 29 - Feb - 2020","skills":"Php, Codeigniter, HTML, CSS, JavaScript, AJAX","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Casperon Technologies Private Limited, D.84, Block No.3,4th Floor, Murugesa Nayakar Complex, Greams Road, Thousand Lights, Chennai - 600 006.","phone":"9176227305","profile":"PHP Developer \nCasperon Technologies Private Limited","description":"Candidate must have good knowledge of Ajax and Third-Party APIs Integration Framework knowledge needed (Codeigniter is preferred one) Expertise interface with HTML, CSS, JavaScript, AJAX, Responsibility for creating web-based applications using PHP. Interview Date: 28 February - 13th March Timings: 12 PM onwards Venue Details- Casperon Technologies Private Limited D.84, Block No.3,4th Floor, Murugesa Nayakar Complex, Greams Road, Thousand Lights, Chennai - 600 006. Contact - Aravind ( 9176227305 )","location":"Chennai","experience":"1 - 4 Years"},{"date":"27, 28, 29 - Feb - 2020","skills":"Core Java and J2EE and AWS Cloud Computing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Virtual Guard Services Private Limited, Deigratia Building, 5th floor, Right Wing, Road No-10 Banjara Hills, Opposite Rainbow Children Hospital, Hyderabad, Telangana - 500 034.","phone":"040-23359199","profile":"Java Full Stack Developer \nVirtual Guard Services Private Limited","description":"We are looking for Full Stack Developer to produce scalable software solutions. You'll be part of a cross-functional team that's responsible for the full software development life cycle, from conception to deployment. As a Full Stack Developer, you should be comfortable around both front-end and back-end coding languages, development frameworks and third-party libraries. Must Have Skills- Java Full Stack : Core Java and J2EE and AWS Cloud Computing Should have Degree in Computer Science or relevant field Proven experience of 2 to 4 years as a Full Stack Developer or similar role Experience developing desktop and mobile applications Knowledge of multiple front-end languages and libraries (e.g. HTML/ CSS, JavaScript, XML, jQuery) Knowledge of multiple back-end languages (e.g. C#, Java, Python) and JavaScript frameworks (e.g. Angular, React, Node.js) Familiarity with databases (e.g. MySQL, MongoDB), Web Servers (e.g. Apache) and UI/ UX design Excellent communication and teamwork skills Organizational skills with an analytical mind Walk-in Date/ Time: 27th February - 6th March 2020, 2 PM onwards Interview Venue: Virtual Guard Services Private Limited, Deigratia Building, 5th floor, Right Wing, Road No-10 Banjara Hills, Opposite Rainbow Children Hospital, Hyderabad, Telangana - 500 034. Contact Person: Pavan Sai Phone No: 040-23359199","location":"Hyderabad","experience":"2 - 4 Years"},{"date":"29 - Feb - 2020","skills":"Core Java, CCS, HTML, Java Script, Angular JS, ReactJS or Node JS","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Altran, Tower 4, Ground Floor, Unitech Infospace SEZ, Tikri, Sohna Road, Sector 48, Gurugram - 122 001.","phone":"Not Provided","profile":"Full Stack/ Java Developer \nAltran Technologies India Private Limited","description":"We at Altran Technologies India Private Limited have an excellent opening for Full Stack Developer in one of our new project. Requirement: Bachelors/ Masters in Computer Science or related field Work Experience : 3 to 5 years Job Location : Gurgaon Candidate must be experienced with Object Oriented front-end development using CCS, HTML, Java Script, e.g., Angular JS, ReactJS or Node JS. Familiarity with Java and web service protocols such as REST, JSON or XML. Working experience with one of 2D and 3D virtualization toolkit or framework, such as Cesium, ArcGIS, Mapbox, WebGL or OpenLayers, etc Familiarity with source control and build environment Excellent Core Java programming skills Strong design patterns and good understanding of OOPS concept Must have database experience either Relational or NOSQL DB Understand Restful API and client server architecture Familiarity with Linux and shell scripts Experienced with spring and hibernate development framework Familiarity with source control and build environment Walk-in Date: Saturday, 29th February 2020 Timings: 10.00 AM and 2.00 PM Venue Details : Altran, Tower 4, Ground Floor, Unitech Infospace SEZ, Tikri, Sohna Road, Sector 48, Gurugram - 122 001. Contact Person: Ajay Kumar Kindly carry copy of valid ID proof (PAN/ Aadhaar/ Passport/ DL) and updated resume.","location":"Gurgaon","experience":"3 - 5 Years"},{"date":"27 - Feb - 2020","skills":"interviewing, screening, recruitment, volume hiring, sourcing","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Tech Mahindra Limited, SEZ, Tower 1, Opposite to Ananth Technologies, Beside Oracle, Hi-Tech City, Madhapur, Hyderabad.","phone":"Not Provided","profile":"HR Executive/ Recruiter \nTech Mahindra Limited","description":"Candidate should have experience into HR, recruitment, end to end recruitment. Should have experience in volume hiring. Able to source profiles from different job portals (naukri, monster, and etc..) Coordinating and managing, the recruitment process - pre-employment screening, cold calling, scheduling, assessment. Maintaining co-ordination and working ethically with the team members. Involved in full cycle Recruitment- sourcing, identifying, interviewing, screening and placing personnel in quick turn around time in contract, payroll with hire and permanent positions. Interested candidates can directly walk-in to the below mentioned address. Walk-in Date/ Time: 27 February 2020, 10 AM onwards Interview Venue: Tech Mahindra Limited, SEZ, Tower 1, Opposite to Ananth Technologies, Beside Oracle, Hi-Tech City, Madhapur, Hyderabad. Contact Person- Monika","location":"Hyderabad","experience":"1 - 2 Years"},{"date":"27, 28, 29 - Feb - 2020","skills":"Software Testing, Regression Testing, UAT, Manual Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Shriram Life Insurance Company Limited, Ramky Selenium, 5th floor Besides Andhra Bank Training Centre, Financial District, Gachibowli, Hyderabad - 500 032.","phone":"040-23434466","profile":"Software Tester/ UAT Analyst \nShriram Life Insurance Company Limited","description":"Shriram Life Insurance Company Limited, is having very urgent requirement for UAT Analyst. Work Experience: 1 to 3 Years Looking for UAT Analyst : Manual Testing, Regression Testing Preparations of Test Cases, Test Execution Testing of Apps/ Portals Walk-in Date/ Time: 27th - 29th February 2020, 10 AM onwards Interview Venue: Shriram Life Insurance Company Limited, Ramky Selenium, 5th floor Besides Andhra Bank Training Centre, Financial District, Gachibowli, Hyderabad - 500 032. Contact Person- Pooja sharma ( 23434466 )","location":"Hyderabad","experience":"1 - 2 Years"},{"date":"29 - Feb - 2020","skills":"Automation/ API Testing, Selenium using Java","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Techwave Consulting India Private Limited, Phoenix Avance Business Hub, Level 4, Building No. H6, Hitech City-2, Hyderabad","phone":"+91 9701979969","profile":"Automation/ API Tester \nTechwave Consulting India Private Limited","description":"Person should have atleast 3 to 4 years of experience in Selenium using Java. Should have experience with Automation tools like Jmeter, Selenium or Katalon studio (Min 1+ years with good coding skills). Must have strong experience in API testing. Experience in designing of frameworks, methodologies Strong Java programming skills Having excellent written and verbal communication Experience with Agile Methodology Experience on Jira and Confluence Experience with Linux, Unix ( optional ) Should have Client facing skills. Walk-in Interview on 29th February 2020 from 9 AM onwards Interview Venue: Techwave Consulting India Private Limited Phoenix Avance Business Hub, Level 4, Building No. H6, Hitech City-2, Hyderabad","location":"Hyderabad","experience":"7 - 12 Years"},{"date":"29 - Feb - 2020","skills":"Test Engineering, Java Testng, Automation Framework, Automation Testing, Selenium, Test Scripts","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Hotel Radha Regent, 110C, Electronic City Phase I, Near Wipro Gate, 1 & 2, Electronic City, Bengaluru, Karnataka - 560 100","phone":"8464964882","profile":"Automation Testing Engineer \nMKS Vision Private Limited","description":"Person must be well-Versed in Java, Selenium, TestNG and any one performance tool. Should have experience in automating banking application. Should have experience in data-driven testing along with POI API. Should have working experience in verifying web and database (AS400) results and should be good at SQL (CRUD operations). Should have minimum knowledge on Katalon Studio and strong problem-solving skills. Should be strong in automating API calls along with Postman/ SoapUI knowledge. Should have working experience in CI/CD (Git/Jenkins or Bamboo). Should have working experience in any of the Test Management Tools (qTest/HP-ALM/TestRail). Should have Knowledge on TestListeners, ExtentReports and log4j. Should have experience in working with Vue.js and PHP web applications. Job Location: Hyderabad Function/ Responsibility: Develop and Execute automated test suites using Selenium and Katalon Studio (preferred). Integrate test suites into Test Management System. Create a pipeline for CI/CD to integrate/execute automated test scripts as per the scheduler. Perform other testing-related duties as required. Investigating problems in software as a result of testing. Interview Date: 29th February 2020 Timing: from 10:00 AM - 5:00 PM Interview Location: Hotel Radha Regent 110C, Electronic City Phase I, Near Wipro Gate, 1 & 2, Electronic City, Bengaluru, Karnataka - 560 100 Required Documents: Your Govt. ID proof, Updated CV","location":"Bangalore","experience":"5 - 10 Years"},{"date":"29 - Feb - 2020","skills":"Software Testing, Test Engineering, Automation Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Integra Software Services Private Limited, SH 49, Pakkamudayanpet, Annamalai Nagar, Puducherry - 605 008.","phone":"0413-4212122","profile":"Software Testing Engineer \nIntegra Software Services Pvt. Limited","description":"Job Role: Testing Engineer Job Location : Pondicherry Years of Experience : 3 - 6 Job Skill Set : Manual / Automation Testing Walk-in Date/ Time: 29th February 2020, 9 AM onwards Interview Venue: Integra Software Services Private Limited SH 49, Pakkamudayanpet, Annamalai Nagar, Puducherry - 605 008. Contact Person- Ms. Priyanka Phone No. 0413-4212122","location":"Pondicherry","experience":"3 - 6 Years"},{"date":"29 - Feb - 2020","skills":"Java, Spring, Hibernate, Junit, JSP, AngularJS, Struts, MySQL, Oracle","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Concourse Solutions Private Limited, 502, Suratwala Mark Plazzo, Wakad - Hinjewadi Road, Hinjewadi Pune - 411 057","phone":"9766916660","profile":"Java Developer \nConcourse Solutions Private Limited","description":"Candidate should be Any Graduate with 2 to 4 years of experience in Java development. Must have good & hands on experience on Java, Spring, Hibernate, Junit, JSP, AngularJS, Struts, MySQL, Oracle. If you are interested in the above positions, please share your updated profile with the below information to pramod@concoursesols.com Total Experience: Relevant Experience: Current CTC: Expected CTC: Notice Period: Scheduled Walk-in is on 29th Feb and 1st March 2020 Timings: 12:00 PM to 5:00 PM Interview Venue: Concourse Solutions Private Limited 502, Suratwala Mark Plazzo, Wakad - Hinjewadi Road, Hinjewadi Pune - 411 057 SPOC: Deepak Singh We are looking for immediate joiners Please feel free to reach out for any queries on 9766916660","location":"Pune","experience":"2 - 4 Years"},{"date":"29 - Feb - 2020","skills":"Software Testing, Test Engineering, C#, Bug Tracking Tool, Test Execution, API Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"TechAffinity Global Private Limited, Global Infocity Park, 8th floor, Module 4B-Block A, No: 40, MGR Salai, Kandanchavadi, Chennai - 600 096.","phone":"7550220997","profile":"QA/ Testing Engineer \nTechAffinity Global Private Limited","description":"Looking for interested and active candidate to work on Manual & Automated testing. Should be self-motivated and responsible on the job he/she carries. Primary Skills: Participate in requirement discussion to review and analysis system specifications/ requirements Should be able to create/ update test cases/ script, based on the understanding of requirement Conduct post-release/ post-implementation testing Must understand the Automation framework, plugins and external tools Should have experience with Selenium Automation with C# Test Execution & Defect Reporting (experience with any bug tracking tool) Analytical mind, Logical thinking and problem-solving aptitude Secondary Skills: Any Testing Certification Knowledge in other automation framework Knowledge to Agile methodologies Knowledge to web services/ API testing Knowledge in Reporting and documenting technical issues Required Candidate profile Should have experience with Selenium Automation with C# Walk-in Date/ Time: 29th February 2020, 10 AM onwards Interview Venue: TechAffinity Global Private Limited Global Infocity Park, 8th floor, Module 4B-Block A, No: 40, MGR Salai, Kandanchavadi, Chennai - 600 096. Landmark: Next to RMZ Business Park/ Opposite to Gem Hospital Contact Person- Mr. Rajesh. N Phone No. 7550220997","location":"Chennai","experience":"1 - 4 Years"},{"date":"26, 27, 28 - Feb - 2020","skills":"Software Testing, Selenium/ Automation testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Biz2Credit InfoServices Private Limited, 9th Floor, Express Trade Tower-2 Block A, Sector 132, Noida.","phone":"Not Provided","profile":"Software Testing Engineer \nBiz2Credit InfoServices Private Limited","description":"Must have excellent understanding of computer science fundamentals - OOPs Concepts, C, C++, SQL and Java. Deep understanding of testing and its various types. Deep understanding of data modeling and data architecture Eligibility Criteria: Person should have 65% throughout his academics. Candidates with Selenium/ Automation testing trainings will be preferred. Knowledge of Automation and functional testing is an advantage. Walk-in Date/ Time: 26th February - 28th February , 10 AM onwards Interview Venue: Biz2Credit InfoServices Private Limited 9th Floor, Express Trade Tower-2 Block A, Sector 132, Noida. Contact Person- Ruchit","location":"Noida","experience":"0 - 1 Years"},{"date":"27 - Feb - 2020","skills":"Manual Testing, Test Case Preparation, Test Plan Preparation, Mobile Testing, System Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Matrimony .Com Limited, Arihant e Park, Lattice Bridge Road, 2nd Floor, Baktavatsalm Nagar, Adyar, Chennai - 600020","phone":"Not Provided","profile":"Manual Testing Engineer \nMatrimony .Com Limited","description":"Candidate must have 2.5 to 4 years experience in Manual Testing Experience in Mobile testing is mandatory Should have knowledge in Database querying Job Responsibility- To be part of requirement analysis Participating in preparing Test Plans Preparing Test Scenarios Preparing Test Cases for module, integration and system testing Preparing Test Data for the test cases Preparing Test Environment to execute the test cases Analysing the Test Cases prepared by other team members Executing the Test Cases Defect Tracking Walk-in Date: 27th February 2020 Interview Timing - 10:00 AM to 2:00 PM Interview Venue: Matrimony .Com Limited Arihant e Park, Lattice Bridge Road, 2nd Floor, Baktavatsalm Nagar, Adyar, Chennai - 600020 Contact Person- Ms. Gracy Note: Candidates who are available Immediately, 15 days to 1 Month Notice please APPLY","location":"Chennai","experience":"2 - 4 Years"},{"date":"27 - Feb - 2020","skills":"HR/ Recruitment, Joining formalities, Salary negotiation","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"SBICAP Securities Limited, 57, 1st & 2nd Floor, Panchkuian Road, Near R.K. Ashram Marg Metro Station, New Delhi - 110 001.","phone":"011-23602810","profile":"HR/ Recruitment Officer \nSBICAP Securities Limited","description":"He/she would be responsible for various activities under the gamut of HR department such as Sourcing, interview scheduling, co-ordination. Pre and post joining formalities for the employees, Onboarding new joinees. Offer generation, documentation, follow - up with the candidates Would be responsible for preparing necessary MIS reports. Should be well versed with MS Word, MS Excel.. etc. Walk-in Date: 27th February 2020 Timings - 10 am till 4 pm Interview Venue: SBICAP Securities Limited 57, 1st & 2nd Floor, Panchkuian Road, Near R.K. Ashram Marg Metro Station, New Delhi - 110 001. Landmark - in front of Metro Pillar No.5/Besides Nathu Sweets Contact No- 011-23602810 Note - Freshers who are interested and willing to persue their career in HR department can attend walk in interview","location":"Delhi","experience":"0 - 1 Years"},{"date":"27 - Feb - 2020","skills":"HR/ Recruitment","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Sunwells Oxygen Private Limited, Above vasanthi dental clinic, kesawarhini, Valasarawakam, Chennai.","phone":"9384862831","profile":"HR Executive/ Recruiter \nSunwells Oxygen Private Limited","description":"Having good communication skill Having knowledge about the recruitment process Good in team work Knowledge on sourcing & screeing Good knowledge in end to end recruitment process Walk-in Date/ Time: 27 February 2020, 9 AM onwards Interview Venue: Sunwells Oxygen Private Limited Above vasanthi dental clinic, kesawarhini, Valasarawakam, Chennai. Contact - PERUMAL (9384862831)","location":"Chennai","experience":"0 - 1 Years"},{"date":"27 - Feb - 2020","skills":"Customer service, Back office processing, Business services","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"HCL Technologies Limited, 1st Floor Pioneer Square, Building, Sector 62, Near, Rapid Metro Station 55-56, Gurgaon.","phone":"9599555476","profile":"Backend Process Executive \nHCL Technologies Limited","description":"Educational Requirement: BBA, BA, B Com, B.SC Graduates (Only 2016/ 2017/ 2018, 2019 and 2020 Pass-outs are eligible for this opening). CS can also apply for the same. Work Experience: Freshers / Maximum 6 months experience Note: Technical graduates / Regular MBA's are not eligible for this opening. Shifts : 24*7 (Rotational) Salary: Upto 2.50 LPA Job Location: Gurgaon Skill Set Required:- Good typing speed (25 wpm with 80% Accuracy). Strong commitment to customer service and quality Excellent Keyboard Skills Demonstrates a strong customer service orientation. Takes responsibility to follow up with customers to ensure their needs and expectations are satisfied. Roles & Responsibilities:- Manage and update Insurance Member and Plan data on multiple systems. Enter new member data into excel and enrollment forms. Processes customer requests in a timely and accurate manner. Communicates with customers through written correspondence. Using PC application and functions such as Excel and Word to update and load data sets. To answer queries coming from end user customers in a polite and professional manner. Walk-in Date/ Time: 27th February 2020, 11 AM onwards Interview Venue:- HCL Technologies Limited 1st Floor Pioneer Square, Building, Sector 62, Near, Rapid Metro Station 55-56, Gurgaon HR Yogendra Write Yogendra on the Top Left of your Resume Contact - Yogendra Singh Bisht (9599555476)","location":"Gurgaon","experience":"0 - 1 Years"},{"date":"29 - Feb - 2020","skills":"Software Testing, Automation with Selenium Webdriver and TestNG","qualification":"B.E./B.Tech, MCA/PGDCA","address":"CSS Corp Private Limited, 7th Floor, Block A6, Shriram The Gateway, #16, GST Road, Perungalathur Chennai.","phone":"9840681899","profile":"Software Testing Engineer \nCSS Corp Private Limited","description":"CSS Corp Private Limited is hiring for Automation/ Manual Tester. Educational Qualification: BE/ B.Tech/ MCA Work Experience: 2 to 6 Years Job Location: Chennai Hands on experience in Automation with Selenium Webdriver and TestNG Knowledge of tools like Jira (Defect Tracking), Confluence (content collaboration). Hands on experience in Java collections, OOPS Good knowledge in Manual Testing concepts Knowledge about Maven and jenkins Knowledge about Git Repository and commands. Candidates can attend Face-to-Face interview on 29th FebURERY 2020 (Chennai Perungulathur Office). Interview Timing: 10 AM to 2 PM Interview Venue: CSS Corp Private Limited 7th Floor, Block A6, Shriram The Gateway, #16, GST Road, Perungalathur Chennai. Contact Person : Monika R (9840681899) Interested Candidates can share your profile to monika.radhakrishnan@csscorp.com along with the below details- Exp in IT - Exp in Selenium Automation- Notice Period - Current CTC- Expected CTC - Availability time and place on 29th Feb 2020 (Chennai)-","location":"Chennai","experience":"2 - 6 Years"},{"date":"27 - Feb - 2020","skills":".Net, XML, Java Script, service (SOAP/ REST) Concepts","qualification":"B.E./B.Tech, MCA/PGDCA","address":"NTT DATA Services Private Limited, DLF IT Park, 7th Block 2nd Floor, Ramapuram. Chennai - 89","phone":"8428535211","profile":".Net Developer/ Analyst \nNTT DATA Global Services Private Limited","description":"Person should have Graduate degree in Computer Science with 4 to 6 years of experience as developer using Microsoft technologies. At least 1 year hands on knowledge in database programming preferably using SQL Server. Should have solid knowledge of .Net, XML, Java Script, service (SOAP/ REST) Concepts. Professional Certification in .Net Framework is preferred Desired Skills: Knowledge of Web server (IIS), Web API Proficient exposure on Jquery, WCF, WPF, Angular JS and MVC 3.0 above Experience with Entity Framework and LINQ. Domain Knowledge: Healthcare, Banking & Financial, Supply Chain or Manufacturing BPO industry related domain background. Walk-in Date: 27th February 2020 Interview Timing: 11 AM-1 PM Interview Venue: NTT DATA Services Private Limited DLF IT Park, 7th Block 2nd Floor, Ramapuram. Chennai - 89","location":"Chennai","experience":"4 - 6 Years"},{"date":"28 - Feb - 2020","skills":"C#, VB .Net, Winform, MySQL/ MS SQL, C# .Net, WPF","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Planetcast Media Services Limited, C-34, Sector 62, Noida - 201 301","phone":"0120-2400779","profile":"C# .Net Developer \nPlanetcast Media Services Limited","description":"Candidate should have experience in Windows based application using C#, VB .Net, Winform, MySQL/ MS SQL, C# .Net, WPF Walk-in Date: 28th February 2020 Time: 10:00 am to 1:00 pm Interview Venue: Planetcast Media Services Limited C-34, Sector 62, Noida - 201 301","location":"Noida","experience":"2 - 5 Years"},{"date":"26, 27, 28 - Feb - 2020","skills":"C#, ASP .NET, JQuery, MVC, Web API, WCF, VB .NET, SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA","address":"KFIN Technologies Private Limited, Tower - B, Plot No. 31 & 32, Selenuim Building Financial District, Nanakramguda, Gachibowli, Hyderabad, Telangana - 500 032.","phone":"Not Provided","profile":".NET Developer \nKFIN Technologies Private Limited","description":"Must Have Skills- C#, ASP .NET, JQuery, MVC, Web API, WCF, VB .NET, SQL Server 2008 or above (Highly Skilled), Java Script, Good to Have - Bootstrap, Angular Job Responsibilities- Design, build, and maintain efficient, reusable, and reliable code using .NET programming languages Unit-Test and deploy applications and systems Revise, update, refactor and debug code Improve existing software Serve as an expert on applications and provide technical support Help maintain code quality, organization, and automatization Help write and optimize in-application SQL statements Ensure the best possible performance, quality, and responsiveness of applications Identify bottlenecks and bugs, and devise solutions to mitigate and address these issues Ensure performance, security, and availability of databases Handle common database procedures such as upgrade, backup, recovery, migration, etc. The ideal candidate should have the following skill set - Interview Date: 26th - 28th February 2020 Time: 12 PM Interview Venue: KFIN Technologies Private Limited Tower - B, Plot No. 31 & 32, Selenuim Building Financial District, Nanakramguda, Gachibowli, Hyderabad, Telangana - 500 032. SPOC - Pradeep Gangaraju","location":"Hyderabad","experience":"3 - 5 Years"},{"date":"29 - Feb - 2020","skills":"C# and ASP .Net, Web API Services using C# and ASP .Net","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Protiviti Consulting Private Limited, DLF Building No. 5, 15th Floor, Tower A, DLF Phase III, DLF Cyber City, Gurugram, Haryana - 122 002","phone":"Not Provided","profile":"Software Engineer - Full Stack/ .Net \nProtiviti Consulting Private Limited","description":"Candidate should have Bachelors degree in related field or equivalent with 2+ years of professional experience in software analysis, development, engineering and support in a large corporate s setting. 2+ years' experience with a programming or scripting language (C#, JavaScript, SQL) 2+ years' experience writing/modifying programs for a small to mid-size application 2+ years' experience administering and/or configuring an application. 2+ years' relevant experience in Microsoft container, Open Source container. Working knowledge of C# and ASP .Net Knowledge of Web API services using C# and ASP .Net Working knowledge of Angular framework - Angular 2.0 or above Experience working with HTML 5, and CSS Walk-in Date: 29th February 2020, 9 AM onwards Timing: From 9 AM onwards till 3 PM. Interview Venue: Protiviti Consulting Private Limited DLF Building No. 5, 15th Floor, Tower A, DLF Phase III, DLF Cyber City, Gurugram, Haryana - 122 002 Contact Person- Bhavna Marwah","location":"Gurgaon","experience":"2 - 5 Years"},{"date":"25, 26, 27, 28, 29 - Feb - 2020","skills":"Asp .Net, MVC, C#, Javascript, jquery and SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Sohung Infotech Private Limited, E - 38, E Block, Sector 63 Noida, Uttar Pradesh - 201 301.","phone":"9911886563","profile":".Net Developers \nSohung Infotech Private Limited","description":"Candidate should have good knowledge of Asp .Net, MVC, C#, Javascript, jquery and SQL Server, Software Development. Must have completed 6 months of Institutional training in Dot Net & MVC. Walk-in Date/ Time: 25 February - 31st March 2020, 11 AM onwards Interview Venue: Sohung Infotech Private Limited E - 38, E Block, Sector 63 Noida, Uttar Pradesh - 201 301. Contact Person- Gagandeep Singh Phone: 9911886563","location":"Noida","experience":"2 - 4 Years"},{"date":"26, 27, 28 - Feb - 2020","skills":"ASP .NET, C#, MVC, SQL, Web API, Angular JS, HTML, CSS, JQuery, Bootstrap","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Digital Minds Software Solutions Private Limited 2nd Floor, A-Wing, Softsol Building, #4 Infocity, Beside Mindspace,Hi-tech City, Madhapur, Hyderabad - 500 081","phone":"040 6688 5669","profile":".Net Developer \nDigital Minds Software Solution Pvt. Limited","description":"Educational Qualification: B. Tech/ MCA Work Experience: 2 - 5 years Process: .Net Domain Skill Set: ASP .NET, C#, MVC, SQL, Web API, Angular JS, HTML, CSS, JQuery, Bootstrap Experience in designing web applications using HTML, CSS, Bootstarp, JQuery, Angular JS. Experience on Developing applications using ASP.Net MVC & C#. Writing and Consuming Web services & Web API. Experience on SQL Server and dealing database using Entity Framework. Knowledge on Kentico is an added advantage. Shift Timings: 9:00 am to 6:00 pm. Walk-in Date/ Time: 26 February - 28 February , 10 AM onwards Interview Venue: Digital Minds Software Solutions Private Limited 2nd Floor, A-Wing, Softsol Building, #4 Infocity, Beside Mindspace,Hi-tech City, Madhapur, Hyderabad, Telangana - 500 081 Team Contact: Email: hr@digitalminds.solutions PH: 9063610208 / 040 6688 5669 Note: Those attended the interview past six months, kindly ignore","location":"Hyderabad","experience":"2 - 5 Years"},{"date":"27 - Feb - 2020","skills":"C# .Net, ASP .Net and SQL Database","qualification":"B.E./B.Tech, MCA/PGDCA","address":"IQVIA Omega, Embassy Tech Square (Cessna Business Park / Embassy tech Square) Marathahalli-Sarjapur Outer Ring Road, Kadubeesanahalli, Bangalore - 560 103","phone":"Not Provided","profile":".Net Developers \nIMS Health Analytical Services Pvt. Limited","description":"Education: Bachelors Degree in Engineering or Masters Degree in Computer Application or equivalent. Years of Experience: 3 to 7 years Job Location: Bangalore Should have good experience in .Net development C# .Net, ASP .Net and SQL Database. Should be good in JQuery. Willing to learn new technologies and explore. Notice Period: Immediate, 30 days, 45 days, or less Walk-in Interview on 27th February from 9 AM onwards Interview Venue: IQVIA Omega, Embassy Tech Square (Cessna Business Park / Embassy tech Square) Marathahalli-Sarjapur Outer Ring Road, Kadubeesanahalli, Bangalore - 560 103 Please Note: Candidates who have attended the interview in the last 3 months are not eligible to attend this interview.","location":"Bangalore","experience":"3 - 7 Years"},{"date":"25, 26, 27, 28 - Feb - 2020","skills":".Net, Angular, Web API, SQL Server, MySQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"IndusInd Bank Limited, Solitaire Corporate Park, Building No. 8 - 3rd Floor, Andheri Kurla Road, Andheri (E), Mumbai - 400 093","phone":"Not Provided","profile":"Angula/ .Net Developer \nIndusInd Bank Limited","description":"Angular - Having minimum 2 years of experience Web API - having at least 2 years of experience SQL Server 12 and above - having minimum 3 years experience MySQL - having minimum 1 years experience Knowledge of client-side scripting frameworks Financial domain knowledge Walk-in Date/ Time: 25th February - 28th February , 10 AM onwards Interview Venue: IndusInd Bank Limited Solitaire Corporate Park, Building No. 8 - 3rd Floor, Andheri Kurla Road, Andheri (E), Mumbai - 400 093 Contact Person- Nancy","location":"Mumbai","experience":"3 - 5 Years"},{"date":"26, 27, 28, 29 - Feb - 2020","skills":"Asp .Net, C#, Ajax ,MVC Dot Net framework 3.5 & above","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Jayam Solutions Private Limited, Plot # 277, Anjaneya Nagar Colony, Moosapet, Hyderabad","phone":"040-48526868","profile":".Net Developer/ Fresher \nJayam Solutions Private Limited","description":"Candidate should have 0 to 1 year of hands-on development experience in the following: Asp .Net, C#, Ajax ,MVC Dot Net framework 3.5 & above IDE: Visual Studio MS SQL Server HTML 5, CSS 3, Angular Js, JQuery Male Candidates only need to apply Walk-in Date/ Time: 24th - 29th February 2020, 10 AM onwards Interview Venue: Jayam Solutions Private Limited Plot # 277, Anjaneya Nagar Colony, Moosapet, Hyderabad Land Mark: Near Shell International School Contact Person- Harishchandrababu M, HR Manager Contact No: +91 9440806850, 040-48526868","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"26, 27, 28 - Feb - 2020","skills":"Lateral Hiring, HR/ Recruitment, On boarding","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Yellow Box HR Services Private Limited, Sagar Apartment, 3rd Floor, Above Wellness Forever, Opposite Parihar Sweets Parihar Chowk, Aundh, Pune - 411 007.","phone":"8600003812","profile":"HR Executive/ Recruiter \nYellow Box HR Services Private Limited","description":"At Yellowbox, you will get a hands-on experience working on a plethora of requirements that will enhance your capabilities as a recruiter Roles & Responsibilities: Partner with c;ients to get a clear view on their strategic and financial objectives and hiring needs Devise and carry out a targeted research strategy Research into clients company, competitors and market place Map role criteria, define position description and document specifications Track and identify prospective candidates using a variety of channels Assess candidates to ensure qualification match, cultural fit and compatibility Conduct confidential interviews, follow-up references and check credits Present shortlisted candidates and provide detailed profile summaries Offer guidance and facilitate the negotiation process through to its completion Follow up with clients and assist with the candidates transition and onboarding Please mail your CV at ashwinip.ybhr@gmail.com along with the following details if interested: Current organization: Current monthly In hand: Expected monthly In hand: Total-experience: Notice period: Walk-in Date: 26th - 28th February 2020 Timings: 10 AM to 3:00 PM Interview Venue: Yellow Box HR Services Private Limited Sagar Apartment, 3rd Floor, Above Wellness Forever, Opposite Parihar Sweets Parihar Chowk, Aundh, Pune, Maharashtra - 411 007. Contact Person- Ashwini ( 8600003812 )","location":"Pune","experience":"0 - 3 Years"},{"date":"28, 29 - Feb - 2020","skills":"Office Administration, Ticket Booking, Facility Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Busybees Logistics Solutions Private Limited, Building# B1, on 1st floor, Kumar Cerebrum IT Park, Kalyani Nagar, Pune","phone":"Not Provided","profile":"Administration Executive \nBusybees Logistics Solutions Pvt. Limited","description":"We are hiring for Admin Executive (Male candidates preferred) Experience: upto 2 Years (Freshers are welcome) Age criteria: below 27 Years only Outstanding communication and interpersonal abilities Excellent organizational and leadership skills Familiarity with office management procedures and basic accounting principles Excellent knowledge of MS Office (Advanced excel) Job Responsibility: 1. Facility Management 2. Travel Desk/ Ticketing 3. Billing & application support (Hotel & Travel booking application Walk-in Date/ Time: 28 February - 29 February 2020, 11 AM onwards Interview Venue: Busybees Logistics Solutions Private Limited Building# B1, on 1st floor, Kumar Cerebrum IT Park, Kalyani Nagar, Pune Contact Person- Omprakash Sutar","location":"Pune","experience":"0 - 2 Years"},{"date":"26, 27, 28 - Feb - 2020","skills":"Attendance, Staff Welfare, Joining Formalities, Data Entry, Payroll Processing","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"PVR Limited, Urban Vault- 22 PVR cinemas 1st Floor, Koramangala 4th block On top of Allahabad bank Bangalore","phone":"Not Provided","profile":"Business HR Associate \nPVR Limited","description":"Candidate should have 0 to 2 years of experience in HR/ Recruitment, Attendance, Staff Welfare, Joining Formalities, Data Entry, Payroll Processing Key Responsibility- Responsible for Controlling cost on stationary, consumables, staff welfare, monthly meetings etc. Responsible for maintaining Total staffing level present in Cinemas. Responsible for checking Attrition lower than 60% annualized per site. Responsible for OnTime completion of joining formalities including Offer letter, Emp codes, mediclaim ESIC cards, uniforms, ID cards. Responsible for All FnF to be sent for processing with accurate and complete details in stipulated time. Responsible for Minimizing Rejection cases of FnF. Responsible for Mantaining HRIS Data, Ontime data entry, New Joinee Entry, Transfer, Exit, Other Master Details,Maintaining Personal files & Updating the same. Walk-in Date/ Time: 26th February - 28th February from 10 AM onwards Interview Venue: PVR Limited Urban Vault- 22 PVR cinemas 1st Floor, Koramangala 4th block On top of Allahabad bank Bangalore","location":"Bangalore","experience":"0 - 2 Years"},{"date":"26, 27 - Feb - 2020","skills":"Office administration & front desk, Office Assistant & Receptionist","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"ANAROCK Property Consultants Pvt. Limited, Office no. 901-A, 9th floor, ONYX Tower, Next to Westin Hotel, Koregaon Park, Pune - 411 001.","phone":"020-67491010","profile":"Front Office Executive \nAnarock Property Consultants Pvt. Limited","description":"Urgent opening for the post of Front office cum Admin Executive on contractual basis Candidate must be willing to work for 6 days a week. Must have excellent communication and good Personality. Should be able to handle both the role as Front office and Admin. FEMALE CANDIDATES Only Preparing excel, transaction details and log book. Preparing office assistant's Conveyance. Booking Jet fleet as and when required, confirming the entity and to take check on whether the bookings are done. Making excel and check the log book. Taking quotes from Hotels for tie up, taking approvals. Booking the hotel rooms according to employees as when required. Assigning the pool car as when required. Walk-in Date/ Time: 26 February - 27 February , 11 AM onwards Interview Venue: ANAROCK Property Consultants Pvt. Limited Office no. 901-A, 9th floor, ONYX Tower, Next to Westin Hotel, Koregaon Park, Pune - 411 001. Contact Person- Shivangi Kulshrestha Phone No. 67491010","location":"Pune","experience":"2 - 6 Years"},{"date":"29 - Feb - 2020","skills":"ASP .NET framework, SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Muthoot Microfin Limited, 4th Floor, Raviz Arcade, M G Road, Padma Junction, Cochin.","phone":"4844105343","profile":"ASP .Net Developer \nMuthoot Microfin Limited","description":"Candidate should have Bachelor's degree in Computer Science/ Engineering or related field Proven experience with AngularJS and MVC .Net Must have excellent communication skills Familiarity with the ASP .NET framework, SQL Server and design/ architectural patterns (E.g. Model-View-Controller (MVC)) Knowledge of at least one of the .NET languages (E.g. C#, Visual Basic .NET) and HTML5/CSS3. Familiarity with architecture styles/ APIs (REST, RPC). Understanding of Agile methodologies. Excellent troubleshooting and communication skills. Job Responsibility- Participate in requirements analysis. Collaborate with internal teams to produce software design and architecture. Hands on experience in AngularJS. Write clean code using .NET programming languages. Test and deploy applications and systems. Walk-in Date/ Time: 29th February 2020, 11 AM onwards Interview Venue: Muthoot Microfin Limited, 4th Floor, Raviz Arcade, M G Road, Padma Junction, Cochin. Landmark : Above McDonald Contact - Chris Jose ( 4844105343 )","location":"Cochin","experience":"1 - 3 Years"},{"date":"24, 25, 26, 27, 28 - Feb - 2020","skills":"Technical Support, International Voice Process, Customer Support","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Porteck India Private Limited, D-179, Sector-63, Near Extramarks, Noida, Uttar Pradesh - 201307.","phone":"0120-4356400","profile":"Technical Support Executive \nPorteck India Infoservices Pvt. Limited","description":"Candidate must have atleast 6 months of experience into Technical Support. Should have good communication skills in English language Must be willing to work in US shifts Immediate joiners preferred Job Responsibility- Research, diagnose, troubleshoot and identify solutions to resolve customer issues. Taking calls with server, printer, router and antivirus issues from the US customers. Exposure to Exchange, Office 365 Walk-in Date/ Time: 24 February - 28 February , 12 PM onwards Interview Venue: Porteck India Infoservices Pvt. Limited D - 179, Sector - 63 Near ExtraMarks, Noida Tel No. 0120-4356400/ 401 Contact - Recruitment Team","location":"Noida","experience":"1 - 4 Years"},{"date":"24, 25, 26, 27, 28, 29 - Feb - 2020","skills":"Office Assistance, General Administration, and Office Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Horizontal Resolutions India Pvt. Limited, F-2, 2nd Floor, Sharma Market, Near Sector 18 Metro Gate No. 1, Noida","phone":"8178777814","profile":"Administration Executive \nHorizontal Resolutions India Pvt. Limited","description":"Candidate should be Any Graduate with 1 to 3 years of experience in Office Assistance, General Administration, and Office Management. Should have excellent communication skills. Roles & Responsibilities- Handling incoming calls and other communications. Managing filing system. Updating paperwork, maintaining documents and word processing. Helping organize and maintain office common areas. Arranging appointments Walk-in Date/ Time: 24th - 29th February 2020, 11 AM onwards Interview Venue: Horizontal Resolutions India Pvt. Limited F-2, 2nd Floor, Sharma Market, Near Sector 18 Metro Gate No. 1, Noida Contact Person- Ajeet (8178777814)","location":"Noida","experience":"1 - 3 Years"},{"date":"24, 25, 26 - Feb - 2020","skills":"Recruitment, Sourcing Profiles, BPO Hiring, Screening, Volume Hiring","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Tech Mahindra Limited, Plot No. S1, Maitre Vihar Road, Chandrasekharpur, Bhubaneswar, Odisha","phone":"7655992071","profile":"HR Recruiter - Direct Contractual \nTech Mahindra Limited","description":"Tech Mahindra Limited, is looking for HR Recruiters (Direct - Contractual Role) for Bhubaneshwar location. Eligibility: B.Tech/ BE Graduate with minimum 0 - 5 years of recruitment exposure Excellent Communication Skills In English and Hindi Must have strong interpersonal skills Willingness to travel for Campus Drive is a Must. All Graduates and Tech Graduates and MA in English / MBA Degree holder can apply Fresher Can also apply ---- Direct Contractual This JOB involves lot of Traveling ... Work Timings: 6 working days, MON to SAT (Also should open to work in Sundays ) Skills Required ------ Data Calling (Mandate) Managing footfall Screening. Collecting Documents Confirmation Calling. Conducting All Rounds Documentation Work. Meeting individual targets through calling & sourcing. Managing Business Requirements. Walk-in Date/ Time: 24th - 26th February 2020, 9 AM onwards Interview Venue: Tech Mahindra Limited Plot No. S1, Maitre Vihar Road, Chandrasekharpur, Bhubaneswar, Odisha Contact Person- Vishal Khanna Note: Please carry following relevant documents at the time of interview 1. SSC(Mark sheet & Certificate) 2. HSC(Mark sheet & Certificate) 3. Graduation CMM or PC 4. Offer, Relieving Letter and last 3 months of Salary Slips(If any) 5. Pan Card 6. Aadhar Card (Mandatory)","location":"Bhubaneshwar","experience":"0 - 5 Years"},{"date":"24, 25, 26 - Feb - 2020","skills":"Blended Process, Back office operations","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Datamatics Business Solutions Limited, Plot No. B-5, Part B Cross Lane MIDC, Andheri East, Mumbai - 400 093","phone":"7506883894","profile":"Backend Process Executive \nDatamatics Business Solutions Limited","description":"Urgent openings for Blended/ Back Office Process Executive @ Andheri East MIDC Only Graduates with good communication skills can apply Should have have Basic knowledge of Excel Research will be done Online, hence should know how to use internet. Utilizing various search engines like Google, Bing to research data about the given entities. Kindly walk-in between 11:30 am to 5 pm on the below mentioned address- Monday to Tuesday i.e 24th to 26th February 2020 Interview Venue: Datamatics Business Solutions Limited Plot No. B-5, Part B Cross Lane MIDC, Andheri East, Mumbai - 400 093 Landmark : Near MIDC police station Nearest Metro Station : Chakala, JB Nagar, Exit Gate no. 1 Contact Person- Elia Shinde (7506883894)","location":"Mumbai","experience":"0 - 2 Years"},{"date":"25, 26 - Feb - 2020","skills":"Technical Support, IT Helpdesk/ Service Desk, Customer Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech, Diploma","address":"Tech Mahindra Limited, Software Development Block -4 Ground Floor, ODC-1 602/3, Elcot SEZ, Sholinganallur Village, Chennai - 600 119.","phone":"Not Provided","profile":"Technical Support Engineer \nTech Mahindra Limited","description":"Tech Mahindra Limited, is hiring for technical support process, please find below the eligibility criteria. 10 + 2/ 10 + Diploma (12 Years of Education) Knowledge in LAN/ WAN/ ROUTER will be an added advantage. Should have good communication Skills. Any fresher can apply (Excepts 2020 batch) , candidates with back logs are accepted. Should be flexible to work in Rotational shift and Rotational week off. Post Graduates can also apply (except 2020 batch) Walk-in Date/ Time: 24th - 26th February 2020, 11 AM onwards Interview Venue: Tech Mahindra Limited, Software Development Block -4 Ground Floor, ODC-1 602/3, Elcot SEZ, Sholinganallur Village, Chennai - 600 119. Contact Person- Prithvi","location":"Chennai","experience":"0 - 1 Years"},{"date":"24, 25, 26, 27 - Feb - 2020","skills":"Technical Support, IT Helpdesk, Customer Support","qualification":"B.E./B.Tech, B.Sc, BCA/BCS","address":"NIIT Limited, A-24, Infocity 1, Sector 34, Gurgaon","phone":"0124-4916889","profile":"Manual Testing/ Content Testing \nNIIT Limited","description":"We are having a Walk-In drive from 24th February 2020 (Contractual for 3 Months / Rotational Shifts) Looking for B.Tech/ BCA Candidates with 0 to 1 year of Experience. Must have an outgoing personality and skills in speaking, organizing, listening, leadership, communication and decision making. Must have Proficiency in English language. Well organized and customer focused. Proficient in Computer (MS Office). Attention to detail and an ability to work easily with others. Ability to work independently in a flexible and adaptable manner. Working globally, covering different time zones and languages is key Open to work in rotational shift. (Cab will be provided for both side) Job Responsibility:- Understand and execute test cases. Find bugs and describe them in a concise and clear manner and in customer-facing language. Create test logs. Understand LMS behavior . Understand different accents. Understand client requirements and share correct inputs to client accordingly. Candidates should be able to find bugs against the following scope: Functionality Layout Content mapping Read-through (for language and project-specific standards) Candidates should have good verbal and written communication skills. Validate documents at each testing stage (Handover document, self-review sign-offs and logs). Share bug reports with the development team. Adhere to the defined QC processes. Walk-in Date: 24th - 27th February 2020 Timings : 10 am to 2 pm Interview Venue: NIIT Limited, A-24, Infocity 1, Sector 34, Gurgaon Contact Person- Deepak (0124-4916889)","location":"Gurgaon","experience":"0 - 1 Years"},{"date":"24, 25, 26, 27, 28, 29 - Feb - 2020","skills":"Core Java, Jsp, Servlet, SQL or Oracle PL/SQL, Prepare Test Plans, Test Cases","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Betamonks Technology Factory Pvt. Limited, YALAMANCHILI, 46, Near Somalwar School, Pratap Nagar, Khamla, Nagpur - 440 022.","phone":"7507444730","profile":"Software Engineer/ Freshers \nBetamonks Technology Factory Pvt. Limited","description":"We are looking for Freshers - Software Engineers having anyone of the below skill sets for Nagpur Location. 1) Java Developer: Must have Strong development knowledge in Java based web applications. Knowledge in developing interactive, user-friendly applications. Mandatory Skills: Core Java, Jsp & Servlet. 2) SQL (or) PL/SQL Developer: Expert in SQL or Oracle PL/ SQL packages, Procedures and Functions. Design and implementation of data models Performance tuning of the queries, procedures, programs. Concepts like Object types, Bulk Bindings, Collections and table imports/ extracts. 3) Software Tester: Prepare Test Plans, Test Cases Analyzing the requirements from clients Arranging Test Environment to execute the test cases Analyzing and executing Test Cases Defect Tracking Communicating with Test Manager Performing Systems Testing, Load Testing. Walk-in Date: 25th February to 7th March 2020 (Except Sunday) Interview Time: 10:00 am to 1:00 pm Interview Venue: Betamonks Technology Factory Private Limited YALAMANCHILI, 46, Near Somalwar School, Pratap Nagar, Khamla, Nagpur - 440 022. Landmark : Near Somalwar High School Contact - HR (7507444730)","location":"Nagpur","experience":"0 - 1 Years"},{"date":"28 - Feb - 2020","skills":"Technical Support, Customer Service, Web Technologies","qualification":"B.E./B.Tech, B.Sc, BCA/BCS","address":"Endurance International Group, Unit No. 501, 5th Floor, Unit - IT Building No. 3, Nesco IT Park, Nesco Complex, Western Express Highway, Goregaon (East) Mumbai - 400 063.","phone":"Not Provided","profile":"Technical Support Engineer \nEndurance International Group (India) Pvt. Limited","description":"Candidate should be Graduate from any stream/ Any Engineering, or BSc (IT or Computers) with 0 to 2 years of experience in Customer Service or similar capacity, preferably on an IT platform. Must be customer focused and willing to do whatever it takes to resolve customer issue. Strong customer interaction skills and ability to work in a variety of customer situations. Should have Outstanding written and verbal communication skills Ability to solve complex problems quickly, inventively and resourcefully Good working knowledge of computers and the internet; strong ability to develop new skills Highly motivated and energetic team player, with excellent interpersonal skills Must be willing to work in rotational shifts Walk-in Date/ Time: 28th February 2020, 10 AM onwards Interview Venue: Endurance International Group - India Unit No. 501, 5th Floor, Unit - IT building No. 3, Nesco IT Park, Nesco Complex, Western Express Highway, Goregaon (East) Mumbai - 400 063. Contact Person- Srishti","location":"Mumbai","experience":"0 - 2 Years"},{"date":"25, 26, 27, 28 - Feb - 2020","skills":"Technical Support, Technical Documentation, Installation, Hardware Troubleshooting","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Ebullient Securities Private Limited, 107, Tower B, First Floor, Unitech Cyber Park, Sector 39, Gurgaon, Haryana","phone":"Not Provided","profile":"Technical Support Engineer \nEbullient Securities Private Limited","description":"We are looking for technically skilled candidates with good problem-solving ability for the position of IT Technical Support Engineer. The duties of an IT Technical Support Engineer include being a reference point for all IT related queries at the user level, responding to user needs in a timely manner and ensuring the optimal running of all systems, among other technical duties. Candidate should have Bachelor's Degree in Computer Science or related field. Must have 2+ years experience in computer networks and systems maintenance. A+, Linux+ or Cisco Certified Network Associate accreditation advantageous. Excellent written and verbal communication skills. Proficient in database programming and software installation. Attention to detail with Good problem-solving skills Must have good interpersonal skills. Walk-in Date/ Time: 25th - 28th February 2020, 9 AM onwards Interview Venue: Ebullient Securities Private Limited, 107, Tower B, First Floor, Unitech Cyber Park, Sector 39, Gurgaon, Haryana","location":"Gurgaon","experience":"2 - 4 Years"},{"date":"25 - Feb - 2020","skills":"Technical Support, International Voice Process, Customer Service","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"DXC Technology (India) Private Limited, TRIL Info Park Ltd., Ramanujam IT SEZ, 8TH Floor, Block D, Littelwood Tower Rajiv Gandhi Salai (OMR), Taramani, Chennai - 600 113","phone":"Not Provided","profile":"Technical Support (Voice Process) \nDXC Technology (India) Private Limited","description":"Candidate have Graduation with 10+2+3/ 4 preferably. Typically requires 0- 2 years general experience, or equivalent combination of experience and college level education. Knowledge and Skills: o Superior skills in both written and verbal communication. o Experience in customer facing role either remote or face to face. o Computer proficiency with applicable software applications (for example Microsoft Office, CAD, Adobe Suite, programming. o Problem solving skills. o Accuracy in data entry. o Excellent fluency in language to be supported. o Experience in a phone based remote role, e- support, e-chat or similar. o Familiarity with computer technology. o Knowledgeable in call routing and case management processes as well as case logging systems and obligation systems . o Understands internal processes and tools. o Knowledge of Knowledge Management Systems and appropriate documentation to the system. Walk-in Date: 25th February 2020 Time - 11 AM - 1 PM Interview Venue - DXC Technology (India) Private Limited TRIL Info Park Ltd., Ramanujam IT SEZ, 8TH Floor, Block D, Littelwood Tower Rajiv Gandhi Salai (OMR), Taramani, Chennai - 600 113","location":"Chennai","experience":"0 - 2 Years"},{"date":"25 - Feb - 2020","skills":"Technical Support, Voice Process, Customer Support","qualification":"Diploma, B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Tech Mahindra Limited, Takshasila, Gate No. 1, Ground Floor, Survey No. 62/1A, Qutubullapur mandal Bahadurpally, Hyderabad - 500043","phone":"Not Provided","profile":"Technical Support (Voice Process) \nTech Mahindra Limited","description":"Candidate should have Any Degree (Backlogs are accepted)/ Diploma/ 12th Customer or Sales or Technical Support experience into BPO domain, to be considered. Domestic calling experience, is considerable Must be Flexible with any shift timings (24*7) Should have good verbal communication skills Freshers can Apply Job Responsibility- Customer Support/ Technical Support- International Voice Dealing with customer inquiries over the phone. Achieving all objectives in line with the Area Business Plan Walk-in Date/ Time: 24th - 25th February 2020, 10 AM onwards Interview Venue: Tech Mahindra Limited Takshasila, Gate No. 1, Ground Floor, Survey No. 62/1A, Qutubullapur mandal Bahadurpally, Hyderabad - 500043 Contact Person- Swathi","location":"Hyderabad","experience":"0 - 5 Years"},{"date":"24, 25, 26, 27, 28 - Feb - 2020","skills":"PHP, Ajax, Third-Party APIs, HTML, CSS, JavaScript, AJAX","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Casperon Technologies Private Limited, D.84, Block No.3, 4th Floor, Murugesa Nayakar Complex, Greams Road, Thousand Lights, Chennai - 600 006.","phone":"9790263818","profile":"PHP Developer (Only Male) \nCasperon Technologies Private Limited","description":"Candidate would have Responsibility for creating web-based applications using PHP. Good knowledge of Ajax and Third-Party APIs integration. Framework knowledge needed (Codeigniter is preferred one) Expertise interface with HTML, CSS, JavaScript, AJAX, Walk-in Date/ Time: 20th February - 28 February , 12 PM onwards Interview Venue: Casperon Technologies Private Limited D.84, Block No.3, 4th Floor, Murugesa Nayakar Complex, Greams Road, Thousand Lights, Chennai - 600 006. Contact Person- Aravind (9790263818)","location":"Chennai","experience":"1 - 4 Years"},{"date":"24 - Feb - 2020","skills":"PHp, HTML, CSS, Web Development","qualification":"B.E./B.Tech, MCA/PGDCA","address":"RIM India Private Limited SAPTHAGIRI #12, 3rd Floor, 60 Feet Road N H B C Layout, Prashant Nagar,(Near Vijaya Nagar), Bengaluru - 560 079","phone":"Not Provided","profile":"PHP Web Developer \nResource Infrastructure Management India Pvt. Limited","description":"We are hiring PHP Developer for our company RIM India Private Limited, Bangalore. Looking for Fresher to 1 year of experience into PHP Freshers should have done training on PHP Technologies Required Skills- PHp, HTML, CSS, Web Development Walk-in Date/ Time: 24 February - 25 February , 10 AM onwards Interested candidates please walk-in to our office on 24/02/2020 (Monday) between 10.00 AM-12.00 PM Resource Infrastructure Management India Pvt. Limited SAPTHAGIRI #12, 3rd Floor, 60 Feet Road N H B C Layout, Prashant Nagar,(Near Vijaya Nagar), Bengaluru - 560079 Land Mark:- Opposite Karnataka Bank Contact Person- Raghu","location":"Bangalore","experience":"0 - 1 Years"},{"date":"22, 24, 25, 26, 27, 28 - Feb - 2020","skills":"Software Testing, Performance Testing, Manual Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"LogStar ERP India Private Limited, 302, Sai Enclave, C-Wing, Behind Vikhroli Bus Depot, Vikhroli (East), Mumbai - 400 083.","phone":"022-41192254","profile":"Software Tester \nLogStar ERP India Private Limited","description":"Person would be required to work with Team Lead to deliver a high quality software Implementing Functional testing, Integration Testing, System Testing. Ability to quickly learn new concepts is necessary. Must have strong team working skills. Basic Knowledge of .Net, SQL Server would be an added advantage. Job Responsibility- Analyse product requirements & contribute to creating test strategies, test scripts & test plans Find reproduce isolate log & report defects,track them from inception to closure Review Test Cases prepared by other. Document and execute test cases Walk-in Date/ Time: 22nd - 28th February 2020, 11 AM onwards Interview Venue: LogStar ERP India Private Limited 302, Sai Enclave, C-Wing, Behind Vikhroli Bus Depot, Vikhroli (East), Mumbai - 400 083. Landmark: ICICI Bank Vikhroli east branch/ Dominos Pizza Contact Person- Ms. Ankita Phone: 022-41192254","location":"Mumbai","experience":"2 - 4 Years"},{"date":"26 - Feb - 2020","skills":"Software Testing, Regression Testing, Automation Testing","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Indium Indium Software (India) Limited, No. 64, Ganesh Chambers Eldams Road, Teynampet, Chennai - 600 018.","phone":"044-66069102","profile":"Automation Testing Engineer \nIndium Indium Software (India) Limited","description":"Indium Indium Software (India) Limited, is Hiring Freshers for Testing opportunity Qualification: B.E/ B.Sc/ MCA (only 2018 & 2019 Pass outs) Mandatory 60% and above (overall Percentage) and No standing arrears Good knowledge in any Programming Language Must have excellent Communication Skills Walk-in Date/ Time: 26th February 2020, 10 AM onwards Interview Venue: Indium Indium Software (India) Limited No. 64, Ganesh Chambers Eldams Road, Teynampet, Chennai - 600 018. Contact Person- Tharani Phone No. 044-66069102","location":"Chennai","experience":"0 - 1 Years"},{"date":"24, 25 - Feb - 2020","skills":"PHP, MySql/ NoSQL Databases","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Fubiq Venture Private Limited, 433, IJMIMA Building, 4th Floor, Behind Infinity Mall, Off Link Road, Interface, Malad West, Mumbai - 400064","phone":"Not Provided","profile":"PHP Developer \nFubiq Venture Private Limited","description":"Candidate must have understanding of the fully synchronous behavior of PHP, Familiarity with MySql/ NoSQL databases and their declarative query languages Knowledge of object oriented PHP programming, Proficient understanding of code versioning tools, such as Git Walk-in Date/ Time: 24th - 25th February 2020, 12 PM onwards Interview Venue: Fubiq Venture Private Limited 433, IJMIMA Building, 4th Floor, Behind Infinity Mall, Off Link Road, Interface, Malad West, Mumbai - 400064 Contact Person- Rakesh Tiwari","location":"Mumbai","experience":"1 - 6 Years"},{"date":"24, 25, 26, 27, 28, 29 - Feb - 2020","skills":"PHP, jQuery, Javascript, HTML, Codeigniter or other MVC framework","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Acorn Tech, Co-win, Gracia Society, R/H No. C-01, Shakar Kalat Nagar Behind Sanket Inn Hotel, Near Bhumkar Chowk, Wakad, Pune - 411 057.","phone":"Not Provided","profile":"Web Developer - PHP/ Full Stack \nAcorn Tech","description":"Ideal candidate should have: 2+ years experience in PHP Experience in jQuery, Javascript and HTML Should know Responsive Design Ideally should know Codeigniter or other MVC framework Advantageous if they know hybrid mobile framework Walk-in Interview till 9th March 2020, 10 AM onwards Interview Venue: Acorn Tech Co-win, Gracia Society, R/H No. C-01, Shakar Kalat Nagar Behind Sanket Inn Hotel, Near Bhumkar Chowk, Wakad, Pune - 411 057. Contact Person- Sawan","location":"Pune","experience":"2 - 6 Years"},{"date":"24, 25, 26, 27, 28, 29 - Feb - 2020","skills":"Core PHP, API, MySQL, HTML, CSS, Javascript, AJAX etc.","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Abchlor Investment Advisors Pvt. Limited, Laxmi Industrial Estate, 409, Laxmi Mall, New link Road, Andheri (West), Mumbai - 400 053","phone":"022-40713322","profile":"PHP Web Developer \nAbchlor Investment Advisors Pvt. Limited","description":"Candidates with minimum 2 years of relevant experience in API, MySQL, Core PHP, AJAX, CSS may apply. Write clean, well designed code. Troubleshoot, test and maintain the core product software and databases to ensure smooth functionality. Demonstrable knowledge of web technologies including HTML, CSS, Javascript, AJAX etc. Good knowledge of MySQL. Experience in integrating third-party APIs. Passion for best design & coding practices. Desire to develop new bold ideas. Walk-in Date/ Time: 24th- 29 February 2020, 9 AM onwards Interview Venue: Abchlor Investment Advisors Pvt. Limited Laxmi Industrial Estate, 409, Laxmi Mall, New link Road, Andheri (West), Mumbai - 400 053 Contact Person- Kumar A Tel No. 022-40713322","location":"Mumbai","experience":"2 - 5 Years"},{"date":"24, 25, 26, 27, 28 - Feb - 2020","skills":"Core Php, Smarty, Zend, JavaScript, Ajax, JQuery, MySQL Database","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Extramarks Education India Pvt. Limited, D-180 , Sector 63 Noida - 201 301.","phone":"Not Provided","profile":"Core PHP Developer \nExtramarks Education India Pvt. Limited","description":"Candidate must have strong knowledge in Core Php, MySQL Database. Analyse, Create and Normalize database independently. Strong in Smarty, Zend with installation process, JavaScript, Ajax, JQuery. Should have good knowledge of Apache Server and Linux, XML, HTML, HTML5, XHTML, CSS. Should be able to handle the project independently. Can understand and work on running projects. Can be able to handle multiple projects simultaneously. My SQL Code Ignitor MVC Frame Work Walk-in Date/ Time: 21st - 28th February 2020, 11 AM onwards Interview Venue: Extramarks Education India Pvt. Limited D-180 , Sector 63 Noida - 201 301. Contact Person- Mr. Sungkrityayan Khan","location":"Noida","experience":"1 - 4 Years"},{"date":"24 - Feb - 2020","skills":"Core PHP, Word Press, JavaScript, JQuery, HTML, Node JS, MySQL, JSON, Ajax","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Advatix APAC Logistics Private Limited, 1- Floor, A Wing AIHP Palms Plot No. 242 & 243, Phase IV, Gurugram, Haryana - 122 015.","phone":"Not Provided","profile":"PHP Developer \nAdvatix APAC Logistics Private Limited","description":"We require a PHP Developer with at least 3+ years of experience and excellent skills in front-end-technologies. Proficient in Core PHP, Word Press, JavaScript, JQuery, HTML, Node JS, MySQL, JSON, Ajax, API Services, third-party API services. Experience of Angular JS, Codeigniter, yii framework. Understanding PHP and other backend technologies and Restful API. Experience in developing responsive webpages such as HTML5, CSS3, SAAS or LESS, Bootstrap etc. Strong analytical, problem solving skills, and attention to details. Deep knowledge of Angular practices and commonly used modules based on extensive work experience. Excellent written and oral communication skills. Knowledge and experience of contemporary JavaScript frameworks, libraries and components. A proactive and team oriented professional. Should have excellent time management skills. Walk-in Date/ Time: 24th February 2010, 10 AM onwards Interview Venue: Advatix APAC Logistics Private Limited 1- Floor, A Wing AIHP Palms Plot No. 242 & 243, Phase IV, Gurugram, Haryana - 122 015. Contact Person- Pallavi sharma","location":"Gurgaon","experience":"3 - 6 Years"},{"date":"29 - Feb - 2020","skills":"Core Java, Servlets, JSPs and J2EE","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Hetero Healthcare Limited, Sy. No. 80-84, Melange Towers, 5th Floor, B Wing, Patrikanagar, Madhapur, Hyderabad - 500 081.","phone":"040-40473535","profile":"Java Developers \nHetero Healthcare Limited","description":"Candidate must have strong knowledge of Core Java, Servlets, JSPs, J2EE and Database Java framework knowledge such as Spring, Hibernate etc. JavaScript, HTML, CSS knowledge required. Experience with web services is an advantage. AJAX, jQuery knowledge is an advantage. Must be a self-starter and able to work well with others. Experience in integrating web services with mobile clients such as iPhone/iPad applications is optional. Design, develop, implement and maintain series of programs, subsystem, revision and enhancement of current system. Walk in date: 29th February 2020 Time: 10 am - 2 pm Interview Venue: Hetero Healthcare Limited Sy. No. 80-84, Melange Towers, 5th Floor, B Wing, Patrikanagar, Madhapur, Hyderabad - 500 081. Phone No: 040-40473535/ 40473500","location":"Hyderabad","experience":"1 - 3 Years"},{"date":"24, 25, 26, 27, 28, 29 - Feb - 2020","skills":"Android Native, Android studio, Kotlin & Java","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Avacend Solutions Private Limited, No. 605, VI Floor, Phase - II, TICEL Bio-Park, CSIR Road, Taramani, Chennai - 600 113.","phone":"Not Provided","profile":"Andriod Developer \nAvacend Solutions Private Limited","description":"Candidate should have 2 to 4 years of experience on Android Native Development, Android studio development, Kotlin & Java. Must have strong OOPS design and programming skills in JAVA Familiarity with APIs Familiarity with payment gateway and Google Maps Integrations Database Technologies like SQLite Walk-in Date/ Time: 24 February - 13th March 2020, 10 AM onwards Interview Venue: Avacend Solutions Private Limited No. 605, VI Floor, Phase - II, TICEL Bio-Park, CSIR Road, Taramani, Chennai - 600 113. Contact Person- Mr Venkat","location":"Chennai","experience":"2 - 4 Years"},{"date":"29 - Feb - 2020","skills":"Java/ J2EE Spring / Hibernate Collection Framework, Exception Handling, Multithreading","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Sella India (Formerly known as Banca Sella), 4th Floor, Block 1, Cee Dee Yes Tyche Towers No. 2, MGR Nedunchalai (Perungudi Bye Pass road) Kandhanchavadi, Chennai - 600 096.","phone":"Not Provided","profile":"Java Developers \nSella India (Formerly known as Banca Sella)","description":"Work Experience : 2 to 7 Years Notice Period : Max of 60 days Candidate should have experience in following skill sets: Java/ J2EE Spring / Hibernate Collection Framework, Exception Handling, Multithreading Design Patterns, Regular Expression. * Banking domain experience is preferable. * Good knowledge in Data Structure & Algorithm * Should be good in logical thinking. * Must have good communication skill. Interview Levels: 1. System Test * MCQ ( Section 1: Core Java Section 2: Framework) * Coding Test (using Core Java concepts) 2.Technical Round 3. Project Manager Round 4. HR Round Interview Date : 29th February (Saturday) Time : 10.3 0am to 2.00 pm Interview Venue: Sella India (Formerly known as Banca Sella) 4th Floor, Block 1, Cee Dee Yes Tyche Towers No. 2, MGR Nedunchalai (Perungudi Bye Pass road) Kandhanchavadi, Chennai - 600 096. Contact Person- Sriram","location":"Chennai","experience":"2 - 7 Years"},{"date":"24, 25 - Feb - 2020","skills":"Java, Python, SQL queries, ETL Tool, Javascript, Data modeling","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Vaco Binary Semantics, Sector 18, Plot No. 15, Electronic City, Gurgaon, Haryana - 122 015","phone":"Not Provided","profile":"Software Engineer (Java) \nVaco Binary Semantics Limited","description":"Candidate should have Bachelor's/ Master degree in Computer Science, or equivalent practical experience having good academics with 2 to 4 years of experience specifically on complex ETL systems and data pipeline management. Experience with internet technologies and Unix/ Linux systems and scripting languages. Experience in working in cross-functional engineering roles with extensive use of SQL queries and data analysis. Experience with systems design and/or coding in a general purpose programming language. Ability to communicate effectively and influence stakeholders in internal Engineering teams, Product Development teams. Must have Innovative and creative approach in solving complex and abstract problems. Interested candidate may directly come for face to face interview on 24th & 25th February, 2020 between 11 am - 4 pm at below mentioned address :- Vaco Binary Semantics Sector 18, Plot No. 15, Electronic City, Gurgaon, Haryana - 122 015 Nearest metro station- Sikanderpur Contact Person - Chetna Rai","location":"Gurgaon","experience":"2 - 4 Years"},{"date":"29 - Feb - 2020","skills":"Java, Spring MVC, Webservices, REST, Hibernate, JDBC","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"HCL Technologies Limited, New Cafateria, Sholinganallur Campus, Chennai.","phone":"Not Provided","profile":"Java Professionals \nHCL Technologies Limited","description":"Scheduled Weekend drive on 29th February 2020 at Sholinganallur, Chennai to fulfil all the open positions. Kindly share your profile across to explore the career opportunity in detail, and to get a better overview of your credentials and aspirations. Candidate should have good experience in Java, Spring MVC, Webservices, REST, Hibernate, JDBC Must have good Attitude with communication skills Work Experience: 3+ Years No. of Position in Open: 15 Notice Period: Less than 60 Days Note: Kindly revert us with your updated CV if you're Interested with the following details on ahmed_s @hcl.com Name: Contact No: Email ID: Highest Qualification: Current Company: Contract or Permanent: If Contract, please do mention Payroll company name: Total years of Experience: Relevant years of Experience in Java, J2EE: Current CTC: Expected CTC: Notice period: Current Location: Availability on 29th Feb'20 Scheduled Weekend Drive: You will be having 2 Technical Face to Face discussion followed by an HR round on the same day. Please feel free to contact us if you have any doubt about the requirement. Please ignore if you do not have relevant experience.","location":"Chennai","experience":"3 - 5 Years"},{"date":"24, 25, 26, 27, 28 - Feb - 2020","skills":"HTML, Wordpress, CSS, Javascript, .NET, PHP","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Aakshdeep Ventures Private Limited, Public Political Party (PPP), 424A, Orbit Plaza, Crossing Republik, Ghaziabad - 201 016","phone":"0120-4513552","profile":"Web Developer \nAakshdeep Ventures Private Limited","description":"Candidate should have 0 to 5 years of experience in Web Development through HTML, Wordpress, CSS, Javascript, .NET, PHP. Fresher may apply, candidate having career gap shall be given preference. Must have good knowledge of Web Development, Walk-in Date/ Time: 24 February - 30 April 2020, 10 AM onwards Interview Venue: Aakshdeep Ventures Private Limited Public Political Party (PPP), 424A, Orbit Plaza, Crossing Republik, Ghaziabad - 201 016 Phone No: 0120-4513552 or 8743061145 (Whatsapp your Resume) Contact Person- Mr Shrivastava","location":"Ghaziabad","experience":"0 - 5 Years"},{"date":"22 - Feb - 2020","skills":"back office, customer, service outbound calling, Voice Process","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"KPMG Office, Third Floor, Building No. 07, Commerzone, Survey no.144/145, Yerwada, Pune","phone":"Not Provided","profile":"Back-end/ Back-office Executive \nKPMG","description":"Fresher's/ Graduates with good communication skills can directly walk-in for interviews Candidate should be able to read, write and speak fluently in English Previous experience in international voice process would be an added advantage Must have strong analytical and problem solving skills. Possess strong written and verbal communication skills Knowledge of MS office ( MS Excel, PowerPoint, Word etc) Must have Basic understanding of IT systems, Job Responsibility: Analyst are typically team members who will be involved in conducting verifications of stated credentials given by clients or vendors. Have the ability to work under pressure stringent deadlines and tough client conditions which may demand extended working hours. Interested candidates can walk-in for interviews on Saturday (22nd February 2020) at the below given address- KPMG Office, Third Floor, Building No. 07, Commerzone, Survey no.144/145, Yerwada, Pune Contact Person : Khushboo Vadhyani Dress Code : Business Formals. Date: 22nd February 2020 (Saturday) Time - 10:00 am to 1:00 pm Feel free to reach out in case you need any further information @ kvadhyani@kpmg.com","location":"Pune","experience":"0 - 4 Years"},{"date":"22, 23 - Feb - 2020","skills":"Core Java, Rest, Javascript, Web Services, JSP, Servlets","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"HCL Technologies Limited, Special Economic Zone,129, Tower 4 Ground Floor, Cafetaria 1, Bommasandra Jigani Link Road, Jigani, Bommasandra Industrial Area, Bengaluru - 562 106","phone":"Not Provided","profile":"Banking Associate (Non-Voice Process) \nHCL Technologies Limited","description":"Walk in Interview is happening this Weekend in our Bangalore HCL Office - 22nd & 23rd February 2020 - Use this excellent Opportunity - Freshers can Walk in - Bangalore Location. Fresher or Experienced up to Maximum 2 Years with Excellent Verbal and Written communication skills can attend and should have no arrears and also should be able to show the Degree and Provisional certificate if selected. Basic Skills Required: 1) Fresher 2) Any Graduate 3) Excellent written and oral communication skills 4) Individual Decision making 5) Excellent hands on skills in MS Office particularly Excel and PowerPoint 6) Ability to manage a variety of cross-functional team members 7) Should be flexible with night Shifts 8) Should not have any standing Arrears or Backlogs. 9) Should be interested to work in Bangalore Location 10) Basic Email etiquette 11) Logical Thinking Ability Interview Location / Walk in Venue: HCL Technologies Limited, Bangalore Special Economic Zone,129, Tower 4 Ground Floor, Cafetaria 1, Bommasandra Jigani Link Road, Jigani, Bommasandra Industrial Area, Bengaluru - 562 106 Walk in Dates: 22nd & 23rd February 2020 (Saturday & Sunday) Time: Between 10 am to 2 pm Contact HR: Mr. Omkharthick & Mr. Vagesh (Please walk in on time to avoid any inconveniences as entry would be restricted after the given timings)","location":"Bangalore","experience":"0 - 2 Years"},{"date":"25 - Feb - 2020","skills":"service quality, customer service orientation, back office processing","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"HCL Technologies Limited, 1st Floor Pioneer Square, Building, Sector 62, Near Rapid Metro Station 55-56, Gurgaon, Haryana","phone":"9599555476","profile":"Backend Process Executive \nHCL Technologies Limited","description":"Career Opportunity in Insurance Industry for Non Technical Graduate fresher, with HCL Technologies Limited- Business Services for the profile of Customer Service Executive (Back Office Process). Educational Requirement: BBA, BA, B Com, B.SC Graduates (Only 2016/ 2017/ 2018 ,2019 and 2020 Pass-outs are eligible for this opening) Note: Technical graduates / Regular MBA's are not eligible for this opening. Work Experience: Freshers / Maximum 6 months experience Skill Set Required: Good typing speed (25 wpm with 80% Accuracy). Strong commitment to customer service and quality Excellent Keyboard Skills Demonstrates a strong customer service orientation. Takes responsibility to follow up with customers to ensure their needs and expectations are satisfied. Roles & Responsibilities:- Manage and update Insurance Member and Plan data on multiple systems. Enter new member data into excel and enrollment forms. Processes customer requests in a timely and accurate manner. Communicates with customers through written correspondence. Using PC application and functions such as Excel and Word to update and load data sets. To answer queries coming from end user customers in a polite and professional manner. Shifts : 24*7 (Rotational) Salary: Upto 2.50 LPA Job Location: Gurgaon Please Walk in for a face to face Interview Interview Date: 25th February' 2020 Timings - 11 AM to 3 PM Interview Venue:- HCL Technologies Limited 1st Floor Pioneer Square, Building, Sector 62, Near Rapid Metro Station 55-56, Gurgaon, Haryana Contact Person: HR Yogendra Contact Number 9599555476 Please write Yogendra Singh Bisht on the top of your resume for entry. Need to Carry: Updated CV, All education certificates (Original & Xerox copy) & Govt address / ID proof. Please Note: Don't carry laptop or any other storage device...!","location":"Gurgaon","experience":"1 - 4 Years"},{"date":"22, 24, 25, 26, 27, 28 - Feb - 2020","skills":"Back Office Operations, Non Voice Process, Client Support, Customer Service","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"GENPACT India Private Limited, Stellar Building, Sector 134, Noida. Nearest Metro Station: Botanical Metro station","phone":"8077360738","profile":"Backend Process Executive \nGENPACT India Private Limited","description":"GENPACT India Private Limited is conducting walk-in drive for Backend/ Non-Voice Process Executive Education Qualification: Any Non-tech Graduate can apply for this requirement. Fresher's are eligible to apply Preferred Qualifications: Good analytical and problem solving skills Prior experience in Banking or Insurance Ability to communicate verbally and through emails with businesses Responsibilities: Transcribe inventories into Excel. Research and determine Like Kind Quality replacements Input appropriate categories, depreciation and pricing sources Insurance/ Banking exposure. Job Location: Noida/ Gurgaon Shifts: 24*7 Your role will require you to utilize your knowledge in the insurance and reinsurance fields to manage and process transactions, interact with clients, manage processes and data, and improve processes. Walk-in Date: 22nd till 28th February 2020 Interview timings- 11 am to 2 pm Interview Location: GENPACT India Private Limited Stellar Building, Sector 134, Noida Nearest Metro Station: Botanical Metro station Contact Person : Surbhi 8077360738; Whatsapp incase of queries Please mention 'Hr Surbhi' on top of the resume and directly walk-in at the venue. Documents to be carried: 2 UPDATED COPIES OF RESUME ORIGINAL AADHAR And PAN CARD IS MANDATORY 2 XEROX COPIES OF ID PROOF 2 PASSPORT SIZE PHOTOGRAPHS LAST 3 MONTHS PAY SLIPS ( IF ANY )","location":"Noida","experience":"2 - 4 Years"},{"date":"21, 22, 24, 25, 26, 27, 28, 29 - Feb - 2020","skills":"Front office, Front Desk/ Receptionist Activities","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Poorvika Mobiles Private Limited, AGR Platina, No. 32, Developed Plot NP (Near Jaya TV) SIDCO Industrial Estate Ekkaduthangal, Chennai-600032","phone":"Not Provided","profile":"Front Office Executive \nPoorvika Mobiles Private Limited","description":"Candidate should be Any Graduate with proven experience as front desk representative, agent or relevant position Excellent knowledge of MS Office (especially Excel and Word) Age: 21 to 30 Years Must be Proficient in English (oral and written) Strong communication and people skills Customer service orientation Job Responsibility- Keep front desk tidy and presentable with all necessary material (pens, forms, paper etc.) Greet and welcome guests Answer questions and address complaints Answer all incoming calls and redirect them or keep messages Receive letters, packages etc. and distribute them Prepare outgoing mail by drafting correspondence, securing parcels etc. Check, sort and forward emails Monitor office supplies and place orders when necessary Keep updated records and files Monitor office expenses and costs Take up other duties as assigned. Walk-in Date/ Time: 21st - 29 February 2020, 11 AM onwards Interview Venue: Poorvika Mobiles Private Limited AGR Platina, No. 32, Developed Plot NP (Near Jaya TV) SIDCO Industrial Estate Ekkaduthangal, Chennai-600032 Contact Person- Senthil","location":"Chennai","experience":"0 - 2 Years"},{"date":"21, 22, 24, 25, 26, 27, 28, 29 - Feb - 2020","skills":"General Administration, Secretarial Activities, Personal Assistance","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"DWARAKA HONDA (Unit of SDP Motors Private Limited) 4-8-137/2, Opposite Pillar No. 147, Attapur Main Road, Rajendra Nagar, Hyderabad.","phone":"Not Provided","profile":"Administration Executive \nSDP Motors Private Limited","description":"Educational Qualification: Any Graduate Work Experience: 2 to 8 Years Job Location: Hyderabad The administrative executive would be responsible for providing personalized secretarial and administrative support to the executive in a professional and timely manner. The administrative executive works one-to-one with the executive for the Organization. Walk-in Date/ Time: 21st February - 29 February , 10 AM onwards Interview Venue: DWARAKA HONDA (Unit of SDP Motors Private Limited) 4-8-137/2, Opposite Pillar No. 147, Attapur Main Road, Rajendra Nagar, Hyderabad. Contact Person- Mr. Rexmartin","location":"Hyderabad","experience":"2 - 8 Years"},{"date":"21, 22 - Feb - 2020","skills":"General Administration, Office Management, Front Office","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"SNN Builders Private Limited, #4, Elephant Rock Road 2nd floor, 3rd Block, Jayanagar Bangalore.","phone":"080-40222201","profile":"Front Office Executive \nSNN Builders Private Limited","description":"Designation : Front Office Executive Educational Qualification : Any Graduate Work Experience : 0 to 3 Years Communication : Kannada & English Walk-in Date/ Time: 18th - 22nd February 2020, 10 AM onwards Interview Venue: SNN Builders Private Limited #4, Elephant Rock Road 2nd floor, 3rd Block, Jayanagar Bangalore. Contact Person: Amrutha Devanga Contact No. 080-40222201","location":"Bangalore","experience":"0 - 3 Years"},{"date":"27 - Feb - 2020","skills":"Office Assistance, Receptionist Activities, Back Office Operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"N. A. Shah Associates LLP, B 21-25, Paragon Centre, Pandurang Budhkar Marg, Prabhadevi, Mumbai, Maharashtra - 400 013.","phone":"Not Provided","profile":"Admin/ Front Office Executive \nN. A. Shah Associates LLP","description":"Candidate should be Any Graduate with 2 to 5 years of experience in Handling reception related duties, acting as a support to the Administration team. Greet and welcome guests as soon as they arrive at the office. Direct client/ visitors to the appropriate person and make them sit in the respective cabin or meeting room. Answer, screen and forward incoming phone calls. Ensure reception area is tidy and presentable, with all necessary stationery and material (e.g. pens, forms and brochures) Provide basic and accurate information in-person and via phone/email. Receive, sort and distribute daily courier. Perform other clerical receptionist duties such as ordering food to client, passing on the information to office boys for water, tea - coffee, etc. for clients / guests. You will have access to confidential information, requiring absolute discretion at all times. The firm is a busy organization with back to back meeting and at times conflicting priorities. Walk-in Date/ Time: 27th February 2020, 11 AM onwards Interview Venue: N. A. Shah Associates LLP B 21-25, Paragon Centre, Pandurang Budhkar Marg, Prabhadevi, Mumbai, Maharashtra - 400 013. Contact Person- Aarti","location":"Mumbai","experience":"2 - 5 Years"},{"date":"22 - Feb - 2020","skills":"C/ C++, C#, VB, OOPS concepts","qualification":"B.E./B.Tech","address":"Ernst & Young Services Private Limited, The Oval Office, 18, iLabs Centre, Madhapur, Hyderabad, Andhra Pradesh - 500 081","phone":"Not Provided","profile":"Trainee Engineer - B.Tech fresher's \nErnst & Young Services Private Limited","description":"Candidate should have Bachelors degree in Computer Science/ Engineering, Information Technology/ Systems or Information Security related fields with no backlogs. Should have 0 to 2 years of relevant experience in consulting/ advisory work, specifically in areas of digital forensics or law enforcement will be favourably considered Knowledge and experience in the following areas required: i) Memory, Network and Application forensics ii) Network protocols & security iii) Strong SQL querying skills (Joins, SPs, functions, etc) iv) Programming: C, C++, C#, VB, OOPS concepts v) Sound technical understanding of computer system hardware, storage devices, including hard drives, personal storage devices, tape systems and other archiving systems If interested and not been interviewed in last 3 Months then kindly attend the walk-in drive between 9 AM -11:00 AM on 22nd February at the below mention address- Ernst & Young Services Private Limited The Oval Office, 18, iLabs Centre, Madhapur, Hyderabad, Andhra Pradesh - 500 081","location":"Hyderabad","experience":"0 - 2 Years"}]}