{"Walkins":[{"date":"9, 10, 11, 12, 13, 15, 16, 17, 18 - Jul - 2019","skills":"Php, CMS, WordPress/ Joomla/ Drupal","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"AISCOR Private Limited, Office No. 202, Suratwala Mark Plazzo, Opposite Hinjewadi Reliance Digital, Hinjewadi, Pune - 411 057","phone":"8555884622","profile":"Web/ Php - CMS Engineer \nAISCOR Private Limited","description":"Candidate should have 1 to 3 years experience working with WordPress/ Joomla/ Drupal. Must have extensive strong working knowledge and experience in PHP and CMS Application Developments and Responsive Designs. Theme development and plugin implementation is a plus Knowledge of Shopify, Wix, Squarespace and Weebly is a plus Good skills and knowledge of Ajax, JScript, Jquery, Json and HTML 5 & CSS3 Better to have Experience/ Knowledge working in Agile Methodology/ Environments Knowledge in MVC Frameworks is a plus Extensive experience writing high quality code or programming and development while applying new techniques to meet business and project goals is crucial. Good Documentation skills and matching code with design solutions that are easy to manage, maintain, customize (themes/ layouts) and configure Ensuring overall responsibilities: reliability, security, availability and high-performance code of solutions Walk-in Date: 8th -18th July 2019 Timing: 11 AM to 4 PM Interview Venue: AISCOR Private Limited Office No. 202, Suratwala Mark Plazzo, Opposite Hinjewadi Reliance Digital, Hinjewadi, Pune - 411 057 Contact No. 8555884622","location":"Pune","experience":"1 - 3 Years"},{"date":"9, 10, 11, 12, 13 - Jul - 2019","skills":"Customer Support, Customer Handling, Process, Voice Process","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Tech Mahindra Limited, A8A, 7th floor, Knowledge Boulevard, Sector-62, Noida.","phone":"7075354583","profile":"Customer Support - Voice Process \nTech Mahindra Limited","description":"We are hiring experienced for E-Commerce Project (Customer Support - Voice Process) Only Day shift & 5 days working . Job Criteria:- Should have minimum 1 year experience in BPO industry Should have handsome experience in handling the domestic premium/ International customers Should have excellent communication skills Should be a Graduate (Any) Job Responsbility:- Voice Inbound Process. Have to handle customer's queries and help them with the right feedback. Rotational day shifts (B/w 9am -9pm any 9hrs) 2 Rotational Weekly off 5 days working Walk-in Date: 9th - 13th July 2019 Time: 10.30 am to 3 pm Venue: Tech Mahindra Limited A8A, 7th floor, Knowledge Boulevard, Sector-62, Noida. Landmark - Beside IMS College (Nearest Metro Station - Electronic city). Contact: Mr. Kiran - 7075354583 Please mention my name (Kiran) on the top of your CV.","location":"Noida","experience":"1 - 6 Years"},{"date":"9, 10, 11, 12, 13, 15 - Jul - 2019","skills":"PHP with CodeIgnitor","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Brainers Commercial Private Limited, A-105, 3rd Floor Sector 63, Noida","phone":"Not Provided","profile":"PHP Developer - Codeignitor \nBrainers Commercial Private Limited","description":"Candidate should have good hand on experience as Developer - PHP with CodeIgnitor. Must have expert level knolwdge/ experience on Database, Admin UI, Middleware and API. Walk-in Date/ Time: 9th - 15th July , 11 AM onwards Intervierw Venue: Brainers Commercial Private Limited A-105, 3rd Floor Sector 63, Noida","location":"Noida","experience":"2 - 7 Years"},{"date":"8, 9, 10, 11, 12, 13, 15, 16, 17, 18 - Jul - 2019","skills":"PHP, JavaScript, PostgreSQL/ MySQL, CMS - Opencart","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Kompanyservices.com, 14/4A, Second Avenue, Sundar Nagar, Ekkaduthangal, Defece Colony, Chennai - 32","phone":"86828 04944","profile":"PHP Developer \nKompanyservices.com","description":"Candidate should have Degree in Computer Science or related field, or equivalent combination of education and experience from which comparable skills and abilities can be acquired; Intermediate experience in the following: o Scripting Languages: PHP, JavaScript o Operating Systems: Mac OS X and Linux o Databases: PostgreSQL/ MySQL o CMS - Opencart, Highly skilled, detail-oriented developer well-versed in Object Oriented Programming and best practices with the ability to re-architect, code, test, and debug existing applications and learn new technologies; Hands-on programming experience with PHP frameworks such as Laravel and Silverstripe, Javascript UI libraries such as Vue and React, RESTful JSON APIs, unit testing (PHPUnit, Dusk, Mockery, Faker), Docker containers, and version control (Git); must be able to show development skills with at least 3 URLs and 2-4 years building and supporting web applications (concept to completion); Walk-in Date/ Time: 8th - 18th July, 2019, 10 am Onwards Interview Venue: Kompanyservices.com 14/4A, Second Avenue, Sundar Nagar, Ekkaduthangal, Defece Colony, Chennai - 32 Contact Person: Mr Narendra Tel: 86828 04944","location":"Chennai","experience":"2 - 4 Years"},{"date":"8, 9, 10, 11, 12 - Jul - 2019","skills":"Core PHP, CI, Drupal, Laravel, CMS and Frameworks.","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Cyfuture India Private Limited, Plot No. 197-198, Phase-2, Block-A, Near Sector 82, NSEZ-Noida","phone":"Not Provided","profile":"Core PHP Developer \nCyfuture India Private Limited","description":"Required Skills- Proficient in Core PHP, CMS and Frameworks. Knowledge on CI, Drupal, Laravel will be an added advantage. Should have good communication skills. Should have strong logical, programming, problem solving and analytical skills. Working experience on Good or Large projects. Should be able to deal with clients diligently. Technical Skills: Making projects on PHP (5 & 7), CMS and frameworks. Working on large scale projects. PHP, Wordpress, CI, Drupal, Java Script, Jquery, MySql, AngularJs/ NodeJs will be an additional advantage. Should know how to integrate third party APIs, Has work experience on Linux platform Working Days- 5.5 Days(2nd and 4th sat. off) Shift Timings- General Morning Shift (Shuttle Facility Available) Days of Interview- 8th - 12th July Time- 10 am to 3 pm Interview Venue- Cyfuture India Private Limited Plot No. 197-198, Phase-2, Block-A, Near Sector 82, NSEZ-Noida","location":"Noida","experience":"2 - 5 Years"},{"date":"9 - Jul - 2019","skills":"PHP Fresher/ Interns","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Mayron Digital Networks, 134 ; 135 Karthik Nagar, Doddanekundi, Bangalore - 560 037","phone":"9513632352","profile":"PHP Developer - Intern \nMayron Digital Networks","description":"Mayron Digital Networks is hiring PHP Developer/ Interns for Bangalore location Job Responsbility- Write clean, well-designed code Produce detailed specifications Troubleshoot, test and maintain the core product software and databases to ensure strong optimization and functionality Contribute in all phases of the development lifecycle Walk-in Date/ Time: 9th July 2019, 9 AM onwards Interview Venue: Mayron Digital Networks 134 ; 135 Karthik Nagar, Doddanekundi, Bangalore - 560 037 Contact no: 9513632352/ 9513114031","location":"Bangalore","experience":"0 - 1 Years"},{"date":"8, 9, 10, 11, 12 - Jul - 2019","skills":"Core PHP, MySQL, Bootstrap, MVC Architecture","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Digi Style, D-244, Second Floor, Sector-10 Near Swani Furniture, Noida","phone":"Not Provided","profile":"PHP Developer \nDigi Style","description":"Work Experience- 2 to 4 Years Strong understanding and hold on working with Core PHP. Excellent knowledge about Core PHP, MySQL, Bootstrap Excellent command on PHP and MySQL using MVC Architecture. Expertise on PHP based framework like: codeigniter, laravel, etc... Required Skills Ability to adjust schedules to meet deadlines will be crucial. Must be self-motivated and take responsibilities for his/her own deliverables. Excellent written and verbal communication skills Ability to manage multiple projects & lead the development effort while meeting deadlines and maintaining high-quality results Good analytical, reasoning, logical and troubleshooting skills Walk-in Date/ Time: 8th - 31st July, 11 AM onwards Interview Venue: Digi Style D-244, Second Floor, Sector-10 Near Swani Furniture, Noida","location":"Noida","experience":"2 - 4 Years"},{"date":"8, 9, 10, 11 - Jul - 2019","skills":"PHP, HTML, CSS, Wordpress, Angular, SQL/ MySQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"MS Technology Private Limited, 2, Community Centre, IInd Floor, Basant Lok, Vasant Vihar New Delhi - 110 057","phone":"011-41669396","profile":"Php/ Web Developer \nMS Technology Private Limited","description":"Candidate should have 2 to 3 years of experience with PHP, HTML, CSS Familiarity with Wordpress and Angular, Python or Node.js SQL/ MySQL database experience is required Bootstrap and or Material Design Comfortable jumping in to unfamiliar frameworks/ codebases Experience using version control systems Web optimization Walk-in Date/ Time: 8th July - 11th July , 11 AM onwards Interview Venue: MS Technology Private Limited 2, Community Centre, IInd Floor, Basant Lok, Vasant Vihar New Delhi - 110 057","location":"Delhi","experience":"2 - 3 Years"},{"date":"10 - Jul - 2019","skills":"Technical Helpdesk, Service Desk, Admin/ Back office Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Allied Digital Services Limited, 13 th floor Unit 22 Bengal Eco Intelligence Park EM Block, Sector 5, Saltlake Kolkata - 700 091","phone":"7304555012","profile":"Technical Support/ Coordinator \nAllied Digital Services Limited","description":"Candidate should be Any Garduate with 1 to 3 years of experience in Technical Helpdesk, Service Desk, Admin/ Back office Support. Must have excellent communication skills Roles & Responsibilities: Monitor IT Helpdesk ticketing tool and allocate tickets to respective locations IT support person Follow-up with location IT Support person till ticket closure Follow-up with third party vendors for IT Support related calls (like Warranty, AMC, MPS vendors etc..) Coordinate between Location IT Support team and AD,Gmail, AV & Network admins Extract daily/ weekly/ monthly/ quarterly SLA reports for IT Services tickets and reports on User feedback Prepare/update documents/ ppts for end user support on using ITSM tool Participate in Monthly review meetings to highlight on the issues and possible solutions to improve IT Services Walk-in Date/ Time: 10th July 2019, 10 AM onwards Interview Venue: Allied Digital Services Limited 13 th floor Unit 22 Bengal Eco Intelligence Park EM Block, Sector 5, Saltlake Kolkata - 700 091 Landmark: Beside Techno India College Campus.","location":"Kolkata","experience":"1 - 3 Years"},{"date":"9, 10, 11, 12, 13 - Jul - 2019","skills":"Customer Care, Customer Support, Helpdesk","qualification":"Diploma, B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"IGT Solutions Private Limited, Purva Primus, OMR, Okkiyam, Next to Reebok show room Thoraipakkam, Chennai - 600 097","phone":"0124-4587309","profile":"Customer Support Associate \nIGT Solutions Private Limited","description":"Education Qualification: 10+2/ Graduate/ Post Graduate in any discipline Candidate must be fluent in English and Hindi (Mandatory) Should be ready to work in 24*7 Age: 18-30 Years Only Job Responsbility- Project handles End to end airline operation. Inbound customer support. Flight Reservations, Bulk bookings, Re-booking, Web site support, Email management for all corporate and travel agent queries. Free travel post completion of 6 months & Employee eligible for IJP after 9 months Walk-in: Mon to Sat Timing: 10:00 AM 5:00 PM Venue: IGT Solutions Private Limited Purva Primus, OMR, Okkiyam, Next to Reebok show room Thoraipakkam, Chennai - 600 097 Contact Person: Meenakshi Ghildiyal Contact No: 0124-4587309","location":"Chennai","experience":"0 - 2 Years"},{"date":"10 - Jul - 2019","skills":"Technical Support, Email Support, International Voice Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"4th Floor, Cognizant ISH Office, Hinjewadi Phase 1 Pune - 411 014","phone":"Not Provided","profile":"Technical Support Associate \nCognizant Technology Solutions India Limited","description":"Cognizant Technology Solutions India Limited, is looking for experienced professionals for International Voice Process - Pune Location. Skill : International Voice Process (Tech Support) Designation : Senior Process Executive (SPE) Salary Package : 4.2 LPA + Night shift allowance + Cab facility Shift : US Shift timing (Shift allowance will be provided) Educational Qualification : Any Graduate Work Experience : 1 - 3 Years Job Location : Pune Candidates with excellent communication are only applicable for this process Candidates with Provisional certificate / Degree Certificates are only applicable UG is mandatory (Candidates with standing arrears are not eligible) Candidate must have completed 10+2+3/4 education system. Only candidates interested to work in International Voice Process and willing to work in night shifts are eligible for this process Interview Date : July 10th 2019, (Wednesday) Time : 12PM - 2PM Interview Location : 4th Floor, Cognizant ISH Office, Hinjewadi Phase 1 Pune - 411 014 Point of Contact : Jash (HR) Mode of Interview : Face to Face Note : Candidates who have recently taken up interview at Cognizant are not eligible. Referrals are invited","location":"Pune","experience":"1 - 3 Years"},{"date":"9 - Jul - 2019","skills":"Customer Care, Customer Support, Voice Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Teleperformance Global Services Pvt. Limited, 1st Floor, Kudlu Gate, Bangalore - 68. Landmark - Behind Hyundai Showroom","phone":"8658172220","profile":"Customer Support (Voice Process) \nTeleperformance Global Services Pvt. Limited","description":"Teleperformance Global Services Pvt. Limited is hiring candidates for Voice Process for Bangalore location. Eligibility Criteria- Fresher and Experienced both can apply. Graduates and Under-Graduates both are eligible. Good communication in Gujarati and English Work Location- Bangalore Shifts- Day/ Rotational Interested candidates can directly walk-in to the above mentioned address- Walk-in Date- 9th July 2019 Time- 10.00 am - 3 pm Interview Venue: Teleperformance Global Services Pvt. Limited 1st Floor, Kudlu Gate, Bangalore - 68 Landmark - Behind Hyundai Showroom And Near to Ekka Hotel Contact Person- HR Neha - 8658172220","location":"Bangalore","experience":"0 - 2 Years"},{"date":"9 - Jul - 2019","skills":"Automation Testing, ETL Testing, SQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Navigant BPM (India) Private Limited, 3rd Floor Bhavani Building Technopark Trivandrum, Kerala","phone":"Not Specified","profile":"Manual/ Automation Tester \nNavigant BPM (India) Private Limited","description":"Candidate should have 3+ Years in SQL/ ETL Testing 3+ Years in Selenium/ Cucumber Walk-in Date: 9th July 2019 Timings: from 9 AM onwards Interview Venue: Navigant BPM (India) Private Limited 3rd Floor Bhavani Building Technopark Trivandrum, Kerala Contact Person: Bindu/ Anoop","location":"Trivandrum","experience":"3 - 6 Years"},{"date":"14 - Jul - 2019","skills":"Software Testing, Writing Test Cases Test Engineering Product Development product design Ios Development","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Disha Info Labs Private Limited (Quick Ride), #96, First floor, 3rd Cross, Behind Coffee Lounge, Opposite Marathahalli Kalamandir service road, RJ Garden, Marathahalli, Bengaluru, Karnataka 560037","phone":"8197556770","profile":"Software Testing - Freshers \nDisha Info Labs Private Limited (Quick Ride)","description":"Disha Info Labs Private Limited (Quick Ride) is conducting walk-in drive on 14 July, 2019 Freshers required. B.E/ MCA/ M.Sc with CS/ IT/ ECE (2019 Passouts) Min. Eligibility : 65% and above academics through out from 10th to Graduation. Excellent Java Programming skills is required. Work Location: Marathahalli, Bangalore Need very good at Programming and keen to work in Product development start-up for minimum 2 years, then candidate can come over for walk-in discussion. Walk-In Date- 14 July 2019 Timing: 9 AM to 11 AM Interview Venue: Disha Info Labs Private Limited (Quick Ride) #96, First floor, 3rd Cross, Behind Coffee Lounge, Opposite Marathahalli Kalamandir service road, RJ Garden, Marathahalli, Bengaluru - 560 037 Interview Process for Developer 1. Written Test( Aptitude, Technical) 2. Java Programming 3. Managerial Round 4. Final round Interview Process for Test Engineer 1. Written Test( Aptitude, Technical) 2. Finding bugs on mobile app , writing test cases 3. Managerial Round 4. Final round For applying go back to reference id in Contact details and fill the link https://forms.gle/ffee5fmMZDFe8kFN9 For further query feel free to call: 8197556770","location":"Bangalore","experience":"0 - 1 Years"},{"date":"8, 9, 10, 11, 12, 15, 16, 17, 18, 19 - Jul - 2019","skills":"Automation Testing, Web Services Testing, Rest SOAP, Test Cases, Automation Tools","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"PurpleTalk India Private Limited, Plot No. 11, 12th Floor, Watermark Techno Park, Survey No. 9, Whitefields, Kondapur, Hyderabad, Telangana - 500 084","phone":"Not Provided","profile":"QA/ Automation Tester \nPurpleTalk India Private Limited","description":"Experience Range: 3 - 6 Years Experience in using test automation tools specifically that runs on javascript like Protractor, Cucumber, etc. Experience testing web services (SOAP/ REST; Throughput, Performance under Load, etc.) Experience testing hosted or SaaS-based solutions. Familiar with relational database design and good working knowledge of SQL for querying, updating, and deleting data. Strong proficiency with functional, regression, performance and stability testing techniques. Job Responsibilities: Understand the role of testing within the software development life cycle and business-related project constraints in web and mobile developments. Develop, implement and execute test plans and scripts to address business and technical use cases. Ability to review and improve test coverage. Able to manage a small team of QA. Able to perform web services testing. Research and document bug reports following agreed-upon processes immediately upon discovery of a quality problem. Walk-n Date/ Time: 8th - 19th July 2019 from 2 PM onwards Interview Venue: PurpleTalk India Private Limited Plot No. 11, 12th Floor, Watermark Techno Park, Survey No. 9, Whitefields, Kondapur, Hyderabad, Telangana - 500 084","location":"Hyderabad","experience":"3 - 6 Years"},{"date":"13 - Jul - 2019","skills":"Java, Selenium Webdriver Python","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Please share your updated resume to register yourself for the recruitment Drive on 13th July 2019.","phone":"Not Provided","profile":"QA - Automation Tester \neInfochips Limited","description":"Candidate should have experience with Python/ Java scripting language Develop automation scripts for user interface, embedded components, and application software components Good to have working experience with Mobile device automation Good to have experience in any unit test framework Having worked on Test case management and issue tracking systems. Support team to implement continuous integration and automated overnight build testing Support automation framework enhancements Experience working with Embedded product automation Linux/ Unix working experience. Experience with source code management (SCM) tools (Subversion, Git) Demonstrate strong troubleshooting and root cause analysis skills Strong oral and written communication skills. Please share your updated resume to avishek.mukherjee@einfochips.com to register yourself for the recruitment Drive on 13th July 2019.","location":"Ahmedabad","experience":"2 - 7 Years"},{"date":"13 - Jul - 2019","skills":"Selenium, QA, Automation/ Manual Testing, Mobile Application Testing","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Unlimited Innovations India Pvt. Limited, MCM Towers, 5th Floor, SIDCO Industrial Estate Guindy, Chennai - 600 032. Landmark: Next to RR tower III","phone":"044-61001910","profile":"Senior QA/ Testing Engineer \nUnlimited Innovations (India) Pvt. Limited","description":"Candidate should have 3+ years of quality analyst/ software testing 1 + year in Selenium. Responsible for preparation of test plan, test cases and maintenance of other QA documentation. Experience in Automated Regression, Load and unit testing frameworks. Be able to proactively generate ideas and scenarios for guiding solution improvements Experience in automation testing tools like selenium with C# is preferred. 1+ year experience in testing of Mobile applications (iOS/Android/ Xamarin/ Flutter) using any tool is added advantage. Self-motivated, resourceful and able to conduct in-depth research as required. Work at a high level of efficiency, eye for detail and accuracy Strong personal ownership of problem resolution. Excellent collaborative and communication skills. Flexible to work during late evenings Energetic and self- motivated team player. Walk-in Date/ Time: 13th July 2019, 10 AM onwards Interview Venue: Unlimited Innovations India Pvt. Limited, MCM Towers, 5th Floor, SIDCO Industrial Estate Guindy Chennai - 600 032 Landmark: Next to RR tower III","location":"Chennai","experience":"3 - 7 Years"},{"date":"9 - Jul - 2019","skills":"Quality monitoring, Quality Analysis, Customer Service","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Majorel India, Plot No.-444, Udyog Vihar Phase-5, Gurgaon","phone":"Not Provided","profile":"Quality Analyst (Travel Process) \nBertelsmann Marketing Services India Pvt. Limited","description":"Know & understand operational KPIs, ability to drive them through Quality Active participation in internal and external calibrations Preparing training materials for buzz sessions, quality breaks. Conducting Quality breaks, Buzz sessions, up training and Agent Round Tables Achieve minimum production target on a weekly basis to stay in touch with the product Assist the front-line team by taking over escalated calls where necessary Through relevant & timely reports communicate performance related indicators into the team and back to the Management To participate in all front line activities to maintain/enhance knowledge of product Meet or exceed Transaction Quality Target as set by the Client/Business Amadeus Experience required for min 1 yr Interested candidates can send their resume at kanika.sharma@majorel.biz OR WALK-IN directly at- Address: Majorel India, Plot No.-444, Udyog Vihar Phase-5, Gurgaon Contact Person: Kanika sharma Timings : 12 am to 5 pm","location":"Gurgaon","experience":"1 - 5 Years"},{"date":"9 - Jul - 2019","skills":"Selenium & Manual Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Velcro Technologies Private Limited, Kritika Layout, Plot 12, Opposite Image Gardens, Karnataka Bank Complex, 1st floor Madhapur, Hitech Cty, Hyderabad - 500 081","phone":"9393959799","profile":"Software Testing Engineer \nVelcro Technologies Private Limited","description":"Qualification: BE/ B.Tech/ M.Tech/ MCA Work Experience: 0 to 3 Years Skills Set : Selenium & Manual Testing Interview Date 9th July 2019 Time 10.00 Am -12.00 Pm Interview Venue: Velcro Technologies Private Limited Kritika Layout, Plot 12, Opposite Image Gardens, Karnataka Bank Complex, 1st floor Madhapur, Hitech Cty, Hyderabad - 500 081 Contact Mounika Call Num 9393959799 (For More Clarifications)","location":"Hyderabad","experience":"0 - 3 Years"},{"date":"13 - Jul - 2019","skills":"Software Testing, Black Box Testing, Quality Engineering, White Box Testing, Test Cases, Product Testing","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Seclore Technology Private Limited, Excom house, 2nd floor, Saki Vihar Road Behind HP petrol pump, Sakinaka, Mumbai - 72","phone":"022-61304200","profile":"Software Testing Engineer \nSeclore Technology Private Limited","description":"Be hands-on in generating precise and concise test plan/scenarios and test cases Have experience in transforming business requirements to create test plans/cases Have participated in full life-cycle of a development project interacting with teams of developers and testers Have involved in preparing the test plans for a release Be familiar with testing of either of system software or web based products or both. Have executed test cases (both regression and new functionality) within timescales against plan Be familiar with defect tracking tools Be familiar with the documentation of testing related artifacts As a quality engineer, you would be responsible for the following activities: Product testing 1. Drafting concise test cases from the requirements of a product release. 2. Ensure product quality at the end of a release cycle by understanding the product features. 3. Will be responsible for conducting product testing (including all aspects like Black box, White Box, integration, regression, stress and other forms of testing) for each release cycle. 4. Might be required to work on multiple testing projects at the same time. 5. Collaborate closely with the development teams in tracking defects, to closure 6. Responsible for updating testing artifacts related to testing based on product modifications and changes in spec. Walk-in Date: 13th July 2019 Time: 11 am - 2 pm Interview Venue: Seclore Technology Private Limited Excom house, 2nd floor, Saki Vihar Road Behind HP petrol pump, Sakinaka, Mumbai - 72","location":"Mumbai","experience":"2 - 4 Years"},{"date":"8 - Jul - 2019","skills":"General Administration, Office maintenance and AMC, Back Office Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Modi Infosol Private Limited, B-38, Okhla Phase-1, New Delhi - 110020","phone":"011-40746900","profile":"Administration Executive \nModi Infosol Private Limited","description":"Candidate should be Any Graduate with 2 to 6 years of experience in General Administration, Office maintenance and AMC, Back Office Management. Must have excellent communication skills Job Responsbility- Manage office supplies stock and place orders Prepare regular reports on expenses and office budgets Maintain and update company databases of office equipments Office maintenance and AMC's management Liaising with authorities. Walk-in Date/ Time: 8th July , 11 AM onwards Interview Venue: Modi Infosol Private Limited B-38, Okhla Phase-1, New Delhi - 110020 Phone No: 011-40746900","location":"Delhi","experience":"2 - 6 Years"},{"date":"8, 9, 10, 11, 12, 13 - Jul - 2019","skills":"General Administration, Front Office/ Receptionist activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"R K Global Shraes & Securities Pvt. Limited, 6B, 6th Floor, 6 Tilak Marg, Sagar Apartments, Near India Gate, New Delhi - 110 001","phone":"011-46072337","profile":"Front Office/ Admin Executive \nR K Global Shraes & Securities Pvt. Limited","description":"Candidate should be Any Graduate with 1 to 4 years of experience in General Administration, Front Office/ Receptionist activities. Smart Female candidates only need to aaply Job Responsbility- To answer incoming calls and address the concerns Greet guests courteously Dispatch of inward and outward courior Supervising Security & Housekeeping Team Candidate would be doing front office plus admin role Walk-in Date/ Time: 8th - 13th July, 2019, 10 AM onwards Interview Venue: R K Global Shraes & Securities Pvt. Limited 6B, 6th Floor, 6 Tilak Marg, Sagar Apartments, Near India Gate, New Delhi - 110 001 (Nearest Metro Station - Mandi House)","location":"Delhi","experience":"1 - 4 Years"},{"date":"8, 9, 10, 11, 12 - Jul - 2019","skills":"Technical Support, Customer Service, Inbound and Outbound Support","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"360 Degree Cloud Technologies Pvt. Limited, SCO 11-12,Second Floor, Above Canara Bank, Sector-16, Faridabad","phone":"Not Provided","profile":"Java Developers/ Fresher \n360 Degree Cloud Technologies Pvt. Limited","description":"360 Degree Cloud Technologies Pvt. Limited is looking for Java Developers/ Freshers or upto 1 year experience Qualification: BCA/ MCA/ B.Tech/ M.Tech - Fresher student can apply. Candidate completed Java course are preferred. Walk-in Date: 8th - 12th July 2019 Interview Time:- 12:00 PM Onwards Interview Venue: 360 Degree Cloud Technologies Pvt. Limited, SCO 11-12,Second Floor, Above Canara Bank, Sector-16, Faridabad Nearest Metro Station:- Old Faridabad Contact person:- Yogesh","location":"Faridabad","experience":"0 - 1 Years"},{"date":"6 - Jul - 2019","skills":"Core Java, Spring framework, SQL/ PL SQL Queries, Stored Procedure","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Ness Technologies (India) Pvt. Limited, No. 33, 6th Block, 17 H Main Road, Koramangala, Bangalore - 560 095. Landmark: Near Apollo Cradle Hospital","phone":"Not Provided","profile":"Senior Java Developer \nNess Technologies (India) Pvt. Limited","description":"Candidate must have excellent Core Java programming skills (6+ years) including multi-threading; Practical experience of using the Spring framework (Spring Boot, Spring Batch, Spring Controllers); Good in writing SQL/ PL SQL Queries, Stored Procedures, Functions, SQL tools. Understands synchronous vs asynchronous communication must have worked on Kafka/Rabbit MQ or some messaging system Walk-in Date/ Time: 6th July 2019 from 9 AM onwards Interview Venue: Ness Technologies (India) Pvt. Limited No. 33, 6th Block, 17 H Main Road, Koramangala, Bangalore - 560 095. Landmark: Near Apollo Cradle Hospital","location":"Bangalore","experience":"6 - 8 Years"},{"date":"1, 2, 3, 4, 5, 6, 8, 9, 10, 11, 12, 13 - Jul - 2019","skills":"Payroll Process, Profession tax, Accounting, etc","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"TopSource Infotech Solutions Pvt. Limited, 3rd Floor ,Gamma 1, Giga Space, Viman Nagar, Opp. Maruti Showroom Pune - 411 014","phone":"Not Provided","profile":"India Payroll Executive \nTopSource Infotech Solutions Pvt. Limited","description":"We are looking for Payroll Professionals Freshers in TopSource. Any candidate who has 3 months of Payroll experience, who is good in communication and has desire to make a career in India Payroll is eligible to apply. Candidate must have 1 years of overall experience with at least last 3 months of Payroll experience. Preference would be given to candidates who have experience in worked for India payroll process. B.com background would be an added advantage Personal Characteristics Should have excellent written and spoken English. Motivated, self-starter individual with high level of integrity, intensity and activity with a can-do attitude. Disciplined process oriented work style Able to work effectively under pressure Ability to work equally well either independently or as part of a team Experience: 0.3 - 3 year Job Location : Pune Salary : As per Market standards Please don't call us if Interested then please Walk-In with updated resume from 1st July to 24th July 2019 between 12.30 PM and 7:30 PM) at the address mentioned below- TopSource Infotech Solutions Pvt. Ltd 3rd Floor ,Gamma 1, Giga Space, Viman Nagar, Opp. Maruti Showroom Pune - 411 014 Contact Person : Pawan Kumar Email id :pawan.burman@topsource.co.in *Kindly carry a copy of your updated resume when you visit us Note: 1) please ignore this email if you have already attended interview in TopSource in last 90 days. 2) Please ignore this email if the job advertisement mentioned above is not relevant to your profile. 3) Outstation candidates need to confirm their schedule by mailing at pawan.burman@topsource.co.in before coming for interview. We dont re-imburse travelling expenses)","location":"Pune","experience":"1 - 4 Years"},{"date":"6 - Jul - 2019","skills":"Java HTML XML CSS Javascript & JQuery Web Frameworks Spring SQL & PL SQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Equiniti India Private Limited, Block 10, 8th Floor, DLF IT Park, 1/124, Mt Poonamalle High Road, Ramapuram, Chennai, Tamil Nadu - 600 089","phone":"7358465533","profile":"Java Developers \nEquiniti India Private Limited","description":"BE/ ME/ MCA/ M.Sc. Computer Science with excellent track record. Should have good experience in developing application on Java Technology stack. Sound knowledge of OO design principles and patterns Work Experience : 2-4 Years Job Location : Chennai Should be a Team player with good interpersonal skills and a drive to take ownership of and responsibility for the tasks assigned to you. Ability to work calmly and methodically even under pressure. Good understanding of the Software Development Lifecycle. Should have appropriate level of expertise of using several of the following technologies: Java HTML XML CSS Javascript & JQuery Web Frameworks Spring SQL & PL SQL DB Server: MS SQL Resful services or web services mybatis/Hibernate IDEs NetBeans/Eclipse, MS SQL Studio JUnit / Integration and system testing Interested candidates can directly walk-in into the below mentioned address on 6th July 2019 (Saturday) : Equiniti India Private Limited Block 10, 8th Floor, DLF IT Park, 1/124, Mt Poonamalle High Road, Ramapuram, Chennai, Tamil Nadu - 600 089","location":"Chennai","experience":"2 - 4 Years"},{"date":"9, 10 - Jul - 2019","skills":"Front Office Reception Front Desk Administration","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"SpiceJet Limited, Plot No. 319, Udhyog Vihar, Phase-4 Gurugram, Haryana 122016","phone":"Not Provided","profile":"Front Office Executive \nSpiceJet Limited","description":"SpiceJet is conducting walk-in interviews for the position Front Office Executive - Administration in our Administration Department on 9th & 10th July ' 2019 from 10:00 am Till 12:00 noon (Tuesday & Wednesday) Designation: Front Office Executive - Administration ( Female Only) Department: Administration Location: Gurugram Educational Qualification: Graduate (Any Stream) REQUIRED SKILLS: Candidate should have prior experience in front desk customer experience Must have good verbal communication skills in both Hindi and English. JOB RESPONSIBILITIES: Attending Guest. Attending Calls Maintaining the reception area Take care of the courier entry Handling candidates for interviews. Coordination with departments internally Kindly report at the below mentioned address and do carry a copy of below listed documents: 1) PAN CARD 2) ADHAAR CARD/PASSPORT/VOTERS ID CARD 3) 10th, 12th & Graduation (Mark sheet/ Certificate) Age Criteria - 21 Yrs - 28 Years Dress Code - Formals Date - 9th July '19 & 10th July '19 (Tuesday & Wednesday) Timing -10:00 am -12:00 noon Venue - Plot No. 319, Udhyog Vihar, Phase-4 Gurugram, Haryana - 122 016","location":"Gurgaon","experience":"1 - 6 Years"},{"date":"9, 10, 11, 12 - Jul - 2019","skills":"front office front desk reception receptionist activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Cheers Interactive (India) Pvt. Limited, Millennium Business Park, Sector 3, Building # 4, Mahape, Navi Mumbai - 400710","phone":"022 6772 5700","profile":"Front Desk Executive/ Receptionist \nCheers Interactive (India) Pvt. Limited","description":"Candidate should be well-versed with MS Office & EPBAX / EPBX system Should be presentable & have good communication skills Job Responsbility- Greet and welcome guests as soon as they arrive at the office Direct visitors to the appropriate person and office Answer, screen and forward incoming phone calls Ensure reception area is tidy and presentable, with all necessary stationery and material (e.g. pens, forms, brochures etc.) Provide basic and accurate information in-person and via phone/email Receive, sort and distribute daily mail/deliveries Order front office supplies and keep inventory of stock Update calendars and schedule meetings Arrange travel and accommodations, and prepare vouchers Keep updated records of office expenses and costs Walk-in Date: 9th - 12th July 2019 Time : 10 am to 5 pm Interview Venue: Cheers Interactive (India) Pvt. Limited Millennium Business Park, Sector 3, Building # 4, Mahape, Navi Mumbai - 400710 Tel: 022 6772 5700","location":"Mumbai","experience":"1 - 6 Years"},{"date":"6 - Jul - 2019","skills":"Selenium Performance Testing Load Testing Functional Testing JMeter SQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Eurofins IT Solutions India Private Limited, Lemon Tree Hotels Limited Lemon Tree Premier, HITEC City Plot No. 2, Survey No. 64, HITEC City, Madhapur, Hyderabad - 500 081","phone":"Not Provided","profile":"Automation Test Engineer \nEurofins IT Solutions India Pvt. Limited","description":"TITLE: QA / Sr.QA Test Engineer Automation REPORTING TO: Manager WORKING LOCATION : Bangalore QUALIFICATIONS: BE/ MCA or any other equivalent degree 3 to 10 years of experience Experience in C#, Testing API/ Web Services, preferably REST Able to write scripts that deal with JSON parameterization Good understanding of SQL Experience in any automation tools: Selenium, Coded UI, UIA, etc. Strong preference to Selenium. Good to have: Exposure to Performance testing tools and processes LoadRunner, JMETER, Visual Studio Load Test, etc. Personal Qualities: Excellent analytical and problem solving skills Excellent verbal and written communication skills Successful teamwork experience Proven ability to transfer knowledge and stay aware of current trends and technical advancements Ability to articulate and present different points-of-views on various technologies Walk-in Date/ Time: 6th July 2019, 9 AM onwards Interview Venue: Eurofins IT Solutions India Private Limited Lemon Tree Hotels Limited Lemon Tree Premier, HITEC City Plot No. 2, Survey No. 64, HITEC City, Madhapur, Hyderabad - 500 081","location":"Hyderabad","experience":"0 - 10 Years"},{"date":"13 - Jul - 2019","skills":"Software Testng, Selenium, Java, Automation Testing, Rest, Test Cases, XML, Jenkins","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Carat Lane Trading Private Limited, No, 32, Khader Nawaz Khan Road, Thousand Lights West, Nungambakkam, Chennai, Tamil Nadu - 600 006","phone":"Not Provided","profile":"Software Engineer/ Tester \nCarat Lane Trading Private Limited","description":"Candidate should have minimum 3 to 5 years of experience in Web/ App Automation. Should have experience in writing automation test cases and implementing automation frameworks (Selenium, Appi, TestNG, RestAssured/ Httpclient). Must be proficient in Java and object oriented programming Good to have development experience Should have been part of automation solutions / test automation frameworks development Strong automation experience UI, API, Mobile app Experience with versioning systems (Subversion-SVN, Git / Git Hub) Experience with Continuous Integration (Jenkins , others ) Understanding of XML, JSON, REST, graphql etc and demonstrated experience with web services APIs Ability to learn new testing tools and approaches appropriate to the technologies being utilized Must be able to work independently and with minimum supervision Positive attitude towards taking new challenges. Good Problem solving and Analytical skills Walk-in Date/ Time: 13th July 2019, 9 AM onwards Interview Venue: Carat Lane Trading Private Limited No, 32, Khader Nawaz Khan Road, Thousand Lights West, Nungambakkam, Chennai, Tamil Nadu - 600 006","location":"Chennai","experience":"3 - 5 Years"},{"date":"6 - Jul - 2019","skills":"hr operationsrecruitmentemployee referralbanking operations","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Amazon Development Centre India Pvt. Limited, Orion Building, Ground floor, Bagmane Constellation Business Park, K. R. Puram - Marathalli Ring Road, Mahadevpura, Bangalore - 560 048","phone":"Not Provided","profile":"HR Operations Executive \nAmazon Development Centre (India) Pvt. Limited","description":"Join Amazons HR team and help make a difference for all Amazonians! We are recruiting for an Employee Services Sr. Associates based out of Bangalore, India. Roles that we are hiring for: - Sr Associate - Recruiting Services - Sr Associate - Screening Services - Sr Associate - Data Management - Sr Associate - Data Management, Leaves Eligibility Criteria : Work experience in any Operations or Corporate environment 1 to 6 years (Max) Minimum Qualification Graduate Excellent Communication Skills Flexible to work in night shifts and staggered week offs. Notice Period- Immediate to 1 month Mega hiring walk-in on 6th July, 2019, 10 AM 1 PM Venue: Amazon Development Centre India Pvt. Limited, Orion Building, Ground floor, Bagmane Constellation Business Park, K. R. Puram - Marathalli Ring Road, Mahadevpura, Bangalore - 560 048 Please bring along: Resume (Your login ID and Source as Employee Referral should be mentioned on top) original PAN & Adhaar Card Passport size photograph","location":"Bangalore","experience":"1 - 6 Years"},{"date":"10 - Jul - 2019","skills":"HTML, CSS, JavaScript, jQuery, C#, ADO .NET, Entity Framework core, ASP .NET MVC","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"G7CR Technologies India Private Limited, Mitra towers,3rd Floor, Kasturba Road, Ashoka Nagar, Bengaluru - 560 001","phone":"080-46414200","profile":"Software Engineer (ASP .Net) \nG7CR Technologies India Pvt. Limited","description":"Candidate must have minimum one year work experience in ASP .Net MVC, C#, Web API. Should create necessary documentations and perform unit test of the work. Design, Develop & Modify Microsoft ASP .NET, MVC applications, .NET components & Web services Design, Develop & maintain Microsoft SQL database schemas & scripts, including views, triggers & stored procedures. Work in a team environment using a structured development process & deliver applications on time. Technical Skills: HTML, CSS, JavaScript, jQuery, C#, ADO .NET, Entity Framework core, ASP.NET MVC, Microsoft SQL server, Web API, JSON, AJAX, Bootstrap. Development Tools: SSMS, Visual Studio 2013/ 2015/ 2017, Chrome Developer Tool Walk-in Drive/ Time: 10th July 2019, 10 AM onwards Interview Venue: G7CR Technologies India Private Limited, Mitra Towers, 3rd Floor, Kasturba Road, Ashoka Nagar, Bengaluru - 560 001 You can reach us on 080-46414200 or send email to richa.agrawal@g7cr.in for any other details.","location":"Bangalore","experience":"1 - 4 Years"},{"date":"6 - Jul - 2019","skills":"Software Testing, Manual Testing","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Amazon Development Centre (India) Pvt. Limited, Ground Floor, Infinity tower, Tata Ramanujam IT City SEZ, Rajiv Gandhi Salai, Near Tidal Park, Old Mahabalipuram Road, Taramani, Chennai - 600 113","phone":"Not Provided","profile":"Software Testing Engineer \nAmazon Development Centre (India) Pvt. Limited","description":"Amazon is hiring Associate, Quality Services for Chennai location, this is a Full Time Role related to Software device testing. Please find the below Job Description for the same and criteria to apply for this role. You may appear for the interview if you find yourself matching the below criteria. Eligibility: BE/ B Tech or BCA/ MCA/ BSC/ MSC are only eligible to appear for the interviews Candidate pursuing Graduation or awaiting results will not be eligible to apply Freshers / candidates with less than one year of experience into Testing Candidates who have appeared for the same role in the last 6 months will not be eligible to reapply Immediate Joiners preferred Interview Date : 06 July 2019 Walk-in : 10:00 AM to 12:00 PM Building Address - Amazon Development Centre (India) Pvt. Limited Ground Floor, Infinity tower, Tata Ramanujam IT City SEZ, Rajiv Gandhi Salai, Near Tidal Park, Old Mahabalipuram Road, Taramani, Chennai - 600 113 Documents to Carry: 2 copies of Resume (Mandatory) 10th Standard Mark sheet (Mandatory) Photo Copies Pan Card (Mandatory) Photo Copies Provisional Certificate and/or Degree Certificate (Mandatory) Photo Copies 2019 Passouts Please carry all semester mark sheets along with the internet copy of your final semester results (Mandatory) Photo Copies","location":"Chennai","experience":"0 - 1 Years"},{"date":"8 - Jul - 2019","skills":".Net Trained/ Freshers","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Atlas Systems Private Limited, No. 56/3, Bannerghatta Main Road, Unit-1B, FIrst Floor, Vakil Square, Gurappana Palya, Bengaluru, Karnataka - 560 029","phone":"080-42615071","profile":".Net Trainee/ Developers \nAtlas Systems Private Limited","description":"Permanent Job Opening for a Product Base for .Net Fresher Night shift (only) Candidate must have good knowledge in .Net Microsoft Certification - mandatory Walk-in Date: 8th July 2019 Timing 11:00 AM to 5:00 PM Interview Venue: Atlas Systems Private Limited No. 56/3, Bannerghatta Main Road, Unit-1B, FIrst Floor, Vakil Square, Gurappana Palya, Bengaluru, Karnataka - 560 029 Contact Person: Kalaivani","location":"Bangalore","experience":"0 - 1 Years"},{"date":"6 - Jul - 2019","skills":"C#/ .Net, MVC, Angular JS, JQuery, Linq, Entity Frameworks, MySQL, Micro Services","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Q3 Infotech Private Limited, 6th Floor JMD Megapolis, Sohna Road, Sector 48, Gurugram - 122 001","phone":"0124-6656028","profile":"Software Developer (.Net) \nQ3 Infotech Private Limited","description":"Candidate should have 1 to 5 years of experience in Software Development using C#/ .Net, MVC, Angular JS, JQuery, Linq, Entity Frameworks, MySQL, Micro Services. Requirements: - 60% and above throughout academics Excellent Oral and written Skills Immediately available or <2 months notice period Interview Date: 6th July 2019 Timings: 9.30 AM to 2.00 PM Interview Venue : Q3 Infotech Private Limited 6th Floor JMD Megapolis, Sohna Road, Sector 48, Gurugram - 122 001 Kindly do call on 0124-6656028 or 0124-6656011 (Shalini) for further details or any query.","location":"Gurgaon","experience":"1 - 5 Years"},{"date":"6 - Jul - 2019","skills":".NET, C#, ASP .NET, Web Forms, AJAX, ADO.NET, VB.Net, WCF","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"eClerx Services Limited, Airoli East, Mindspace, Bulding No 11, 5th & 6th Floor, K Raheja Mindspace, Pot # 3, TTC Industrial Area, Thane Belpur Road, Airoli, Navi Mumbai, Maharashtra - 400 708","phone":"9619554943","profile":".Net Developer \neClerx Services Limited","description":"Person should have extensive knowledge of Software Development Life Cycle (SDLC) and have worked using Water-Fall and Agile methodologies. Expertise in Microsoft .NET technologies such as Visual Studio .NET, C#, ASP .NET, Web Forms, AJAX, ADO.NET, VB .Net, WCF, Microsoft SQL Server, SSIS, SSRS and SSAS. Experience in Designing, Modeling and Development of Database using SQL Server 2000/2005/2008. Have worked on highly complex Stored Procedures and Functions. Strong knowledge of Object Oriented Design Methodologies and OOPs along with SOA. Walk-in Date/ Time: 6th July , 10 AM onwards Interview Venue: eClerx Services Limited Airoli East, Mindspace, Bulding No 11, 5th & 6th Floor, K Raheja Mindspace, Pot # 3, TTC Industrial Area, Thane Belpur Road, Airoli, Navi Mumbai, Maharashtra - 400 708 Kindly send resumes on sailee.chaudhari@eclerx.com","location":"Mumbai","experience":"2 - 7 Years"},{"date":"6, 7 - Jul - 2019","skills":"ASP.Net MVC C# WCF SQL Server","qualification":"B.E./B.Tech","address":"ZipBooks Software Solutions Pvt. Limited, 410, Pinnacle Business Park, Corporate Road, Prahladnagar, Prahlad Nagar, Ahmedabad, Gujarat - 380 015","phone":"07940037105","profile":".Net Developers \nZipBooks Software Solutions Pvt. Limited","description":"Candidate should have 0 to 4 years of experience in developing enterprise applications on .NET platform. Write well-designed, testable and Reusable software code. Troubleshoot- Debug & Update systems. Walk-in Date/ Time: 6th July - 7th July , 11 AM onwards Interview Venue: ZipBooks Software Solutions Pvt. Limited 410, Pinnacle Business Park, Corporate Road, Prahladnagar, Prahlad Nagar, Ahmedabad, Gujarat - 380 015","location":"Ahmedabad","experience":"0 - 4 Years"},{"date":"6 - Jul - 2019","skills":".Net Framework, C#/ VB.Net, ASP.Net, SQL Server","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Sparsh Communications Pvt. Limited, #8-2-293/ 82/A/ 854-M, Road No. 44, Jubilee Hills, Near Express TV (News Channel), Hyderabad - 500 033.","phone":"9703304411","profile":".Net Developer \nSparsh Communications Pvt. Limited","description":"Minimum 2 years of experience in .Net Framework, C#/ VB.Net, ASP.Net, SQL Server 2005/ 2008. Well-versed with JavaScript, AJAX, Web services Have strong concepts of OOPS. Hands on experience in product/ project development using MVC Strong database programming skills(T-SQL) Either Angular or Web API experience is Mandatory Should have hands on experience in working on complex business applications. Job Work Timings: Indian Time Zone Week Days: Five Day Week Interview Date - 6th July 2019 (Saturday) Time 11: 00 AM to 3:00 PM Interview Venue: Sparsh Communications Pvt. Limited #8-2-293/ 82/A/ 854-M, Road No. 44, Jubilee Hills, Near Express TV (News Channel), Hyderabad - 500 033. Landmark: Lane between Rangoli and Trisha Showrooms, Near Peddamma Temple Contact No: 9703304411 If your profile fits the below requirement don't hesitate to send your updated resume to venkat.akula@sparshcom.net and get the Interview schedule and Immediate Offer.","location":"Hyderabad","experience":"2 - 5 Years"},{"date":"6 - Jul - 2019","skills":"C#, ASP.Net, MVC, Web API, (RDBMS) SQL Server","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"RGBSI: 18/7 I Floor, Narayana Business Chambers, Hosur Main Road, Wilson Garden, Bangalore - 27","phone":"9620248463","profile":"ASP .Net Developer \nAcculogix Software Solutions India (P) Limited","description":"Person should have 1+ years of experience in full stack software development (web development). Must have excellent communication skills. Experience working in a product development background would be preferred. Individual Contributor having Strong knowledge and Hands on Experience doing projects in C#, ASP.Net, MVC, Web API. Hands on experience in Client side language like JavaScript or JQuery or Angular JS etc. Good understanding in Microsoft Technologies like ASP.NET Web Applications , LINQ to Entities. Strong knowledge in Database Management System (RDBMS) SQL Server. Good knowledge in Bootstrap. Working exposure to Agile/Scrum methodologies. Strong Knowledge in HTML, CSS and a basic knowledge of Object Oriented Programming Concepts. Knowledge of debugging web API with tools like fiddler, Postman. Notice period of 30 days or less!!! 60% throughout academics is mandatory. Walk-in Date/ Time: 6th July 2019, 10 AM onwards Interview Venue: RGBSI: 18/7 I Floor, Narayana Business Chambers, Hosur Main Road, Wilson Garden, Bangalore - 27 Interested candidates kindly share your updated resume to RL1@rgbsi.co.in","location":"Bangalore","experience":"1 - 5 Years"},{"date":"6 - Jul - 2019","skills":"ASP .NET framework, SQL Server MVC, WCF","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Techwave Consulting Inc., Level 4, Buildig No. H6 Phoenix Avance Business Hub, Hitech City, Behind Dell Campus, Hyderabad - 500 081","phone":"Not Provided","profile":"Junior .Net Developer \nTechwave Consulting India Pvt. Limited","description":"Candidate should have 2 to 4 years of proven experience as a C# .NET Developer Good working knowledge with the ASP .NET framework, SQL Server MVC, WCF Should have good communication skills. Job timings : Should work in Rotational shifts (24/7) Looking for immediate joiners Interview process : System test (.Net related) Technical round Walk-in Date/ Time: 6th July from 9 AM onwards Interview Venue: Techwave Consulting Inc., Level 4, Buildig No. H6 Phoenix Avance Business Hub, Hitech City, Behind Dell Campus, Hyderabad - 500 081 Please send profiles to kanusha@techwave.net","location":"Noida","experience":"2 - 4 Years"},{"date":"5 - Jul - 2019","skills":"Branch/ Banking Operations, Back Office Operations, Data Entry","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Kotak Infiniti, 2nd Floor, Building No 21, Infinity Park, Off Western Express Highway, General A K Vaidya Marg, Malad (East ), Mumbai - 400 097","phone":"Not Provided","profile":"Back Office/ Operations Executive \nKotak Mahindra Bank Limited","description":"Qualification: Any Graduate Fresher required. CTC To be Offered : 130000-155000 No. Of Position : 4 Job Responsbility- 1. Execution of system access requests through KRAMAN 2. Creation/ Modification of business roles in KRAMAN 3. Maintaining database for users for whom access is provided in respective applications according to their KRAMAN business role 4. Creation/Modification of user ids in various systems 5. Handling queries received through mails and calls 6. Timely execution of Remedy requests received 7. Co-ordination with PAN INDIA users on KRAMAN related issues 8. Conducting user access reviews and user access verifications in coordination with business 9. Coordination with group companies (KSEC, KLI, KMIL, Wealth) in order to provide system access to their users 10. Timely execution of requests received w.r.t. Treasury applications Interview Date : 5 July 2019 Timing : 11 am to 4 pm Interview Venue : Kotak Mahindra Bank Limited, Kotak Infiniti, 2nd Floor, Building No 21, Infinity Park, Off Western Express Highway, General A K Vaidya Marg, Malad (East ), Mumbai - 400 097 Contact Person : Khushbu Rathod","location":"Mumbai","experience":"0 - 1 Years"},{"date":"5 - Jul - 2019","skills":"Recruitment, Head Hunting, Job Posting/ Sourcing, Referencing, Social Media","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Tech Mahindra Limited, A-8 , Sector-62 , 1st Floor Knowledge Boulevard -Noida","phone":"Not Provided","profile":"Recruitment Executive \nTech Mahindra Limited","description":"Candidate should have excellent communication skills+ Convincing skills. Should have done leadership hiring for at least 2-5 years Have done bulk hiring for 2-4 Years Should be excellent in Headhunting and Networking Ability to work under pressure Have done work in Job portals Only BPO expr can apply Require only Male candidate Job Responsbility- Handle end to end recruitment solution delivery and Walk-ins. Interact with the internal stakeholders to get a clear briefing on the open positions. Analyse their requirements and identify the best ways to source talent. Source profiles from different job Portals, through Job Posting Referencing and Headhunting. Prepare and Analyse Recruitment Trackers & maintain MIS of work for review. Walk-in Date: 5th July 2019 Timing: 11 AM - 4 PM Interview Venue: Tech Mahindra Limited A-8 , Sector-62 , 1st Floor Knowledge Boulevard -Noida Next to IMS and Jaypee College.","location":"Noida","experience":"2 - 5 Years"},{"date":"5 - Jul - 2019","skills":"Back Office Operations Non Voice Hiring Interviewing Chat Insurance Processing","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"HCL Technologies Limited, 1st Floor, Navins WSS Towers, #107, Harris Road, Egmore, Pudupet, Chennai - 600 002","phone":"Not Provided","profile":"Backend Process Executive \nHCL Technologies Limited","description":"HCL Technologies Limited, is hiring for Insurance Process for Back Office Operations, Please find below details for further clarification. Basic Criteria's: Graduation is a must (Without any standing Arrears) Decent Communication Skills in English (Written and spoken) Should have good basic knowledge in Banking & Insurance Fresher's can apply if you are good in Communication and MS office Skills (2019 passed out please ignore) Process Name : Insurance Back office Shifts : U.S Night Shifts Skills : Good Email Etiquette's/ Insurance Processing/ Chat Work Location : Sholinganallur, Chennai Walk in Date: 5th July, 2019 Timings : 10 AM to 1 PM Interview Venue: HCL Technologies Limited, 1st Floor, Navins WSS Towers, #107, Harris Road, Egmore, Pudupet, Chennai - 600 002 (Land Mark : Near Casino Theater) Contact HR : Sharmi Sai","location":"Chennai","experience":"0 - 3 Years"},{"date":"4, 5, 6 - Jul - 2019","skills":"General Administration, Front Office/ Receptionist Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"WebReinvent Technologies Pvt. Limited, 1st Floor, Plot 6-7, Near Metro Pillar No. 770 Rama Park, Dwarka Mor Metro Station, New Delhi - 110 059","phone":"8588864948","profile":"HR Recruiter - Fresher \nWebReinvent Technologies Pvt. Limited","description":"Walk-in interview for Fresher HR Recruiters. Immediate joiner will be preferred. Basic Training will be provided to fresher Job Responsibility: End to End Recruitment Coordinating with Candidates Scheduling Interviews Walk-in Date/ Time: 4th July - 6th July , 11 AM onwards Interview Venue: WebReinvent Technologies Pvt. Limited 1st Floor, Plot 6-7, Near Metro Pillar No. 770 Rama Park, Dwarka Mor Metro Station, New Delhi - 110 059","location":"Delhi","experience":"0 - 1 Years"},{"date":"4, 5 - Jul - 2019","skills":"Office Administration, Travel Arrangements, Back Office Assistance","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Chetu India Private Limited, A Block 186, Sector 63, Noida, Uttar Pradesh - 201 301","phone":"9667427662","profile":"Administration Executive \nChetu India Private Limited","description":"Person must have proven experience as an office administrator, office assistant or relevant role. Must have outstanding communication and interpersonal abilities. Excellent organizational and leadership skills. Familiarity with office management procedures and basic accounting principles Job Responsbility: Coordinating office activities and operations to secure efficiency and compliance to company policies. Supervising administrative staff and dividing responsibilities to ensure performance Keep stock of office supplies and place orders when necessary Walk-in Date/ Time: 4th - 5th July 2019 from 3 PM onwards Interview Venue: Chetu India Private Limited A Block 186, Sector 63, Noida, Uttar Pradesh - 201 301","location":"Noida","experience":"3 - 8 Years"},{"date":"5, 6 - Jul - 2019","skills":"General Administration, Back Office Assistance","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Bharat Institute of Engineering & Technology (BIET) Mangalpally (V), Ibrahimpatnam (M) Hyderabad, Telengana - 501 510","phone":"Not Provided","profile":"Admin/ Office Assistant \nBharat Institutions- Division of Chinta Reddy","description":"Educational Qualification: Any Degree Work Experience: 0 to 8 Years Age: 21-35 Years Freshers Can apply Salary: 8,000/- to 15,000/- Candidate should have good communication skills. Should be well versed with MS word and MS Excel. Should be proficient in typing. Screening phone calls, emails, letters and personal visits. Ability to communicate effectively in English, both orally and in writing. Should have the knowledge & able to perform the office related activities. Job Locations: 1. Bharat Institute of Engineering & Technology (BIET) Mangalpally (V), Ibrahimpatnam (M) Hyderabad, Telengana - 501 510 2. Bharat Institute for Degree & PG college for Women Address: 3-4-781, Opposite Tourist Hotel, Kachiguda Station Rd, Barkatpura, Kachiguda, Hyderabad, Telangana - 500027 Interested candidates can send your resume to mbapgrec@gmail.com Please bring your updated resume with one passport size photo for Interview. Note: 1) The selected candidates should execute an Service Agreement for Min 1 year. 2) Academic Original Certificates submission is mandatory; for which an Acknowledgment receipt will be issued. Candidates who have attended Interview in last 6 months need not to Apply.","location":"Hyderabad","experience":"0 - 8 Years"},{"date":"6 - Jul - 2019","skills":"MVC, Javascript, JQuery, ASP .Net, C#, Entity Framework","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"PaAmar Jyothi House Building, No. 57 to 82, Domlur Village,, Civil Area, Kasaba Hobli, Bangalore North Taluk, 100 Feet Road, Bengaluru, Karnataka - 560 071","phone":"8216617777","profile":".Net Professionals \nCognizant Softvision","description":"We currently have a Full-time opportunity for a Sr .Net Developer Developer / .Net Technical Architect position with Cognizant Softvision Work Experience: 5 to 14 Years Skills: .Net, Asp .Net ,C#,MCV, Java Script, Jquery No of Positions 5 Place of Work: Bangalore Walk-In drive on 6th July 2019 9 AM onwards Interview Venue: PaAmar Jyothi House Building, No. 57 to 82, Domlur Village,, Civil Area, Kasaba Hobli, Bangalore North Taluk, 100 Feet Road, Bengaluru, Karnataka - 560 071","location":"Bangalore","experience":"5 - 14 Years"},{"date":"5, 6, 8, 9, 10, 11, 12, 13, 15, 16, 17 - Jul - 2019","skills":"Java, Struts, Spring, or WebLogic JMS","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"AGS House, Plot No. EL 82 & 83, TTC Industrial Estate, MIDC Electronic Zone, Navi Mumbai - 400 705.","phone":"Not Provided","profile":".Net Developers \nAGS Transact Technologies Limited","description":"Urgent hiring for .Net Developer in AGS Transact Technologies Limited Job Location : Ghansoli Shift timings : day shift We are into payment industry and we are hiring candidates who have worked for projects related to banks Walk-in Date/ Time: 5th July - 17th July , 9 AM onwards Interview Venue: AGS House, Plot No. EL 82 & 83, TTC Industrial Estate, MIDC Electronic Zone, Navi Mumbai - 400 705. Contact person : Rasika HR Team","location":"Mumbai","experience":"1 - 4 Years"},{"date":"4 - Jul - 2019","skills":"Software Testing, Selenium (testing tool), Test methodologies, Test Strategies","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Prometric Testing Private Limited, 2nd Floor, DLF Infinity Tower-A, DLF Phase 2, GURGAON, Haryana - 122 001","phone":"0124-4517145","profile":"Manual Testing Engineer \nPrometric Testing Private Limited","description":"Bachelors / Masters Degree in Computer Science, Engineering or a related subject Proven work experience in manual quality assurance. Strong knowledge of Manual Testing. Experience in writing clear, concise and comprehensive test plans and test cases Hands-on experience with manual testing. Experience with performance and/or security testing is a plus Excellent communication skills Good analytical skills Only Female candidates need to apply Job Hoppers please avoid to come for the interview Job Responsbility- Perform quality testing to ensure the exams operate as expected once delivered to the candidate Understand and analyze specification documents Executing tests as per the specification documents Review for any logical/documentation defects Reporting defects found during testing. Reporting and documentation. Co ordinate with all stake holders for successful completion of testing process Shift Timings: 9:00 am - 5:30 pm Saturdays & Sunday Fixed Weekly Off Interview Details: Date: 4-July-2019 (Thursday) Timings: 12:00 pm - 4:00 pm Venue: Prometric Testing Private Limited 2nd Floor, Infinity Tower A, DLF Cyber City, Gurgaon - 122002","location":"Gurgaon","experience":"2 - 3 Years"},{"date":"4, 5 - Jul - 2019","skills":"Software Testing, Automation Testing, Software Engineering, Manual Testing, Selenium","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Novac Technology Solutions, Office No: 275, Statesman One, R.K. Mutt Road, Mylapore, Chennai - 600 004 (Landmark: Near to Bata Showroom/ Mylapore Railway Station)","phone":"Not Provided","profile":"Software Testing Engineer \nNovac Technology Solutions","description":"Novac Technology Solution is currently hiring for Software Engineer Trainee (Certified Software Testing Engineers) for Chennai Location. Who can apply? Candidate with 70% above in 10th, 12th, UG / PG are eligible. Certification in Software Testing (Manual or Automation) is must. BE/ B Tech (CSE/ IT/ ECE) MCA, MSc (Computers) from 2018 & 2019 batch only BSc (CS) & BCA from 2018 & 2019 batch only Work Experience: Fresher Age criteria Not more than 26 Years Job Location: Chennai Selection Process: Online Aptitude Test Technical Online Round Technical F2F round Candidates who are interested, walk-in to the below mentioned venue directly with your updated CV. Walk-in Date: 4th & 5th July 2019 Time: 10 am to 3 pm Interview Venue: Novac Technology Solutions Office No: 275, Statesman One, R.K. Mutt Road, Mylapore, Chennai - 600 004 (Landmark: Near to Bata Showroom/ Mylapore Railway Station) *Note: If you have appeared for the same process in last 6 months you wont be eligible.","location":"Chennai","experience":"0 - 1 Years"},{"date":"4 - Jul - 2019","skills":"Software Testing, Manual Testing","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Amazon Development Centre (India) Private Limited, Ground Floor, Infinity tower, Tata Ramanujam IT City SEZ, Rajiv Gandhi Salai, Near Tidal Park, Old Mahabalipuram Road, Taramani, Chennai - 600 113","phone":"Not Provided","profile":"QA/ Testing Engineer \nAmazon Development Centre (India) Pvt. Limited","description":"Amazon is hiring Associate, Quality Services for Chennai location, this is a Full Time Role related to Software device testing. Please find the below Job Description for the same and criteria to apply for this role. You may appear for the interview if you find yourself matching the below criteria. Eligibility Cretria: BE/ B.Tech or BCA/ MCA/ BSc/ MSc are only eligible to appear for the interviews Candidate pursuing Graduation or awaiting results will not be eligible to apply Freshers / candidates with less than one year of experience into Testing Candidates who have appeared for the same role in the last 6 months will not be eligible to reapply Immediate Joiners preferred Walk-in Date : 04 July 2019 Time: 10 AM to 12 PM Interview Venue: Amazon Development Centre (India) Private Limited Ground Floor, Infinity tower, Tata Ramanujam IT City SEZ, Rajiv Gandhi Salai, Near Tidal Park, Old Mahabalipuram Road, Taramani, Chennai - 600 113 Documents to Carry: 2 Copies of Resume (Mandatory) 10th Standard Mark sheet (Mandatory) Photo Copies Pan Card (Mandatory) Photo Copies Provisional Certificate and/or Degree Certificate (Mandatory) Photo Copies 2019 Passouts Please carry all semester mark sheets along with the internet copy of your final semester results (Mandatory) Photo Copies","location":"Chennai","experience":"0 - 1 Years"},{"date":"6 - Jul - 2019","skills":"Core Java, Servlets, JSPs and J2EE","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Hetero Healthcare Limited, New Mark House, Plot No. 48-51 & 54-57 Survey# 78, 3rd Floor, Patrikanagar, Madhapur, Hyderabad - 500 081","phone":"Not Provided","profile":"Java Developers \nHetero Healthcare Limited","description":"Work Experience: 1 to 3 years of experience Design, develop, implement and maintain series of programs, subsystem, revision and enhancement of current system. Must be a self-starter and able to work with peer groups AJAX, jQuery knowledge is an advantage. Database knowledge is required. Experience with Web Services is an advantage. Strong Core Java, Servlets, JSPs and J2EE knowledge. JavaScript, HTML, CSS knowledge, Java frame work knowledge such as Spring, Hibernate Experience in integrating web services with mobile clients such as iPhone/iPad applications is optional. Walk-in Date/ Time: 6th July 2019, 10 AM Onwards Interview Venue: Hetero Healthcare Limited New Mark House, Plot No. 48-51 & 54-57 Survey# 78, 3rd Floor, Patrikanagar, Madhapur, Hyderabad - 500 081 Land Mark :Near Maxcure Hospital","location":"Hyderabad","experience":"1 - 3 Years"},{"date":"4, 5, 6 - Jul - 2019","skills":"Software Testing, Test Engineering, Developing Test Plans & Use cases","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Netedge Computing Solutions Pvt. Limited, NetEdge Tower C - 56/ 39, Sector - 62 Noida - 201 301","phone":"78388-37993","profile":"Senior Test Engineer/ Lead \nNetedge Computing Solutions Pvt. Limited","description":"The person must have experience in: Analyzing Business requirements & Developing Test Plans & Use cases Creating Test Cases for various Modules & Test Execution Reporting bugs with severity & priority according to customer Requirement & project. The person will be responsible for: Managing the Testing Team Assigning the work & ensuring the work gets completed as per project plan Interaction with Developers & Project Managers / Customers (if required) Development of Test Cases Walk-in Date/ Time: 2nd - 6th July 2019, 11 AM onwards Interview Venue: Netedge Computing Solutions Pvt. Limited NetEdge Tower C - 56/ 39, Sector - 62 Noida - 201 301","location":"Noida","experience":"3 - 5 Years"},{"date":"4, 5, 6, 8, 9, 10, 11, 12, 13 - Jul - 2019","skills":"Software Testing, Poduct Implementation, Bug fixing","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Talent Times Private Limited, 7-1-617/A, Third Floor, Unit # 305, Imperial Towers, Ameerpet, South India Shopping Mall Building Hyderabad, Telangana - 500 016","phone":"8367788879","profile":"Software Testing/ Support Engineer \nTalent Times Private Limited","description":"Qualification: Any Graduate/ B.E/ B.Tech/ MCA Work Experience: Fresher's / 0- 1 year Job Location: Hyderabad Key Responsibilities- Responsible for software testing, product implementation, Bug fixing, minor application issues and any adhoc requirements from client. Including PF, ESI, Insurance, Professional Tax Walk-in Date: 4th July - 31st August 2019 Time: 10 AM onwards Interview Venue: Talent Times Private Limited 7-1-617/A, Third Floor, Unit # 305, Imperial Towers, Ameerpet, South India Shopping Mall Building Hyderabad, Telangana - 500 016 Phone No. 8367788879","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"4, 5, 6, 8, 9, 10, 11, 12, 13, 14, 15 - Jul - 2019","skills":".Net Technologies, Trained Freshers","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Awapal Solutions Private Limited, E-38, First Floor, Sector-63, Noida - 201 301","phone":"9911886563","profile":"Manual Tester/ Client Support \nAwapal Solutions Private Limited","description":"Candidate should have 6 months to 1 year of relevant experience. Must be having good Knowledge of Manual testing, Automation Testing and Security testing. Must be comfortable in client support & software training to clients. Must have positive attitude Walk-in Date/ Time: 4th - 15th July, 11 AM onwards Interview Venue: Awapal Solutions Private Limited E-38, First Floor, Sector-63, Noida - 201 301","location":"Noida","experience":"0 - 1 Years"},{"date":"4, 5, 6 - Jul - 2019","skills":"Core Java, Advanced Java, Java Script, PhP, SQL, ASP .Net","qualification":"B.E./B.Tech, MCA/PGDCA","address":"9, Wadhwani Plaza, Nr. Vishal E-Square, Ambedkar Chowk, Old Pune Mumbai Highway, Pimpri, PUNE, Maharashtra - 411018,","phone":"7083614983","profile":"Software Developer (Java/ Php/ .Net) \nSynetica","description":"Candidates should have good knowledge of Core Java, Advanced Java, Java Script, PhP, SQL, ASP .Net Internet Tools : HTML5, CSS3, JavaScript, Ajax, WPF, JQuery, XML, Web Services, Must have excellent communication and collaboration skills. Walk-in Date/ Time: 4th July - 6th July , 9 AM onwards Interview Venue: Synetica, Shop No.9, Wadhwani Plaza, Near Vishal E-Square, Ambedkar Chowk, Old Pune-Mumbai Highway, Pimpri, Pune - 411 018 Mobile: 7083614983","location":"Pune","experience":"0 - 5 Years"},{"date":"6 - Jul - 2019","skills":"Core Java/ J2EE 7.0 above, Hibernate, JPA, Spring 3.0+, Web Services","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Tech Mahindra Limited, A-20, Sector-60 (Near Sector 59 Metro Station) Noida (U.P)","phone":"Not Provided","profile":"Core Java Developer \nTech Mahindra Limited","description":"Person should have 3 to 8 year of professional software development experience in following skills: Strong understanding of Core Java/ J2EE 7.0 above Experience in frameworks Hibernate, JPA, Spring 3.0+, Experience in producing and consuming Web Services and Experience in using Application servers like WebLogic, JBOSS Working knowledge of RDBMS, SQL and PL/SQL. Experience in developing and consuming REST Web Services (Spring Boot). Experience in implementing J2EE Design Patterns. Must be willing to work in shifts from 1 PM to 10:30 PM IST Work Location - Noida/ Pune Shift- 1 PM to 10:30 PM Interview Day- 6th July 2019 Venue Details Tech Mahindra Limited A-20, Sector-60 (Near Sector 59 Metro Station) Noida (U.P) Contact Person- Nitesh Singh Reporting Time- 10 Am to 1 Pm","location":"Noida","experience":"3 - 8 Years"},{"date":"8, 9, 10, 11, 12 - Jul - 2019","skills":"Core Java, Spring framework (Core, Data, Security, Cloud)","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"CRIF Solutions Private Limited, Unit No. 01, Ground Level, Survey No. 114 & 115 Icon Towers, Baner Road, Pune - 411 045","phone":"Not Provided","profile":"Java Developers \nCRIF Solutions Private Limited","description":"Candidates who are meeting below criteria will only be considered: Should have 3 to 6 years of experience Drive will start from 11:00 to 6:00 PM Should match below skill sets also - 3 to 6 years Experience in Core Java - 2+ years of experience in Spring framework (Core, Data, Security, Cloud) - Spring Boot - Micro Services and Web Services - Angular 4/6 with 2+ years of experience - XML Parsing, XML Validation, Xslt, Xsd Walk-in Date/ Time: 8th - 12th July, 2019 10 AM onwards Interview Venue: CRIF Solutions Private Limited Unit No. 01, Ground Level, Survey No. 114 & 115 Icon Towers, Baner Road, Pune - 411 045 Tel: 020-67642952","location":"Pune","experience":"3 - 6 Years"},{"date":"6 - Jul - 2019","skills":"Java, Core Java, Servlets, Hibernate, Struts, Spring","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Full Creative Private Limited, Ascendas Tech Park, Pinnacle Building, Phase I, 4th Floor, CSIR Road, Taramani, Chennai.","phone":"Not Provided","profile":"Software Engineer - Java \nFULL Creative Private Limited","description":"Candidate should have excellent programming skills in Java Script & Core Java Experience in Amazon-AWS/ Google Cloud Design & implementation experience in SQL/NoSQL (MySQL, PostgreSQL, Google's Cloud Datastore, MongoDB) Knowledge of version control systems like GIT & TDD. Must have good communication skills Write well designed & efficient codes. Ensure the designs are in compliance with specifications Should build an interface with the customers, management & the team. Walk-in Date/ Time: 6th July 2019, 10 AM onwards Interview Venue: Full Creative Private Limited, Ascendas Tech Park, Pinnacle Building, Phase I, 4th Floor, CSIR Road, Taramani, Chennai.","location":"Chennai","experience":"1 - 4 Years"},{"date":"6 - Jul - 2019","skills":"Java / J2EE including frameworks like Spring boot, Hibernate etc.","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Purpletalk India Private Limited, Plot No. 12th Floor, Watermark Technopark, Survey No. 9, Whitefields, Kondapur, Whitefields, Kondapur, Hyderabad, Telangana - 500 084","phone":"Not Provided","profile":"Java Developer \nPurpletalk India Private Limited","description":"The Java Developer will be responsible for writing code to build and support enterprise applications. This role will interface with the business and other developers to ensure business requirements are translated into detailed technical specifications. Essential Responsibilities: Design and build scalable REST APIs. develop, test, tune for performance and deploy web services. Work with product team to build innovative, robust, and easy-to-use features. Collaborate with the team, optimize and refactor the back-end architecture. Conduct code reviews to uphold high-quality code and standard. Own teams output drive sprint planning, prioritize tasks; Keep key stakeholders updated on progress, milestones and any potential slippages. Build systems that process big data in a distributed environment. Qualifications/ Requirements: Bachelors Degree in Computer Science, or related computer field. 3 years of minimum experience in Java software development. Strong in Java / J2EE including frameworks like Spring boot, Hibernate etc. Experience with micro services based architecture including building Good knowledge on SQL (MySQL / Oracle / SQL Server / Postgres), NoSQL (MangoDB / Cassandra), App server Knowledge (Tomcat/JBoss etc.), OSGi, REST Web Services Working / Usage experience of Docker or similar and Container Experience with Cloud computing in added advantage (AWS / Azure) Assist production support team with any system issues as they arise. Strong Debugging and Troubleshooting expertise. Strong communication skills (oral and written). Walk-in Date/ Time: 6th July 2019, 10 am Onwards Interview Venue: Purpletalk India Private Limited Plot No. 12th Floor, Watermark Technopark, Survey No. 9, Whitefields, Kondapur, Whitefields, Kondapur, Hyderabad, Telangana - 500 084","location":"Hyderabad","experience":"4 - 9 Years"},{"date":"6 - Jul - 2019","skills":"Java, Spring, Hibernate with Microservices / Springboot / Angular /Unix /PL SQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Virtusa Consulting Services Pvt. Limited, Virtusa, Capital, 203, Financial District, Gachibowli, Hyderabad - 500 019","phone":"Not Provided","profile":"Java Developers/ Lead \nVirtusa Consulting Services Pvt. Limited","description":"Virtusa Consulting Services Pvt. Limited is hiring for Java - Senior Developers/ Lead for Hyderabad location. Work Experience: 4- 10 Years Job Location: Hyderabad Notice Period: Max 30 Days Person should have good hands on experience on Java, Spring, Hibernate with Microservices / Springboot / Angular /Unix /PL SQL. Should have good communication skills Walk-in Date/ Time: 6th July 2019 from 10 AM onwards Interview Venue: Virtusa Consulting Services Pvt. Limited Virtusa, Capital, 203, Financial District, Gachibowli, Hyderabad - 500 019 Land Mark - Near Wipro Circle, Opposite to CA. Recruiter Name 'Surabhi' need to be mentioned on the top of the resume","location":"Hyderabad","experience":"4 - 10 Years"},{"date":"6 - Jul - 2019","skills":"API development, Core Java, J2EE technologies, JPA, Hibernate, Spring-boot, Spring framework","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Infogain India Private Limited, The Bristol, DLF Phase-1 Qutub Enclave, Near Sikanderpur Metro Station, Gurugra","phone":"Not Provided","profile":"Java Developer/ Lead \nInfogain India Private Limited","description":"Candidate should have 3 to 8 years of hands on experience in API development, Core Java, J2EE technologies, JPA, Hibernate, Spring-boot, Spring framework. Should be able to deliver in a fast paced Agile Environment. Must have strong analytical skills. Walk-in Date/ Time: 6th July 2019, 10 AM onwards Interview Venue: Infogain India Private Limited The Bristol, DLF Phase-1 Qutub Enclave, Near Sikanderpur Metro Station, Gurugram","location":"Gurgaon","experience":"3 - 8 Years"},{"date":"5 - Jul - 2019","skills":"C/ C++ algorithms oops android Java","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Pride Hulkul, #116, 802, Lal Bagh Main Road, SGN Layout, Doddamavalli, Sudhama Nagar, Bengaluru, Karnataka - 560 027","phone":"Not Provided","profile":"Android Developers - Java \nOottru Technologies Private Limited","description":"We are looking for Fresh Android developers who are trained on Android and have good analytical and programming skills. Candidate should have completed minimum a Engineering degree in Computer Science or Information Science/ MCA/ M.Tech with Computer Science major disciplines. Should have passed out in 2017 or later. Must have a minimum score of 60% in their latest degree. Must know the basics of programming - C/ C++ Good in analytical and problem solving abilities Should know the basics of OOPS concepts Must have learnt Android app development: Should be good in algorithms Walk-in Date: 5 July 2019, Friday Timings: 10 AM to 12 PM Interview Venue: Oottru Technologies Private Limited Pride Hulkul, #116, 802, Lal Bagh Main Road, SGN Layout, Doddamavalli, Sudhama Nagar, Bengaluru, Karnataka - 560 027","location":"Bangalore","experience":"0 - 1 Years"},{"date":"6 - Jul - 2019","skills":"Core Java 7/8, Spring, Spring Boot & Micro Services, MVC Architecture","qualification":"B.E./B.Tech","address":"Capgemini India Private Limited, Campus 6B, Pritech Park, RMZ Ecospace, Bellandur BANGALORE - 37","phone":"Not Provided","profile":"Java Fullstack Developer \nCapgemini Technology Services India Limted","description":"We are hiring Java Developers with 4 to 8 years of experience for Bangalore location Person must be a Graduate in Computers or Engineering from a reputed university. Hands on experience in Core Java 7/8, Spring, Spring Boot & Micro-services. Experience in MVC Architecture, object oriented design and test driven development. Strong understanding regarding the usage of version management tools (such as Git, SVN), Jenkins, Maven, ANT and Test Driven development. Good to have knowledge Hibernate, HTML, Java Script, Angular JS. Must have strong SQL skills Good stakeholder management experience and communication skills Nice to have knowledge on Node JS. Walk-in Date/ Time: 6th July, 2019, 10 am onwards Interview Venue: Capgemini India Private Limited Campus 6B, Pritech Park, RMZ Ecospace, Bellandur BANGALORE - 37 Contact Person - Priyanka/ Pampa","location":"Bangalore","experience":"4 - 8 Years"},{"date":"3, 4, 5 - Jul - 2019","skills":"QA/ Manual Testing, Python, Android, iOS","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"SPA Systems Private Limited, 1st Floor, Mahalaxmi Plaza, Sector-3 Vaishali, Ghaziabad - 201 010","phone":"9599226764","profile":"QA Manual Testing/ Trainee \nSPA Systems Private Limited","description":"Candidate should have 6 Months of training in QA/ Manual Testing, Python, Android, iOS. Must have good knowledge of one or more programming languages relevant to the role Walk-in Date/ Time: 3rd - 5th July 2019, 10Am onwards Interview Venue: SPA Systems Private Limited 1st Floor, Mahalaxmi Plaza, Sector-3 Vaishali, Ghaziabad - 201 010 (Walking Distance from Vaishali Metro Station)","location":"Ghaziabad","experience":"0 - 1 Years"},{"date":"11 - Jul - 2019","skills":"Java, Spring boot, Microservices, Spring Mvc, E-commerce, Migration","qualification":"B.E./B.Tech, MCA/PGDCA","address":"FTD India Private Limited, Block D Wing II, 5th Floor, Cyber Gateway Building, HitechCity, Madhapur, Hyderabad - 500 081","phone":"040-66030303","profile":"Java Developers \nFTD India Private Limited","description":"FTD India Private Limited, is seeking passionate software application developers to work with our highly talented team of young dedicated professionals who aim to give our customers a memorable shopping experience. Education: BE/ B.Tech/ MCA with 70% throughout academics from premier institutions Experience Range: 1 to 3 Years Place of Work: Hyderabad Duties & Responsibilities: Architect, build and deploy cloud platform microservices by using spring boot. Follow Agile Software Development methodology. Adhere to best practices in coding, documentation, test automation, and deployment. Ensure code quality with code design review participation and 100% pass rate on automated regression test suite. Knowledge, Skills & Abilities: Expert level Java skills: Can write non trivial distributed applications using Java libraries. Excellent understanding of Generics, concurrency, streams, java collections Strong understanding of Microservices and Cloud Native Application architectures. Excellent in development and deployment of MicroServices by using Spring Boot, Spring Cloud and API gateway (Netflix Zuul). Strong Core Spring and the Spring ecosystem (Spring Boot, Spring Cloud, Spring Data, Spring Security) skills. Experience with Test Driven Development (TDD ) and testing tools such as Junit and Mockito. Strong demonstrated usage of CI/CD pipelines and tools such as Jenkins, Git, SonarCube etc. Strong DB experience in Relational DB's and at least one NOSQL db, like for example MongoDB. Experience with Docker containers on Google Cloud Platform, powered by Kubernetes. Strong understanding of implementing and consuming Restful/HTTP protocols. Experience with Web frameworks like React, Redux and Webpack is a plus. Requires excellent spoken and written English skills. Date of Drive: 11th July, 2019 Time: 9:00 AM to 2:00 PM Interview Venue: FTD India Private Limited Block D Wing II, 5th Floor, Cyber Gateway Building, Hitech City, Madhapur, Hyderabad - 500 081 Interview Process: Candidates who clear Code Assessment test will be processed for further technical discussions. Note: Candidate who attended our interview process in last 6 months are not eligible for this drive.","location":"Hyderabad","experience":"1 - 3 Years"},{"date":"6 - Jul - 2019","skills":"Manual Testing, Software Testing","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"QualityKiosk Technologies Pvt. Limited, A Wing - 419, Rupa Solitaire Millennium Business Park, Mahape, Navi Mumbai - 400 709","phone":"Not Provided","profile":"Manual Tester (Freshers) \nQualityKiosk Technologies Pvt. Limited","description":"B.E /B.Tech /MCA/ B.Sc/ BCA/ M.Sc/ M.tech- Passing Year- 2017 or 2018 Percentage Criteria-Mandatory 2 academics 60%+ AND 1 academic 55%-60% Java knowledge added advantage Should be willing to work in Manual Testing Open to travel anywhere in Mumbai (Western, Central, Navi Mumbai) Good Analytical approach & Logical reasoning skills Good Communication Skills Education gap not more than 1 Year 2 year bond Walk-in Date: 6 July 2019- Saturday Time: 11:00 AM till 2:00 PM Interview Venue: QualityKiosk Technologies Pvt. Limited, A Wing - 419, Rupa Solitaire Millennium Business Park, Mahape, Navi Mumbai - 400 709, Lift Number 24 & 25 (Directions: next to Mastek, take a right from the main entrance) Contact Person: Mausimi Sardar/ Leena Bhor Note: Requested to be prepared on manual testing before coming for the interview Candidate location from Western Line & till Bhandup. No Navi Mumbai","location":"Mumbai","experience":"0 - 1 Years"},{"date":"5 - Jul - 2019","skills":"Core Java, Selenium, Software Testing, Automation Testing, Software Engineering","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"CourseCube Private Limited, 57, 1st Floor, 7th Main, 17th Cross Road, NS Palya, BTM 2nd Stage, Bengaluru, Karnataka - 560 076","phone":"Not Provided","profile":"Trainee Engineer - Core Java/ QA \nAtmecs Technologies Private Limited","description":"Only B-Tech, M-Tech, MCA, MSc students from 2017/ 18/ 19 Passouts are eligible. Candidates should have scored 60% throughout in UG/ PG. Must have excellent communication skills. Must have undergone training or course in Core Java/ QA Should be comfortable with bond for 2 years. Job location will be in Hyderabad. Walk-in Date/ Time: 5th July 2019 from 9 AM onwards Interview Venue: CourseCube Private Limited 57, 1st Floor, 7th Main, 17th Cross Road, NS Palya, BTM 2nd Stage, Bengaluru, Karnataka - 560 076 Note: Interested students should report to venue by 8:30 AM only.","location":"Bangalore","experience":"0 - 1 Years"},{"date":"4, 5 - Jul - 2019","skills":"Software Testing/ Manual/ Automation/ Selenium Trained","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Changepond Technologies Private Limited, H-2, SIPCOT IT Park, Old Mahabalipuram Road, Siruseri, Chennai, Tamil Nadu - 603 103","phone":"044-47480037","profile":"Testing/ Quality Analyst Trainee \nChangepond Technologies Pvt. Limited","description":"Changepond Technologies Pvt. Limited, is hiring Quality Analyst Trainees for Chennai location Educational Qualification: BE/ B. Tech/ MCA Eligibility: Aggregate of 60% in 10th, 12th, UG & PG (if any) Year of Passing: 2016, 2017 & 2018 Should have completed a course in Testing from any training institute. Must have Good Communication Skills Required Skills: Testing/ Manual/ Automation/ Selenium Trained or Certified Freshers. Male candidates preferred Walk-in Date: 4th & 5th July 2019 (Thursday/ Friday) Time: 9:30 AM to 4:00 PM Interview Venue: Changepond Technologies Private Limited H-2, SIPCOT IT Park, Old Mahabalipuram Road, Siruseri, Chennai, Tamil Nadu - 603 103 Interview Rounds: 1. Combined Apps (Testing & Logical reasoning), 2. Technical face to face 3. HR Interview. Contact Person: Kalaiselvan, Human Resources","location":"Chennai","experience":"0 - 1 Years"},{"date":"4 - Jul - 2019","skills":"Background Verification, Non Voice/ Backend Operations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Neeyamo Enerprise Solutions Pvt. Limited, NTPL SEZ (Blueridge) IT 05, 1st Floor, 154/06 Phase 1, Hinjewadi, Pune - 411 057","phone":"020-67934007","profile":"Service Delivery Executive \nNeeyamo Enerprise Solutions Pvt. Limited","description":"Designation: 1) Service Delivery Executive (BGV Executive) 2) Associate Team Lead (ATL) Job Responsbility: Connecting with various educational institutes &/or corporate offices for verification of credentials given by clients. Conducting research & analysis to validate authenticity of the aforementioned data. Has the ability to work under stringent deadlines and tough client conditions. The ATL will have a team of 2-4 Service Delivery Executives under him/her. Strictly freashers or 0-1 year experience allowed only for ATLs. Qualification: Any Graduate (Except Post Graduates like M.Tech, MBA, etc) Eligibility Criteria:- Must be comfortable working in night Comfortable with a voice profile Strong analytical & problem solving skills Can work under pressure Immediate Joining No standing arrears Levels of Interview:- Aptitude test Face to face interview HR Discussion Reporting time: 11:00 am Contact Person: Harpreet Note : Please bring 2 copies of your resume.","location":"Pune","experience":"0 - 2 Years"},{"date":"2, 3 - Jul - 2019","skills":"Recruitment, conducting interviews, HR/ Interviewing, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Prime Focus Technologies Limited, 2nd floor, Janardhan Towers, Bilekahalli, Bannerghatta Road, Bangalore - 560 076","phone":"Not Provided","profile":"HR Recruiter \nPrime Focus Technologies Ltd Limited","description":"We have an excellent opportunity for MBA (HR) freshers/ experienced candidates. Prime Focus Technologies (PFT) is hiring talented, passionate Recruiters for its Talent Acquisition team to assist in end-to-end recruitment process. Roles & Responsibilities: Assist to Design and implement overall recruiting strategy. Perform job and task analysis to document job requirements and objectives. Prepare recruitment materials and post jobs. Source and recruit candidates by using databases, social media etc Screen candidates resumes and job applications Prepare & maintain the documented recruiting reports. Conduct interviews. Job Location: Bangalore Walk-in Date/ Time: 2nd & 3rd July, 10 AM Onwards Venue Details: Prime Focus Technologies Limited 2nd floor, Janardhan Towers, Bilekahalli, Bannerghatta Road, Bangalore - 560 076 Landmark : After Brand Factory and Opposite Rainbow Children's Hospital","location":"Bangalore","experience":"0 - 3 Years"},{"date":"3, 4, 5 - Jul - 2019","skills":"General Administration, MIS Preparation, Back Office Operations, Non Voice Process","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Karvy Fintech Private Limited, Tower- B, Plot No. 31 & 32, Selenium building Gachibowli Road Financial District, Nanakramguda, Serilingampally Mandal, Hyderabad - 500 032","phone":"Not Provided","profile":"Back Office Executive \nKarvy Fintech Private Limited","description":"We are hiring both Freshers as well as experienced candidates. The ideal candidate should be preferably from a Finance background and should be knowing basics of excel. Educational Qualification - Graduate and Above Other Requirement : Knowledge on Financial Industry and hands on knowledge on Excel Job Responsbility- Meet performance standards of respective sub-function. Operational efficiency & effectiveness. Able deliver the output within agreed timelines Responsible for cheque stop and reissue. Responsible for responding customer mails within TAT. Responsible for MIS preparations, attending queries and client calls. Responsible for executing SIP transactions. Responsible for checking daily reports and maintaining the quality. Regular touch with all vendor / banks & AMC for daily activities Walk-in Date/ Time: 3rd July - 5th July from 11 AM onwards Interview Venue: Karvy Fintech Private Limited Tower- B, Plot No. 31 & 32, Selenium building Gachibowli Road Financial District, Nanakramguda, Serilingampally Mandal, Hyderabad - 500 032","location":"Hyderabad","experience":"0 - 5 Years"},{"date":"2, 3, 4, 5 - Jul - 2019","skills":"interviewing hiring recruitment hr ta social media events","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Busybees Logistics Solutions Pvt. Limited, (Xpressbees) B1 Building, 1st Floor, Cerebrum IT Park Kalyani nagar, Pune - 411 014.","phone":"Not Provided","profile":"HR Executive \nBusybees Logistics Solutions Pvt. Limited","description":"Roles & Responsibilities- Source potential candidates from various online channels (e.g. social media and professional platforms like StackOverflow and Behance) Craft recruiting emails to attract passive candidates Screen incoming resumes and application forms Interview candidates (via phone, video and in-person) Prepare and distribute assignments and numerical, language and logical reasoning tests Advertise job openings on companys careers page, social media, job boards and internally Provide shortlists of qualified candidates to hiring managers Send job offer emails and answer queries about compensation and benefits Monitor key HR metrics, including time-to-fill, time-to-hire and source of hire Participate in job fairs and host in-house recruitment events Collaborate with managers to identify future hiring needs Act as a consultant to new hires and help them onboard Walk-in Date/ Time: 2nd July - 5th July, 10 am Onwards Interview Venue: Busybees Logistics Solutions Pvt. Limited, (Xpressbees) B1 Building, 1st Floor, Cerebrum IT Park Kalyani nagar, Pune - 411 014.","location":"Pune","experience":"1 - 2 Years"},{"date":"1, 2, 3, 4, 5, 8, 9, 10, 11, 12 - Jul - 2019","skills":".Net technologies/ C#, .NET, C#, Web API, Web Services","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Ganapathi Raja Enclave, # 75 /A, 1st and 2nd Floor, 100 Feet Road, 15th Cross Road, Sarakki, 1st Phase, J. P. Nagar, Bengaluru, Karnataka - 560 078","phone":"Not Mentioned","profile":".Net Developers \nSilicomp India Private Limited","description":"Person must be Graduate with at least fifteen (15) years of education in any discipline and 1 to 3 years of relevant experience on .Net technologies/ C#, .NET, C#, Web API, Web Services. Must be excellent in Hibernate & MongoDB. Functional analysis of existing software Job Location: Bangalore Interested candidates please Walk-in with your updated resume from Tuesday to Thursday between 10.00 am to 4.00 pm to the below mentioned address- Ganapathi Raja Enclave, # 75 /A, 1st and 2nd Floor, 100 Feet Road, 15th Cross Road, Sarakki, 1st Phase, J. P. Nagar, Bengaluru, Karnataka - 560 078 Near JP-Nagar Metro Railway Station/ Sindoora Convention Hall. Contact Person: Nirmala","location":"Bangalore","experience":"1 - 3 Years"},{"date":"1, 2, 3 - Jul - 2019","skills":"PHP, HTML, CSS, Python or Node JS, SQL/ MySQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"MS Technology Private Limited, 2, Community Centre, IInd Floor, Basant Lok, Vasant Vihar, New Delhi - 110 057","phone":"011-41669396","profile":"Web Developer - Php \nMS Technology Private Limited","description":"Experience with PHP, HTML, CSS Familiarity with Wordpress and Angular Python or Node.js SQL/ MySQL database experience Bootstrap and or Material Design Comfortable jumping in to unfamiliar frameworks/codebases Experience using version control systems Web optimization Walk-in Date/ Time: 1st - 3rd July , 11 AM onwards Interview Venue: MS Technology Private Limited 2, Community Centre, IInd Floor, Basant Lok, Vasant Vihar, New Delhi - 110 057","location":"Delhi","experience":"2 - 3 Years"},{"date":"6 - Jul - 2019","skills":"Technical Support, Technical Helpdesk, Service Desk, End User Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Microland Limited, Ground Floor, #6 & 7, Palm Court, Sector 14 20/4 Sukrali Chowk, Opp. Huda Park, Gurugram - 122 001","phone":"0124-6754030","profile":"Technical Support Engineer \nMicroland Limited","description":"Candidate should have with minimum 1 year of experience in technical helpdesk Experience in the domain of voice technical support/ helpdesk is must Knowledge in International service delivery standards such as ITIL, eSCM or CMMi Excellent verbal & written communication - Interpersonal skills Should be in a position to resolve L1 and L1.5 calls Should be able to drive customer experience via HD support Must be familiar with Microsoft technologies and windows environment Smartphone/Desktop and Laptop hardware/software troubleshooting. Office utility tools, antivirus tools, personal firewall tools or other business productivity tools troubleshooting Job Role: Service Desk & Helpdesk Engineers Experience Required: 0.6 - 5 year Salary:-1 Lpa to 3.20 Lpa Job Location:- Gurgaon, Manesar, Rohtak Job Responsbility: Single Point Of Contact (SPOC) assistance for End User Support To respond to the incidents /problem/change reported by Customer predominantly through Voice Interaction and also through email, chat and web portal Log Tickets in the call-logging tool on behalf of users Take necessary action viz resolves (over phone or remote) or assigns the issue to right assignment group Monitor the service desk tool for open and pending incidents Own the incident and provide end to end resolution for the ticket Interested candidates can turn up directly at Microland premises:- Walk-in Date:- 6th July 2019 Timing:-10:00 am to 5:00 pm max Venue:- Ground Floor, #6 & 7, Palm Court, Sector 14 20/4 Sukrali Chowk, Opp. Huda Park, Gurugram - 122 001 Interested candidate can call on 0124-6754030 or can send their CV at manishaSh@microland.com","location":"Gurgaon","experience":"1 - 5 Years"},{"date":"1, 2, 3, 4 - Jul - 2019","skills":"Software Testing, Automation Testing, Manual Testing, Script Writing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Ganapathi Raja Enclave, #75 /A, 1st and 2nd Floor, 100 Feet Road, 15th Cross Road, Sarakki, 1st Phase, J. P. Nagar, Bengaluru - 560 078","phone":"080-43358090","profile":"Automation Test Engineers \nFIME India","description":"WALK IN for Test Engineers to join our team! As a Test Engineer you will be responsible for planning and implementing of tests that prove the functional and non-functional requirements of the system.: Skills Required: Test and prove that the software meets major business requirements Good Scripting Knowledge in Java, Python, JavaScript, etc. 0-2 years experience in Manual and Automation Testing - functionality, regression, use case and system testing Experience in any test management tools Prove for scalability and performance of a software Ensuring the quality of the system as a whole Develop and automate tests for software validation Prepare defect reports and report test progress Excellent communication, analytical, problem solving skills and should be able to work independently Job Location: Bangalore Interested candidates please Walk-in with your updated resume from Tuesday to Thursday between 10.00 am to 4.00 pm to the below mentioned address or share your updated resume to Nirmala.madyangala@fime.com Ganapathi Raja Enclave, #75 /A, 1st and 2nd Floor, 100 Feet Road, 15th Cross Road, Sarakki, 1st Phase, J. P. Nagar, Bengaluru - 560 078 Near JP-Nagar Metro Railway Station Contact Person: Nirmala Contact Number: 080-43358090/ 9901650716","location":"Bangalore","experience":"0 - 2 Years"},{"date":"2, 3, 4, 5 - Jul - 2019","skills":"C# with Oops Concepts, Dotnet, Javascript","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Janya IT Technologies Pvt. Limited, 301, Fortune Chambers, Silicon Valley, Image Garden Function Hall lane, Opp. HDFC Bank, Madhapur, Hyderabad - 500 081","phone":"Not Provided","profile":".Net Trained/ Freshers \nJanya IT Technologies Pvt. Limited","description":"We have a urgent opening for .Net trained candidates of 2017/2018 & 2019 pass outs of B.Tech/ BCA/ M.Tech/ MCA. Candidate must have good knowledge in C# with Oops Concepts, Dotnet, Javascript Walk-in Date: 2nd to 5th July 2019 Timings: 10 am to 12 pm Interview Venue: Janya IT Technologies Pvt. Limited 301, Fortune Chambers, Silicon Valley, Image Garden Function Hall lane, Opp. HDFC Bank, Madhapur, Hyderabad - 500 081","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"1, 2, 3, 4, 5 - Jul - 2019","skills":"Technical Support, IT Helpdesk, Customer Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Digital Minds Software Solutions Pvt. Limited, 2nd Floor, A-Wing, Softsol Building,, #4 Infocity, Beside Mindspace, Hi-tech City, Madhapur, Hyderabad, Telangana - 500 081","phone":"040 66885669","profile":"Technical Support Executives \nDigital Minds Software Solution Pvt. Limited","description":"Digital Minds Software Solution Pvt. Limited, is conducting Walk in Drive for Technical Support Executives. Educational Qualification: Any Degree Work Experience: 3 - 6 Years Job Location: Hyderabad Shift Timings (IST): Australian Voice Process (2:30 Am to 11:30 Am or 4:00 Am to 1:00 Pm or 6:00 Am to 03:00 Pm) (Shifts can change depending on Roster or Day light saving (Rotational) Required Skills- Excellent Comm Skills / Technical Skills / Trouble shooting skills / Customer Handling Skills Good in Active Directory, Basic Exchange Server or Office 365 administration, DHCP & DNS Excellent Knowledge of desktop OS Windows 8.1 / 10 and Trouble Shooting. Support hardware issues related to PC desktops, laptops, networking and Cisco phones. Able to work effectively with vendors and suppliers by logging tickets and service requests. Hands on experience with Ticketing tools is essentials(Jira / Alloy Navigator etc ) Knowledge of VMware(VSphere 5.5) and Citrix Xen Server. Knowledge of Cisco CUCM / Unity/ PLM - Not mandatory Knowledge on Backup (Veritas Backup, Veeam Backup, etc...) Walk-in Date: 1st to 5th July 2019 Timings: 10 AM -1 PM & 2 PM - 4 PM Interview Venue: Digital Minds Software Solution Private Limited 2nd Floor, A-Wing, Softsol Building,, #4 Infocity, Beside Mindspace,Hi-tech City, Madhapur, Hyderabad, Telangana - 500 081 Phone No: 9063610208/ 040 6688 5669 Note: Those attended the interview with in Six Months, Kindly Ignore. Salary:","location":"Hyderabad","experience":"3 - 6 Years"},{"date":"1, 2, 3, 4, 5 - Jul - 2019","skills":"Technical Support, Customer Service/ Troubleshooting","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Dell Technologies, Plot # 42, Hitec City Layout, Opposite to Deloitte, Madhapur, Hyderabad - 500 081","phone":"Not Provided","profile":"Technical Support Associate \nDell Technologies Private Limited","description":"Educational Qualifications : Any Graduates/ Post Graduates are eligible to apply with minimum 6 months to maximum 39 months of work experience. Any 10+2,10+3 with 12 months international calling experience /24 months domestic calling experience may apply (Mandatory). Candidates should be flexible to work in night shifts. Must have excellent communication skills. Should have good technical knowledge 2 way transport provided Role Overview Responsible for providing telephone/ email/ chat, online, social media and remote diagnostic technical support of desktops, portables, peripherals (e.g., printers, projectors, etc.) and software Role Responsibilities Responsible for providing diagnostic technical support related to installation, operation, configuration,performance, and usage of assigned products Diagnosis & resolving of the hardware problems and troubleshooting. Verifies warranty entitlement and determines appropriate action. Applies diagnostic techniques to identify problems, investigate causes and recommend solutions to correct failures. Documents problems in the support solution database for diagnostics and solution implementation. Provides basic remote deployment, maintenance and consulting services. Walk-in Date/ Time: 1st to 5th July 1 PM Onwards Interview Venue : Dell Technologies, Plot # 42, Hitec City Layout, Opposite to Deloitte, Madhapur, Hyderabad - 500 081 Timings : 1:00 PM to 3 :00 PM, Monday to Friday . Important Note : Please carry an updated CV, a valid Govt. ID proof & passport size photographs.","location":"Hyderabad","experience":"1 - 4 Years"}]}