{"Walkins":[{"date":"23 - Nov - 2019","skills":"Software Testing, Product Testing, Test Reporting, Automation Testing, Selenium, JMeter","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Hays Business Solutions Pvt. Limited, Candor Tech Space, IT/ITES Park, Unitech Infospace Building, 3rd Floor, Plot 2, Block B, Sector - 62, Noida","phone":"9871712629","profile":"Software Testing Engineer \nHays Business Solutions Pvt. Limited","description":"Candidate should have Bachelor Degree/ MCA with 5+ years of experience in testing Must have excellent exposure of Products & Product Integration testing. Track record of value addition done to the Product/ Solutions through strong QA processes Proficiency in Test Automation and test management tools like Selenium, Protractor, Jmeter etc Non Functional Test like API, UI and DB is a big plus Lead, mentor and provide thought leadership to a team consisting of QA Engineer Strong quality & risk quantification & management skills Knowledge of different types of Software Architectures and how they work Should be able to work in close collaboration with Product Management and Product Engineering teams Should be able to identify, track and mitigate risks to the product Walk-in Date/ Time: 23 November 2019, 9 AM onwards Interview Venue: Hays Business Solutions Pvt. Limited Candor Tech Space, IT/ITES Park, Unitech Infospace Building, 3rd Floor, Plot 2, Block B, Sector - 62, Noida Land Mark: Opposite Father Agnel School Contact Detail: Email: RecruitmentIndia@hays.com Mobile: 9871712629 Contact Person- Ajay","location":"Noida","experience":"5 - 7 Years"},{"date":"18, 19, 20, 21, 22 - Nov - 2019","skills":"Testing Tools, QA, Smoke Testing, Regression Testing, Manual Testing, Sanity Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Inogic Tech (India) Private Limited, Everest Nivara Infotech Park 1. Office No-301, 3rd Floor, B wing, Plot No. D-3, TTC Industrial Area, Indira Nagar, Turbhe, MIDC, Navi Mumbai - 400 705","phone":"Not Mentioned","profile":"Manual Testing Engineer \nInogic Tech (India) Private Limited","description":"Candidate must have good hands on experince in Manual Testing, knowledge of QA policies, testing tools, bug tracking tools, experince working on products based Testing, Understanding of C#, .Net, Java, should be well versed with functional, sanity, smoke, & regression testing Required Candidate profile Must Have First Class though-out academics Must be ready to sign a bond Good Communication skills Walk-in Date: 18th - 22nd November 2019 Timings: 10 AM onwards Interview Venue: Inogic Tech (India) Private Limited Everest Nivara Infotech Park 1. Office No-301, 3rd Floor, B wing, Plot No. D-3, TTC Industrial Area, Indira Nagar, Turbhe, MIDC, Navi Mumbai - 400 705 Contact Person- Jivita Note:- if you have second class in any degree, please do not apply","location":"Mumbai","experience":"1 - 4 Years"},{"date":"18, 19, 20 - Nov - 2019","skills":"Software Testing, Test Engineering, Automation Testing, Manual Testing, Selenium","qualification":"B.E./B.Tech, MCA/PGDCA","address":"BELAIR Travel & Cargo Private Limited, Plot No. 9 Pocket 3, Sector 11, Dwarka New Delhi","phone":"011-43149007","profile":"Software Testing Engineer \nBELAIR Travel & Cargo Private Limited","description":"Candidate should be BE/ B.Tech or MCA with 3 to 5 years of experience in Software Testing, Test Engineering, Automation Testing, Manual Testing, Selenium, Test Design, Test Scripts Job Responsbility: * Individual will be responsible to developing manual test scripts * Responsible to executing automated and manual test cases * Responsible to tracking and logging defects during execution * Generating reports such as defect analysis report, project Walk-in Date/ Time: 14th November - 20th November , 10 AM onwards Venue Details- BELAIR Travel & Cargo Private Limited Plot No. 9 Pocket 3, Sector 11, Dwarka New Delhi Contact Person- Himani Rawal Tel: 011-43149007","location":"Delhi","experience":"3 - 5 Years"},{"date":"21, 22 - Nov - 2019","skills":"Software Testing, Automation Testing, Manual Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Soft Suave Technologies Private Limited, Gayatri Tech Park, 4th floor, Plot No 183, EPIP, Near iGate, KIADB Industrial Area, Road 1B, 1B, EPIP Zone Whitefield Rd Kundalahalli, Whitefield Bengaluru - 560 066","phone":"044-42874244","profile":"QA/ Software Tester (Fresher) \nSoft Suave Technologies Private Limited","description":"Soft Suave is hiring for QA automation and selenium testing for Bangalore location. If you are willing to kickstart your career in the field of testing, then you have chosen the right destination. Eligibility: B.E. / B.Tech / M.E. / M.Tech / MCA 2016, 2017, 2018 & 2019 passed outs. Immediate Joiners required. Job Location: Bangalore Required Skills: Should have good knowledge in testing using Selenium web driver Possesses expertise in Manual Automation Maintain and Build Functional Automated Test Suite Full participation in Release Planning and Product Roll Out Job Responsbility: Performing the review of all the software requirements Preparing the test cases with perfection Analyse the reports and execute the tests Validating the date and reporting of defects Final preparation of the test reports Rounds of Interview: Level 1: Technical Aptitude test Level 2: Programming Test Level 3: HR Interview Interview Date : November 21 & 22, 2019 (Thursday & Friday) Interview Time: 10:00 am to 1:00 pm (Post this time slot, candidates will not be considered) Interview Venue: Soft Suave Technologies Private Limited, Gayatri Tech Park, 4th floor, Plot No 183, EPIP, Near iGate, KIADB Industrial Area, Road 1B, 1B, EPIP Zone Whitefield Rd Kundalahalli, Whitefield Bengaluru - 560 066. Contact Person- Sudhendra Devi Tel: 044-42874244","location":"Bangalore","experience":"0 - 2 Years"},{"date":"18, 19, 20 - Nov - 2019","skills":"ASP .NET, ASP .NET MVC, C#, SQL Server, Bootstrap, JavaScript/ JQuery","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Aigilx Health Technologies Private Limited, TICEL Bio Park, 8th Floor, Block II, Module 807 & 808, CSIR Road, Near Ascendas Tech Park, Chennai - 600 113.","phone":"Not Mentioned","profile":"Software Testing Engineer \nAigilx Health Technologies Pvt. Limited","description":"Mandatory Skill Set: ï‚· Good Knowledge in manual testing ï‚· Basic understanding of Automation testing ï‚· Knowledge in Creating test cases and execute. ï‚· Good Knowledge on security, performance and load testing. ï‚· Good Communication Desired Skill Set: ï‚· Testing concepts ï‚· Hands on with any IDE e.g. Visual Studio ï‚· Good understanding of S/W engineering concepts. ï‚· Good understanding of Agile methodology. Roles & Responsibilities: Responsible for understanding API functionality, work flow, writing Testcases(TCs) using Test Framework, reviewing the TCs and execution of TCs for the application made in Angular 5, Node.JS Responsible for Test Automation of web pages, web services or servers which involves automating web user scenarios/TCs, writing Test Scripts for regression/ stress test, TCs review and TCs execution Initiative to propose ideas / improvements in tools/ process. Walk-in Date/ Time: 18th - 20th November , 12 AM onwards Venue Details: Aigilx Health Technologies Private Limited, TICEL Bio Park, 8th Floor, Block II, Module 807 & 808, CSIR Road, Near Ascendas Tech Park, Chennai - 600 113 Contact Person- Aruna M U","location":"Chennai","experience":"1 - 3 Years"},{"date":"19 - Nov - 2019","skills":"Software Testing, Test Engineering, Defect Management, Defect Tracking Tool, Test Execution","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Concentrix Daksh Services India Pvt. Limited, Prasad Tech Park, Tower A, No. 97, EPIP, Whitefield Bangalore, Karnataka - 560 066","phone":"Not Provided","profile":"Software Testing Engineer \nConcentrix Daksh Services India Pvt. Limited","description":"Qualification: Regular Degree/ Diploma in Information Technology (BE, B. Tech, BCA/ MCA, BSC IT would be given preference) Work Experience: 3 to 5 in years in Software Testing Candidate must have excellent verbal and written communication skills. Overall should be a good team player with willingness to learn and drive to achieve Good Excel skills and reporting knowledge. Agile - Scrum Should be able to drive Continuous Improvement in the testing process Working knowledge on defect management and JIRA (added advantage) NOTICE PERIOD-IMMEDIATE TO 15 Days Joining TIME ONLY Walk-in Date/ Time: 19th November 2019, 11 AM onwards Interview Venue: Concentrix Daksh Services India Pvt. Limited Prasad Tech Park, Tower A, No. 97, EPIP, Whitefield Bangalore, Karnataka - 560 066 Contact Person- Ekta wadhawan","location":"Bangalore","experience":"3 - 5 Years"},{"date":"18, 19 - Nov - 2019","skills":"ASP .NET, C#, JQuery, Angular JS, MVC, Entity Framework","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"IQVIA, Omega, Embassy Tech Square, (Cessna Business Park or Embassy tech Square) Marathahalli-Sarjapur Outer Ring Road, Kadubeesanahalli, Bangalore - 560 103","phone":"Not Provided","profile":".Net Developer \nIMS Health Analytics Services Pvt. Limited","description":"Person must have good hands on experience in ASP .NET, C#, JQuery, Angular JS, MVC, Entity Framework. Hands on experience writing SQL Queries, Stored procedures, functions in SQL Server. Hands on experience writing unit tests (NUnit, Junit etc). Be the technical expert for the platform, understanding all aspects including Asp.Net, Sql Server, Solr, OpenPipeline (Java) Interpret requirements then recommended and communicate the technical solution. Participate in feature development as part of a Scrum team including estimating, implementation across the full stack, writing unit tests, writing acceptance tests. Guiding other team members in approach to implementation Date : 18th & 19th November, 2019 Reporting Time : 9:00 AM to 1:30 PM Venue Details: IQVIA Omega, Embassy Tech Square (Cessna Business Park or Embassy tech Square) Marathahalli-Sarjapur Outer Ring Road, Kadubeesanahalli, Bangalore - 560 103 Contact Person: Soumya Interview Process: Online Test, Technical Interview, Managerial Interview, HR Interview Documents Required (Mandatory): Hard copy of this email, Resume and ID proof Please Note: Candidates who have attended the interview in the last 3 months are not eligible to attend this interview.","location":"Bangalore","experience":"5 - 8 Years"},{"date":"18 - Nov - 2019","skills":"Software Engineering, Technical Design, Project Implementation","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Incedo Technology Solutions Limited, Udyog Vihar Phase 4 Next to Polaris, Gurgaon, Haryana","phone":"0124-4765354","profile":"Senior .Net Engineer \nIncedo Technology Solutions Limited","description":"Qualification: BE/ B.Tech/ M./Tech/ MCA Work Experience: 5 - 9 Years Job Location: Gurgaon Work with team of application developers and collaborate with a senior architect and solution designer to effectively deliver projects, enhancements, and applications. Develop end to end RPA solutions from requirements gathering to bot deployment focusing on scalability and extensibility using UI Path and .Net Work with the Product Owners, Business Analysts, RPA Architect, and operations teams including teams from Incedos clients for creating technical design documents and project implementation Walk-in Interview on 18th November 2019 Timings - 12:00 pm - 5:00 pm Interview Venue: Incedo Technology Solutions Limited Udyog Vihar Phase 4 Next to Polaris, Gurgaon, Haryana Contact Person- Anjana Srivastava","location":"Gurgaon","experience":"5 - 9 Years"},{"date":"18, 19, 20, 21, 22, 23 - Nov - 2019","skills":".NET MVC/ Web API, C#, REST APIs, SQL Server","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Cuembux Software Solutions Pvt. Limited, Vatika Business Centre, Level-5, Panchsheel Tech Park One Shashtri Nagar, Yerwada, Pune - 411 006","phone":"8263072261","profile":"Senior .Net Developer \nCuembux Software Solutions Pvt. Limited","description":"Mandatory Requirements: Minimum 3-5 years of experience in .NET MVC/ Web API, C# Basic knowledge of Microsoft Azure. Candidate should have worked on Entity framework 6.0 Candidate should have working experience with SQL Server Candidate should be expert in C#, REST APIs. Good to have skills: .NET Core is added advantage. Knowledge of Any other cloud platform is again added Angular 2.0+, JavaScript/ jQuery Good communication skill. Walkin Date/ Time: 15th November - 31st December , 10 AM onwards Interview Venue: Cuembux Software Solutions Private Limited Vatika Business Centre, Level-5, Panchsheel Tech Park One Shashtri Nagar, Yerwada, Pune Maharashtra - 411 006 Contact - HR (8263072261)","location":"Pune","experience":"3 - 5 Years"},{"date":"23 - Nov - 2019","skills":"ASP .Net (3.5 or later), C#, MVC, WCF, MS SQL Server,LINQ, Entity framework","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Microland Limited, Micropolis, #236, 92/ 1A, Konappana Agrahara, Electronic City Phase-1, Bengaluru- 560 100","phone":"Not Provided","profile":".Net Developer \nMicroland Limited","description":"We are conducting a weekend Drive for .NET Developer position on 23rd November 2019 (Saturday) between 10.00 AM to 3.00 PM IST Work Experience: 3 to 8 Years Location: Microland, Micropolis Office, Electronic City, Bangalore Person must have Professional software development experience in ASP .Net (3.5 or later), C#, MVC, WCF, MS SQL Server,LINQ, Entity framework, Web API for REST and SOAP web Services, SQL Server. Strong in SDLC, Software API design, Unit testing, Deployment, Documentation. Strong OOPs, Databases and HTML, XML, AJAX, JavaScript, JSON and jQuery Hands on experience on Development tools: VSTS, TFS, SVN/Tortoise SVN, JIRA Knowledge of SSIS, SSRS, NodeJS, AngularJS and ITSM domain will be added advantage. Exposure to build management and Test-Driven Development. - Industry recognized professional certifications in .NET technologies is a definite plus. Build solid development framework for service components. * Maintaining clear dependencies and modularity across the application. - Testing own implementation via unit tests and user testing Walk-in Date/ Time: 23 November , 9 AM onwards Interview Venue: Microland Limited Micropolis, #236, 92/ 1A, Konappana Agrahara, Electronic City Phase-1, Bengaluru- 560 100 Interested candidates, please share your resume to Saranyat@microland.com with the Subject Line as .Net Developer","location":"Bangalore","experience":"3 - 8 Years"},{"date":"18, 19, 20 - Nov - 2019","skills":"Core Java, J2EE, ASP .NET, MVC, .NET CORE ADO.NET, OOPS CONCEPTS","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Nexgile Technologies Private Limited, 4th Floor, Win-Win Towers, Tower B, Hi-Tech City, Hyderabad - 500 081","phone":"9989343212","profile":"Java & .Net Developers \nNexgile Technologies Private Limited","description":"1) Java Developer Strong in Core Java J2EE, Strong in Spring Strong in JDBC Hibernate, SQL 2) .Net Developer ASP .NET, MVC, .NET CORE ADO.NET, OOPS CONCEPTS HTML, CSS, JAVA Script, AJAX ENTITY FRAMEWORK, SQL Qualification: Degree or Above Need to have good communication skills and interpersonal skills to work in a team Walk-in Date/ Time: 18th - 20th November , 10 AM onwards Interview Venue: Nexgile Technologies Private Limited 4th Floor, Win-Win Towers, Tower B, Hi-Tech City, Hyderabad - 500 081 Contact Person- Siva Sai (9989343212)","location":"Hyderabad","experience":"0 - 1 Years"},{"date":"18, 19, 20, 21, 22 - Nov - 2019","skills":".Net (C# in ASPX), SQL Server and SSIS","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Affluent Global Service Private Limited, Patton House-2, 3rd Floor, 4th B Cross Road, 5th Block, Kormangala, Behind Empire Hotel,' Bangalore, Karnataka -560 034.","phone":"8123200700","profile":".Net Developer \nAffluent Global Services Pvt. Limited","description":"Looking for a .Net developer for supporting .Net application using (C# in ASPX). Good to have understanding in SQL DB as well. Nice to have knowledge in SQL Server and SSIS as well Primary Skills: .Net (C# in ASPX) Experience: 2-4 Years Shift Timings: 1 PM-9:30 PM Walk-in Date/ Time: 18th - 22nd November , 9 AM onwards Interview Venue: Affluent Global Service Private Limited Patton House-2, 3rd Floor, 4th B Cross Road, 5th Block, Kormangala, Behind Empire Hotel,' Bangalore, Karnataka -560 034. Contact - Hari Hara-D ( 8123200700 )","location":"Bangalore","experience":"2 - 4 Years"},{"date":"23 - Nov - 2019","skills":".Net, C# 7.0 and above, MS SQL, JavaScript, HTML5, Object Oriented Programming","qualification":"B.E./B.Tech, MCA/PGDCA","address":"G-Cube Webwide Software Pvt. Limited, 2nd Floor A-154/ A, Near TCS, Sector 63, Noida - 201 307","phone":"Not Provided","profile":".Net Developers \nG-Cube Webwide Software Pvt. Limited","description":"C# based API and business logic implementation. Contribution as a developer on different stages of Agile based development process. Development based on technical design (HLD, LLD) & functional design Ability to learn and adapt new technologies C# 7.0 and above, MS SQL, JavaScript, HTML5 Object Oriented Programming Understanding of functional programming. Should have good communication skills Must have Good Aptitude skills Worked on any advance Javascript framework (React, Backbone, Angular etc.) Worked on GIT based Source code management system .Net Core Walk-In Details:- Date & Time:- Saturday, 23rd November 2019 Interview Venue: G-Cube Webwide Software Pvt. Limited, 2nd Floor A-154/ A, Near TCS, Sector 63, Noida - 201 307 Contact Person:- Kapil Muni Sharma (HR)","location":"Noida","experience":"1 - 2 Years"},{"date":"18, 19, 20, 21, 22 - Nov - 2019","skills":"ASP .NET, C#, MVC, SQL, Web API, Angular JS, HTML, CSS, JQuery, Bootstrap","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Digital Minds Software Solutions Pvt. Limited, 2nd Floor, A-Wing, Softsol Building,, #4 Infocity, Beside Mindspace,Hi-tech City, Madhapur, Hyderabad, Telangana - 500 081","phone":"040 6688 5669","profile":"Software Engineers (ASP .Net) \nDigital Minds Software Solution Pvt. Limited","description":"Qualification: B. Tech/ MCA Experience: 2 to 3 years Process: .Net Domain Shift Timings: 9:00 am to 6:00 pm. Experience in designing web applications using HTML, CSS, Bootstarp, JQuery, Angular JS Experience on Developing applications using ASP.Net MVC & C# Writing and Consuming Web services & Web API Experience on SQL Server and dealing database using Entity Framework Knowledge on Kentico is an added advantage Skill Set: ASP .NET, C#, MVC, SQL, Web API, Angular JS, HTML, CSS, JQuery, Bootstrap. Interview Dates & Timings: From 18th to 22nd Nov 2019 between 10:00 Am to 4:00 Pm. Interview Venue: Digital Minds Software Solutions Pvt. Limited 2nd Floor, A-Wing, Softsol Building,, #4 Infocity, Beside Mindspace,Hi-tech City, Madhapur, Hyderabad, Telangana - 500 081 Team Contact: Email: hr@digitalminds.solutions PH: 9063610208/ 040 6688 5669","location":"Hyderabad","experience":"2 - 3 Years"},{"date":"18, 19, 20, 21, 22, 25, 26, 27, 28, 29 - Nov - 2019","skills":"C# .NET ASP .Net .NET Core MVC Entity Framework LINQ SQL Server","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Genzeon Technology Solutions Private Limited, #408, 4th Floor, 1st Block, PSR Prime Towers, Beside DLF building, Gachibowli, Hyderabad - 500 032","phone":"Not Provided","profile":"ASP .Net Developer \nGenzeon Technology Solutions Pvt. Limited","description":"Genzeon Technology Solutions Pvt. Limited is looking for .Net Developer with 3+ years of experience for our office at Gachibowli, Hyderabad. Required Skills: 4 years' experience in .Net technologies. C# .NET ASP .Net .NET Core MVC Entity Framework LINQ SQL Server Good programming skills, problem-solving and project documentation skills Good communication skills Walk-in Date/ Time: 18th - 29 November 2019, 10 AM onwards Interview Venue: Genzeon Technology Solutions Private Limited, #408, 4th Floor, 1st Block, PSR Prime Towers, Beside DLF building, Gachibowli, Hyderabad - 500 032 Contact Person- Tajdarali Syed","location":"Hyderabad","experience":"3 - 6 Years"},{"date":"18, 19, 20, 21, 22 - Nov - 2019","skills":"ASP .NET MVC, C#, WEB API, SQL Server, Entity Framework","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Futurism Technologies Private Limited, Futurism House, Survey No. 105, Opp. Sadanand Resort,, Mumbai-Bengaluru Bypass Highway, Baner, Pune, Maharashtra - 411 045","phone":"Not Provided","profile":"ASP .Net/ MVC Developer \nFuturism Technologies Private Limited","description":"We have two openings : 1. Developer (3 -5 Years Exp) (ASP .NET MVC, C#, WEB API, SQL Server, Entity Framework, Angular, HTML,CSS, JQuery, Javascript, JSON) (Who can develop any module from Scratch) (Domain :Ecommerce/ ERP/ CRM/ Retail) 2. Application Support (2-3 Years Exp) (Skills sets are same but candidate must be in maintenance /enhancement of the module) Walk-in Date/ Time: 18th - 22nd November , 9 AM onwards Address: Futurism Technologies Private Limited Futurism House, Survey No. 105, Opp. Sadanand Resort,, Mumbai-Bengaluru Bypass Highway, Baner, Pune, Maharashtra - 411 045 Contact - Mr Sudhir Mathur","location":"Pune","experience":"2 - 6 Years"},{"date":"18, 19, 20 - Nov - 2019","skills":"Net, SQL Queries, Web Services, MVC","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Nucsoft Limited, 602 A-Wing, Times square building, Marol Naka, Andheri - Kurla Road, Andheri (East), Mumbai - 400 059","phone":"Not Provided","profile":".Net Developer \nNucsoft Limited","description":"Minimum 2 to 7 years of experience into .Net Development Hands on experience in writing SQL Queries. Must have knowledge of Web Services, MVC. Exposure to BFSI domain will be an added advantage. Walk-in Date/ Time: 18th - 20th November , 10 AM onwards Interview Venue: Nucsoft Limited 602 A-Wing, Times square building, Marol Naka, Andheri - Kurla Road, Andheri (East), Mumbai - 400 059 Contact Person- Nazrana Alware Share your CV on : nazrana_alware@nucsoft.com","location":"Mumbai","experience":"2 - 7 Years"},{"date":"22 - Nov - 2019","skills":".Net SDLC OOPS Entity Framework Software troubleshooting","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Textronics Design Systems (I) Private Limited, Plot. No. EL-109, 2nd Floor, TTC Electronic Zone, MIDC Mahape Navi Mumbai - 400 710.","phone":"7977682014","profile":"Junior .Net Developer \nTextronics Design Systems (I) Pvt. Limited","description":"Textronics Design Systems (I) Private Limited is hiring On-Roll Employee for Software Developer ( C# ) Required Skills: WCF Services, WEB APIs, Microsoft Entity Framework, LINQ, Dependancy Injection Knowledge of design principles .Net SDLC OOPS Entity Framework Software troubleshooting Job Responsbility- Execute full life-cycle software development Database design (relation, cardinality, constraint, index) Database data manipulation(joins ,sub-query, cursor, stored procedure etc) Understand & write quality code Execute WCF services OOPs Walk-in Date/ Time: 22nd November 2019, 11 AM onwards Interview Venue: Textronics Design Systems (I) Private Limited Plot. No. EL-109, 2nd Floor, TTC Electronic Zone, MIDC Mahape Navi Mumbai - 400 710. Email : hr@textronic.net Contact Person- Vinay Patil (7977682014)","location":"Gurgaon","experience":"0 - 2 Years"},{"date":"18, 19 - Nov - 2019","skills":".Net, MVC, C#, Crystal Reports, SQL Server","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Vmoksha Technologies Pvt. Limited, #2799 & 2800, Srinidhi, Sector-1, 27th Main, HSR Layout, Bangalore - 560 102","phone":"080-41376300","profile":".Net Developer \nVmoksha Technologies Private Limited","description":"Minimum of 3-years relevant work experience in developing software applications using Microsoft technologies, Good communication and Documentation skills Should have at least 1.5 year experience in ASP .Net MVC Should have experience in HTML, JavaScript Primary Skills: .Net, MVC, C#, Crystal Reports Secondary- SQL Server Required Experience: 3 - 4 Years of experience in Dot net Developer. Walk-in Date/ Time: 18th - 19th November , 9 AM onwards Interview Venue: Vmoksha Technologies Pvt. Limited #2799 & 2800, Srinidhi, Sector-1, 27th Main, HSR Layout, Bangalore - 560 102 Land Mark: Above Bata Showroom, Near Agara flyover (view on Map) Contact - Pravallika ( 080-41376300 ) Note: Priority for Immediate Joiners and Please apply if you have experience in healthcare domain only","location":"Bangalore","experience":"3 - 6 Years"},{"date":"18, 19, 20, 21, 22, 23, 25, 26, 27, 28, 29, 30 - Nov - 2019","skills":"Core Java, JSP Servlets, JDBC, Spring & Hibernate","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Adjecti Solutions Private Limited, 123, Level-II, Tower-A, The Corenthum Building A-41, Sector 62, Noida - 201 301","phone":"0120-4089940","profile":"Java/ J2EE Developer (Trainee) \nAdjecti Solutions Private Limited","description":"Adjecti Solutions Private Limited is looking for Java/ J2EE Trainees in Java Stream.(Core Java, JSP Servlets, JDBC, Spring & Hibernate) ,which would be an exciting opportunity for B.E/ B.Tech/ MCA freshers, who are pass outs of 2019 & 2020 batch to join as Software Trainees and grow as Programmers/ Architects. Key Requirements- Have profound interest in Java technologies. Must have accomplished academic projects on Core Java, JSP Servlets, JDBC, Spring & Hibernate. Must have taken any professional training from any reputed training institute viz- Ducat, J Spiders, Cetpa Infotech, Trisect etc. Would be ready for signing an employment contract for 2 Years after training period of 6 months. Would be entitled for appraisal plans that are based on performance during this course of time. Below is the Interview Criteria- Aptitude Test Technical MCQs & Coding Round on Java technologies F2F discussion with Technical Panel. Walk-in Date/ Time: 18th - 30 November, 11 AM onwards Interview Venue: Adjecti Solutions Private Limited 123, Level-II, Tower-A, The Corenthum Building A-41, Sector 62, Noida - 201 301 Office Landline 0120-4089940 Contact - Jasmeen Kaur","location":"Noida","experience":"0 - 1 Years"},{"date":"18 - Nov - 2019","skills":"hr generalist activities, mis preparation, recruitment, background verification","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"SpiceJet Limited, Building No. 319, Udyog Vihar, Phase 4, Gurgaon - 120 016","phone":"Not Mentioned","profile":"HR Executive (only Male) \nSpiceJet Limited","description":"Any Graduate with excellent verbal and written communication skills Prior experience of business partnering and HR Operations preferred Knowledge of MS-Excel is must Open for travelling Eye for detail Kindly report at the below mentioned address and do carry a copy of your updated resume along: Date: 18th November' 2019 (Monday) Timing : 10 am Till 12 Noon SpiceJet Limited Building No. 319, Udyog Vihar, Phase 4, Gurgaon - 120 016. Dress Code : Formals","location":"Gurgaon","experience":"0 - 2 Years"},{"date":"16, 18, 19, 20, 21, 22 - Nov - 2019","skills":"PHP, HTML, CSS, Wordpress, Javascript, User Experience","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Zinnov Management Consulting Pvt. Limited, WrkPod, Coworking Space in Coimbatore Shared Office Space, 76-77, Nava India Road, KR Puram. Avarampalayam, Peelamedu, Coimbatore - 641 006.","phone":"7411811381","profile":"PHP Web Developer \nZinnov Management Consulting Pvt. Limited","description":"Candidate must have 1 to 3 years of experience working with Wordpress- adding new pages, templates, editing blogs, forms and managing extensions. Should have good experience customizing Wordpress pages with Php and Javascript. Extensive knowledge of CSS and HTML methods for providing performant visual effects Experience working with Responsive website to make user experience across all screen sizes consistent. Experience with monitoring, deployment and maintenance of website using Jenkins or other CI/CD tools. Ability to provide SEO solutions Knowledge of optimizing techniques to make the load time of website faster Ability to communicate complex technical concepts to both technical and non-technical audiences.Must have good communication skill Walk-in Date/ Time: 13th November - 22nd November , 9 AM onwards Interview Venue: Zinnov Management Consulting Pvt. Limited WrkPod, Coworking Space in Coimbatore Shared Office Space, 76-77, Nava India Road, KR Puram. Avarampalayam, Peelamedu, Coimbatore - 641 006. Contact - Vishnu BG ( 7411811381 )","location":"Coimbatore","experience":"1 - 3 Years"},{"date":"16, 18 - Nov - 2019","skills":"HR/ Recruitment, Talent Acquisition","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"CIEL HR Services, 3-10-53/ A,2nd Floor, Trimulgherry Circle, Sec-bad. Landmark: Opposite to PAI Showroom","phone":"040-48554489","profile":"HR Executive/ Recruiter \nCIEL HR Services Private Limited","description":"CIEL HR Services Private Limited, is currently looking for HR RECRUITER Qualification: Any Graduate Work Experience : 1+ Years Industry should handled like Pharma/ Healthcare/ Manufacturing/ Engineering Job Location : Tirumalagiri, Sec-bad, Hyderabad Salary : Upto 15,000/ Month Walkin Details Date : 16th & 18th November 2019 Timings : 11 am to 5 pm Venue Details CIEL HR Services 3-10-53/ A,2nd Floor, Trimulgherry Circle, Sec-bad. Landmark : Opposite to PAI Showroom Contact Person : Nikitha Call : 040-48554489","location":"Hyderabad, Secunderabad","experience":"1 - 5 Years"},{"date":"17, 18, 19, 20, 21, 22, 23 - Nov - 2019","skills":"Front Desk/ Receptionist Activities","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Skyrams Outdoor Advertising India Pvt. Limited, No. 15 & 17, Lalith Towers, 1st Floor GST Road, Alandur, Chennai - 600 016.","phone":"7558124533","profile":"Front Office Executive \nSkyrams Outdoor Advertising India Pvt. Limited","description":"Answer phones and operate a switchboard. Route calls to specific people. Answer inquiries about company. Greet visitors warmly and make sure they are comfortable. Call persons waiting for visitor and book them a room to meet in. Schedule meetings and conference rooms. Hand out employee applications. Arrange appointments. Make coffee and set out food. Ensure reception area is tidy. Coordinate mail flow in and out of office. Coordinate office activities. Handle phone calls from people calling in sick. Walk-in Date/ Time: 17th November - 23 November , 9 AM onwards Venue: Skyrams Outdoor Advertising India Pvt. Limited No. 15 & 17, Lalith Towers, 1st Floor GST Road, Alandur, Chennai - 600 016. Contact - Keerthana ( 7558124533 )","location":"Chennai","experience":"1 - 3 Years"},{"date":"18 - Nov - 2019","skills":"Back End Operations, Non Voice Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"EXL Services India Private Limited, A 18 Sector 59 Noida. Nearest Metro Station - Sector 59","phone":"Not Provided","profile":"Back Office Executive \nEXL Services India Private Limited","description":"EXL Services India Private Limited is hiring for Non Voice/ Back Office (Female Candidates) Any Graduate can apply (Female Only) Experience: 6 months of any experience Fresher can apply Candidate should have excellent Communication Skills Should be OK with night / rotational shifts Should have typing speed of 30+ wpm Walk-in Date: 18th November 2019 Time: 11:00 AM to 2:30 PM Interview Venue: EXL Services India Private Limited, A 18 Sector 59 Noida Nearest Metro Station - Sector 59 Note: Resume and Aadhar Card (original + 2 photocopy) along with 02 passport size photographs is mandatory to carry to enter inside the premises.","location":"Noida","experience":"3 - 5 Years"},{"date":"18, 19 - Nov - 2019","skills":"HR Administration, Brach Office Administration, Staffing, Record keeping","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Office No 09 and 10, 6Th Floor, Prabhu Orbit Building, Opp B.D Bhalekar Ground, Kalidas Kala Mandir Road Nashik - 422 001.","phone":"Not Provided","profile":"Branch Operations Executive \nAxis Bank Limited","description":"Ensuring that a resigning employee completes the requisite Exit formalities within TAT. Ensure that the employee separated on the ground of termination and absconding are update in the system on time and the records are been maintained properly. Candidate should have hands on experience in advance excel. Administration Responsibilities - Maintaining petty cash of the branch and record keeping of the expenses on monthly basis. Maintaining track of all office administration details such as expense details, stationery required and utilized, inward / outward courier details etc. Coordinating for the housekeeping of the branch. Audit Responsibilities - Maintaining the records of Audit - Maintaining all the necessary files, registers, and documents and email correspondents as the set guidelines of the company. Interested candidate, please walk in on below address with 2 copies of resume and photographs. Interview Date: - 18th & 19th November 2019 Time: - 10 AM to 4 PM Interview Venue- Office No 09 and 10, 6Th Floor, Prabhu Orbit Building, Opp B.D Bhalekar Ground, Kalidas Kala Mandir Road Nashik - 422 001. Contact Person: - Govind Palve Second & Forth Saturday & Sunday off will be off","location":"Nasik","experience":"1 - 6 Years"},{"date":"16, 17 - Nov - 2019","skills":"Android, Java (Oops), Git, Mercurial or SVN","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Ojas Innovative Technologies Pvt. Limited, 9th/2nd Floor, Block C/A, MJR Magnifique, Raidurgam, Hyderabad","phone":"Not Provided","profile":"Android Developer \nOjas Innovative Technologies Pvt. Limited","description":"Person should have hands on experience on Android and Java (Oops) Design and build applications for theAndroidplatform with latest OS Proficient understanding of code versioning tools such as Git, Mercurial or SVN Hand on Coding experience. Good Communication skills . Experience Level - 3 to 6 Years Work Location : Hyderabad Interview Process: CODE TEST/ Technical Discussion/ Managerial Discussion No of Positions - 10 Please come to F2F interview on 16th or 17th November' 2019. Timings: 9 AM onwards Interview Venue: Ojas Innovative Technologies Pvt. Limited 9th/2nd Floor, Block C/A, MJR Magnifique, Raidurgam, Hyderabad If you need more details mail to rajasekhar.poojari@ojas-it.com","location":"Hyderabad","experience":"3 - 6 Years"},{"date":"20 - Nov - 2019","skills":"Java, JSP, Spring, Hibernate, Javascript","qualification":"B.E./B.Tech, MCA/PGDCA","address":"eMudhra Limited, Survey No. 80/2 , Plot No. 23, 24 - 25, 2nd Floor Bellandur Village, Varthur Hobli, Bangalore - 560 103","phone":"080-42275322","profile":"Junior Java Developer \neMudhra Limited","description":"Immediate opportunity for Junior Java Developers with eMudhra@ Bangalore location: Work Experience: 6 months to 1 Year Key Skills: Java, JSP, Spring, Hibernate, Javascript Notice Period: Immediate /15-30 days Face to face Interview: 20th November 2019 9 AM onwards Venue: eMudhra Limited Survey No. 80/2 , Plot No. 23, 24 - 25, 2nd Floor Bellandur Village, Varthur Hobli, Bangalore - 560 103 Landmark : Above ICICI Bank , Bellandur Branch Contact Person- Deepa CS Interested candidates who are willing to attend the interview can drop the resume to Deepa.cs@emudhra.com or can reach on 080-42275322","location":"Bangalore","experience":"0 - 1 Years"},{"date":"18, 19, 20 - Nov - 2019","skills":"JAVA, Oracle, Spring, Hibernate, Jboss","qualification":"B.E./B.Tech, MCA/PGDCA","address":"In Solutions Global Limited, Unit No. 513, 4th Floor, Oxford Towers, Airport Road, Kodihalli, Bengaluru - 560 017","phone":"Not Mentioned","profile":"Java Developer \nIn Solutions Global Limited","description":"Candidate should be BE/ B.Tech or MCA with 1 to 4 years of experience on Software Development using Hands on experience on JAVA, Oracle, Spring, Hibernate, Jboss. Walk-in Date/ Time: 18th - 20th November 2019, 11 AM onwards Interview Venue: In Solutions Global Limited Unit No. 513, 4th Floor, Oxford Towers, Airport Road, Kodihalli, Bengaluru - 560 017 Contact Person - Serita Mathias","location":"Bangalore","experience":"1 - 4 Years"},{"date":"16, 17 - Nov - 2019","skills":"Java, Spring, Hibernate, Struts, Web Services NodeJs or Angular JS","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Information Dynamics India Private Limited, Elnet Software City, 6th Floor Module 61 & 63, Rajiv Gandhi Salai, Service Lane, Taramani, Chennai, Tamil Nadu - 600 113","phone":"Not Provided","profile":"Java Developer \nInformation Dynamics India Private Limited","description":"Information Dynamics India Private Limited have an opening for Java Developers for MNC . Work Experience: 2 to 8 Years Job Location : Coimbatore Notice Period : Immediate to 30 Days. Required Skills: Java, Spring, Hibernate, Struts, Web Services NodeJs or Angular JS Interested Candidate come to F2F Interview For Saturday and Sunday. Date: 16th & 17th November , 9 AM onwards Interview Venue: Information Dynamics India Private Limited Elnet Software City, 6th Floor Module 61 & 63, Rajiv Gandhi Salai, Service Lane, Taramani, Chennai, Tamil Nadu - 600 113 Contact Person : Shaik Noorani Documents to Carry : Updated Resume ID Proof","location":"Coimbatore","experience":"2 - 8 Years"},{"date":"16, 17 - Nov - 2019","skills":"Core Java, Rest Web services and Spring-boot","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Ojas Innovative Technologies Pvt. Limited, 9th/ 2nd Floor, Block C/A, MJR Magnifique, Raidurgam, Hyderabad","phone":"Not Provided","profile":"Senior Java Developer \nOjas Innovative Technologies Pvt. Limited","description":"Candidate should have experience in Core Java, Rest Web services and Spring-Boot. Proficient in developing web applications using Spring, Hibernate. Must have good hands on Coding experience Should have Good Communication skills Experience Level - 5 to 8 Years Work Location : Hyderabad Interview Process: CODE TEST/ Technical Discussion/ Managerial Discussion. No of Positions :60 Walk-in Date/ Time: 16th - 17th November , 9 AM onwards Interview Venue: Ojas Innovative Technologies Pvt. Limited 9th/ 2nd Floor, Block C/A, MJR Magnifique, Raidurgam, Hyderabad","location":"Hyderabad","experience":"5 - 8 Years"},{"date":"18, 19, 20, 25, 26, 27 - Nov - 2019","skills":"Core Java/ J2EE, JavaScript, Jquery, Struts/ Spring framework, Oracle DB PL, SQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Infonovum Software & Consulting Pvt. Limited, No 7, Sriman Srinivasa Road, Alwarpet, Chennai - 600 018","phone":"044-42059589","profile":"Java Developer \nInfonovum Software & Consulting Pvt. Limited","description":"Candidate should have good experience in the full development cycle, from requirements analysis through operations and maintenance Have strong hands-on experience with the following: o Java, Spring/ Spring Boot o XML technologies (XPath, XQuery, XSL) o XML databases o Experience with as many of the following is a plus: o HTML5/CSS3 o JavaScript/TypeScript, AngularJS, Angular 2+ o Linux, Windows Agile development methodology Excellent written and oral communication skills Mandatory Skills- Core Java/ J2EE, JavaScript, Jquery, Struts/ Spring framework, Oracle DB PL, SQL Walk-in Date:18th to 27th November 2019 Only from Monday to Wednesday (every week) Timings: 10 AM - 1 PM Interview Venue: Infonovum Software & Consulting Pvt. Limited No 7, Sriman Srinivasa Road, Alwarpet, Chennai - 600 018","location":"Chennai","experience":"1 - 4 Years"},{"date":"18, 19, 20, 21 - Nov - 2019","skills":"BPO Hiring, Talent Acquisition, Head Hunting, Non IT Recruitment","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"HappyEasyGo India Private Limited, First Floor, Plot No. 883, Udyog Vihar Phase-V, Gurugram - 122 003, Haryana","phone":"0124-6409930","profile":"Talent Acquisition Executive \nHappyEasyGo India Private Limited","description":"Candidate should be Good in Bulk Hiring, Volume Hiring or Mass Hiring would be an added advantage. Should be good in Communication Skills. Can manage End to End Recruitment. Candidate from BPO Background will be Preferred. Roles & Responsibilities: Working closely with business unit heads in closing approved open positions within optimum cost, quality & time. Good experience in BPO hiring or Bulk Hiring, people who can manage Volume hiring, daily walk-ins drives. Partnering with existing employees/recruitment portals/campuses/ social media websites for talent acquisition. Involvement in end to end recruitment life cycle in Permanent / Contractual staffing. Walk-in Date/ Time: 18th - 21st November , 12 AM onwards Venue: HappyEasyGo India Private Limited First Floor, Plot No. 883, Udyog Vihar Phase-V, Gurugram - 122 003, Haryana Phone No. - +91-0124-6409930/ 99 Contact Person : Mr. Laxman/ Meenakshi (HR)","location":"Gurgaon","experience":"2 - 5 Years"},{"date":"16 - Nov - 2019","skills":"Php, MVC framework, Angularjs, CSS, Laravel, MVC Framework, HTML","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Buzzyears Education Private Limited, Palm court, 7th floor, 704, Skolaro, Sector 16, Gurgaon","phone":"09650299233","profile":"Junior PHP Developer \nBuzzyears Education Private Limited","description":"Qualification: B.Tech in Computer Science/ BCA Work Experience: 0 to 2 Years Fresher can also apply Technical Skills- PHP development Knowledge including and not limited to MVC framework and experience with scripting languages including JQuery. Knowledge of LAMP (Linux-Apache/ Lighty-MySQL-PHP) based development. Proficiency using HTML/ CSS/ Javascript/ AJAX/ jQuery/ NodeJS/ Angularjs in a production environment Must have strong CS fundamentals gained through Bachelor's degree in Computer Science or related field with equivalent experience. Looking for young, energetic mind with good coding skills. Open for challenges Walk-in Date/ Time: 16th November 2019, 10 AM onwards Interview Venue: Buzzyears Education Private Limited Palm court, 7th floor, 704, Skolaro, Sector 16, Gurgaon Contact - Munmun Sarkar Tel: 09650299233","location":"Gurgaon","experience":"0 - 2 Years"},{"date":"16 - Nov - 2019","skills":"Php, MySQL, JavaScript, Ajax, JQuery","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Extramarks Education India Pvt. Limited, D-180, Sector 63 Noida - 201301","phone":"Not Provided","profile":"PHP Developer \nExtramarks Education India Pvt. Limited","description":"Candidate must have strong knowledge in MySQL Database. Analyse, Create and Normalize database independently. Strong in Smarty, Zend with installation process, JavaScript, Ajax, JQuery. Knowledge of Apache Server and Linux. Knowledge of XML, HTML, HTML5, XHTML, CSS. Should be able to handle the project independently. Can understand and work on running projects. Can be able to handle multiple projects simultaneously. Walk-in Date/ Time: 16th November from 10 AM onwards Interview Venue: Extramarks Education India Pvt. Limited D-180, Sector 63 Noida - 201301","location":"Noida","experience":"1 - 3 Years"},{"date":"18, 19, 20, 21, 22 - Nov - 2019","skills":"Php, MySQL, CSS, Codeigniter, Javascript","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Avplat India Private Limited, Flat 511, KTC Illumination, Mind Space, Madhapur, Hyderabad","phone":"9618755050","profile":"Software Engineer (PHP) \nAvplat India Private Limited","description":"Avplat is seeking an Angular/ Ionic Developer Full-stack Developer to join us in developing premium native experiences for our consumers. In this role, you will deliver well designed, highly testable, and resilient applications. You will also be instrumental in driving our mobile technology roadmap forward and evangelizing mobile development and testing practices. The successful candidate is both deeply experienced with mobile development and a team player that thrives in a collaborative agile environment. Walk-in Date/ Time: 18th - 22nd November , 10 AM onwards Interview Venue: Avplat India Private Limited Flat 511, KTC Illumination, Mind Space, Madhapur, Hyderabad Contact - Naveen (9618755050)","location":"Hyderabad","experience":"2 - 5 Years"},{"date":"16 - Nov - 2019","skills":"PHP-CorePHP, Smarty, MVC Framework","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Yamaha Motor Solutions India Pvt. Limited, 19/6, Mathura Road, Faridabad, Haryana - 121 006.","phone":"0129-4013957","profile":"Core PHP Developer \nYamaha Motor Solutions India Pvt. Limited","description":"Qualification: B.Tech/ M.Tech/ MCA/ M.Sc. or Equivalent Experience : 6 months - 3 Years Job Location : Faridabad Required Skills: Hands-on programming experience in PHP-CorePHP, Smarty, MVC Framework Experience working with MVC Framework CakePHP or CodeIgniter etc. Excellent in JavaScript and jQuery PSD to HTML Conversion Good Knowledge in JASON, REST API, XML, AJAX and CSS3 Excellent Hands-on experience in MYSQL database in writing DDLs, DMLs, Stored Procedures, Views, Functions and Indexing Worked on mysql or postgres and Web Servers Apache or ngnix Knowledge on Website server management tool Optimization SEO/Content/Website Speed, Web security Walk-in Date: 16th November 2019 (Saturday) Time - 10 AM - 12 PM Interview Venue: Yamaha Motor Solutions India Pvt. Limited 19/6, Mathura Road, Faridabad, Haryana - 121 006. (Landmark: Opp. Escorts Mujesar Metro Station) Contact Person: Ms. Anu Contact No: 0129-4013957","location":"Faridabad","experience":"1 - 3 Years"},{"date":"16, 18, 19, 20 - Nov - 2019","skills":"Php, MVC, Framework, Cake Php, Core Php, Codeigniter, Yii","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"BELAIR Travel and Cargo Pvt. Limited, Plot No. 9 Pocket 3, Sector 11, Dwarka, New Delhi","phone":"011-43149007","profile":"PHP Developer \nBELAIR Travel and Cargo Pvt. Limited","description":"Candidate should be BE/ B.Tech/ M.Tech or MCA with 1 to 3 years of experience in Php, MVC, Framework, Cake Php, Core Php, Codeigniter, Yii. Able to write clean, well designed code. Produce detailed specifications. Troubleshoot, test and maintain the core product software and databases to ensure strong optimization and functionality. Contribute in all phases of the development lifecycle Walk-in Date/ Time: 15th - 20th November , 11 AM onwards Interview Venue: BELAIR Travel and Cargo Pvt. Limited Plot No. 9 Pocket 3, Sector 11, Dwarka, New Delhi For further details email your resume at hr@belair.in or call on 011-43149007 Contact Person- Himani Rawal","location":"Delhi","experience":"1 - 3 Years"},{"date":"16 - Nov - 2019","skills":"PHP Web Codeigniter framework, MVC design patterns.","qualification":"B.E./B.Tech, MCA/PGDCA","address":"IonIdea Enterprise Solutions Pvt. Limited, # 38-40, EPIP, Whitefield, Besides SAP LABS, Bangalore - 560 066. Landmark: KTPO Stop, Near Ginger Hotel","phone":"080-66581500","profile":"PHP Developer \nIonidea Interactive Private Limited","description":"Candidate must have strong knowledge of PHP Web Codeigniter framework. Understanding the fully synchronous behavior of PHP, MVC design patterns. Thorough knowledge of front-end technologies, such as JavaScript, Jscript, HTML5, Bootstrap and CSS3. Knowledge of object-oriented PHP programming Knowledge of MySQL server and SQL queries Understanding accessibility and security compliance Walk-in Date/ Time: 16th November 2019, 9 AM onwards Interview Venue: Ionidea Interactive Private Limited # 38-40, EPIP, Besides SAP LABS Whitefield, Bangalore - 560 066. Landmark: KTPO Stop, Near Ginger Hotel Contact Person- Mercia","location":"Bangalore","experience":"2 - 6 Years"},{"date":"16 - Nov - 2019","skills":"Python & Front-end Technologies, Object-Oriented Programming","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Ardentia Technologies Pvt. Limited, Office No 74 & Office No 114, Udyog Bhavan, Sonawala Road, Goregaon (East), Mumbai - 400 063","phone":"Not Provided","profile":"Python Developer/ Fresher \nArdentia Technologies Pvt. Limited","description":"Candidate must have good understanding of Python & Front-end technologies Strong in Logical Thinking, understanding in object-oriented programming Understand the software Development Life cycle Should have good communication skills Must be ready for 2 Years Employment Contract Interview Process: Written Aptitude Test HR round 1st Technical Round Final Technical Round Walk-in Date: 16th November 2019 Timings: 9:00 AM to 12:00 PM Interview Venue: Ardentia Technologies Pvt. Limited Office No 74 & Office No 114, Udyog Bhavan, Sonawala Road, Goregaon (East), Mumbai - 400 063 (5 Minutes walking distance from Goregaon - East station) Contact Person- Jayashree/ Kamlesh","location":"Mumbai","experience":"0 - 1 Years"},{"date":"16, 17, 18, 19, 20, 21, 22 - Nov - 2019","skills":"PHP, MySQL, Javascript, HTML5 and CSS, AJAX, JQuery, XML, and Linux","qualification":"B.E./B.Tech, MCA/PGDCA","address":"ITP Software India Private Limited, #2C2 , Wing C, 2nd Floor, Melange Towers, Patrika Nagar, Madhapur, Hitech City, Hyderabad, Telangana - 500 081.","phone":"9121543121","profile":"PHP Developer \nITP Software India Private Limited","description":"Candidate should have 4 - 10 years of experience in PHP, MySQL, Large Scale Web applications. Must have In-depth understanding of MVC architecture, Object Oriented Concepts and Design patterns with experience in PHP Framework like Codelgniter. Profound knowledge about state-of-the-art technologies and standards (PHP, MySQL, Javascript, HTML5 and CSS, AJAX, JQuery, XML, and Linux) Strong Analytical problem solving and trouble shooting skills. Strong in PHP5, MYSQL, Javascript, JQuery, AJAX, HTML5, CSS3. Must understand responsive design. Experience in software development life-cycle and best practices. Strong Database and SQL skills, Database and query Optimization in MySQL Must be able to work on own initiative as well as part of a team Excellent verbal & written communication skills Exposure to Linux environment would be an added advantage Walk-in Date/ Time: 16th - 22nd November , 10 AM onwards Interview Venue: ITP Software India Private Limited #2C2 , Wing C, 2nd Floor, Melange Towers, Patrika Nagar, Madhapur, Hitech City, Hyderabad, Telangana - 500 081. Contact - Myra ( 9121543121 )","location":"Hyderabad","experience":"4 - 9 Years"},{"date":"15, 16, 18, 19, 20, 21, 22, 23, 25, 26, 27, 28, 29 - Nov - 2019","skills":"IT Service Desk/ Tech support / ITES/ International Voice Process","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Tech Mahindra Limited, Plot- 45-47, Gate 1, ITC-4, (Abdul Kalam) KIADB Industrial Area, Electronic City, Phase -2 Bangalore - 560 100","phone":"7981960648","profile":"Technical Support (International Process) \nTech Mahindra Limited","description":"Candidate should have at least 1 to 2 years in IT Service Desk/ Tech support / ITES environment desirable or similar profile from an International voice process. Should have experience or clear understanding in Basic Hardware Troubleshooting of PCs, MS Office /Office 365 applications. Knowledge & Skills- Fluent in English verbal and Nonverbal Excellent telephone skills Customer focused Ability to multi-task and prioritize workload Ability to adapt to continuously changing procedures and environment Team player with strong interpersonal skills Key Accountability: Respond to incident calls and emails from users on desktop issues, hardware, application related issues and queries. Ask targeted questions to quickly understand the root of the problem. Perform IT installations, configurations and troubleshoot computer hardware and software in accordance with IT Services standards. Walk In Date: 15th - 29 November 2019 Time: 10 AM to 3 PM (Weekdays) Venue: Tech Mahindra Limited Plot- 45-47, Gate 1, ITC-4, (Abdul Kalam) KIADB Industrial Area, Electronic City, Phase -2 Bangalore - 560 100 Job Location - ITPL or Electronic City Contact Person - Manish 7981960648 or 9008073809","location":"Bangalore","experience":"1 - 4 Years"},{"date":"15 - Nov - 2019","skills":"Java EE platforms, Apache Tomcat 7, Weblogic 12c, Jboss","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Exela Technologies (SourceHOV) 106, Annasalai, Land Mark: Near ABT Maruthi Showroom, Guindy , Chennai 32, (Located next to Wipro Building)","phone":"7550274743","profile":"Java Developer \nSourcehov India Private Limited","description":"Candidate should be B. Tech, MCA, M. Tech degree in Computer Science Engineering or a related subject with 1+ years of proven hands-on experience in Java/ Software Development. Hands on experience in using REST APIs and Web Services (SOAP) within a web platforms Hands on experience in designing and developing applications using Java EE platforms Object oriented analysis, UML and design using common design patterns. Hands on experience in development IDE (Eclipse) Hands on experience on using application server (Apache Tomcat 7, Weblogic 12c, Jboss) Excellent knowledge of Relational Databases, SQL and ORM technologies (JPA2, Hibernate) Experience in the Spring Framework, Maven Walk-in Date/ time: 15th November 2019 from 10 AM onwards Interview Venue: Exela Technologies (SourceHOV) 106, Annasalai, Land Mark: Near ABT Maruthi Showroom, Guindy , Chennai 32, (Located next to Wipro Building)","location":"Chennai","experience":"1 - 2 Years"},{"date":"14, 15 - Nov - 2019","skills":"Administration, Project Management, Document Control, Project Coordination","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Rexus India Private Limited, C312, Mittal Commercia, Marol, Andheri (East), Mumbai - 400 059.","phone":"022-49713072","profile":"HR & Project Coordinator \nRexus India Private Limited","description":"Candidate should have Any Bachelors Degree from an accredited college or university in Computer/ Electronics or any stream. Fresher or 1 to 3 years related experience in the IT hardware and Networking industry with at least 1 year experience in project management role and IT recruitment. Must have fluency in English Certification in PMP or Prince will be preferred MBA in HR or Diploma in HR preferred. Work Timings Options: Morning Shifts, 1 pm 10 pm, etc. Walk-in Date/ Time: 11th November - 15th November , 2 PM onwards Venue Details- Rexus India Private Limited C312, Mittal Commercia, Marol, Andheri (East), Mumbai - 400 059. Phone No: 022-49713072 Contact Person- Kumkum Choudhary","location":"Mumbai","experience":"0 - 3 Years"},{"date":"14, 15, 16, 18, 19, 20 - Nov - 2019","skills":"HR/ Recruitment, General Administration, Back Office Activities","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Quintessence Business Solutions & Services, Module 21 & 23, Second Floor. Elnet Software City, TS-140, Block 2&9, Rajiv Gandhi Salai, Taramani, Chennai - 113.","phone":"Not Provided","profile":"HR/ Admin Executive \nQuintessence Business Solutions Services Pvt. Limited","description":"We are looking for MBA/BBA (HR) with 0 months to 1 year experience Freshers can also apply Should have good communication skills Preferably female candidate Flexible to work in night shift Job Responsbility- End to end recruitment process Handling the vendor management Responsible of on-boarding the new joinees and handing over to the operations Walk-in Date/ Time: 13th - 20th November from 12 PM onwards Interview Venue: Quintessence Business Solutions & Services Module 21 & 23, Second Floor. Elnet Software City, TS-140, Block 2&9, Rajiv Gandhi Salai, Taramani, Chennai - 113. Interested candidates can walk In directly from Monday to Friday at 11.00 a.m. to 3.00 p.m Or forward your CV to sangeetha.p@qbssmail.com Contact Person : Sangeetha HR","location":"Chennai","experience":"0 - 1 Years"},{"date":"14, 15 - Nov - 2019","skills":"Managing Front Office / Reception/ Housekeeping /Security/Courier services/Vendors","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Kotak Mahindra Life Insurance Company Limited, Neelima Nirupama, 4th Floor, Plot No- 55, Old no -22A, Vijay Raghava Road, T Nagar, Near Andhra Club, Chennai - 600 017","phone":"022-66057050","profile":"Administration Executive \nKotak Mahindra Life Insurance Co. Limited","description":"Applicant should be a graduate with min 6 month work-experience. Age should not be more than 28 Knowledge of Admin role is a must Aware of Local language must Managing Front Office / Reception/ Housekeeping /Security/ Courier services/ Vendors Maintaining Registers & Reports. Budgeting and working for cost reduction/saving. Printing & Purchase of Stationeries Repairs and upkeep of branch infrastructure (AC, DG , telephone lines), Engineering Services(AC, UPS Electricity etc). Arranging all the required items for routine operations. Managing On time Vendor Payment Process Preferences -(Only Female Candidates can apply) Walk-in Date/ Time: 14th - 15th November , 11 AM onwards Interview Venue: Kotak Mahindra Life Insurance Company Limited Neelima Nirupama, 4th Floor, Plot No- 55, Old no -22A, Vijay Raghava Road, T Nagar, Near Andhra Club, Chennai - 600 017 Contact Person- Jayshree Bhati ( 022-66057050 )","location":"Chennai","experience":"0 - 1 Years"},{"date":"14, 15, 16, 18, 19, 20, 21 - Nov - 2019","skills":"General Administration, Front Desk/ Travel Desk, Visitors / Guest Relations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Sankalpan Infrastructure Private Limited, A G -001, Thane One, G.B. Road, Majiwade Thane (West) - 400610","phone":"022 6691 9400","profile":"Front Desk Administrator \nSankalpan Infrastructure Private Limited","description":"Candidate should be Any Garduate with 2 to 4 years of experience in General Administration, Front Desk/ Travel Desk, Visitors / Guest Relations. Must have excellent communication skills Job Responsbility- To take care of travelling arrangements and maintain of Airtel for employees. To be presentable on front desk. To represent the company's image being on front desk effectively by delivering prompt services to the internal staff and external visitors. Interaction on phone with clients and handling the EPABX system. Walk-in Date/ Time: 12th - 21st November , 11 AM onwards Interview Venue: Sankalpan Infrastructure Private Limited A G -001, Thane One, G.B. Road, Majiwade Thane (West) - 400610 Tel No: 022 6691 9400 Contact Person- Amol Humane","location":"Mumbai","experience":"2 - 4 Years"},{"date":"15 - Nov - 2019","skills":"J2EE, Spring Core, Spring MVC, Hibernate, JPA, JavaScript, Servlets","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Infosys BPM Limited, #785, Ground Floor Axis Sai Jyoti 15th Cross 100 Feet Road Sarakki, 1st Phase J P Nagar, Bangalore","phone":"Not Provided","profile":"Technical Support (L1 Support) \nInfosys BPM Limited","description":"Walk-in @ INFOSYS BPM- Hiring for Technical Support (L1 Support) -Bangalore ELIGIBILITY CRITERIA: Designation: Senior Technical Process Executive Domain: Voice Process Education: Any Graduate/Post Graduate (With No Backlogs) Total Experience: 1 to 2 of relevant experience in Technical Help Desk/Customer Support /Service Desk Good Product Knowledge on current Technical world Logical & Analytical Ability People Mgmt. & Interpersonal skill Problem Solving Skills & Trouble shooting capabilities on product and tool Client Interactions Skills Soft Skill: Assertive and effective in communications (written & verbal) Analytical ability, Good working knowledge of MS Office INTERVIEW DATE : 15th-November-2019 (Friday) TIME: 10:00 AM-12:00 PM VENUE DETAILS : Infosys BPM Limited #785, Ground Floor Axis Sai Jyoti 15th Cross 100 Feet Road Sarakki, 1st Phase J P Nagar, Bangalore Landmark - Sindhuri Convention Hall. CONTACT PERSON: Umashankar REFERRED BY: Roshni The candidate should carry below mentioned documents in Original: A copy of Resume 10th, 12th, Graduation and Post-Graduation (Mark Sheet and Certificate). Provisional Degree Certificate 2 Color Passport Size Photographs. ID Proof - Pan Card, Driving License, Voters ID, and Passport. AADHAAR CARD-Mandatory DISCLAIMER: Kindly do not carry Laptops to the Interview Venue.","location":"Bangalore","experience":"1 - 3 Years"},{"date":"16 - Nov - 2019","skills":"Technical Support, International Voice Process, Customer Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Artech Infosystems Private Limited, INFOSPACE, B - II, Tower II, Ground Floor, Sector - 62 | NOIDA - 201 307","phone":"Not Provided","profile":"Technical Support Associates \nArtech Infosystems Private Limited","description":"Artech presents a wonderful opportunity to start career in US Recruitment!! Considering Candidates from BPO Background/ Technical Support ELIGIBILITY CRITERIA (3 Months-2 Years of experience in any of the following domains) International BPO Technical Support Domestic IT Staffing MUST HAVE Good Communication Skills Any Graduate JOB ROLE - Responsible for sourcing profiles through various Job Portals Like Dice, Monster, carrier Builder. Contacting candidates and qualifying them on Skills vs experience, area of Interest, Geographic location in US and Visa types etc. and candidates commitment towards work Meeting daily & Weekly targets by submitting quality candidate for our clients various vertical Projects Complete analysis of candidate's current / previous project and responsibility undertaken per project. Building good relationship and reputation with each candidate for long term association Formatting resumes according to clients requirement Coordinating interviews on call for the shortlisted candidates Appropriate paperwork to be done before on boarding the candidate Sending daily performance report to the Account manager Rush to the Mega Walk-In on SATURDAY 16th Nov 2019 per the details given below- TIME: 11:00 AM IST - 03:00 PM IST VENUE Artech Infosystems Private Limited INFOSPACE, B - II, Tower II, Ground Floor, Sector - 62 | NOIDA - 201 307 Landmark- Labor Chowk/ Park Ascent Hotel/ Father Agnel School/ Barclays Building","location":"Noida","experience":"1 - 2 Years"},{"date":"15, 18, 19, 20, 21, 22, 25, 26, 27, 28, 29, 30 - Nov - 2019","skills":"Technical Support/ Service Desk/ Help Desk","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Tech Mahindra Limited; Hinjewadi Phase-3, Pune","phone":"02042252879","profile":"Technical Support Associate \nTech Mahindra Limited","description":"Looking for L1 Support engineer/ Technical Support/ Service Desk/ Help Desk experience. Min 0.6 Months of relevant experience is Mandatory (Technical Support with International Voice Process) and Immediate joining. Candidate should be aware of basic technical knowledge and should have below skill set * Password reset & Account unlock (AD and other applications) * Active Directory account management * MS office application issues * Remote Desktop Management * MS Outlook issues (profile creation, PST, permissions, calendar sharing, delegation) * Creation/Access Management of Network Drives and Shared Folders * Browser trouble shooting * Wireless troubleshooting Walk In Date: 9th - 30 November , 12 PM onwards Time: 12pm to 4pm PM (MON-FRIDAY) Venue: Tech Mahindra Limited; Hinjewadi Phase-3, Pune Contact Person: HR Jasbeer Contact No: 02042252879 (Direct Line) Candidates can call between 12.30 to 8.30 Mon-Sat","location":"Pune","experience":"0 - 3 Years"},{"date":"16 - Nov - 2019","skills":"Technical Support, SQL Queries, IT Helpdesk","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Amazon Development Centre (India) Pvt. Limited, 40, B Block, 5th Floor, Global Infocity (SP Infocity), M G R Salai, Perungudi, Kandanchavady, Chennai - 600 096","phone":"Not Provided","profile":"Technical Support Associate \nAmazon Development Centre (India) Pvt. Limited","description":"Amazon Development Centre (India) Pvt. Limited, is hiring Technical Support Associate / Technical Ops Associate for Chennai location. Eligibility Criteria: Minimum Qualification - Any Graduation Should have knowledge in SQL & Linux. Should be able to write query in SQL and use Linux Commands. Excellent problem Solving Skills. Work Experience - 0-3 years (Max). Notice period shouldn't be more than 1 month. The candidates who have appeared for Tech Ops / Tech Support Associate in the last 6 months are not eligible to re-apply. Walk-in Date: 16th Nov, Saturday Time: 10.00 am to 12.00 pm Venue Details: Amazon Development Centre (India) Pvt. Limited, 40, B Block, 5th Floor, Global Infocity (SP Infocity), M G R Salai, Perungudi, Kandanchavady, Chennai - 600 096 Contact Person: Karthikeyan Please carry hard copy of below documents (Mandatory): 2 copies of resume for the interview. Copy of PAN Card & Adhar Card Provisional Certificate / Degree Certificate of Highest educational qualification Last three months pay slip and Relieving letter from all previous employers Please carry of original government ID proof for security Perks and Benefits Transportation & Meal Voucher","location":"Chennai","experience":"0 - 3 Years"},{"date":"16 - Nov - 2019","skills":"ASP .Net, asp.net Core, ASP.net MVC (.Net 4+ onwards)","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"MRT Info Technologies Pvt. Limited, Smartworks, Fleet House, Andheri - Kurla Road, Gamdevi, Marol, Naka, Mumbai - 400 059","phone":"9154579470","profile":".Net Developer \nMRT Info Technologies Pvt. Limited","description":"Work Experience : 2-9 Years Notice period : Immediate to Max 30 days Must have good knowledge in ASP .Net, asp.net Core, ASP.net MVC (.Net 4+ onwards) Must have good knowledge in .Net Core WEB API 2 Must have good knowledge in Object oriented programming Must have good knowledge in design patterns Must have good knowledge in C# Must have knowledge in Integrating RESTful APIs to connect to back end services Should have good knowledge of using JSON data and XML data sets Have knowledge in Jquery, Javascript Must be good in Oracle or SQL Server - query writing Should know writing queries and stored procedures. Should have good communication and analytical skills Knowledge of any JS framework angular / React / Vue JS will be an advantage Good Communication, Problem Solving, Interpersonal skills with ownership mindset and passion towards the role. Walk-in Date/ Time: 16th November 2019, 10 AM onwards Venue: MRT Info Technologies Pvt. Limited Smartworks, Fleet House, Andheri - Kurla Road, Gamdevi, Marol, Naka, Mumbai - 400 059 Contact - Rafat Tanveer Contact number : 9154579470, 9848033990 Please mention MRT Infotech on the top of the resume","location":"Mumbai","experience":"2 - 9 Years"},{"date":"13, 14, 15 - Nov - 2019","skills":"Manual Testing, SDLC and STLC life cycle, SQL queries","qualification":"B.E./B.Tech, MCA/PGDCA","address":"PACCORE SOFTWARE INDIA PVT LIMITED, 1-89/G/36 PLOT NO-36, NASUJA BUILDING SHILPI VALLEY, Madhapur, HYDERABAD-500081","phone":"040-40125455","profile":"Quality Analyst (Manual Testing) \nPaccore Software (India) Private Limited","description":"Looking for IT Professional with 2+ years of Manual Testing experience and who can join immediately Must have good understanding in SDLC and STLC life cycle Ability to develop and document test cases for projects Good knowledge on various testing concepts and experience in execution Good knowledge on SQL queries Good knowledge on defect tracking tool - Microsoft test manager (MTM) is an added advantage. Good Communication Skills Walk-in Date/ Time: 13th - 15th November 2019, 2 PM onwards Venue: PACCORE SOFTWARE INDIA PVT LIMITED 1-89/G/36 PLOT NO-36, NASUJA BUILDING SHILPI VALLEY, Madhapur, HYDERABAD-500081 Land Mark : Opposite Westin, Mind Space Contact Person- Pallavi Joseph Phone# 040-40125455","location":"Hyderabad","experience":"2 - 3 Years"},{"date":"16, 17 - Nov - 2019","skills":"software testing, load testing, defect reporting, performance testing, testing tools","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Mosaic Hotels (a unit of Shipra Hotels Ltd.) C-1 | Sector 18 | Noida - 201301","phone":"9594862744","profile":"Senior Software Tester \nMindgate Solutions Private Limited","description":"There is an urgent requirement for our Organisation for the position of Sr. Software Tester and the interviews are being organised on Saturday,16th November 2019 in between 10:00 am - 3:00 pm at Noida and Sunday,17th November 2019 in between 10:00 am-3:00 pm at Delhi Location . Educational Qualification: - BE/B. Tech/MCA or BCA/Bachelor Degree with Degree/Diploma in Computer Science/ Information Technology Experience:- i) Total 4+ years in software development ii) Minimum 3 years of working Experience on Software testing in application lifecycle management environment & familiarity with best practices in software development and testing in Microsoft platform including load testing iii) Minimum 3 years' experience of testing tools i.e. iv) 2+ years of experience of testing on Suite of Visual Studio v) 2+ years of experience in manual testing Interview Date:16th November 2019 Time: 10:00 am-3:00 pm Interview Location: Mosaic Hotels (a unit of Shipra Hotels Ltd.) C-1 | Sector 18 | Noida - 201301 | India Interview Date: Sunday,17th November 2019 Time: 10:00 am-3:00 pm Interview Location: Hotel Emarald, 112, Babar Road,Opp.World Trade Center,Connaught Place, New Delhi.110001,PH.91-11-40044000 Interview Time:10:00 am -3:00 pm Contact - Sanjana ( 02261966105 ) Interested Candidates whose profile is matching to the job description mentioned can directly come for personal Interview on any of the above mentioned address as per the said dates . Kindly consider this mail itself as an confirmation for the interview if the above mentioned criteria are matching to your profile.","location":"Delhi, Noida","experience":"4 - 7 Years"},{"date":"16 - Nov - 2019","skills":"QA, Automation Testing, Selenium with Java","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Tetrasoft India Private Limited, Plot No. 16, Sector - III, HUDA Techno Enclave, Opposite K. Raheja IT Park, Hyderabad","phone":"040 67551532","profile":"QA/ Automation Tester \nTetrasoft India Private Limited","description":"Work Experience: 4 to 9 Years Key Skills: Selenium with Java (Should be very Strong) Job Location: Hyderabad Walk-in Date/ Time: 16th November , 10 AM onwards Interview Venue: Tetrasoft India Private Limited Plot No. 16, Sector - III, HUDA Techno Enclave, Opposite K. Raheja IT Park, Hyderabad Contact Person- Sriram Phone: 040 67551532 NOTE: Candidates who are attended interview with Tetrasoft in Last 3 months are not eligible for this Drive.","location":"Hyderabad","experience":"4 - 9 Years"},{"date":"13, 14 - Nov - 2019","skills":"Software Testing, Manual Testing, Test Scripts, Testing Concepts","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"WIPRO HR Services Private Limited, Candor Info Space, Building 2, Subhash Chowk, Tikri, Sector 48, Gurgaon - 122 001.","phone":"Not Provided","profile":"Manual Testing Engineer \nWIPRO HR Services Private Limited","description":"Education: Any Graduate with relevant work experience BE/ B.TECH/ MCA (preferred) Required Experience: 6-8 years of work experience in US/CAN Health and Wealth (HW) domain and benefits administration. Strong project management skills. Should able to interpret Clients requirement and provide analysis & updates (configuration )in the system Should possess good Testing Knowledge and SQL Queries. Should able to communicate on Requirement Analysis in the project involved Knowledge of Software Development Life Cycle (SDLC) principles/concepts. Excellent Communication Skills Experience in creating test plans, identifying test cases and perform test execution. Experience in relational databases, ability to write SQL queries. Experience in MS Office tools specifically MS Excel. Ability to communicate ideas in both technical and user-friendly language. Ability to conduct research into application development issues and products. Ability to translate client requirements and/or legislation into system specifications. Experience working in a team-oriented, collaborative environment. Walk-in Date: 13th & 14th November' 2019 (Wednesday and Thursday) Time - 11:30 am to 1:00 pm Interview Venue: WIPRO HR Services Private Limited Candor Info Space, Building 2, Subhash Chowk, Tikri, Sector 48, Gurgaon - 122 001. Contact Person- Pallavi Shah","location":"Gurgaon","experience":"6 - 8 Years"},{"date":"15 - Nov - 2019","skills":"Build test scenarios, suites, data & cases Test case execution Analyze failure & report defect","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Textronics Design Systems (I) Private Limited, Plot. No. EL-109, 2nd Floor, TTC Electronic Zone, MIDC Mahape Navi Mumbai - 400 710.","phone":"7977682014","profile":"Junior Software Tester \nTextronics Design Systems India Pvt. Limited","description":"Textronics Design Systems India Pvt. Limited is Hiring On-Roll Employee for Junior Software Tester Required Skills: Proficient English Communication Time Mangement Positive attitude Multi-tasking Documentation NOTE Candidates with Testing Course preferred Job Responsbility Build test scenarios, suites, data & cases Test case execution Analyze failure & report defects Review ongoing development or technical documentation Upload content testing & resolution EXE testing Bug reporting & resolution Error documentation Walk-in Date/ Time: 15th November 2019, 11 AM onwards Interview Venue: Textronics Design Systems (I) Private Limited Plot. No. EL-109, 2nd Floor, TTC Electronic Zone, MIDC Mahape, Navi Mumbai - 400 710. Directions: Get down at Ghansoli Station and Take auto (Share basis) for EL-109. Email : hr@textronic.net Contact - Vinay Patil (7977682014)","location":"Mumbai","experience":"0 - 3 Years"},{"date":"14 - Nov - 2019","skills":"Functional testing, software testing, manual testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Planit Testing India Private Limited, Knox Plaza, A Wing, Office #104, Chincholi Bunder Road, Mind Space, Malad West, Mumbai - 400 064","phone":"Not Provided","profile":"Software Testing Trainee \nPlanit Testing India Private Limited","description":"Planit is looking for Software testing trainees with 0-2 years of experience. Eligibility Criteria : Experience : 0-2 years in Manual testing with good communication skills Notice period : 0 - 15 days Willingness to work at any client location within Mumbai Walk-in Date/ Time: 14th November 2019, 10 AM onwards Interview Venue: Planit Testing India Private Limited Knox Plaza, A Wing, Office #104, Chincholi Bunder Road, Mind Space, Malad West, Mumbai - 400 064 Landmark : Near Evershine Mall/ Tangent Showroom, Contact - Planit HR","location":"Mumbai","experience":"0 - 2 Years"},{"date":"16 - Nov - 2019","skills":"Automation Testing, GPSTesting, Bluetooth, Grey Box testing, Test Case, Test Plan","qualification":"B.E./B.Tech","address":"Robert Bosch Engineering and Business Solutions Limited, No. 123 Industrial Layout, Hosur Road Koramangala Bangalore - 560 095","phone":"Not Provided","profile":"Software Testing Engineer \nRobert Bosch Engineering & Business Solutions Pvt. Limited","description":"Educational Qualification: B.E/ B.Tech Work Experience: 2 to 6 years Experience in preparation and execution of test strategy, test plan and test specifications Good understanding of Project/ Test Life Cycle Programming experience in Python, TCL, Perl, Shell, C#, C++, C Testing certifications would be an added advantage Experience in usage of Test and Measuring Equipment If this position is of interest to you, kindly walk-in with your latest resume at the following Walk-in on 16th November 2019 Saturday, between 9:00 AM to 12 PM Venue Details: Robert Bosch Engineering and Business Solutions Limited No. 123 Industrial Layout, Hosur Road Koramangala Bangalore - 560 095 Landmark: Opposite Forum Mall Contact Person: Shaziya/ Lakshmi","location":"Bangalore","experience":"2 - 6 Years"},{"date":"14 - Nov - 2019","skills":"Software Testing, Functional testing, Automation Testing, Manual Testing","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Nucleus Software Exports Limited, A - 39, Sector - 62, Near Noida Electronic City, Noida, UP Nearest Metro Station - Noida Electronic City","phone":"2403970","profile":"Software Test Engineer \nNucleus Software Exports Limited","description":"Education- B.Tech/ BE/ MCA with 60% and above. Work Experience: 4-5 Years Required Skills: Strong experience in software testing (Manual & Automation) Experience with building test plans and criteria for quality assurance Experience with DevOps environments. Familiar with automation test methodologies and popular automation tools (i.e. Selenium, Jmeter) Experience working with integration testing tools like Junit, etc. Experience working with version control tools like SVN, JIRA Experience working on SQL Programming experience in Java, PHP, and JavaScript Strong communication and collaboration skills Overseeing, defining, and building the test processes end-to-end for our products Worked in an Agile environment Walk-in Date/ Time: 14th November , 10 AM onwards Interview Venue: Nucleus Software Exports Limited A - 39, Sector - 62, Near Noida Electronic City, Noida, UP Nearest Metro Station - Noida Electronic City Contact - TA Team-Noida ( 2403970 ) If interested please send your updated resume at karan.setia@nucleussoftware.com before attending the interview with below asked details: Total Exp- Rel Exp- Current CTC- Expected CTC- Notice Period-","location":"Noida","experience":"4 - 5 Years"},{"date":"14, 15, 18, 19, 20, 21, 22 - Nov - 2019","skills":"Automation Testing, Test Scenarios, QA Automation, Test Scripts, Test Cases","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Marolix Technology Solutions Pvt. Limited, Level-1, Three Cube Towers, Beside's Watermark Building, Whitefield road, Kondapur, Hyderabad","phone":"Not Mentioned","profile":"QA Automation Tester \nMarolix Technology Solutions Pvt. Limited","description":"1. Participate in analysis and design sessions to create test scenarios for input into test deliverables; review project deliverables produced during the project lifecycle to understand application changes, project scope and testing scope. 2. Create and execute test plans and test cases from business requirements/user stories. 3. Ensure completeness of test deliverables based on all requirements and technical designs; ensure appropriate sign-offs. 4. Anticipates and identifies issues and risks to the project and create the appropriate resolutions and mitigation strategies. 5. Creates, maintains, and executes manual or automated test scripts for assigned application/project added plus. Responsibilities: 1. Involved in preparing Test Cases covering Functional and UI Experience with Selenium, WebDriver, Protractor ,GIT & Core Java. 2. Knowledge with Jenkins, Maven & Could testing 3. Testing modules and reporting bugs early in release life cycle 4. Frequent feedback to Development Team and Test Lead on stability of tested components 5. Perform functional, installation and performance testing 6. Prepare Build Verification Testing Documents 7. Should have worked on Agile methodology Walk-in Date/ Time: 12th November - 22nd November , 11 AM onwards Interview Venue: Marolix Technology Solutions Pvt. Limited Level-1, Three Cube Towers, Beside's Watermark Building, Whitefield road, Kondapur, Hyderabad Contact - Sai Krishna Boddu","location":"Hyderabad","experience":"1 - 3 Years"},{"date":"16 - Nov - 2019","skills":"QA/ Software Testing, Automation Testing, Manual Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Jio Haptik Technologies Limited, A Wing, 8th Floor, 801, Cello Triumph, I B Patel Road, Jay Prakash Nagar, Goregaon East , Mumbai","phone":"9106614459","profile":"QA/ Testing Engineer \nJio Haptik Technologies Limited","description":"QA Manual Test Engineer Role Requirements: 2+ years of software quality engineering and automated testing experience. Experience testing complex cross-platform web and mobile applications. Should have worked on at least one programming language using selenium. (Python recommended) Creating and maintaining automated test cases along with PR reviews for the same. Decompose business requirements to be able to write effective acceptance criteria and automated test scripts for medium to high complexity projects. Contribute ideas to improve/develop our QA processes and best practices based on your extensive experience. Should be able to communicate and coordinate well with the Development team, Project Managers, and external stakeholders. Experience with using the latest engineering tools. (eg. Jenkins, JIRA, Confluence, Git/Perforce) Good intuition, passionate and a killer instinct to find edge cases and bugs. Should have worked in a scrum-based, agile development environment. QA Automation Role Requirements: B.E. / B.Tech. / MCA in Computer Science, Engineering or related field is required. 1-3 years of prior experience in Testing web/mobile products. Excellent written and verbal communication skills. Self-starter with the ability to multi-task, prioritize, manage workload and consistently deliver results. Experience with using the latest Web service / API testing tools. (eg. POSTMAN, JMeter, etc) Experience with using the latest engineering tools. (eg. Jenkins, JIRA, Confluence, Git/Perforce) Experience working in a scrum-based, agile development environment. Walk-in Date/ Time: 16th November 2019, 10 AM onwards Interview Venue: Jio Haptik Technologies Limited A Wing, 8th Floor, 801, Cello Triumph, I B Patel Road, Jay Prakash Nagar, Goregaon East , Mumbai (Landmark: Near Hub Mall - HP Petrol Pump Lane) Contact Person- Anushree You can also reach me on 9106614459 for any queries.","location":"Mumbai","experience":"2 - 7 Years"},{"date":"15 - Nov - 2019","skills":"C# .Net, ASP .Net Webforms/ MVC, Entity Framework, ADO .Net, SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA","address":"SecurView Systems Private Limited, 1st floor, Amar Apex, Infront of Bata Showroom, Baner Road, Pune","phone":"Not Provided","profile":"Testing Engineer/ Trainee \nSecurView Systems Private Limited","description":"Qualification: BE/ B-Tech (IT/ CS/ Electronics) or MCA or University degree equivalent Platform: Windows, UNIX Languages: C, SQL, Basic knowledge of Shell Scripting. Essentials Skills: Good knowledge of SDLC/ STLC, Functional/ Non-Functional Testing, Black Box, Regression Testing Desired Skills: Automation testing and networking knowledge Knowledge on ISO, CMM and Six Sigma Standards Soft Skills: Excellent problem solving skills Strong technical background and good interpersonal skills Quick learner and excellent team player having ability to work under pressure Salary details: For 6 Months salary will be 10,000/- per month After 6 months salary will vary from 2.4 LPA to 3 LPA Description: This position is a part of Quality Assurance group which is a key group in the Engineering & Development Department of SecurView. Walk-in Date/ Time: 15th November 2019, 10 AM onwards Interview Venue: SecurView Systems Private Limited 1st floor, Amar Apex, Infront of Bata Showroom, Baner Road, Pune Contact Person- Tanvi Salpekar","location":"Pune","experience":"0 - 1 Years"},{"date":"13, 14, 15, 16, 18, 19 - Nov - 2019","skills":"Front Desk, Office Administration, Receptionist/ Front Office Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Adecco India Private Limited, Montieth Place, No. 47, 2nd Floor, Montieth Road, Egmore, Chennai - 600 008","phone":"Not Provided","profile":"Front Office/ Admin Executive \nAdecco India Private Limited","description":"Qualification :12th Or Any Graduate Experience: Fresher or Experience Work Locations : ANNASALAI Walk-in Date/ Time: 12th November - 19th November , 10 AM onwards Interview Venue: Adecco India Private Limited Montieth Place, No. 47, 2nd Floor, Montieth Road, Egmore, Chennai - 600 008 Opposite To central Bank Near Rajarathinam stadium And Alsa Mall Contact Person: SenTamil","location":"Chennai","experience":"0 - 5 Years"},{"date":"12, 13, 14, 15, 16, 18, 19, 20, 21, 22, 23, 25, 26, 27, 28, 29 - Nov - 2019","skills":"Core Java/ J2EE , JavaScript , Jquery ,Struts/Spring framework, Oracle DB PL,SQL","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Infonovum Software and Consulting Pvt. Limited, No 7, Sriman Srinivasa Road, Alwarpet, Chennai - 600 018","phone":"044-42059589","profile":"Java Developer \nInfonovum Software and Consulting Pvt. Limited","description":"Candidate should have 1 to 4 years of experience in the full development cycle, from requirements analysis through operations and maintenance Have strong hands-on experience with: o Java, Spring/ Spring Boot o XML technologies (XPath, XQuery, XSL) o XML databases o Experience with as many of the following is a plus: o HTML5/CSS3 o JavaScript/TypeScript, AngularJS, Angular 2+ o Linux, Windows Agile development methodology Excellent written and oral communication skills Mandatory Skills - Core Java/ J2EE , JavaScript , Jquery ,Struts/ Spring framework, Oracle DB PL, SQL Development Walk-in : Only from Monday to Wednesday (every week) Date: 11th - 29th November , 10 AM - 1 PM Interview Venue: Infonovum Software and Consulting Pvt. Limited No 7, Sriman Srinivasa Road, Alwarpet, Chennai - 600 018 Contact Person- Vidhya P Phone: 044-42059589","location":"Chennai","experience":"1 - 4 Years"},{"date":"16 - Nov - 2019","skills":"Spring boot , Core Java and Webservices","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Renault Nissan Technology (India) Pvt. Limited, Adarsh Hamilton 2/4, Langford Garden Road, Richmond Town, Bengaluru - 560 025","phone":"Not Provided","profile":"Java Developers \nRenault Nissan Technology (India) Pvt. Limited","description":"Experience in the development of Responsive Web applications Strong Experience in Spring boot , Core Java and Webservices Good knowledge in Agile methodology and devops Good Communication & Analytical skills Experience : 3+ Years Interview Date: 16th November 2019 Day : Saturday Interview Location : Renault Nissan Technology (India) Pvt. Limited Adarsh Hamilton 2/4, Langford Garden Road, Richmond Town, Bengaluru - 560 025. Contact Person Name: Rama.C Note: Please ignore this mail if you have already attended the interview. Refer some of your friends / Colleagues for the same.","location":"Bangalore","experience":"3 - 8 Years"},{"date":"14, 15 - Nov - 2019","skills":"J2SE, J2EE, Spring , Struts, Webservices and Hibernate","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"DXC Technology India Private Limited, Maruthi Concorde Business Park, Sy No: 30/3 Konappana Agrahara Village, Begur Hobli, Hosur Road, Bangalore - 560 100.","phone":"Not Provided","profile":"Java Backend Developer \nDXC Technology India Private Limited","description":"Person should have 4+ years of experience in software development with Java/ J2EE technologies and Java Portal. Experience in development of enterprise business applications using J2SE, J2EE, Spring , Struts, Webservices and Hibernate. Good Experience in Design, Development and Implementation of application using Java, J2EE & Java. Should involved in SDLC- Software development life cycle. Good Experience in Developing Applications using Collections, Exception, Multithreading and JDBC. Extensive experience on web-based applications and development environments using Java, Servlet, JSP Restful, SOAP, Hibernate and Spring framework. Should worked on backend tools such as SQL server, MySQL , Oracle Walk-in Date/ Time: 14th - 15th November , 9 AM onwards Interview Venue: DXC Technology India Private Limited Maruthi Concorde Business Park, Sy No: 30/3 Konappana Agrahara Village, Begur Hobli, Hosur Road, Bangalore - 560 100. Near to Maruthi Show room (Near to Konappana Agrahara Busstop) Contact Persomn- Srinivasan","location":"Bangalore","experience":"4 - 9 Years"},{"date":"16 - Nov - 2019","skills":"Java, J2EE, Spring, Web Services (Rest & SOAP), JMS","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"NISUM Technologies Private Limited, Corner 29, Plot# 16 & 29, Survey# 54 Near KIMS hospital, Kondapur Main Road, Kondapur, Serilingampally, Hyderabad - 500 084","phone":"9154044185","profile":"Java Professionals \nNISUM Technologies Private Limited","description":"Java Walk-In Drive with NISUM Technologies @ 16th November 2019 (Saturday) Experience:- 4 to 6 Years Work Location:- Hyderabad Java, J2EE, Spring, Web Services (Rest & SOAP), JMS, Hands on full cycle Web development, J2EE, UI and Front end development experience, especially on Java 8 features. Very Good understanding of code quality and Java coding standards. Strong with Spring core, boot, mvc, transaction, jms etc.. across various Spring versions. Experience with Java, J2EE tech stack - capable to write Rest services and expose them securely. Good communication and writing skills required Experience of working in Agile project management teams, BDD & TTD exposure, great understanding of JIRA or any of similar tool is required. Understanding and experience on various caching mechanisms. Please register here:- https://bit.ly/2CCeTCy Walk-in Date: 16th November 2019 Interview timings:- 11: 00 AM to 04:00 PM Interview Venue: NISUM Technologies Private Limited Corner 29, Plot# 16 & 29, Survey# 54 Near KIMS hospital, Kondapur Main Road, Kondapur, Serilingampally, Hyderabad - 500 084 Land Mark : Near KIMS Hospital Contact Person- Rakesh (9154044185)","location":"Hyderabad","experience":"4 - 6 Years"},{"date":"16 - Nov - 2019","skills":"Java, J2EE, AngularJS, Java Script, XSLT, HTML5/CSS, Ajax/ JSON","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"SSP India Private Limited, 4th Floor, Tower A2 DLF World Tech Park, SEZ, Silokhera, Gurugram - 122 002","phone":"Not Provided","profile":"JAVA Developer \nSSP India Private Limited","description":"Candidate should have Bachelors/ Masters degree in Engineering (preferably Electronics, Computer Science, Information Technology) with At least 3 years in design and Development of Java, J2EE applications At least 2 years in AngularJS, Java Script, XSLT, HTML5/ CSS, Ajax/ JSON Strong OOPS concepts, Core Java and various design patterns using JAVA (1.5 or later)Strong knowledge of development best practices, development methodologies & standards. Experienced in J2EE, JSP, Java Servlets, EJB Experienced with Eclipse IDE, SVN version control and continuous integration XML, SQL, DB2/Oracle, WAS and Apache/IBM HTTP server Adhere to industry standard coding practices to write secured and optimized code for all above Thorough understanding of SDLC processes to drive best practices Excellent verbal, written and interpersonal communication skills to interface with various teams Walk-in Date/ Time: 16th November 2019, 9 AM onwards Interview Venue: SSP India Private Limited 4th Floor, Tower A2 DLF World Tech Park, SEZ, Silokhera, Gurugram - 122 002 Contact Person- Gunjan","location":"Gurgaon","experience":"2 - 6 Years"},{"date":"16 - Nov - 2019","skills":"Java, Unit Testing. Technical Support, Javascript, Database Design","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Datazoic Machines Private Limited, 141, TVH Agnitio Park, 2nd Floor, OMR, Kandanchavadi, Chennai - 96","phone":"Not Provided","profile":"Java Developers \nDatazoic Machines Private Limited","description":"Responsible for providing a technical design of the solution to meet the requirements as explained in the BRD. Develop class diagrams, database diagrams based on existing methodologies and best practices, explain to the team members. Work with and under the directions of the manager to develop new modules and enhance existing modules of the product. Contribute to the development process by providing enhancements to the methodology and best practices. Create Unit test plans, explain to the team members, perform unit-testing using Junit. Provide technical leadership during certain scenarios, mentor the juniors in the team and assist them in understanding requirements, coding, unit-testing and other development related activities. Depending on the requirements, work on JavaScript/jQuery/Java/ SQL to build/enhance modules of the product. Be flexible enough to switch between these platforms to meet the demands in development and deployment of the products. Walk-in Date/ Time: 16th November 2019, 10 AM onwards Interview Venue: Datazoic Machines Private Limited 141, TVH Agnitio Park, 2nd Floor, OMR, Kandanchavadi, Chennai - 96 Contact Person- Mr Anthony","location":"Chennai","experience":"3 - 8 Years"},{"date":"12, 13, 14, 15 - Nov - 2019","skills":"Android Studio and Java, Life CycleF, ront End, Mobile Applications, Web Technologies","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Thumbay Technologies Private Limited, 4th Floor, Prestige Tower, Beside Ritz Carlton Hotel, Residency Road, Bangalore.","phone":"080-68220152","profile":"Android App Developer \nThumbay Technologies Private Limited","description":"Key Skills- Android Studio and Java Roles & Responsibilities- Deliver across the entire app life cycle -concept, design, build, deploy, test, release to app stores and support. Build prototypes at tech scoping stage of projects. Working along the web developers to create and maintain a robust framework to support the apps/web. Working with the front end developers to build the interface with focus on usability features. Create compelling mobile device specific user interfaces and experiences. Optimizing performance for the apps /web. Provide assistance and Mobile Application testing/prototyping framework to testers and support personnels Writes, edits, and debugs new Mobile Application Code for assigned projects, including necessary records and desired output Integrate Mobile Applications with third party Softwares for Payment Gateway, Listing Data, CRM and other applications Document code consistently throughout the development process by listing a description of the program, special instructions, and any changes made in database tables on procedural, modular and database level. Walk-in Date/ Time: 6th November - 15th November , 10 AM onwards Interview Venue: Thumbay Technologies Private Limited 4th Floor, Prestige Tower, Beside Ritz Carlton Hotel, Residency Road, Bangalore. Contact Person- Nisha (080-68220152)","location":"Bangalore","experience":"2 - 5 Years"},{"date":"12, 13 - Nov - 2019","skills":"Back Office Assistance, General Administration","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Netscribes (India) Private Limited, Millennium City 5th Floor, Tower 1 DN 62, Street No. 10, Sector V, Bidhannagar, Kolkata - 700 091","phone":"Not Provided","profile":"Back Office Executive \nNetscribes (India) Private Limited","description":"Candidate should be a graduate or awaiting final results with decent communication skill in English both written and verbal and must have an eye for detail. Basic knowledge of E-commerce industry is preferred. Age Limit - 30 years Job Salt-lake, Sector-V, Kolkata Job Responsibilities: To write features and attributes of product through extensive secondary research To adhere the feature guidelines sent from client's end Writing short product descriptions wherever necessary To adhere daily target related to production and quality To keep error benchmark at minimum as specified by the client To participate in periodical trainings as and when conducted by mentors. Walk-in Date/ Time: 12th - 13th November 2019, 11 AM onwards Interview Address: Netscribes (India) Private Limited Millennium City 5th Floor, Tower 1 DN 62, Street No. 10, Sector V, Bidhannagar, Kolkata - 700 091 Please carry your PAN and Aadhar Card at the time of interview.","location":"Kolkata","experience":"0 - 3 Years"},{"date":"12, 13 - Nov - 2019","skills":"Front Office Activities, Facility Management, General Administration","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"SRM Institute of Science Technology, 2/21, Pillaiyar Kovil Street, Alinjivakkam","phone":"Not Provided","profile":"Front Office Executive \nSRM Institute of Science Technology","description":"Candidate should be Any Graduate with 0 to 1 year of experience in Front Office Activities, Facility Management, General Administration. Must have excellent communication skills, Walk-in Date/ Time: 12th - 13th November , 9 AM onwards Interview Venue: SRM Institute of Science Technology 2/21, Pillaiyar Kovil Street, Alinjivakkam Contact Person- Senthil Kumar","location":"Chennai","experience":"0 - 1 Years"},{"date":"13, 14, 15 - Nov - 2019","skills":".Net, C# & SQL Server","qualification":"B.E./B.Tech, MCA/PGDCA","address":"ParadigmIT Group, eCentric Solutions Private Limited, Purva Summit Building, SMARTWORKS, 6th Floor, White Field, Hitech City, Madhapur, Hyderabad - 500 081","phone":"Not Provided","profile":"C# .Net Developer \nParadigmIT Group (eCentric Solutions)","description":"Educational Qualification- BE/ B.Tech/ MCA Criteria: 2017 to 2019 Passouts Only Experience level: 0 to 2 Years Required Skills: Excellent Communication Skills Must have Excellent Knowledge on C# & SQL. Preferred Location:- Hyderabad only Working Hours: 1.00 PM to 10.00 PM Own Transportation Required Walk-in Date: 11th to 15th November (Monday to Friday) Time: 11 AM to 7 PM Interview Location: ParadigmIT Group, eCentric Solutions Private Limited, Purva Summit Building, SMARTWORKS, 6th Floor, White Field, Hitech City, Madhapur, Hyderabad - 500 081 Contact Person- Ramakrishna","location":"Hyderabad","experience":"0 - 2 Years"},{"date":"13 - Nov - 2019","skills":"Back End Operations, General Insurance/ Underwriting","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"EXL Services.com (I) Private Limited, Tower 1, Cybercity, Magarpatta City, Pune","phone":"Not Provided","profile":"Back Office Associate \nEXL Services.com (I) Private Limited","description":"Candidate should be Any Graduate with minimum 2 years of general insurance/ underwriting experience. Must have excellent communication Skills. Should be OK with night / rotational shifts Interested candidates can walk-in on Date: 13th November 2019 Time: 11:30 AM to 2:30 PM Venue: EXL Services.com (I) Private Limited Tower 1, Cybercity, Magarpatta City, Pune Note: Please carry your updated resume and Aadhar Card (original + 2 photocopy) along with 02 passport size photographs is mandatory to enter inside the premises.","location":"Pune","experience":"2 - 6 Years"},{"date":"13 - Nov - 2019","skills":"Java, Core Java, C++/ C, Devops, Software Programming","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Alpha Infoconsultants Private Limited, N5 Building 3rd Floor, South Exten, Part 1 New Delhi - 110 049","phone":"8630370961","profile":"Java Developer/ Fresher \nAlpha Infoconsultants Private Limited","description":"We are Direct hiring fresher candidate for the software developer. Candidate should have excellent knolwdge of Java, Core Java, C++/ C, Devops, Software Programming Walk-in interview Date -13/11/2019 (Wednesday) Timing - 10am Interview Venue- Alpha Infoconsultants Private Limited N5 Building 3rd Floor, South Exten, Part 1 New Delhi - 110 049 Contact Person - (HR) 8630370961","location":"Delhi","experience":"0 - 1 Years"},{"date":"12, 13, 14, 15 - Nov - 2019","skills":"Core Java, Data Structures, Multithreading","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Broadridge Financial Solutions, Inc. Divyasree NR Enclave, Whitefield, Bangalore - 560 066","phone":"Not Provided","profile":"Java Developers \nBroadridge Financial Solutions (India) Pvt. Limited","description":"Education: BE / B.Tech / MCA or equivalent is needed Shifts : Willingness to work in Rotational Shifts Job Location: Bengaluru 4 to 10 years of experience in Software Development in Java Technology. Strong in Core Java, Data Structures, Multithreading. Expertise in Springs, JQuery, Java Script, JDS, Servlets & JSP, Unix / Shell Scripting, SQL Hands on Experience on Struts, EJB, Web services, AJAX, JPA, Hibernate, HTML, Angular 2, Jenkins, ReactJS and CSS Experience in Writing test cases using JUnits, Mockito Good to have knowledge on Websphere MQ , Active MQ, distributed Caching techniques i.e. Memcached, Redis. Knowledge on Docker containerization, Elasticsearch, Kibana will be added advantage Exposure on KAFKA, Distributed Caching, Cloud based technologies. Strong Analytical thinking Walk-in Date: 11th to 15th Nov 2019 (Monday to Friday) Timings: 12:00 PM to 5:00 PM Venue Location: Broadridge Financial Solutions, Inc. Divyasree NR Enclave, Whitefield, Bangalore - 560 066 Point Of contact- NCJ, Chakravarthy & Dipannita","location":"Bangalore","experience":"4 - 10 Years"},{"date":"9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25 - Nov - 2019","skills":"Front Office, General Administration, Front desk/ Reception Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Jupiter Life Line Hospitals Limited, Opposite Rituparna Society, Near Prathamesh Park, Baner, Pune - 411 045","phone":"020-27992200","profile":"Front Office Executive \nJupiter Life Line Hospitals Limited","description":"Candidate should be Any Graduate with 1 to 5 years of experience in Front Office, General Administration, Front desk/ Reception Activities. Must have excellent communication skills. Job Responsbility- Greeting Patients/ Customers, Handling OPD Desk, Attending calls, OPD Bills, Handling queries on Desk. Co- Ordinating with Consultants & Doctors. Scheduling patient appointments. Preparing MIS. Collecting patient Satisfaction feedbacks. Walk-in Date/ Time: 8th - 25 November , 10 AM onwards Interview Venue: Jupiter Life Line Hospitals Limited, Opposite Rituparna Society, Near Prathamesh Park, Baner, Pune - 411 045 Contact Person- Mrs. Pranita Mhaske Tel Number: 020-27992200","location":"Pune","experience":"1 - 5 Years"},{"date":"11, 12, 13, 14, 15 - Nov - 2019","skills":"Front Desk/ Front Office, Receptionist Activities, Guest Relations","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Sodexo Food Solutions (India) Private Limited, #110/1, M Krishnappa Layout, Opposite KIA Motors, Lalbagh Road, Bengaluru, Karnataka - 560 027.","phone":"Not Provided","profile":"Front Office Executive \nSodexo Food Solutions India Pvt. Limited","description":"Female candidates are required for Receptionist/ Front Office Executive position for our reputed clients based in Bangalore at Banaswadi Road, Bommanahalli and Marathahalli. Roles & Responsibilities- Welcomes guests Have a good knowledge of all systems and standard operating procedures of front office. Good communication skills & command on English language Good working knowledge of MS Office Presentable Interested candidates may walk-in between 10 AM to 5 PM 8th - 15th November 2109 (Monday to Friday) Interview Venue: Sodexo Food Solutions (India) Private Limited #110/1, M Krishnappa Layout, Opposite KIA Motors, Lalbagh Road, Bengaluru, Karnataka - 560 027.","location":"Bangalore","experience":"1 - 6 Years"},{"date":"16 - Nov - 2019","skills":"Back Office Operations, Supply Chain Management, Non Voice Process","qualification":"B.A., B.Com, B.Sc, BCA/BCS, B.E./B.Tech, Others","address":"Albans Projects Private Limited, 2nd Floor, Malhotra House, Above Tata Motors, Krishanlal Marwah Marg, Saki Vihar Road, Near Marwah Estate, Andheri, Mumbai - 400 072.","phone":"9324771589","profile":"Purchase/ Back Office Executive \nAlbans Projects Private Limited","description":"Candidate should have 0 to 1 year of experience as a Purchasing Executive. Good understanding of supply chain procedures. Advanced knowledge of MS Excel. Solid organizational skills. Candidates from Andheri and near by would be an advantage. Responsibilities- Monitor stock levels and identify purchasing needs Research potential vendors. Track orders and ensure timely delivery. Update internal databases with order details .(dates, vendors, quantities, discounts) Conduct market research to identify pricing trends. Evaluate offers from vendors and negotiate better prices. Prepare cost analyses. Walk-in Date/ Time: 16th November 2019, 10 AM onwards Interview Venue: Albans Projects Private Limited 2nd Floor, Malhotra House, Above Tata Motors, Krishanlal Marwah Marg, Saki Vihar Road, Near Marwah Estate, Andheri, Mumbai - 400 072. Landmark: After Picnic Restaurant Contact - Shweta (9324771589)","location":"Mumbai","experience":"0 - 1 Years"},{"date":"11, 12, 13, 14 - Nov - 2019","skills":"Back Office, General Administration, Data Entry","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Mahendra Realtors & Infrastructure Pvt. Limited, 603, 6th Floor, Quantum Tower, Ram Baug Lane, Near SBI, SV Road, Malad West, Mumbai.","phone":"9082850347","profile":"Tender/ Admin Assistant \nMahendra Realtors & Infrastructure Pvt. Limited","description":"Candidate should be Any Graduate with 1 to 2 years of experience Must have very Strong communication skill oral as well as written Multi-Tasking skills with Computer literacy Job Responsbility- To Source Tenders from all available modes for Maharashtra, Goa, Gujarat, Karnataka & all MMR Region and taking approval for final participation within Given Time. Taking Approval from Management to Participate in Tenders before time. Walk-in Date/ Time: 11th - 14th November 2019, 11 AM onwards Interview Venue: Mahendra Realtors & Infrastructure Pvt. Limited 603, 6th Floor, Quantum Tower, Ram Baug Lane, Near SBI, SV Road, Malad West, Mumbai. Contact - HR (9082850347)","location":"Mumbai","experience":"1 - 2 Years"},{"date":"11 - Nov - 2019","skills":"Front Office Acvtivities, Facility Management, basic book keeping","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Rapidsoft Technologies Pvt. Limited, Plot 63, Udyog Vihar, Phase IV, Gurgaon, Haryana - 122 001.","phone":"Not Provided","profile":"Front Desk Executive (Female) \nRapidsoft Technologies Pvt. Limited","description":"Candidate should good knowledge of office management and basic bookkeeping Excellent knowledge of MS Office (especially Excel and Word) Must have strong communication and people skills Good organizational and multi-tasking abilities Maintain files and records; update when necessary Key Responsibilities- Responsible for end to end office operations Handle the walk-in as well as telephonic inquiries & maintaining record of visitors. Supervise & administer the Supervisor,keep a check on housekeeping & office staff. Must have Strong interpersonal skills Walk-in Date/ Time: 11th November 2019, 10 AM onwards Interview Venue: Rapidsoft Technologies Pvt. Limited Plot 63, Udyog Vihar, Phase IV, Gurgaon, Haryana - 122 001. Contact Person - Priya","location":"Gurgaon","experience":"1 - 2 Years"},{"date":"9 - Nov - 2019","skills":"Automation testing, Selenium, API testing or mobile application testing","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Maveric Systems Limited, Plot No. 1 & 2 NP, 2nd Floor, Lords Tower, Block 1, Jawaharlal Nehru Road, Thiru Vi Ka Industrial Estate, Ekkaduthangal, Chennai - 600 032.","phone":"Not Provided","profile":"Automation Testers \nMaveric Systems Limited","description":"Candidate must have good experience into Automation testing using Selenium and Java. Should be good into Java Coding or Programming. Should have a good exposure or experience or strong knowledge towards API testing or mobile application testing. Work experience in any frameworks (cucumber, maven, BDD, Hybrid, etc.,) Should have experience or knowledge in Framework development. Must have a strong knowledge in OOPS concepts. Interested Can walk in to the below mentioned Location along with your updated CV, passport size photograph and any ID proof. Walk-in Date: 9th November 2019 Time : 9 AM too 12 PM (Strictly no walk-in after 12:00 PM) Interview Venue: Maveric Systems Limited Plot No. 1 & 2 NP, 2nd Floor, Lords Tower, Block 1, Jawaharlal Nehru Road, Thiru Vi Ka Industrial Estate, Ekkaduthangal, Chennai, Tamil Nadu - 600 032. Contact Person : Ramya / Mark felix / Priyadharshni","location":"Chennai","experience":"3 - 8 Years"},{"date":"11, 12, 13, 14, 15 - Nov - 2019","skills":"IT Helpdesk, Technical Support, Service Desk","qualification":"B.Sc, BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Pharmarack Technologies Private Limited, Office No. 201, Pride Portal, 202, 203, Senapati Bapat Road, Bahiratwadi, Bhageerath, Gokhalenagar, Pune - 411 016.","phone":"Not Provided","profile":"Technical Support Executive \nPharmarack Technologies Private Limited","description":"Education - MCA/ B.sc (Comp Science) / B.E (IT)/ M.E (IT) / B.E (Comp. Science) Experience - 6 months to 2 years in IT support services/ Technical Support Good fresher's cvs with strong technical knowledge will do. Must Have - Good Communication and good interpersonal skills Good computer operations skills (Word, Excel ) and email handling. English Proficiency/ Other languages would be an advantage Job Responsbility- Updating self-help documents so customers/employees can try to fix problems themselves Analyze, troubleshoot and resolve technical issues of the clients Improving overall quality of service and increasing customer delight levels Achieving overall productivity and service level targets Walk-in Date/ Time: 11th - 15th November , 11 AM onwards Interview Venue: Pharmarack Technologies Private Limited Office No. 201, Pride Portal, 202, 203, Senapati Bapat Road, Bahiratwadi, Bhageerath, Gokhalenagar, Pune, Maharashtra - 411 016. Contact Person- Avinash","location":"Pune","experience":"0 - 2 Years"},{"date":"9 - Nov - 2019","skills":"Selenium API/ BDD Java","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Capgemini Technology Services (India) Limited, Prestige Cyber Towers, No. 117, Rajiv Gandhi Salai, Karapakkam, Chennai","phone":"Not Provided","profile":"Selenium Test Analyst \nCapgemini Technology Services (India) Limited","description":"Please carry a Government Approved Photo ID Original & 2 Passport size photograph, without these you will not be allowed to attend the interview. Candidate must have excellent with a strong technical background and strong communication skills. Experience in analyzing the middle tier technology problem solving skills and testing using REST API web services. Experience in raising bugs in JIRA and drive defect triage call Collaborate with testing developers and architects on collecting requirements payloads data for service testing and service virtualization Good working experience in BDD framework Good understanding of Agile Methodology Primary Skills Selenium API/ BDD Java Interview Date: 9th November 2019 (Saturday) Timing: 9:00 AM to 3.00 PM Interview Venue: Capgemini Technology Services (India) Limited Prestige Cyber Towers, No. 117, Rajiv Gandhi Salai, Karapakkam, Chennai Contact Person: - Santhoshi","location":"Chennai","experience":"4 - 6 Years"},{"date":"9 - Nov - 2019","skills":"Selenium with Java or C#, Web API Testing","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"CES IT Private Limited, 1st Floor, West wing Beta Block, SSPDL, Old No. 25, Rajiv Gandhi Salai (OMR), Navalur, Chennai - 603 103.","phone":"Not Provided","profile":"QA/ Testing Engineer \nCES IT Private Limited","description":"Walk-in-Interview for QA Automation Jr, Sr & Lead on 9th November 2019 (Saturday) Navalur, OMR, Chennai Location (3-9 Years) Skill set: Looks at Selenium with Java or C#, Web API Testing The Candidate must have Strong Communication skills Experience: 3 - 9 Years Work Timing: 1.00 PM - 10.00 PM IST (Pick-up and Drop will be provided) Walkin Date: 9th November 2019 Timing: 10 am - 3 pm Interview Venue: CES IT Private Limited, 1st Floor, West wing Beta Block, SSPDL, Old No. 25, Rajiv Gandhi Salai (OMR), Navalur, Chennai - 603 103. If possible, please share your updated profile to raghavendran.arumugam@cesltd.com","location":"Chennai","experience":"3 - 9 Years"},{"date":"9 - Nov - 2019","skills":"Software Testing, White box, Black box testing, Database Testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Sheorey Digital Systems Limited, Certified Company Software Lab & Technical Support Center, Anjaneya Techno Park, 1st Floor, 147, HAL Airport Road, Kodihalli, Bengaluru - 560 008.","phone":"Not Provided","profile":"Software Testers \nSheorey Digital Systems Limited","description":"Candidate should have 2 to 3 years of experience in Software Testing, White box, Black box testing, Database level testing (SQL). Preparation, Execution of Test plan and Test cases. Must have good knowledge of Agile Methodology and Ms - Office tools Walk-in Date/ Time: 9th November 2019, 10 AM onwards Interview Venue: Sheorey Digital Systems Limited Certified Company Software Lab & Technical Support Center Anjaneya Techno Park, 1st Floor, 147, HAL Airport Road, Kodihalli, Bengaluru - 560 008.","location":"Bangalore","experience":"2 - 3 Years"},{"date":"8, 9, 11, 12, 13, 14, 15, 16 - Nov - 2019","skills":"Software Testing, Manual/ Automation Testing, Test Cases","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Cyber Trident Technologies, 214, 3rd Floor, Surya Plaza, L B S Road Navi Peth, Dandekar Pool, Pune - 411 030.","phone":"Not Provided","profile":"Software Testing Trainee (Intern) \nCyber Trident Technologies","description":"We offer internship program on Software Testing (Manual and Automation Testing) To become a complete QA Professional To provide insight into real world scenarios of Software testing life Cycle To give hands on practical training with live project. Walk-in Date/ Time: 8th - 16th November , 10 AM onwards Interview Venue: Cyber Trident Technologies 214, 3rd Floor, Surya Plaza, L B S Road Navi Peth, Dandekar Pool, Pune - 411 030. Contact Person- Ritesh Naidu","location":"Pune","experience":"0 - 1 Years"},{"date":"9 - Nov - 2019","skills":"Manual Testing, API (Rest/ SOAP), SQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Xpanxion International Private Limited, Ground Floor, Sai Radhe Building behind Sheraton Grand Hotel 7, Railway Officers Colony, Pune, Maharashtra - 411 001","phone":"020-66290500","profile":"QA/ Manual + API Tester \nXpanxion International Private Limited","description":"We at Xpanxion International are inviting you to walkin for interviews for Manual API Testing Work Experience: 2 - 4 Years Mandatory Skills : Manual Testing, API (Rest/ SOAP), SQL. (Please note all you must have experience in all the mentioned skills) Good to have: Mobile Testing (iOS) Immediate joiners Are most welcome. Walk-in Date/ Time: 9th November 2019, 10 AM onwards Interview Venue: Xpanxion International Private Limited Ground Floor, Sai Radhe Building behind Sheraton Grand Hotel 7, Railway Officers Colony, Pune, Maharashtra - 411 001 Landmark: Behind Pune Railway Station Contact Person: KASHISH CHAUHAN Please walk in directly for the interview with your resumes. Interview process: 1. Test (coding - API and DB) 2. L1 Technical Interview 3. L2 Technical Interview * Post Selection the remaining rounds will be done in the succeeding week.","location":"Pune","experience":"2 - 4 Years"},{"date":"9 - Nov - 2019","skills":"Automation testing using Selenium Java","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"QualityKiosk Technologies Private Limited, 4th Floor, 419A, C Wing, Rupa Solitaire, Sector-1, Millennium Business Park, Mahape, Kopar Khairane, Navi Mumbai, Maharashtra - 400 710","phone":"022-41288260","profile":"Automation Test Engineer \nQualityKiosk Technologies Private Limited","description":"Candidate must be strong in Automation testing using Selenium Java. Should have good verbal and written communication, Understand user requirements or functional specifications. Perform detailed technical analysis with impacts (Technical/ Functionally). Need to have strong analytical skills Need a Hands-on coding person for this role. Working as individual Contributor There will be 3 Levels of interviews (face to face technical, System Coding test & managerial round) Interview Date: 9th November 2019 - Saturday Time: 11:00 AM to 4:30 PM Interview Venue: QualityKiosk Technologies Private Limited 4th Floor, 419A, C Wing, Rupa Solitaire, Sector-1, Millennium Business Park, Mahape, Kopar Khairane, Navi Mumbai, Maharashtra - 400 710 (Lift Number: 24 & 25)","location":"Mumbai","experience":"1 - 5 Years"},{"date":"9 - Nov - 2019","skills":"General Administration, Team Leading, HR, Grievance Handling, Employee Engagement","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"DXC Technology India Private Limited, Maruthi Concorde Business Park, Sy No: 30/3 Konappana Agrahara Village, Begur Hobli, Hosur Road, Bangalore - 560 100.","phone":"Not Provided","profile":"Technical Support Associate \nDXC Technology India Private Limited","description":"Applicant must have Graduation with 10+2+3/4 preferably with 0- 3 years general experience, or equivalent combination of experience and college level education. Knowledge and Skills: oSuperior skills in both written and verbal communication. oExperience in customer facing role either remote or face to face. oComputer proficiency with applicable software applications (for example Microsoft Office, CAD, Adobe Suite, programming. oProblem solving skills. Walk-in Date: 9th November 2019 (Saturday). Time: 10:00 AM to 1:00 PM Venue - DXC Technology India Private Limited Maruthi Concorde Business Park, Sy No: 30/3 Konappana Agrahara Village, Begur Hobli, Hosur Road, Bangalore - 560 100. Point of Contact: Punith S M","location":"Bangalore","experience":"0 - 3 Years"},{"date":"9 - Nov - 2019","skills":"Software Testing, Selenium, Typescript, OOPS, JavaScript, Agile","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"We Work, Block L, Embassy TechVillage, Outer Ring Road, Bengaluru, Karnataka - 560 103","phone":"Not Provided","profile":"QA/ Software Tester \nDMI Innovations Private Limited","description":"Hiring Event: Interviews will be held on 9th November at Bangalore Technical Skills- Need hands on protractor and Selenium tool JavaScript/ Typescript experience is must Cucumber/ Jasmine framework hands-on experience OOPS concept and implementation in project Excellent to write with test cases for complex applications Understanding of test strategies and test plan, Hands-on would be an added advantage Defect life cycle knowledge Process Hands on in Agile STLC Process Other Skills- Excellent communication skills Knowledge on Healthcare domain will be added advantage","location":"Bangalore","experience":"4 - 9 Years"},{"date":"9, 10, 11, 12, 13, 14, 15, 16, 17 - Nov - 2019","skills":"PHP, Web Development","qualification":"B.E./B.Tech, MCA/PGDCA, B.Sc, BCA/BCS","address":"Showflipper Entertainment & Productions Pvt. Limited, Anand Nagar, Sinhagad Road, Pune - 411 051","phone":"Not Provided","profile":"PHP Developer \nShowflipper Entertainment & Productions Pvt. Limited","description":"Candidate should be Any Graduate with 2 to 3 years of experience in Website Development, project making, Website Maintainance. Walk-in Date/ Time: 7th - 17th November , 6 PM onwards Interview Venue: Showflipper Entertainment & Productions Pvt. Limited Anand Nagar, Sinhagad Road, Pune - 411 051 Contact Person- SANDEEP JOSHI","location":"Pune","experience":"2 - 3 Years"},{"date":"9 - Nov - 2019","skills":"Technical/ Network Support, Voice Process","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Tech Mahindra Limited A-6, Sector-64, Noida","phone":"9871069624","profile":"Technical/ Network Support \nTech Mahindra Limited","description":"Tech Mahindra is hiring fresher's and experienced candidates for Technical/ Network Support for Tech Voice Process. Job Type: Permanent Job Location:Sector-64, Noida Experience Range: Any experience eligible. Freshers can also apply Role: Technical/ Customer Support Associate Skills Required:- Good communication skills. Excelent logical reasoning Candidate should be aware of good technical knowledge. Troubleshooting of technical related issues and ensure to resolve the issues or queries over the call. Candidate should be flexible to work in 24*7 environments, comfortable to work in night shifts. Result awaited candidates can also apply. Both side Transport facility available (Pick & Drop). 5 Days Working. Walk-in Date :9th November 2019 Timing: 11:00 AM- 4 PM Interview Venue: Tech Mahindra Limited A-6, Sector-64, Noida Contact Person- Karishma Bhatnagar ( 9871069624 )","location":"Noida","experience":"0 - 4 Years"},{"date":"11, 12, 13, 14 - Nov - 2019","skills":"Technical Support, Customer Service/ Troubleshooting","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"CSS Corp Private Limited, Ground floor, Ambit park, Ambattur, Chennai","phone":"9790065949","profile":"Technical Support Engineer \nCSS Corp Private Limited","description":"Any Graduation without Arrears , 10th + 3 years diploma also can apply. Experience within a customer service environment preferred. Excellent communication in English. Work Experience - 0-5 Years (Max). Freshers also welcome. Passionate about learning and mastering new technologies and skills. Immediate Joiners are preferred ( Max Notice Period 15 days) Walk-in Date: 11th - 14th November 2019 Time : 11 am to 7 pm Venue: CSS Corp Private Limited Ground floor, Ambit park, Ambattur, Chennai Contact Person: Sheik HR Tel: 9790065949 Note: Bring 2 resume copies, Any Government ID proof for security purpose","location":"Chennai","experience":"0 - 5 Years"},{"date":"12 - Nov - 2019","skills":"Technical Support, Service Desk, IT Helpdesk, Networking, Troubleshooting","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Cognizant Technology Solutions India Limited, Manyata Embassy Business Park, Mahogany (F2 Building), 2nd Floor, Hebbal Outer Ring Road, Rachenahalli, Bangalore - 560 045","phone":"Not Provided","profile":"Technical Support Associate \nCognizant Technology Solutions India Ltd","description":"Cognizant Technology Solutions India Limited is hiring Senior Process Executive (Voice) - Bangalore Location. Education : Any Graduate / Post-Graduate Work Experience : 1 to 4 years Work Location : Bangalore Skill: Voice Process Shift : Flexible to work in Night shifts Excellent written and verbal communications skills (English) Excellent Troubleshooting skills, search skills, ability to approach problems logically Basic Networking Domain experience (6+ months) Any Technical Support International Voice Experience Preferably from Help desk or Service desk Ensure on meeting daily KPIs Receiving end user calls Provide first level resolutions Ticket creation/ Categorization/ Prioritization Ticket escalation to respective Support Group Incident resolution and recovery Ticket Closure If interested, kindly walk-in to the below address on 12th November' 2019 (Tuesday) Time: 11 AM to 1 PM Interview Venue: Cognizant Technology Solutions India Limited, Manyata Embassy Business Park, Mahogany (F2 Building), 2nd Floor, Hebbal Outer Ring Road, Rachenahalli, Bangalore - 560 045 POC: Sathish You are requested to carry the following documents for the discussion A copy of your updated resume(Mandatory) 2 passport size photograph (Mandatory) Copy of your government photo id (Pan card / Passport / Driving License ). (Mandatory) Print Out of this Email. Note: Candidates who have taken up interview with cognizant in the last 2 months are not eligible to re-take the interview again","location":"Bangalore","experience":"1 - 4 Years"}]}